{
    "000050.KS": {
        "short_name": "Kyungbang",
        "long_name": "Kyungbang Co.,Ltd",
        "summary": "Kyungbang Co., Ltd. engages in textile spinning and real estate development businesses in South Korea. Its products include cotton, nylon spun, rayon blend, wool blend, polyester blend, acrylics blend, and Tencel blend yarns for general clothing and bedding applications; and mercerized yarn and other fabrics for use in golf wear, casuals, sweaters, socks, etc. The company's real estate development activities comprise development and operation of shopping malls, department stores, and hotels. Kyungbang Co., Ltd. was founded in 1919 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000240.KS": {
        "short_name": "HANKOOK & COMPANY",
        "long_name": "Hankook & Company Co., Ltd.",
        "summary": "Hankook & Company Co., Ltd., together with its subsidiaries, manufactures and sells tires, tubes, and alloy wheels. The company offers tires for passenger cars, SUVs and light trucks, trucks and buses, and motorsports. The company is also involved in the manufacture and sale of tire and tube manufacturing machines, and tire molds; trade and consulting business; facilities management and baking activities; and distribution of tires. It operates in North America, South and Central America, Asia, and Europe. The company was formerly known as Hankook Technology Group Co., Ltd. and changed its name to Hankook & Company Co., Ltd. in December 2020. Hankook & Company Co., Ltd. was founded in 1941 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000270.KS": {
        "short_name": "KIA CORP.",
        "long_name": "Kia Corporation",
        "summary": "Kia Corporation, together with its subsidiaries, manufactures and sells vehicles in South Korea, North America, and Europe. The company offers cars, SUVs and MPV, eco, and commercial vehicles. It sells its products through a network of dealers. The company was formerly known as Kia Motors Corporation and changed its name to Kia Corporation in January 2021. Kia Corporation was founded in 1944 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "000430.KS": {
        "short_name": "DaewonKangup",
        "long_name": "Daewon Kang Up Co., Ltd.",
        "summary": "Daewon Kang Up Co., Ltd. develops, produces, and sells suspension springs and seats in South Korea and internationally. The company offers suspension springs, including coil and leaf springs, stabilizer and torsion bars, and air springs, as well as air and pusher axle suspension kits for automobile makers; and coil insert, tension bar connection, and test equipment for springs. It also provides precision springs, such as engine valve springs and cotters, curved springs, return springs, die springs, and precision wire and disc springs, as well as flat and snap rings, and IT components for use in auto parts, electronic products, industrial machinery, civil construction parts, and high precision IT parts. In addition, the company offers seats for automobiles, subway trains, trains, heavy equipment, and other industries; manufacturing equipment for coil and leaf springs, and stabilizer bars; peelers, testing equipment for springs, and engineering services; equipment for materials processing and engineering services; and adjusters, recliners, pumping devices, headrests, magnesium frames, and set assemblies. The company was founded in 1946 and is headquartered in Cheonan-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Cheonan-si"
    },
    "000950.KS": {
        "short_name": "Chonbang",
        "long_name": "Chonbang Co., Ltd.",
        "summary": "Chonbang Co., Ltd. manufactures and sells textiles in South Korea. The company offers yarns, dyed yarns, embroidery and sewing threads, fabrics, knit products, and raw materials under the Morethan Premium, Hempia, Silroyal, Royal, Cleaniber, and Newstar brands. It also manufactures film condensers; sells and distributes used cars; and provides outbound travelling and golf membership services. The company was formerly known as Chonnam Spinning Co., Ltd and changed its name to Chonbang Co., Ltd. in 1970. Chonbang Co., Ltd. was founded in 1935 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001070.KS": {
        "short_name": "TaihanTextl",
        "long_name": "Taihan Textile Co., Ltd.",
        "summary": "Taihan Textile Co., Ltd. produces and supplies textile products in South Korea and internationally. The company offers various apparel products, including shirts/blouses, jackets/pants, underwear products, etc.; bedding products, such as blankets, pillows, etc.; military and police uniforms, and working clothes; and gear products. It also provides woven and knit fabrics; cupra and cellulose fibers; and yarns comprising special, melange, cotton, MVS, slub, and fancy yarns. The company was founded in 1953 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001420.KS": {
        "short_name": "TaewonMulsan",
        "long_name": "Tae Won Mulsan Co., Ltd.",
        "summary": "Tae Won Mulsan Co., Ltd. manufactures and sells engine water pumps and engine surrounding parts for automobiles. The company provides water pumps for farm machines and automobiles; rod and cable type gear shift cover assemblies; shift blocks and front bearing covers for trucks; brackets for transmission mounts; shackles for alternators; EGR adapters; and ECU housing products. It also offers refined phosphate gypsum, gypsum plaster, calcined gypsum, and gypsum resin mortar for use in construction materials. The company was formerly known as Samyang Trading and changed its name to Tae Won Mulsan Co., Ltd. in February 1968. Tae Won Mulsan Co., Ltd. was founded in 1955 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001460.KS": {
        "short_name": "BYC",
        "long_name": "BYC Co., Ltd.",
        "summary": "BYC Co., Ltd. produces and sells underwear in South Korea and internationally. It offers men's and women's underwear, pajamas, and innerwear for babies under the BYC, SCORPIO, BODY HEAT, BODY DRY, LESON, CELPINK, SC SPORTS, and RAMMI brand names. The company sells its products through online and stores. The company operates 1,700 franchises and 14 chain stores. BYC Co., Ltd. was founded in 1946 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001465.KS": {
        "short_name": "BYC(1P)",
        "long_name": "BYC Co., Ltd.",
        "summary": "BYC Co., Ltd. produces and sells underwear in South Korea and internationally. It offers men's and women's underwear, pajamas, and innerwear for babies under the BYC, SCORPIO, BODY HEAT, BODY DRY, LESON, CELPINK, SC SPORTS, and RAMMI brand names. The company sells its products through online and stores. The company operates 1,700 franchises and 14 chain stores. BYC Co., Ltd. was founded in 1946 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "001620.KS": {
        "short_name": "KBIDK",
        "long_name": "Kbi Dongkook Ind. Co., Ltd",
        "summary": "Kbi Dongkook Ind.Co.,Ltd provides automobile components in South Korea. It offers interior and exterior components, air conditioning, and lamp parts. The company was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002070.KS": {
        "short_name": "VIVIEN",
        "long_name": "Vivien Corporation",
        "summary": "Vivien Corporation operates in the lingerie market in South Korea. It sells its products under the VIVIEN, BBM, Maternity, GENTOFF, SUVIVIEN, DELOR, Rosebud, and PANDORA brands through a network of department stores and Vivian stores. The company was formerly known as Namyeung Vivien Corporation and changed its name to Vivien Corporation in August 2020. The company is based in Seoul, South Korea. As of January 21, 2020, Vivien Corporation operates as a subsidiary of KANGLIM Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002170.KS": {
        "short_name": "SamyangTongsang",
        "long_name": "Samyang Tongsang Co., Ltd",
        "summary": "Samyang Tongsang Co., Ltd produces and sells leather products in South Korea. The company offers leather for handbags, footwear products, car seats, and baseball gloves; and baseball gloves and American footballs. It is also involved in real estate leasing activities. The company was founded in 1957 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "002350.KS": {
        "short_name": "NEXENTIRE",
        "long_name": "Nexen Tire Corporation",
        "summary": "Nexen Tire Corporation engages in the production, sale, and rental of tires in South Korea and internationally. The company offers passenger car, SUV, van and light truck, and solid tires, as well as tubes and flaps; and tire finder and warranty services. It also provides services in the non-tire sector, including transport and storage, and molding, as well as confectionery and baking. The company was founded in 1942 and is headquartered in Yangsan-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yangsan-si"
    },
    "002355.KS": {
        "short_name": "NEXENTIRE(1PB)",
        "long_name": "Nexen Tire Corporation",
        "summary": "Nexen Tire Corporation engages in the production, sale, and rental of tires in South Korea and internationally. The company offers passenger car, SUV, van and light truck, and solid tires, as well as tubes and flaps; and tire finder and warranty services. It also provides services in the non-tire sector, including transport and storage, and molding, as well as confectionery and baking. The company was founded in 1942 and is headquartered in Yangsan-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yangsan-si"
    },
    "002870.KS": {
        "short_name": "ShinpoongPaprMfg",
        "long_name": "Shinpoong Paper Mfg. Co., Ltd",
        "summary": "Shinpoong Paper Mfg. Co., Ltd produces and sells paper products. It offers duplex board products that are used for packaging foods, electronic products, tissues, cleansers, and toys. The company was founded in 1960 and is headquartered in Pyeongtaek si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Pyeongtaek-Si"
    },
    "002880.KS": {
        "short_name": "DAYOU A-TECH",
        "long_name": "Dayou A-Tech Co.,Ltd",
        "summary": "Dayou A-Tech Co.,Ltd manufactures and sells automobile seats in South Korea. The company offers sportage, soul booster, seltos, and bongo III car seats. The company was founded in 1960 and is based in Gwangju-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gwangju"
    },
    "002920.KS": {
        "short_name": "YoosungEnt",
        "long_name": "Yoosung Enterprise Co., Ltd.",
        "summary": "Yoosung Enterprise Co., Ltd. manufactures and supplies engine and auto parts in South Korea and internationally. The company offers cast iron piston rings, cylinder liners, air compressors, camshafts, valve guides, and loose sand vacuum assisted counter-gravity castings. Its products are used in automobile, marine, and agricultural engines applications in the assemblers and replacement markets. Yoosung Enterprise Co., Ltd. was founded in 1959 and is headquartered in Asan-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Asan-Si"
    },
    "003200.KS": {
        "short_name": "IlshinSpng",
        "long_name": "Ilshin Spinning Co., Ltd",
        "summary": "Ilshin Spinning Co., Ltd produces and sells yarns and fabrics in South Korea. The company offers combed cotton, compact, slub, patched, tri-blended, blended and synthetic, and OE glove yarns under the THREESTAR brand; melange yarns under the MELANSTAR brand; and MVS yarns under the IVYSTAR brand. It also provides fabrics, including cotton, rayon, mixed, and interwoven fabrics, as well as offers dyed yarns and fabrics. The company was founded in 1951 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003610.KS": {
        "short_name": "Pangrim",
        "long_name": "Pangrim Co., Ltd.",
        "summary": "Pangrim Co., Ltd. manufactures and sells textile products in South Korea and internationally. It produces a range of fabrics. The company was formerly known as PangRim Textile Co., Ltd. and changed its name to Pangrim Co., Ltd. in 1991. Pangrim Co., Ltd. was founded in 1963 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003720.KS": {
        "short_name": "SamyoungChem",
        "long_name": "SamYoung Chemical Co.,Ltd",
        "summary": "SamYoung Chemical Co.,Ltd manufactures and sells electronic and packaging films in South Korea. It offers PP films, such as BOPP films that are used in food and non-food packing materials, tapes, capacitors, etc.; CPP films; and vacuumed films for application in food packages, agrichemicals, medical products, sundries, stationaries, gift packings, etc., as well as nylon films for meat and meat processing vacuum packing, and agricultural/fishery/industrial vacuum packing. The company also provides capacitor films; and wraps, such as PE stretch films for packing electronic products, complicated machines and parts, various living household products, medical products, bricks, and other separable products, as well as PE bio wraps, PVC sun wraps, and antifungal sun wraps. In addition, it offers lamination products consisting of poly match and toothpaste films; and paper packing containers. The company exports its products to 40 countries. The company was founded in 1959 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "003830.KS": {
        "short_name": "DaehanSynthFibr",
        "long_name": "Daehan Synthetic Fiber Co., Ltd.",
        "summary": "Daehan Synthetic Fiber Co., Ltd. manufactures and sells polyester yarns in Korea and internationally. The company offers specialty and regular polyester yarns. It sells its polyester products under the Acepora brand. Daehan Synthetic Fiber Co., Ltd. was founded in 1963 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "004100.KS": {
        "short_name": "TaeyangMtl",
        "long_name": "Taeyang Metal Industrial Co., Ltd.",
        "summary": "Taeyang Metal Industrial Co., Ltd. produces and sells cold forged and precision processed parts for automobiles in South Korea and internationally. The company offers automotive products, including cylinder head, main bearing cap, fly wheel, con rod, crank shaft pulley, eye and ring, cam, wheel and union, flange, U-shape, and specialty bolts; ball studs and housings, outer sockets, tie rods, upper and solid shafts, shaft blanks and type products, and socket parts; guide rods, input and output rods, adjusting screws, piston blanks, and piston adjustment products; color-RR products; and lug wrenches. It also provides motorcycle components, such as drive-train components and steering systems; and appliance components comprising compressor bolts. The company was founded in 1954 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan-Si"
    },
    "004105.KS": {
        "short_name": "TaeyangMtl(1P)",
        "long_name": "Taeyang Metal Industrial Co., Ltd.",
        "summary": "Taeyang Metal Industrial Co., Ltd. produces and sells cold forged and precision processed parts for automobiles in South Korea and internationally. The company offers automotive products, including cylinder head, main bearing cap, fly wheel, con rod, crank shaft pulley, eye and ring, cam, wheel and union, flange, U-shape, and specialty bolts; ball studs and housings, outer sockets, tie rods, upper and solid shafts, shaft blanks and type products, and socket parts; guide rods, input and output rods, adjusting screws, piston blanks, and piston adjustment products; color-RR products; and lug wrenches. It also provides motorcycle components, such as drive-train components and steering systems; and appliance components comprising compressor bolts. The company was founded in 1954 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan-Si"
    },
    "004170.KS": {
        "short_name": "Shinsegae",
        "long_name": "Shinsegae Inc.",
        "summary": "Shinsegae Inc. operates department stores in South Korea. It operates its department stores under the Shinsegae name. The company also manufactures and retails clothing and furniture; leases real estate; and offers advisory services, as well as operates passenger terminal. As of December 31, 2019, it operates nine departmental stores. Shinsegae Inc. was founded in 1955 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "004250.KS": {
        "short_name": "NPC",
        "long_name": "NPC Co., Ltd.",
        "summary": "NPC Co., Ltd. manufactures and sells plastic products in South Korea. The company's products include containers, pallets, chairs and desks, recycling bins, sheets, reversetap, and cups. The company was formerly known as National Plastic Co., Ltd. and changed its name to NPC Co., Ltd. in March 2010. NPC Co., Ltd. was founded in 1965 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan-Si"
    },
    "004450.KS": {
        "short_name": "SamhwaCrown&Closure",
        "long_name": "Samhwa Crown & Closure Co., Ltd",
        "summary": "Samhwa Crown & Closure Co., Ltd manufactures and sells bottle caps used in the packaging of beverages, alcohols, and foods in South Korea and internationally. It offers crown, roll on pilfer proof, plastic, white, press on twist off, and injection caps. The company also provides metal printing services for caps. It also exports its products. The company was founded in 1965 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "004700.KS": {
        "short_name": "ChokwangLeat",
        "long_name": "Chokwang Leather Co.,Ltd.",
        "summary": "Chokwang Leather Co.,Ltd. manufactures and sells leather products in South Korea. It offers automotive leather products, such as seat covers, head rests, arm rests, steering wheels, knobs, door trims, and dash boards; fashion leather products, including MC type, full grain, shrunken, vegetable tanned, oil type, corrected grain, embossed grain, and cow and waterproof leather products, as well as shoes, handbags, wallets, belts, etc.; and furniture. The company supplies its products to motors and car makers. Chokwang Leather Co.,Ltd. was founded in 1936 and is headquartered in Cheongju, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Cheongju"
    },
    "004830.KS": {
        "short_name": "Duksung",
        "long_name": "Duksung Co., Ltd.",
        "summary": "Duksung Co., Ltd. produces and sells synthetic leathers in South Korea. It offers artificial leathers, synthetic resins, materials for cosmetics, polishing pads, textiles, wet dressing products, and intermediate organic material products for OLEDs. The company was formerly known as Duksung Chemical Industry Co. and changed its name to Duksung Co., Ltd. in March 2000. Duksung Co., Ltd. was founded in 1966 and is headquartered in Suwon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Suwon-si"
    },
    "004835.KS": {
        "short_name": "Duksung(1P)",
        "long_name": "Duksung Co., Ltd.",
        "summary": "Duksung Co., Ltd. produces and sells synthetic leathers in South Korea. It offers artificial leathers, synthetic resins, materials for cosmetics, polishing pads, textiles, wet dressing products, and intermediate organic material products for OLEDs. The company was formerly known as Duksung Chemical Industry Co. and changed its name to Duksung Co., Ltd. in March 2000. Duksung Co., Ltd. was founded in 1966 and is headquartered in Suwon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Suwon-si"
    },
    "005030.KS": {
        "short_name": "PusanCstIron",
        "long_name": "Pusan Cast Iron Co., Ltd.",
        "summary": "Pusan Cast Iron Co., Ltd. manufactures and sells automobile components for various OEM customers in South Korea. The company offers knuckles, carriers, cases, crank shafts, HSGs, base assemblies, saddle lowers, hubs, drums, cam shafts, caliper housings and discs, brake bridges and spiders, hub wheels, brake frames, bearing caps, and pot calipers. It also focuses on renewable energy business. The company also exports its products internationally. Pusan Cast Iron Co., Ltd. was founded in 1967 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "005320.KS": {
        "short_name": "Kukdong",
        "long_name": "Kukdong Corporation",
        "summary": "Kukdong Corporation manufactures and sells knit garments for men, women, and children in South Korea. It also offers workwear; activewear, such as training wear, golf wear, and fitness wear; lounge wear, including home wear, room wear, sleep wear, and night gown; and fashion wear. The company also exports its products in the United States, the European Union, and Chile. Kukdong Corporation was founded in 1967 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005360.KS": {
        "short_name": "Monami",
        "long_name": "Monami Co., Ltd.",
        "summary": "Monami Co., Ltd. manufactures and sells stationery products in South Korea and internationally. The company offers pens, pencil, markers, highlighters, and artist's materials, as well as miscellaneous, such as eraser, glue stick, white clean, correction tape, and white board cleaner. Monami Co., Ltd. was founded in 1960 and is headquartered in Yongin-Si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yongin-Si"
    },
    "005380.KS": {
        "short_name": "HyundaiMtr",
        "long_name": "Hyundai Motor Company",
        "summary": "Hyundai Motor Company, together with its subsidiaries, manufactures and distributes motor vehicles and parts. It operates through Vehicle, Finance, and Others segments. The company offers cars under the Azera, Sonata, Veloster, Veloster N, i30 Fastback N, i30 N, i30, Elantra, Accent, i20, and i10 names; and SUVs under the Palisade, Santa Fe, Tucson, Creta, Kona, and Venue names. It also provides commercial vehicles under the H-1 and H-100 names; and eco vehicles under the IONIQ 5, NEXO, Santa Fe Hybrid/Plug-in Hybrid, Tucson Hybrid, KONA Electric, Elantra Hybrid, IONIQ Plug-in Hybrid, IONIQ Electric, IONIQ Electric, and i30 Hybrid names. In addition, the company offers trucks, buses, vans, and engines; vehicle financing, credit card processing, marketing, engineering, mobility, and insurance services; and train manufacturing services, as well as operates a football club. Further, it is involved in real estate development; research and development; and investment activities. The company was incorporated in 1967 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005389.KS": {
        "short_name": "HyundaiMtr(3PB)",
        "long_name": "Hyundai Motor Company",
        "summary": "Hyundai Motor Company, together with its subsidiaries, manufactures and distributes motor vehicles and parts. It operates through Vehicle, Finance, and Others segments. The company offers cars under the Azera, Sonata, Veloster, Veloster N, i30 Fastback N, i30 N, i30, Elantra, Accent, i20, and i10 names; and SUVs under the Palisade, Santa Fe, Tucson, Creta, Kona, and Venue names. It also provides commercial vehicles under the H-1 and H-100 names; and eco vehicles under the IONIQ 5, NEXO, Santa Fe Hybrid/Plug-in Hybrid, Tucson Hybrid, KONA Electric, Elantra Hybrid, IONIQ Plug-in Hybrid, IONIQ Electric, IONIQ Electric, and i30 Hybrid names. In addition, the company offers trucks, buses, vans, and engines; vehicle financing, credit card processing, marketing, engineering, mobility, and insurance services; and train manufacturing services, as well as operates a football club. Further, it is involved in real estate development; research and development; and investment activities. The company was incorporated in 1967 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005390.KS": {
        "short_name": "ShinsungTongsang",
        "long_name": "Shinsung Tongsang Co., Ltd.",
        "summary": "Shinsung Tongsang Co., Ltd. manufactures, distributes, and sells fashion products in Korea. The company also exports fibers and clothes of various brands, including UNIONBAY, OLZEN, ZIOZIA, TOPTEN10, AND Z, and Edition through its sales network, such as branch retail stores, department stores, and discount stores. In addition, it operates RICHMART, a local community-based discount store. The company was founded in 1968 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "005720.KS": {
        "short_name": "NEXEN",
        "long_name": "Nexen Corporation",
        "summary": "Nexen Corporation manufactures and sells rubber products in South Korea. The company offers tubes and flaps, solid tires, carbon masterbatch pellets and sheets, golf balls, and bladders for tires. It also provides logistics services, including sea, bulk, air, inland transport and distribution, warehouse, and knock down. The company also exports and distributes its products to approximately 140 countries. Nexen Corporation was founded in 1968 and is headquartered in Gimhae, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gimhae-si"
    },
    "005725.KS": {
        "short_name": "NEXEN(1P)",
        "long_name": "Nexen Corporation",
        "summary": "Nexen Corporation manufactures and sells rubber products in South Korea. The company offers tubes and flaps, solid tires, carbon masterbatch pellets and sheets, golf balls, and bladders for tires. It also provides logistics services, including sea, bulk, air, inland transport and distribution, warehouse, and knock down. The company also exports and distributes its products to approximately 140 countries. Nexen Corporation was founded in 1968 and is headquartered in Gimhae, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gimhae-si"
    },
    "005800.KS": {
        "short_name": "ShinyoungWacoal",
        "long_name": "Shinyoungwacoal,Inc.",
        "summary": "Shinyoungwacoal,Inc. produces and sells foundation products and lingerie for women in South Korea. It offers its products under the VENUS, VENUS MEN, PINK VENUS, ORLFA, SOLB, WACOAL, SALUTE, MC, RIECHE, MOTHERPIA, REMAMMA, ART-BEAU, VENUS CHOU, JASMIN, and ANETA brands. The company was founded in 1954 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "006370.KS": {
        "short_name": "DaeguDptStr",
        "long_name": "Daegu Department Store Co., Ltd.",
        "summary": "Daegu Department Store Co., Ltd. operates department stores in South Korea. The company was founded in 1944 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Daegu"
    },
    "007340.KS": {
        "short_name": "DTR AUTOMOTIVE",
        "long_name": "DTR Automotive Corporation",
        "summary": "DTR Automotive Corporation manufactures and sells automotive parts in South Korea. The company also produces and sells automobile batteries, tubes, and accumulators; dust-proof products for automotive engines; and other automotive parts. In addition, it develops and supplies software products; and engages in the construction of residential buildings, including apartments. The company was formerly known as Dong AhTire & Rubber Co.,Ltd. and changed its name to DTR Automotive Corporation in November 2017. DTR Automotive Corporation was founded in 1971 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ulsan"
    },
    "007860.KS": {
        "short_name": "SEOYON",
        "long_name": "Seoyon Co., Ltd.",
        "summary": "Seoyon Co., Ltd. researches and develops, manufactures, and sells automobile interior products primarily in South Korea, the United States, the People's Republic of China, India, Europe, and internationally. It offers seats and other products, as well as engages in the real estate management services. The company was formerly known as Hanil E-Hwa Co., Ltd. and changed its name to Seoyeon Co., Ltd. in August 2014. The company was founded in 1972 and is based in Anyang-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Anyang-Si"
    },
    "008500.KS": {
        "short_name": "IljeongInd",
        "long_name": "Iljeong Industrial Co.,Ltd",
        "summary": "Iljeong Industrial Co.Ltd. provides car seat fabrics to automobile makers in Korea. Its moquette, tricot, woven, plush jacquard, jersey, single knit, and headliner fabrics are used in car seat fabrics, head linings, door trims, arms rests, and sun visors. The company also provides upholstery fabrics that are used in sofas and chairs in hotel and homes. Iljeong Industrial Co.Ltd. was founded in 1973 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan-Si"
    },
    "008600.KS": {
        "short_name": "WillBes",
        "long_name": "The Willbes & CO., Ltd.",
        "summary": "The Willbes & Co., Ltd. manufactures and sells apparel in South Korea. It also provides postgraduate training for individuals looking for professional jobs, such as lawyer, diplomat, government official, appraiser, labor attorney, and others, as well as engages in the investment activities. The company was formerly known as Kunja Industries, Co., Ltd. and changed its name to The Willbes & Co., Ltd. in 1997. The Willbes & Co., Ltd. was founded in 1973 and is headquartered in Cheonan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Cheonan-si"
    },
    "008730.KS": {
        "short_name": "YoulchonChem",
        "long_name": "Youlchon Chemical Co.,Ltd.",
        "summary": "Youlchon Chemical Co.,Ltd. produces and sells functional packaging materials. The company offers adhesive and composite materials for surface protection of various electronic materials; release materials for general industrial-purpose and optical materials; and hard coating materials for display materials. It also provides flexible packaging materials for food, daily commodities, and functional packaging; laminated tubes, which are used to pack toothpaste, food, and medical supplies; biaxial oriented polypropylene films, casted polypropylene films, and polypropylene shrink films; and corrugated boards. The company was formerly known as Youl Chon Printing Company and changed its name to Youlchon Chemical Co.,Ltd. in April 1988. Youlchon Chemical Co.,Ltd. was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008770.KS": {
        "short_name": "HtlShilla",
        "long_name": "Hotel Shilla Co.,Ltd",
        "summary": "Hotel Shilla Co.,Ltd operates as a hospitality company. The company operates airport duty-free shops under the The Shilla Duty Free name, which offer various luxury brands in boutique items, fashion, jewelry, cosmetics, watches, etc., as well as an online duty-free shop and a guest lounge. It also operates hotels under the The Shilla Seoul and The Shilla Jeju names; and Hotel Shilla fitness center. Hotel Shilla Co.,Ltd is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008775.KS": {
        "short_name": "HtlShilla(1P)",
        "long_name": "Hotel Shilla Co.,Ltd",
        "summary": "Hotel Shilla Co.,Ltd operates as a hospitality company. The company operates airport duty-free shops under the The Shilla Duty Free name, which offer various luxury brands in boutique items, fashion, jewelry, cosmetics, watches, etc., as well as an online duty-free shop and a guest lounge. It also operates hotels under the The Shilla Seoul and The Shilla Jeju names; and Hotel Shilla fitness center. Hotel Shilla Co.,Ltd is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Lodging",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "008870.KS": {
        "short_name": "Kumbi",
        "long_name": "Kumbi Corporation",
        "summary": "Kumbi Corporation manufactures and sells glass bottles, bottle caps, cosmetics, and plastic products in South Korea. The company was formerly known as Jin Ro Glass Co., Ltd. and changed its name to Kumbi Corporation in April 1992. Kumbi Corporation was founded in 1973 and is headquartered in Icheon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Icheon-Si"
    },
    "009240.KS": {
        "short_name": "Hanssem",
        "long_name": "Hanssem Co., Ltd.",
        "summary": "Hanssem Co., Ltd. operates as a full-service interior company in South Korea, the United States, China, and Japan. The company offers furniture, appliances, household accessories, fabric products, etc. for kitchen, bedroom, living room, and bathroom. It also provides package designs that coordinate interior items in furniture, lightings, fabrics, and living goods for space of bedroom, living room, children's room, kitchen, office room, and bathroom, as well as library and daily supplies. The company offers its products through direct stores, construction company's special sales, and kitchen-and-interior-specialized stores, as well as through online shopping malls and interior affiliated stores. It operates 12 stores; 450 re-house agencies; 200 Kitchenbach agencies; and 80 interior specialty agencies. The company was founded in 1970 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009270.KS": {
        "short_name": "Shinwon",
        "long_name": "ShinWon Corporation",
        "summary": "ShinWon Corporation manufactures and sells men's wear, women's wear, casual, sports, and accessories in South Korea. Its owned women's wear brands include Besti Belli, SI, VIKI, and ISABEY; and men's wear brands comprise SIEG, SIEG Fahrenheit, Vanhart Di Albazar, and MARKM. The company also exports its products to the United States and Europe. It operates approximately 430 stores, as well as an online portal. ShinWon Corporation was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009275.KS": {
        "short_name": "Shinwon(1P)",
        "long_name": "ShinWon Corporation",
        "summary": "ShinWon Corporation manufactures and sells men's wear, women's wear, casual, sports, and accessories in South Korea. Its owned women's wear brands include Besti Belli, SI, VIKI, and ISABEY; and men's wear brands comprise SIEG, SIEG Fahrenheit, Vanhart Di Albazar, and MARKM. The company also exports its products to the United States and Europe. It operates approximately 430 stores, as well as an online portal. ShinWon Corporation was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009320.KS": {
        "short_name": "DAEWOOELECCOMPONENTS",
        "long_name": "Daewoo Electronic Components Co., Ltd.",
        "summary": "Daewoo Electronic Components Co., Ltd. produces and sells automotive components in South Korea. The company offers automotive components include on board chargers, and coolant and positive temperature coefficient heaters for electric cars; electronic water pumps and climatic control heads for hydrogen cars; pulse width modulations for air conditioning systems; voltage regulators for voltage controller applications; actuator control units for supercharger applications; and torque angle sensors for steering applications. Its automotive components also comprise solenoids, tip tronics, and LED indicators for automatic transmission applications; around view modules for camera systems; brushless DC electric motors for ventilation seat applications; and regulators, relays, and HMIs for electric bicycle applications. The company also provides aluminum capacitors, such as surface mount aluminum electrolytic, miniature aluminum electrolytic, and large sized aluminum electrolytic capacitors. Daewoo Electronic Components Co., Ltd. was founded in 1973 and is headquartered in Jeongeup, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Jeongeup"
    },
    "009680.KS": {
        "short_name": "MT",
        "long_name": "Motonic Corporation",
        "summary": "Motonic Corporation manufactures and sells automotive components worldwide. The company offers high pressure regulators, receptacle, and manifolds; LPDI high-pressure fuel pumps, and low-pressure fuel pumps and drivers; LPI systems comprising pump modules, injection modules, regulators, and drivers; oil pump control units and fuel pump controllers; and variable valve lifts. It also provides electronic-cylinder deactivation actuators and electronic-variable valve lifts; aluminum alloy, stainless steel, plastic, and high pressure rails; oil pumps; GDI high-pressure fuel pumps; EGR valves; and air induction components comprising intake manifolds, throttle bodies, and air control valves. In addition, the company offers LPG bi-fuel systems, including regulators, cut-off solenoids, ECUs, and injectors; rocker arms; and gas filters, switch and level gauges, waste gate actuators, control units, piston clutches, and LPG mixer systems. The company was formerly known as Changwon Carburetor Ind. Co., Ltd. and changed its name to Motonic Corporation in March 2002. Motonic Corporation was founded in 1974 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "009900.KS": {
        "short_name": "MS IND",
        "long_name": "Myoung Shin Industrial Co.,Ltd",
        "summary": "Myoung Shin Industrial Co.,Ltd manufactures and sells automobile parts in South Korea. The company was founded in 1982 and is headquartered in Gyeongju, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gyeongju"
    },
    "009970.KS": {
        "short_name": "YoungoneHoldings",
        "long_name": "Youngone Holdings Co., Ltd.",
        "summary": "Youngone Holdings Co., Ltd. manufactures and sells apparel, shoes, handbags, sleeping bags, socks, and accessories in South Korea and internationally. It offers clothing products, such as outdoor apparel, sportswear, technical clothing, knitwear, sweaters, and casual wear; shoes, including sports shoes, casual shoes, safety shoes, sneakers, boots, and fishing shoes; mountain climbing, travel, casual, and business bags; and camping goods. The company was formerly known as Youngone Corp. and changed its name to Youngone Holdings Co., Ltd. in July 2001. Youngone Holdings Co., Ltd. was founded in 1974 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "010100.KS": {
        "short_name": "KorFlange",
        "long_name": "Korea Flange Co., Ltd",
        "summary": "Korea Flange Co., Ltd. manufactures and sells automotive power transmission parts worldwide. It offers auto parts, including half shaft and front axle assemblies for passenger cars; and front axle and brake assemblies for buses and trucks. The company also provides engine parts of automobiles comprising crank and cam shafts, hubs, differential gears, spindles, and connecting rods; and carbon steel, non-steel, ANSI, AWWA, API, MSS, welding neck, threeded, slip-on, lap joint, blind, and socket welding flanges. In addition, it offers industrial vessel engine bases and frames, such as air and exhaust receivers, bed plates, and frame boxes for power plants, vessel and steel structures, press containers of chemical factories, and bridge and construction-related works. The company was formerly known as Ulsan Ironworks Corporation and changed its name to Korea Flange Co., Ltd. in March 1976. Korea Flange Co., Ltd. was founded in 1974 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ulsan"
    },
    "010600.KS": {
        "short_name": "WELLBIOTEC",
        "long_name": "Wellbiotec Co., Ltd.",
        "summary": "Wellbiotec Co., Ltd. produces and sells leather products in South Korea and internationally. The company provides leather products for shoes, bags, car seats, and handle covers. It also offers logistics consulting, container, warehouse/clearance, and transportation agency services; product research and development, consulting, distribution, and sales; and general and specialized medicines, health functional products, diagnosis kits, cosmeceuticals, and other products. In addition, the company is involved in casting agency, celebrity development, content production, and multi-channel network; and food and beverages businesses. The company was founded in 1975 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "010690.KS": {
        "short_name": "Hwashin",
        "long_name": "HWASHIN CO.,Ltd",
        "summary": "HWASHIN CO.,Ltd manufactures and sells automobile chassis and body components. It offers chassis products, such as front and rear cross member type, front and rear lower arm, rear CTBA, rear trailing and assist arm, rear axle housing assembly, front upper arm, pedal, and fuel tank; and body parts comprising reinf side outer, fender apron and member, center and rear floor, cowl complete and cross bar, bumper rail, and sun roof reinf products. The company was formerly known as Hwashin Industrial Corporation and changed its name to HWASHIN CO.,Ltd in March 1995. HWASHIN CO.,Ltd was founded in 1969 and is headquartered in Yeongcheon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yeongcheon-Si"
    },
    "011090.KS": {
        "short_name": "Enex",
        "long_name": "Enex Co.,Ltd",
        "summary": "Enex Co., Ltd. manufactures and sells furniture in Korea and internationally. The company offers built-in wardrobes, including casements, sliding built-in cabinets, built-in cabinate options, wardrobes, single cabinet, front doors, and dress rooms; bedroom furniture, such as queen/king bed, single bed, mattresses, chiffoniers, and dressing tables; and living room furniture comprising sofa, Chinese furniture, and tea tables. It also provides kitchen furniture, including tables, storage, and Ireland furniture products; and student/study room furniture, such as chairs, desks, bookshelves, and kid's furniture products, as well as office furniture products. In addition, the company offers household goods comprising kitchen, bathroom, and pet products, as well as bedding sets, carpets, and rugs; and furniture and product equipment for kitchen, living room, and multi-purpose spaces. It sells its products through direct stores and distribution networks, as well as online under the Enex brand name. The company was formerly known as ORIPYO Co., Ltd. and changed its name to Enex Co., Ltd. in March 1992. Enex Co., Ltd. was founded in 1971 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "011280.KS": {
        "short_name": "Tailim Pkg",
        "long_name": "Tailim Packaging Co., Ltd.",
        "summary": "Tailim Packaging Co., Ltd. manufactures and sells paper and packaging products in South Korea. The company was formerly known as Tailim Packaging Industrial Co., Ltd. and changed its name to Tailim Packaging Co., Ltd. in May 2016. Tailim Packaging Co., Ltd. was founded in 1976 and is based in Siheung, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Siheung-Si"
    },
    "011300.KS": {
        "short_name": "Seongan",
        "long_name": "SEONGAN CO., Ltd.",
        "summary": "SEONGAN CO., Ltd., a textile company, manufactures, exports, and sells fabric related products in Korea and internationally. The company offers dress, blouse, jackets/pants, prints and specialized, interior woven fabrics; white thobe and uniforms; and tops/dress, and prints and specialized fabrics. It offers its products under STARTEX, Kuntex, and SOFSIL brand names. SEONGAN CO., Ltd. was founded in 1953 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "012280.KS": {
        "short_name": "YeonghwaMtl",
        "long_name": "Yeong Hwa Metal Co., Ltd.",
        "summary": "Yeong Hwa Metal Co., Ltd. manufactures and sells automotive casting products in South Korea. It offers exhaust manifolds, cylinder blocks, and crank shafts; wheel hubs, and diff cases and carriers; brake discs and drums; mission carriers, oil pump housings, and pressure plates; and turbine and bearing housings. The company was founded in 1977 and is based in Changwon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Changwon"
    },
    "012330.KS": {
        "short_name": "Mobis",
        "long_name": "Hyundai Mobis Co.,Ltd",
        "summary": "Hyundai Mobis Co.,Ltd manufactures and sells automotive parts worldwide. The company offers advanced driver assistance systems, including lane keeping assist systems, smart cruise controls, autonomous emergency braking systems, highway driving assist systems, and auto parking systems; and head, rear, and small lamps, as well as lamp electronics. It also provides electrification products, including power converters, driving systems, electric energy systems, 48V mild hybrid systems, and fuel cell electric vehicles; and airbag modules and electronics. In addition, the company offers infotainment; centre-infotainment-display systems; digital cluster products; windshield, combiner, and AR HUDs; sound systems; i-MEB, a combined master cylinder; MEB, a device that combines ABS, an electronic braking system; EPB, a brake system that operates the parking brake through switch operation; EPS, an electronic steering system; and suspension systems. Further, it supplies aftermarket service parts, automobile accessories, and automotive system solutions. The company was formerly known as Hyundai Precision Industry Co., Ltd and changed its name to Hyundai Mobis Co.,Ltd in November 2000. Hyundai Mobis Co.,Ltd was founded in 1977 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "013520.KS": {
        "short_name": "HS Corp",
        "long_name": "Hwaseung Corporation Co.,Ltd.",
        "summary": "Hwaseung Corporation Co., Ltd. engages in the in the manufacture and sale of industrial rubber products. The company is based in Yangsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yangsan-si"
    },
    "013890.KS": {
        "short_name": "ZINUS",
        "long_name": "Zinus, Inc",
        "summary": "Zinus, Inc manufactures and sells mattresses, bedroom furniture, beds, bedding products, etc. It sells it products through stores and online channels. The company was founded in 1979 and is based in Seongnam-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "014160.KS": {
        "short_name": "DaeyoungPkg",
        "long_name": "DAE YOUNG Packaging.Co., Ltd.",
        "summary": "DAE YOUNG Packaging.Co., Ltd. manufactures and sells corrugated cardboards and boxes in South Korea. The company provides middle, reverse side, and surface base papers for corrugated fiber boards. It offers single and double faced; and double and triple wall corrugated fiber boards. DAE YOUNG Packaging.Co., Ltd. was founded in 1979 and is based in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan"
    },
    "015230.KS": {
        "short_name": "DaechangForging",
        "long_name": "Daechang Forging Co., Ltd.",
        "summary": "Daechang Forging Co., Ltd. manufactures and sells various forged products in South Korea and internationally. It offers undercarriage parts for heavy construction equipment, such as excavators and dozers; track group assemblies; track rollers and idlers; segments and sprockets; crankshafts; mini excavators; and other parts. The company was founded in 1955 and is based in Gimhae-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gimhae-si"
    },
    "016090.KS": {
        "short_name": "Daehyun",
        "long_name": "Daehyun Co.,Ltd.",
        "summary": "Daehyun Co., Ltd. manufactures and sells women's clothing in South Korea. The company markets its products under various brand names, including Blu Pepe, CC Collect, Zooc, Dewl, and Mojo S Phine. It also operates Envy department stores. The company was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "016450.KS": {
        "short_name": "HansaeYes24Holdings",
        "long_name": "Hansae Yes24 Holdings Co., Ltd",
        "summary": "Hansae Yes24 Holdings Co., Ltd., through its subsidiaries, produces and sells fabrics in South Korea and internationally. It offers baby clothes under the Moimoln brand name; operates a kid sports multi play shop; operates an online bookstore; publishes books/textbooks; distributes cultural products, including music, DVD/Blu-ray, and gift products; offers ticket booking services; and provides digital contents, such as Web novels, light novels, and comics. The company was formerly known as Hansae Co. Ltd. and changed its name to Hansae Yes24 Holdings Co., Ltd. in 2009. Hansae Yes24 Holdings Co., Ltd. was founded in 1982 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "016740.KS": {
        "short_name": "DUAL",
        "long_name": "DUAL Co., Ltd.",
        "summary": "DUAL Co., Ltd. manufactures and sells automobile parts in South Korea and internationally. Its products comprise car fabrics, seats, and air bags. The company was founded in 1971 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "016800.KS": {
        "short_name": "Fursys",
        "long_name": "Fursys Inc.",
        "summary": "Fursys Inc. designs, manufactures, and sells office and home furniture products primarily in South Korea. It primarily offers desks and panels, executive officer chairs, lobby chairs, conference and lecture systems, sofas, sofa tables, and other accessories, as well as furniture for libraries and dormitories. The company also provides healthcare related furniture for the use in medical equipment, ward, clinical, nursing station, workspace, lab, elementary and secondary science lab, and resting standby areas. It markets its products under the FURSYS, iloom, and SIDIZ brands. Fursys Inc. was founded in 1983 and is based in Seoul, Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "017370.KS": {
        "short_name": "WooshinSystems",
        "long_name": "Wooshin Systems Co., Ltd.",
        "summary": "Wooshin Systems Co., Ltd. manufactures and sells automotive body assembly systems and body parts in South Korea and internationally. The company offers automotive body assembly systems, including robotic, gate change, index, sliding, and overhead hinge framers; roller and W/H roll hemmings, hemming presses, and table tops; and geo pallet, skid, lift and carry, friction, and linear motor systems, as well as plain shuttles, accumulators, and part feeders. It also provides automotive interior components, such as A-pillar, B-pillar, C-pillar, door center trim panel, real speaker grill, arm rest, and seat back panel; and door parts, hoods, trunk-lids, and seat belts. The company was founded in 1984 and is headquartered in Siheung-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Siheung-Si"
    },
    "018880.KS": {
        "short_name": "Hanon Systems",
        "long_name": "Hanon Systems",
        "summary": "Hanon Systems manufactures, distributes, and sells automotive thermal and energy management solutions for conventional, electric, hybrid, fuel cell, and autonomous vehicles in South Korea, Europe, Asia, and the Americas. The company offers heating ventilation, and air conditioning (HVAC) systems; and radiators, blowers, compressors and clutches, front end modules, exhaust gas recirculation modules, electronic coolant pumps and valves, electronic waste gate actuators, and electronic throttle bodies. It also provides fluid transport products, including refrigerant lines, coolant lines, transmission oil cooler lines, accumulators, receiver driers, internal heat exchangers, and metal seal fittings, as well as powertrain cooling systems and thermal and emissions solutions. In addition, the company offers automatic and manual front and rear temperature controls that operate the HVAC systems; cluster ion generators; and cooling modules, such as radiators, condensers, fans, and shrouds. Further, it is involved in the development, technology consultation, import, and export of auto parts. The company was formerly known as Halla Visteon Climate Control Corporation and changed its name to Hanon Systems in August 2015. Hanon Systems was founded in 1986 and is headquartered in Daejeon, South Korea. Hanon Systems operates as a subsidiary of Hahn & Co. Auto Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Daejeon"
    },
    "020000.KS": {
        "short_name": "Handsome",
        "long_name": "HANDSOME Corp.",
        "summary": "HANDSOME Corp. operates as a fashion retail company in South Korea and internationally. The company offers T-shirts, blouses, shirts, knits, pants, skirts, and dresses for women; T-shirts, shirts, knits, pants, and suits for men; and top and bottom clothing products for kids. It also provides jackets, jumpers, trench coats, cardigans/vests, coats, and down jumpers; and bags, shoes, hats, jewelry, scarfs/mufflers, socks, ties, and others. In addition, the company offers lifestyle products, including fabrics, fragrances, and other accessories; skincare products and other accessories; dishes, boards/trays, cutleries, coffee/tea products, fabrics/napkins, and other accessories; stationary products, books, and other accessories; and fashion products and other accessories for pets. The company manufactures and retails fashion brands, such as TIME, MINE, SYSTEM, SJSJ, DECKE, the CASHMERE, LATT BY T, OBZEE, O'2nd, 2nd floor, SJYP, Rouge & Lounge, TIME homme, and SYSTEM homme; and distributes imported luxury fashion brands, including LANVIN, BALLY, CALVIN KLEIN, DKNY, CANALI, CLUB MONACO, TOMMY HILFIGER, TOMMY JEANS, AMERICAN EAGLE OUTFITTERS, etc. Further, it operates multi-brand concept stores under the MUE, TOM GREYHOUND, and FOURM names. The company was founded in 1987 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "021240.KS": {
        "short_name": "COWAY",
        "long_name": "COWAY Co., Ltd.",
        "summary": "Coway Co., Ltd. operates in the home wellness appliances industry in South Korea, the United States, Malaysia, China, Thailand, Indonesia, and Vietnam. It provides air purifiers, water purifiers, bidets, juicers, water softeners, and other home wellness appliances; and Internet of Things products and services to care for people's lives in a fundamental manner. The company is also involved in the provision of mattress rental and air conditioner disinfection cleaning services; and automatic matching services. In addition, it offers anti-aging cosmetics under the Re:NK brand; fermented oriental herbal cosmetics under the Allvit brand; and functional healthy food under the Healthygru: brand. Further, the company provides water and sewage treatment, sewage and wastewater reuse, industrial water purification, and industrial wastewater treatment services; and rents water purifiers, bidets, etc. Coway Co., Ltd. was founded in 1989 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "023530.KS": {
        "short_name": "LOTTE SHOPPING",
        "long_name": "Lotte Shopping Co., Ltd.",
        "summary": "Lotte Shopping Co., Ltd. engages in the retail operations through department stores, outlet stores, discount stores, supermarkets, health and beauty stores, specialty stores, home shopping, online malls, and convenience stores channels. The company also operates a chain of multiplex movie theaters under the Lotte Cinema brand name and engages in film production and distribution activities under the Lotte Cultureworks. In addition, it is involved in retailing of consumer electronics, e-commerce, and TV home shopping. The company was formerly known as Hyupwoo Industrial Co., Ltd. and changed its name to Lotte Shopping Co., Ltd. in November 1979. Lotte Shopping Co., Ltd. was founded in 1970 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "023800.KS": {
        "short_name": "Inzi",
        "long_name": "INZI Controls Co.,Ltd.",
        "summary": "INZI Controls Co.,Ltd. provides automobile parts in South Korea and internationally. The company offers thermal management system parts, including coolant control valves, thermostats, thermostat housing assemblies, electric thermostats, bypass valves, and coolant temperature sensors; and xEV parts, such as battery cases, FCEV coolant temperature sensors, and battery thermal management parts. It also provides engineering plastic parts, including cylinder head covers, air cleaners, air intake manifolds, and valve body covers. In addition, the company offers knock sensors, temperature sensors, pressure relief valves, solenoid valves, vacuum actuators, fuel pressure regulators, oil pressure switches, and solenoid valve integrated vacuum actuators, as well as turbocharger actuators and oil filters. INZI Controls Co.,Ltd. was founded in 1978 and is headquartered in Siheung-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Siheung-Si"
    },
    "023810.KS": {
        "short_name": "INFAC",
        "long_name": "INFAC Corporation",
        "summary": "INFAC Corporation manufactures and sells auto parts in South Korea and internationally. The company offers control cables, such as hood latch release, automatic and manual transmission shift, parking brake, accelerator, fuel filler, shift lock, key interlock, and manual park release cables, as well as flexible shafts for power seats; battery cables, including wiring harness products; and ignition cables comprising high tension and spark plug cables. It also provides actuators consisting of motor, hydraulic/pneumatic, and solenoid actuators; smart key system, active, and passive antennas; feeder cable assembly products comprising high frequency and AVN feeder cables; and shell, disk, and air horns, as well as parts for electric vehicles and hybrid electric vehicles. The company was formerly known as Samyeong Cable Co., Ltd. and changed its name to INFAC Corporation in 2004. INFAC Corporation was founded in 1969 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "024900.KS": {
        "short_name": "DuckYangInd",
        "long_name": "Duckyang Ind. Co., Ltd.",
        "summary": "Duckyang Ind. Co., Ltd. manufactures and sells automotive parts in Korea. Its products include cockpit module subcomponents, instrument panel assembly parts, door trims, battery module assembly products, energy storage systems, carriers, interior and exterior parts, consoles, etc. The company was founded in 1977 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ulsan"
    },
    "025620.KS": {
        "short_name": "Jayjun Cosmetic",
        "long_name": "Jayjun Cosmetic Co., Ltd.",
        "summary": "Jayjun Cosmetic Co., Ltd. manufactures and sells various cosmetic products in South Korea. The company offers facial care products, including mask pack, eigel patch, skincare, cleansing, and suncare products; makeup; collagen jelly and other relates products; skin cells, moisture moisturizing, whitening brightening, and sensitive calm moisture care products; nutritional elasticity and anti-aging nutritional care products; and trouble and UV protection care products. It serves its products in China, the Southeast Asia, the Americas, and Europe. The company was formerly known as Jayjun Co., Ltd. and changed its name to Jayjun Cosmetic Co., Ltd. Jayjun Cosmetic Co., Ltd. was founded in 1972 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    },
    "025750.KS": {
        "short_name": "HomeDeco",
        "long_name": "Hansol Homedeco Co., Ltd.",
        "summary": "Hansol Homedeco Co., Ltd. manufactures and distributes furniture components, interior materials, and other products in South Korea. The company offers furniture components, such as medium density fiberboards, low pressure melamine products, PET boards, furniture doors, SB floors, steel floors, reinforced floors, flooring products, door molding materials, wall materials, and sheet materials. It also engages in the plantation business; production of steam energy using renewable energy; and provision of lumber products and saw dust. The company was formerly known as Jeonju Imsan Co., Ltd. and changed its name to Hansol Homedeco Co., Ltd. in January 2003. Hansol Homedeco Co., Ltd. was incorporated in 1991 and is headquartered in Seoul, South Korea with additional office locations in Yeongnam, Daegu, and Honam. It has a factory location in Iksan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "031430.KS": {
        "short_name": "SHINSEGAE INTERNATIONAL",
        "long_name": "Shinsegae International Co., Ltd.",
        "summary": "Shinsegae International Co., Ltd. operates as a fashion retailer in South Korea. It offers fashion, beauty, and lifestyle brands. The company also designs, manufactures, and distributes fashion, beauty, and living products. It operates through a network of approximately 860 stores. The company was founded in 1979 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Retail",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "033250.KS": {
        "short_name": "CHASYS",
        "long_name": "CHASYS Co., Ltd.",
        "summary": "CHASYS Co., Ltd. manufactures and sells automotive chassis systems and rear axles in South Korea and internationally. Its products include front suspension systems, such as sub frames, and center members and impact beams; rear suspension systems, including modules, axles, and crossmembers; arms/links; trailer hitches; and other products. The company was formerly known as Samlip Precision Co., Ltd. and changed its name to CHASYS Co., Ltd. in December 2002. CHASYS Co., Ltd. was founded in 1989 and is based in Gyeongsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gyeongsan"
    },
    "033530.KS": {
        "short_name": "SEJONG",
        "long_name": "Sejong Industrial Co., Ltd.",
        "summary": "Sejong Industrial Co., Ltd. engages in the research and development, production, and supply of automotive parts in South Korea and internationally. The company offers exhaust systems, including exhaust manifold, catalytic converter, selective catalytic reduction (SCR), sub resonator, and main resonator products for passenger and commercial vehicles. It also provides electronic devices, such as hydrogen sensor, pressure sensor, pressure relief valve-H2, and water trap components of driving devices for hydrogen fuel cell vehicles; electromechanical parts and functions modules related to the exhaust systems comprising nitrogen oxide sensors, temperature sensors, differential pressure sensors, oxygen sensors, particulate matter sensors, and urea-SCR systems; and wheel speed sensors. In addition, the company develops green energy products, such as portable fuel cell system, which uses hydrogen energy; and power generator that changes liquefied petroleum gas into hydrogen gas and converts it into electricity. Sejong Industrial Co., Ltd. was founded in 1976 and is based in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ulsan"
    },
    "035150.KS": {
        "short_name": "Baiksan",
        "long_name": "BAIKSAN Co,. Ltd",
        "summary": "BAIKSAN Co,. Ltd engages in the production, manufacture, and sale of artificial and synthetic leather in South Korea. Its products are used in shoes, clothing, bags, balls, sports products, cases for electronics, furniture, interior materials of automobiles, and other goods. The company was formerly known as Baiksan Hwasugn Co., Ltd. and changed its name to BAIKSAN Co,. Ltd in April 1998. The company was founded in 1984 and is headquartered in Siheung-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Siheung-Si"
    },
    "035250.KS": {
        "short_name": "Kangwonland",
        "long_name": "Kangwon Land, Inc.",
        "summary": "Kangwon Land, Inc. engages in the casino, tourist hotel, and ski resorts businesses in South Korea. Its business also covers condominium, golf course, and a water park. The company operates the Kangwon Land Casino with 200 game tables, 1,360 slot machines, and video games. It also operates the Kangwonland Hotel, Convention Hotel, High1 Hotel, Mountain Condominium, Valley Condominium, and Hill Condo; High1 Ski Resort; High1 CC public golf course; and a gambling addiction care center, as well as High1 sports teams. Kangwon Land, Inc. was founded in 1998 and is based in Jeongseon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Jeongseon"
    },
    "037710.KS": {
        "short_name": "Gwangju Shinsegae",
        "long_name": "Gwangju Shinsegae Co., Ltd.",
        "summary": "Gwangju Shinsegae Co., Ltd. operates department stores under the E-Mart name in South Korea. The company was formerly known as Gwangju Shinsegae Department Co., Ltd. and changed its name to Gwangju Shinsegae Co., Ltd. in 2006. Gwangju Shinsegae Co., Ltd. was founded in 1995 and is based in Gwangju, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gwangju"
    },
    "039130.KS": {
        "short_name": "HANATOUR SERVICE",
        "long_name": "Hanatour Service Inc.",
        "summary": "Hanatour Service Inc. provides travel and related services in South Korea, Northeast and Southeast Asia, the United States, and Europe. The company offers individual travel, honeymoon, cruise lines, leisure sports, education/business, and golf travel packages. It also distribution of travel information and providing information to customers based on travel information through its travel information platform tourtips.com, as well as provides real-time tourism information through Jeju mobile application; and IT services, including information on hotels, network integration systems, airline products, disaster recovery systems, integrated business information systems, and information security management system certification services, as well as Mileage Club membership and communication services through the HanaTour Loyalty System. In addition, the company develops and operates Tour de CafÃ©, a coffeehouse brand that offers specialty coffees, premium teas, and homemade desserts; Tour de Gourmet, a restaurant brand that offers signature dishes from various countries; YOULAM the Grill, a BBQ restaurant that serves meat dishes located in downtown Seoul; and YOULAM, a casual Korean restaurant. Further, it produces and distributes cultural products; operates SM duty free stores in Incheon and Seoul; and plans, invests in, and produces various cultural performances through its tourism service distribution network, as well as through its agencies and partners. The company was formerly known as Kook-Jin travel Agency and changed its name to Hanatour Service Inc. in March 1996. Hanatour Service Inc. was founded in 1993 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Travel Services",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "041650.KS": {
        "short_name": "SANGSIN",
        "long_name": "Sangsin Brake Co., Ltd.",
        "summary": "Sangsin Brake Co., Ltd. engages in the manufacture and sale of brakes and other vehicle friction materials in South Korea and internationally. The company offers brake pads, brake linings, brake assemblies, brake shoe assemblies, rail brakes, retarders, tuning parts, yaw brakes, brake discs and drums, and brake parts under the HI-Q, HAGEN, and HARDRON brands. Its products are used in racing and premium cars, passenger and foreign vehicles, taxis, buses, and other commercial vehicles. The company was formerly known as Sangsin Brake Ind. Co., Ltd. and changed its name to Sangsin Brake Co., Ltd. in March 2002. Sangsin Brake Co., Ltd. was founded in 1953 and is headquartered in Daegu, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Daegu"
    },
    "057050.KS": {
        "short_name": "HYUNDAIHOMESHOP",
        "long_name": "Hyundai Home Shopping Network Corporation",
        "summary": "Hyundai Home Shopping Network Corporation operates as an online shopping company in South Korea. It offers clothing and underwear products, shoes, fashion accessories, cosmetics/beauty products, watches, jewel and luxury goods, sport and leisure products, childbirth and infant products, kitchen/life/health products, food, furniture/bedding/construction products, consumer electronics/digital products, hobbies/pets, travel/insurance/rental products, and other miscellaneous goods. The company offers its products through cable, satellite, and IPTV, as well as mobile and Internet shopping channels. The company was founded in 2001 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "060980.KS": {
        "short_name": "HALLA HOLDINGS",
        "long_name": "Halla Holdings Corp.",
        "summary": "Halla Holdings Corp. engages in the automobile, construction, and education/sports businesses in South Korea and internationally. The company offers automobile parts. It also operates a port terminal; a university; an ice hockey club; and a golf club. The company was formerly known as Mando Corporation and changed its name to Halla Holdings Corp. in October 2014. Halla Holdings Corp. was founded in 1962 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "064960.KS": {
        "short_name": "SNT MOTIV",
        "long_name": "SNT Motiv Co., Ltd.",
        "summary": "SNT Motiv Co., Ltd. produces, develops, and sells products for defense and automotive industries in South Korea and internationally. It offers motors, engine/transmission components, electric/electronic products, chassis, airbags, power train parts, shock absorbers, semi conduct machinery components, die castings, and defense products, as well as suspension systems, wheels and tires, and knuckles. The company was formerly known as S&T Motiv Co., Ltd. and changed its name to SNT Motiv Co., Ltd. in February 2021. SNT Motiv Co., Ltd. was founded in 1981 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "067830.KS": {
        "short_name": "SAVEZONEI&C",
        "long_name": "Savezone I&C Corporation",
        "summary": "Savezone I&C Corporation operates fashion discount stores in South Korea. It also operates convenience facilities, such as a cultural and sports centers. The company was formerly known as Uless Co., Ltd. and changed its name to Savezone I&C Corporation in 2004. Savezone I&C Corporation was founded in 2002 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "069640.KS": {
        "short_name": "HANSAEMK",
        "long_name": "Hansaemk Co.,Ltd.",
        "summary": "Hansaemk Co.,Ltd. manufactures and sells women's and men's casual clothes in South Korea and internationally. It sells its products under the PGA TOUR, LPGA, NBA, NBA KIDS, BUCKAROO, TBJ, and ANDEW brands. The company was formerly known as MK Trend Co., Ltd. Hansaemk Co.,Ltd. was founded in 1995 and is headquartered in Seoul, South Korea. Hansaemk Co.,Ltd. is a subsidiary of Hansae Yes24 Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "069960.KS": {
        "short_name": "HYUNDAIDEPTST",
        "long_name": "Hyundai Department Store Co., Ltd.",
        "summary": "Hyundai Department Store Co.,Ltd operates various department stores located in Apgujeong-dong and Cheonho-dong, Gangdong District in South Korea. It also provides real estate agency services. The company was founded in 2002 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Department Stores",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "070960.KS": {
        "short_name": "YP",
        "long_name": "HJ Magnolia Yongpyong Hotel & Resort",
        "summary": "HJ Magnolia Yongpyong Hotel & Resort owns and operates a resort in South Korea. Its facilities include ski, golf, and lodging, as well as rental shops, restaurants, ball rooms, meeting rooms, and leisure sports facilities. The company was founded in 1975 and is based in Pyeongchang-gun, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Resorts & Casinos",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Pyeongchang-gun"
    },
    "071840.KS": {
        "short_name": "LOTTE Himart",
        "long_name": "LOTTE Himart Co.,Ltd.",
        "summary": "LOTTE Himart Co.,Ltd. retails in home appliances in South Korea. Its product categories include TVs, refrigerators, washers and dryers; home, beauty, and health appliances; seasonal appliances; computers; camera, game, and sound products; mobile phone; living and kitchen goods; furniture, and home dÃ©cor and care products; sports fashion and leisure products; office and stationery products; hobby, travel, and pet products; vehicles and tools; books and toys; fashion products; beauty products, such as makeup, perfume, accessories, and healthcare; and food products, comprising of sweets, snacks, water beverages, coffee, milk, instant food, sauce, and health/diet food. The company also offers home care services. It operates 466 LOTTE HIMART stores, as well as online store. LOTTE Himart Co.,Ltd. was formerly known as Hi-mart Co., Ltd. and changed its name to LOTTE Himart Co.,Ltd. in November 2012. The company was founded in 1987 and is headquartered in Seoul, South Korea. LOTTE Himart Co., Ltd. is a subsidiary of Lotte Shopping Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Specialty Retail",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "071950.KS": {
        "short_name": "KOAS",
        "long_name": "KOAS Co., Ltd.",
        "summary": "KOAS Co., Ltd. produces and sells office furniture in South Korea. It offers office, executive, conference, classroom, laboratory, dormitory, library, U.S. army, and hospital furniture; executive, office, multi-use, and public chairs; conference tables; sofas and tables; and interactive whiteboards, as well as student, training center, and amenity furniture. KOAS Co., Ltd. also exports its products to approximately 34 countries. The company was formerly known as Koaswell, Co., Ltd. and changed its name to KOAS Co., Ltd. in 2011. KOAS Co., Ltd. was founded in 1984 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "073240.KS": {
        "short_name": "KUMHOTIRE",
        "long_name": "Kumho Tire Co., Inc.",
        "summary": "Kumho Tire Co., Inc. engages in the manufacture, sale, and export of tires in South Korea and internationally. It provides tires for passenger cars, light trucks and SUV/CUV, buses, and commercial vehicles, as well as original equipment. The company was founded in 1960 and is headquartered in Gwangju, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gwangju"
    },
    "075180.KS": {
        "short_name": "SAC",
        "long_name": "Saeron Automotive Corporation",
        "summary": "Saeron Automotive Corporation manufactures and sells brake pads and linings, and rotor facings. The company was founded in 1999 and is based in Cheonan-si, South Korea. Saeron Automotive Corporation is a subsidiary of Nisshinbo Holdings Inc.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Cheonan-si"
    },
    "079430.KS": {
        "short_name": "HYUNDAILIVART",
        "long_name": "Hyundai Livart Furniture Company Limited",
        "summary": "Hyundai Livart Furniture Company Limited manufactures and sells furniture and wooden products in South Korea and internationally. It operates through five segments: B2C Furniture, Office Furniture, Furniture for Special Sales, B2B, and Others. The company offers cabinets, beds, built-in painted doors, household goods, and finished products; office desks, drawers, bookcases, partitions, etc.; and woodworking, kitchen and general furniture, and wooden windows to construction companies. It distributes and sells eco-friendly boards; and construction materials, packaging materials, uniforms, etc., as well as engages in the construction and commodity brokerage activities. In addition, the company is involved in the wholesale, retail, and sale of general merchandise and corporate clothing. It offers its products through offline stores and online malls, as well as direct sales. The company was formerly known as Livart Furniture Co., Ltd. and changed its name to Hyundai Livart Furniture Company Limited in April 2014. Hyundai Livart Furniture Company Limited was founded in 1977 and is headquartered in Yongin-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yongin-Si"
    },
    "079980.KS": {
        "short_name": "HUVIS",
        "long_name": "Huvis Corporation",
        "summary": "Huvis Corporation develops, manufactures, and sells chemicals and fiber materials in South Korea and internationally. The company offers staple fibers, including spinning, non-woven and non-woven special, and stuffing fibers for use in automobile, furniture, sanitary product, cleaner, filter, non-woven fabric, civil/construction material, clothing, sport wear, premium padding, innerwear, bedding, accessories, and interior applications; and filament yarns, such as apparel, casual sports, interior, and eco products for use in women and men suits, outdoor wear, swimsuits, casual wear, seat covers, beddings, and wet tissues. It also provides regular, homo-PET, and specialty PET resins that are used in filament yarns, staple fibers, various PET bottles, industrial materials, films, sheets, and masterbatches; and Meta Aramid and polyphenylene sulfide super fibers for use in protection garment, safety garment, industrial material, insulation material, automotive heat-resisting material, and industrial filter applications. In addition, the company offers non-woven, high tenacity yarn, spunbond, geogrid, and monofilament industrial materials that are used in various areas comprising industrial, consumer, civil engineering/construction, and sanitary applications. Huvis Corporation was founded in 2000 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "081660.KS": {
        "short_name": "Fila Holdings",
        "long_name": "FILA Holdings Corporation",
        "summary": "FILA Holdings Corporation, together with its subsidiaries, engages in the sale of textile products, clothing, footwear, leather products, watches, cosmetics, golf equipment, and other products in South Korea, the United States, and internationally. It is also involved in the retail and wholesale of apparel and footwear under the FILA brand. In addition, the company manufactures and sells golf products, including golf balls, golf clubs, and golf gears under the Titleist brand; and licenses FILA branded products. It operates approximately 529 stores. The company was formerly known as FILA Korea Ltd. and changed its name to FILA Holdings Corporation in January 2020. FILA Holdings Corporation was founded in 1991 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "084870.KS": {
        "short_name": "TBH GLOBAL",
        "long_name": "TBH Global Co., Ltd",
        "summary": "TBH Global Co., Ltd operates as a fashion company in China, Singapore, Malaysia, Armenia, Mongolia, and Saudi Arabia. The company offers its products under the Basic House, Mind Bridge, The Class, Jucy Judy, Marcbrick, and Spello brand names. It operates 1,800 stores. The company was formerly known as The Basic House Co., Ltd. and changed its name to TBH Global Co., Ltd in April 2016. TBH Global Co., Ltd was founded in 2001 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "088790.KS": {
        "short_name": "JINDO",
        "long_name": "Jindo.Co., Ltd.",
        "summary": "Jindo.Co., Ltd. manufactures, distributes, and sells fashion products in South Korea. It offers fur products under the Jindo Fur, Elfee, Uba, and Cleve brands. The company was formerly known as Jindo F & Co., Ltd. and changed its name to Jindo.Co., Ltd. in 2010. Jindo.Co., Ltd. was founded in 1973 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "089470.KS": {
        "short_name": "HDCHEP",
        "long_name": "HDC Hyundai Engineering Plastics Co., Ltd.",
        "summary": "HDC Hyundai Engineering Plastics Co., Ltd. develops, produces, and supplies various plastic materials in South Korea and internationally. The company offers polypropylene (PP) compound materials for use in producing automotive, interior/exterior materials, electrical and electronics components, water purifiers, etc. It also provides thermoplastic elastomers; cross linkable polyethylene products, such as graftmers and catalyst M/B products; matt compounds consisting of BOPP, IPP, blown films, and blow molding compounds; PE, PP, and EVA based adhesive resins; pipe coating resins; and nylon and EVOH based barrier resins. In addition, the company offers engineering plastics comprising nylon compounds, PET and PBT compounds, PBT/PET alloys, PC/ABS and PC/PBT alloys, PPE/PA and PPE/PS alloys, and PPS compounds; general purpose and high impact polystyrene products, which are used in various areas from household goods to electrical appliances; and expandable polystyrene products that are primarily used for shock absorption or packing materials. Further, it provides construction materials, including polybutylene and polyethylene for raised temperature pipes; pipe connectors, including PB, brass, and water tap connectors; chlorinated polyvinyl chloride pipes and joints; uniform water supply brass BT systems, such as faucet flow control valves; and integrated drainage systems. Additionally, HDC Hyundai Engineering Plastics Co., Ltd. distributes products for use in cold and hot water supply, and heating applications. The company was formerly known as Hyundai Engineering Plastics Co., Ltd. HDC Hyundai Engineering Plastics Co., Ltd. was founded in 1988 and is headquartered in Dangjin, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Dangjin-si"
    },
    "090080.KS": {
        "short_name": "PHC",
        "long_name": "Pyung Hwa Industrial Co., Ltd.",
        "summary": "Pyung Hwa Industrial Co., Ltd. manufactures and sells automotive and general industrial rubber parts in South Korea and internationally. It offers anti-vibration systems, including powertrain mounts, suspension and chassis, advanced products, engine systems, and engine belt systems; products for fuel systems, braking/steering systems, and air and cooling systems; and caterpillar and road wheel rubber products for combat vehicles and specialized rubber. The company was founded in 1950 and is based in Daegu, South Korea. Pyung Hwa Industrial Co., Ltd. is a subsidiary of Pyung Hwa Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Daegu"
    },
    "090370.KS": {
        "short_name": "METALABS",
        "long_name": "Metalabs Co., Ltd.",
        "summary": "Metalabs Co., Ltd. primarily provides clothing in South Korea. It also manufactures and distributes prescription drugs, medical devices, and masks; develops peptide-based bio products; offers medical management services; and distributes cosmetics, as well as operates dating applications. The company was formerly known as Avista Inc. and changed its name to Metalabs Co., Ltd. in April 2018. Metalabs Co., Ltd. was founded in 2000 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "092200.KS": {
        "short_name": "DIC",
        "long_name": "DAE-IL Corporation",
        "summary": "DAE-IL Corporation manufactures and sells powertrain systems for automobiles, motorcycles, and heavy equipment in South Korea and internationally. It offers car transmission and engine gears; trans and drive axles, and transmission and excavator products; and motorcycle transmission and engine products, as well as production and measurement systems. The company also manufactures electric automobiles, motorcycles, and trucks. In addition, it exports its products. DAE-IL Corporation was founded in 1976 and is headquartered in Ulsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ulsan"
    },
    "092780.KS": {
        "short_name": "DONGYANG PISTON",
        "long_name": "Dong Yang Piston Co., Ltd.",
        "summary": "Dong Yang Piston Co., Ltd., together with its subsidiaries, manufactures and sells automotive parts in South Korea and internationally. It offers compact pistons for gasoline, diesel, LPI, and hybrid engines used in passenger cars and SUVs; mid-size pistons for diesel and natural gas engines used in vans, mini buses, compact trucks, and buses; and large-size pistons for gasoline engines used in medium and heavy duty trucks, construction equipment, and generators. The company also provides small pistons for msall gasoline engines used in two-wheelers, including motorcycles; pistons for military vehicles and vessels, as well as agricultural vehicles, such as tractors, combines, etc.; piston pins for automobile engines; diamond cutting tools for piston machining; and ring carriers for gas and diesel engine pistons, as well as cylinder liners for diesel engines. In addition, it implements assembly of various components, such as piston rings, pins, and con rods with pistons. Dong Yang Piston Co., Ltd. was founded in 1967 and is based in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Ansan-Si"
    },
    "093240.KS": {
        "short_name": "HYUNGJI ELITE",
        "long_name": "hyungji Elite Co., Ltd.",
        "summary": "hyungji Elite Co., Ltd. produces and sells school uniforms in Korea. It offers school uniforms under Elite brand name. The company also produces and supplies uniforms for the Samsung Group. In addition, it provides fashion products under the Young Age, Portfolio, Miss & Mister, and Sonobi brands; apparel for women under the RAGELLO brand; shoes under the Esquire brand; and jackets, trousers, jogging sets, and coats. The company was formerly known as Elite Basic Inc. and changed its name to hyungji Elite Co., Ltd. in October 2015. hyungji Elite Co., Ltd. was founded in 1969 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "101140.KS": {
        "short_name": "INBIOGEN",
        "long_name": "INBIOGEN CO.,Ltd",
        "summary": "INBIOGEN CO.Ltd manufactures and sells footwear for children, youth, and adults in South Korea and internationally. The company markets its products under the ARTIS, SPECS, WANGJA, NEOSPEC, and CHAMPION brands. The company was formerly known as BTONE CO.,Ltd. INBIOGEN CO.Ltd was founded in 1949 and is based in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Pyeongtaek-Si"
    },
    "102280.KS": {
        "short_name": "SBW",
        "long_name": "SBW, Inc.",
        "summary": "SBW, Inc. manufactures, distributes, and sells underwear in South Korea. The company offers innerwear under the TRY, CHAVILLE, HEAT UP, COOLUTION, S.MILE, CRIKET, JAMES CASTLER, M:MUR, UBER MAN, and CHIVANT brands. It also ofeers its products online. The company was formerly known as SSANGBANGWOOL&TRYGROUP.Inc and changed its name to SBW, Inc. in 2011. SBW, Inc. was founded in 1954 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "105630.KS": {
        "short_name": "Hansae",
        "long_name": "Hansae Co., Ltd.",
        "summary": "Hansae Co., Ltd. manufactures and sells finished clothing products in Vietnam, Indonesia, Nicaragua, Guatemala, Myanmar, and Haiti. It also exports its products to the United States and other countries. The company was founded in 1982 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "111110.KS": {
        "short_name": "Hojeon",
        "long_name": "Hojeon Limited",
        "summary": "Hojeon Limited, a clothing company, produces and sells garments in South Korea, Indonesia, and Vietnam. It offers woven sportswear, special functional outdoor clothing, and sports team's uniforms. The company was founded in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "111770.KS": {
        "short_name": "Youngone Corp",
        "long_name": "Youngone Corporation",
        "summary": "Youngone Corporation engages in the manufacture and sale of clothing, shoes, bags, sleeping bags, and socks worldwide. The company offers technical apparels, knitwear, and sweaters, as well as casual wears, including outdoor apparels and sportswear; sports shoes, casual shoes, safety shoes, sneakers, winter boots, and fishing shoes; and mountaineering, travel, casual, and business bags, as well as camping supplies. It is also involved in the distribution of lifestyle outdoor products of TAKHI brand. The company was founded in 1974 and is headquartered in Seoul, South Korea. Youngone Corporation is a subsidiary of Youngone Holdings Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Apparel Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "134790.KS": {
        "short_name": "Sidiz",
        "long_name": "Sidiz.Inc.",
        "summary": "Sidiz.Inc. manufactures and sells office furniture in South Korea and internationally. The company offers stools, conference chairs, interior chairs, portable chairs, and accessories. It offers products through stores. The company was formerly known as Teems, Inc. Sidiz.Inc. was founded in 2010 and is headquartered in Eumseong, South Korea. Fursys Inc., Educational Furniture and Education Materials business operates independently of Fursys Inc. as of January 27, 2011.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Furnishings, Fixtures & Appliances",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Eumseong"
    },
    "143210.KS": {
        "short_name": "HANDS CORPORATION",
        "long_name": "Hands Corporation Ltd.",
        "summary": "Hands Corporation Ltd. manufactures and sells aluminum wheels for automobiles in South Korea, the United States, Yurub, Asia, and Africa. The company was formerly known as Donghwa and Co., Ltd. and changed its name to Hands Corporation Ltd. in September 2012. Hands Corporation Ltd. was founded in 1972 and is based in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Incheon"
    },
    "144620.KS": {
        "short_name": "KOLON MATERIALS",
        "long_name": "Kolon Materials, Inc.",
        "summary": "Kolon Materials, Inc. provides textile products worldwide. It offers nylon and polyester yarn products; and fabrics. The company is based in Gwacheon, South Korea. Kolon Materials, Inc. is a subsidiary of Kolon Industries, Inc.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gwacheon"
    },
    "155660.KS": {
        "short_name": "DSR",
        "long_name": "DSR Corp",
        "summary": "DSR Corporation manufactures and sells wires and wire ropes worldwide. It offers fiber ropes, slings/webbings, wire ropes, and wires for various applications, such as mooring, lifting, fishing, oil and gas, mining, leisure, logging, crane, automotive, general use, electronics, construction, agriculture, and consumer goods. The company was founded in 1940 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Busan"
    },
    "161390.KS": {
        "short_name": "HANKOOK TIRE & TECHNOLOGY",
        "long_name": "Hankook Tire & Technology Co., Ltd.",
        "summary": "Hankook Tire & Technology Co., Ltd. manufactures, distributes, and sells tires, tubes, and alloy wheels worldwide. It provides tires for passenger cars, SUVs, light trucks, buses, and trucks, as well as competition tires. The company is also involved in the manufacture and sale of tire molds and injection molds; trading and consulting; facilities management service and backing; and computer printing activities. It provides its products under the Hankook, Laufenn, and Kingstar brands. The company was formerly known as Hankook Tire Co., Ltd. and changed its name to Hankook Tire & Technology Co., Ltd. in May 2019. Hankook Tire Co., Ltd. was founded in 1941 and is headquartered in Seongnam-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "200880.KS": {
        "short_name": "SEOYONEHWA",
        "long_name": "Seoyon E-Hwa Co., Ltd.",
        "summary": "Seoyon E-Hwa Co., Ltd. develops, manufactures, and sells automobile-interior parts in South Korea and internationally. It provides door trims, bumpers, consoles, package trays, pillar trims, screen assys, seats, head linings, rear and covering shelves, and screen assemblies for passenger vehicles, commercial vehicles, heavy equipment, and ships. The company was formerly known as Hanil E-Hwa Co., Ltd. and changed its name to Seoyon E-Hwa Co., Ltd. in January 2016. Seoyon E-Hwa Co., Ltd. was founded in 1972 and is based in Anyang-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Anyang-Si"
    },
    "204320.KS": {
        "short_name": "MANDO",
        "long_name": "Mando Corporation",
        "summary": "Mando Corporation manufactures and sells automobile parts in South Korea and internationally. The company offers braking systems, such as caliper brakes, master cylinder and boosters, drum brakes, electric parking brakes, active hydraulic boost Gen3 products, integrated dynamic brakes, and active retraction calipers, as well as ABS, TCS, and ESC products; steering systems, including steering gear systems, manual steering gears, hydraulic power steering gears, intermediate shafts, steering columns, and electric power steering systems; and suspension systems comprising damper spring modules, shock absorbers, suspension struts, self-levelizers, and semi-active suspension systems. It also provides driver assistance systems consisting of smart cruise control, lane keeping assist, smart parking assist, blind spot detection, and autonomous emergency braking systems; and electronics, such as power packs, Yaw and G sensors, ultrasonic sensors, torque sensors, torque angle sensors, radars, and front camera modules. The company was founded in 1962 and is headquartered in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Pyeongtaek"
    },
    "214330.KS": {
        "short_name": "KUMHO HT",
        "long_name": "Kumho HT, Inc",
        "summary": "Kumho HT, Inc produces and sells automotive bulbs, electrical equipment, and LED PCBA modules in Asian countries, North America, and Europe. The company's S25 bulbs include front and rear turn signal, tail/stop, and back-up lamps, as well as daytime running and rear combination lamps. It also provides head position and fog lamps; wedge bulbs comprise dashboard/door courtesy, position/license, map, room/high mounted stop, and overhead console/backup/rear combination lamps; festoon bulbs comprising map and room/luggage/glove box/sun visor/door courtesy lamps; and halogen bulbs comprising head lights and fog lamps. The company was founded in 1988 and is headquartered in Gwangju, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gwangju"
    },
    "241590.KS": {
        "short_name": "H.S.ENTERPRISE",
        "long_name": "Hwaseung Enterprise Co., Ltd.",
        "summary": "Hwaseung Enterprise Co., Ltd. manufactures and sells shoes for sporting goods. It also purchases and sells natural rubber, synthetic rubber, recycled rubber, and EVA; and pepper and chemical materials, as well as supplies water to shoe manufacturing companies. The company sells its natural rubber to shoes, tires, and adhesive tapes production factories. It exports its products to Korea, Indonesia, and China. The company was founded in 2015 and is based in Seoul, South Korea. Hwaseung Enterprise Co., Ltd. is a subsidiary of Hwaseung Industries Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "272550.KS": {
        "short_name": "SAMYANG PACKAGING",
        "long_name": "Samyang Packaging Corporation",
        "summary": "Samyang Packaging Corporation manufactures and sells PET bottles that are used for various types of food and beverages in South Korea. The company offers heat resistant, heat and pressure resistant, pressure resistant, normal pressure, and miscellaneous bottles for use as PET bottles of beverages, such as fruit drinks, sports drinks, and coffee. It is also involved in the production and supply of various preforms; PET recycling activities; and aseptic filling business under the Asepsys name. The company is headquartered in Seoul, South Korea. Samyang Packaging Corporation is a subsidiary of Samyang Corporation.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "298020.KS": {
        "short_name": "HYOSUNG TNC",
        "long_name": "Hyosung TNC Corporation",
        "summary": "Hyosung TNC Corporation manufactures fiber in South Korea and internationally. It offers spandex for the textile industry under the creora brand name; nylon textile filaments, such as micro-fine denier yarn, nylon polyester yarn, bonding yarn, high tenacity yarn, hollow yarn, cool touch yarn, high luster yarn, and far-infrared yarn, as well as recyclable nylon; and polyester fibers, including cotton-replicating polyester yarn, cool touch yarn, odor-resistant yarn, heat generating yarn, latent crimped yarn, far-infrared yarn, and recycled polyester fiber. The company also provides general apparel, workwear, and industrial fabrics; and dyed products comprising nylon 2-way spandex, polyester 2-way spandex, multiple microdenier fiber, cotton union cloth, and polyester fabrics. In addition, it offers marketing services in the trading sector with steel, chemicals, and LED markets. Further, the company operates a cold/frozen storage warehouse in the Seoul Metropolitan Area. Hyosung TNC Corporation was founded in 1957 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "308170.KS": {
        "short_name": "CENTRAL MOTEK",
        "long_name": "CENTRAL MOTEK Co.Ltd.",
        "summary": "CENTRAL MOTEK Co.Ltd. manufactures and sells automotive parts. The company offers axle assembly, aluminum forging, steering, suspension, engine, front and rear brake axle module, power train, and transmission parts. It markets its products in Asia, North America, Europe, and Australia. CENTRAL MOTEK Co.Ltd. was founded in 1971 and is headquartered in Gimhae, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Gimhae"
    },
    "339770.KS": {
        "short_name": "KYOCHON F&B",
        "long_name": "Kyochon Food&Beverage Co., Ltd.",
        "summary": "Kyochon Food&Beverage Co., Ltd. operates restaurants in South Korea and internationally. The company offers fried chicken. It operates 29 branches and 1,198 franchises. The company was founded in 1991 and is headquartered in Osan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Restaurants",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Osan-si"
    },
    "378850.KS": {
        "short_name": "HS R&A",
        "long_name": "Hwaseung R&A Co., Ltd.",
        "summary": "Hwaseung R&A Co., Ltd. primarily produces and sells automobile parts worldwide. The company offers weather strip products, including front and rear glass molding products, hood weather strips, sun roof weather strips, glass run products, fixed weather strips, door opening weather strips, door seal and door drip weather strips, trunk lids, and inner and outer door belts. It also provides air conditioning, power steering return, fuel, radiator, brake vacuum, heater, fuel filler, power steering pressure, hydraulic brake, and intercooler hoses. Hwaseung R&A Co., Ltd. is based in Yangsan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Yangsan"
    },
    "788.F": {
        "short_name": "COUPANG INC.CL.A DL-,0001",
        "long_name": "Coupang, Inc.",
        "summary": "Coupang, Inc. owns and operates in e-commerce business through its mobile applications and Internet websites primarily in South Korea. It sells various products and services in the categories of home goods and dÃ©cor products, apparel, beauty products, fresh food and groceries, sporting goods, electronics, and everyday consumables, as well as travel, and restaurant order and delivery services. The company was founded in 2010 and is based in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "CPNG": {
        "short_name": "Coupang, Inc.",
        "long_name": "Coupang, Inc.",
        "summary": "Coupang, Inc. owns and operates in e-commerce business through its mobile applications and Internet websites primarily in South Korea. It sells various products and services in the categories of home goods and dÃ©cor products, apparel, beauty products, fresh food and groceries, sporting goods, electronics, and everyday consumables, as well as travel, and restaurant order and delivery services. The company was founded in 2010 and is based in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Internet Retail",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "HYMTF": {
        "short_name": "HYUNDAI MOTOR CO",
        "long_name": "Hyundai Motor Company",
        "summary": "Hyundai Motor Company, together with its subsidiaries, manufactures and distributes motor vehicles and parts. It operates through Vehicle, Finance, and Others segments. The company offers cars under the Azera, Sonata, Veloster, Veloster N, i30 Fastback N, i30 N, i30, Elantra, Accent, i20, and i10 names; and SUVs under the Palisade, Santa Fe, Tucson, Creta, Kona, and Venue names. It also provides commercial vehicles under the H-1 and H-100 names; and eco vehicles under the IONIQ 5, NEXO, Santa Fe Hybrid/Plug-in Hybrid, Tucson Hybrid, KONA Electric, Elantra Hybrid, IONIQ Plug-in Hybrid, IONIQ Electric, IONIQ Electric, and i30 Hybrid names. In addition, the company offers trucks, buses, vans, and engines; vehicle financing, credit card processing, marketing, engineering, mobility, and insurance services; and train manufacturing services, as well as operates a football club. Further, it is involved in real estate development; research and development; and investment activities. The company was incorporated in 1967 and is headquartered in Seoul, South Korea.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "HYU.F": {
        "short_name": "HYUNDAI MOT.0,5N.VTG GDRS",
        "long_name": "Hyundai Motor Company",
        "summary": "Hyundai Motor Company, together with its subsidiaries, manufactures and distributes motor vehicles and parts. It operates through Vehicle, Finance, and Others segments. The company offers cars under the Azera, Sonata, Veloster, Veloster N, i30 Fastback N, i30 N, i30, Elantra, Accent, i20, and i10 names; and SUVs under the Palisade, Santa Fe, Tucson, Creta, Kona, and Venue names. It also provides commercial vehicles under the H-1 and H-100 names; and eco vehicles under the IONIQ 5, NEXO, Santa Fe Hybrid/Plug-in Hybrid, Tucson Hybrid, KONA Electric, Elantra Hybrid, IONIQ Plug-in Hybrid, IONIQ Electric, IONIQ Electric, and i30 Hybrid names. In addition, the company offers trucks, buses, vans, and engines; vehicle financing, credit card processing, marketing, engineering, mobility, and insurance services; and train manufacturing services, as well as operates a football club. Further, it is involved in real estate development; research and development; and investment activities. The company was incorporated in 1967 and is headquartered in Seoul, South Korea.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Auto Manufacturers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "South Korea",
        "city": "Seoul"
    }
}