{
    "002170.KS": {
        "short_name": "SamyangTongsang",
        "long_name": "Samyang Tongsang Co., Ltd",
        "summary": "Samyang Tongsang Co., Ltd produces and sells leather products in South Korea. The company offers leather for handbags, footwear products, car seats, and baseball gloves; and baseball gloves and American footballs. It is also involved in real estate leasing activities. The company was founded in 1957 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.samyangts.com",
        "market_cap": "Micro Cap"
    },
    "025620.KS": {
        "short_name": "Jayjun Cosmetic",
        "long_name": "Jayjun Cosmetic Co., Ltd.",
        "summary": "Jayjun Cosmetic Co., Ltd. manufactures and sells various cosmetic products in South Korea. The company offers facial care products, including mask pack, eigel patch, skincare, cleansing, and suncare products; makeup; collagen jelly and other relates products; skin cells, moisture moisturizing, whitening brightening, and sensitive calm moisture care products; nutritional elasticity and anti-aging nutritional care products; and trouble and UV protection care products. It serves its products in China, the Southeast Asia, the Americas, and Europe. The company was formerly known as Jayjun Co., Ltd. and changed its name to Jayjun Cosmetic Co., Ltd. Jayjun Cosmetic Co., Ltd. was founded in 1972 and is headquartered in Incheon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Incheon",
        "zipcode": null,
        "website": "http://www.jayjun.co.kr",
        "market_cap": "Micro Cap"
    },
    "035150.KS": {
        "short_name": "Baiksan",
        "long_name": "BAIKSAN Co,. Ltd",
        "summary": "BAIKSAN Co,. Ltd engages in the production, manufacture, and sale of artificial and synthetic leather in South Korea. Its products are used in shoes, clothing, bags, balls, sports products, cases for electronics, furniture, interior materials of automobiles, and other goods. The company was formerly known as Baiksan Hwasugn Co., Ltd. and changed its name to BAIKSAN Co,. Ltd in April 1998. The company was founded in 1984 and is headquartered in Siheung-si, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Siheung-Si",
        "zipcode": null,
        "website": "http://www.baiksan.co.kr",
        "market_cap": "Micro Cap"
    },
    "081660.KS": {
        "short_name": "Fila Holdings",
        "long_name": "FILA Holdings Corporation",
        "summary": "FILA Holdings Corporation, together with its subsidiaries, engages in the sale of textile products, clothing, footwear, leather products, watches, cosmetics, golf equipment, and other products in South Korea, the United States, and internationally. It is also involved in the retail and wholesale of apparel and footwear under the FILA brand. In addition, the company manufactures and sells golf products, including golf balls, golf clubs, and golf gears under the Titleist brand; and licenses FILA branded products. It operates approximately 529 stores. The company was formerly known as FILA Korea Ltd. and changed its name to FILA Holdings Corporation in January 2020. FILA Holdings Corporation was founded in 1991 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.filaholdings.com",
        "market_cap": "Mid Cap"
    },
    "101140.KS": {
        "short_name": "INBIOGEN",
        "long_name": "INBIOGEN CO.,Ltd",
        "summary": "INBIOGEN CO.Ltd manufactures and sells footwear for children, youth, and adults in South Korea and internationally. The company markets its products under the ARTIS, SPECS, WANGJA, NEOSPEC, and CHAMPION brands. The company was formerly known as BTONE CO.,Ltd. INBIOGEN CO.Ltd was founded in 1949 and is based in Pyeongtaek, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Pyeongtaek-Si",
        "zipcode": "17908",
        "website": "http://www.inbiogen.co.kr",
        "market_cap": "Micro Cap"
    },
    "241590.KS": {
        "short_name": "H.S.ENTERPRISE",
        "long_name": "Hwaseung Enterprise Co., Ltd.",
        "summary": "Hwaseung Enterprise Co., Ltd. manufactures and sells shoes for sporting goods. It also purchases and sells natural rubber, synthetic rubber, recycled rubber, and EVA; and pepper and chemical materials, as well as supplies water to shoe manufacturing companies. The company sells its natural rubber to shoes, tires, and adhesive tapes production factories. It exports its products to Korea, Indonesia, and China. The company was founded in 2015 and is based in Seoul, South Korea. Hwaseung Enterprise Co., Ltd. is a subsidiary of Hwaseung Industries Co., Ltd.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Footwear & Accessories",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hsenterprise.co.kr",
        "market_cap": "Small Cap"
    }
}