{
  "005360.KS": {
    "city": "Yongin-Si",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Retail",
    "long_name": "Monami Co., Ltd.",
    "market": "kr_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "Monami",
    "state": null,
    "summary": "Monami Co., Ltd. manufactures and sells stationery products in South Korea and internationally. The company offers pens, pencil, markers, highlighters, and artist's materials, as well as miscellaneous, such as eraser, glue stick, white clean, correction tape, and white board cleaner. Monami Co., Ltd. was founded in 1960 and is headquartered in Yongin-Si, South Korea.",
    "website": "http://www.monami.com",
    "zipcode": null
  },
  "071840.KS": {
    "city": "Seoul",
    "country": "South Korea",
    "currency": "KRW",
    "exchange": "KSC",
    "industry": "Specialty Retail",
    "long_name": "LOTTE Himart Co.,Ltd.",
    "market": "kr_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "LOTTE Himart",
    "state": null,
    "summary": "LOTTE Himart Co.,Ltd. retails in home appliances in South Korea. Its product categories include TVs, refrigerators, washers and dryers; home, beauty, and health appliances; seasonal appliances; computers; camera, game, and sound products; mobile phone; living and kitchen goods; furniture, and home décor and care products; sports fashion and leisure products; office and stationery products; hobby, travel, and pet products; vehicles and tools; books and toys; fashion products; beauty products, such as makeup, perfume, accessories, and healthcare; and food products, comprising of sweets, snacks, water beverages, coffee, milk, instant food, sauce, and health/diet food. The company also offers home care services. It operates 466 LOTTE HIMART stores, as well as online store. LOTTE Himart Co.,Ltd. was formerly known as Hi-mart Co., Ltd. and changed its name to LOTTE Himart Co.,Ltd. in November 2012. The company was founded in 1987 and is headquartered in Seoul, South Korea. LOTTE Himart Co., Ltd. is a subsidiary of Lotte Shopping Co., Ltd.",
    "website": "http://www.e-himart.co.kr",
    "zipcode": null
  }
}
