{
    "000050.KS": {
        "short_name": "Kyungbang",
        "long_name": "Kyungbang Co.,Ltd",
        "summary": "Kyungbang Co., Ltd. engages in textile spinning and real estate development businesses in South Korea. Its products include cotton, nylon spun, rayon blend, wool blend, polyester blend, acrylics blend, and Tencel blend yarns for general clothing and bedding applications; and mercerized yarn and other fabrics for use in golf wear, casuals, sweaters, socks, etc. The company's real estate development activities comprise development and operation of shopping malls, department stores, and hotels. Kyungbang Co., Ltd. was founded in 1919 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.kyungbang.co.kr",
        "market_cap": "Large Cap"
    },
    "000950.KS": {
        "short_name": "Chonbang",
        "long_name": "Chonbang Co., Ltd.",
        "summary": "Chonbang Co., Ltd. manufactures and sells textiles in South Korea. The company offers yarns, dyed yarns, embroidery and sewing threads, fabrics, knit products, and raw materials under the Morethan Premium, Hempia, Silroyal, Royal, Cleaniber, and Newstar brands. It also manufactures film condensers; sells and distributes used cars; and provides outbound travelling and golf membership services. The company was formerly known as Chonnam Spinning Co., Ltd and changed its name to Chonbang Co., Ltd. in 1970. Chonbang Co., Ltd. was founded in 1935 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "120-013",
        "website": "http://www.chonbang.co.kr",
        "market_cap": "Large Cap"
    },
    "001070.KS": {
        "short_name": "TaihanTextl",
        "long_name": "Taihan Textile Co., Ltd.",
        "summary": "Taihan Textile Co., Ltd. produces and supplies textile products in South Korea and internationally. The company offers various apparel products, including shirts/blouses, jackets/pants, underwear products, etc.; bedding products, such as blankets, pillows, etc.; military and police uniforms, and working clothes; and gear products. It also provides woven and knit fabrics; cupra and cellulose fibers; and yarns comprising special, melange, cotton, MVS, slub, and fancy yarns. The company was founded in 1953 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.thtc.co.kr",
        "market_cap": "Large Cap"
    },
    "003200.KS": {
        "short_name": "IlshinSpng",
        "long_name": "Ilshin Spinning Co., Ltd",
        "summary": "Ilshin Spinning Co., Ltd produces and sells yarns and fabrics in South Korea. The company offers combed cotton, compact, slub, patched, tri-blended, blended and synthetic, and OE glove yarns under the THREESTAR brand; melange yarns under the MELANSTAR brand; and MVS yarns under the IVYSTAR brand. It also provides fabrics, including cotton, rayon, mixed, and interwoven fabrics, as well as offers dyed yarns and fabrics. The company was founded in 1951 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07237",
        "website": "http://www.ilshin.co.kr",
        "market_cap": "Large Cap"
    },
    "003610.KS": {
        "short_name": "Pangrim",
        "long_name": "Pangrim Co., Ltd.",
        "summary": "Pangrim Co., Ltd. manufactures and sells textile products in South Korea and internationally. It produces a range of fabrics. The company was formerly known as PangRim Textile Co., Ltd. and changed its name to Pangrim Co., Ltd. in 1991. Pangrim Co., Ltd. was founded in 1963 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.pangrim.com",
        "market_cap": "Large Cap"
    },
    "003830.KS": {
        "short_name": "DaehanSynthFibr",
        "long_name": "Daehan Synthetic Fiber Co., Ltd.",
        "summary": "Daehan Synthetic Fiber Co., Ltd. manufactures and sells polyester yarns in Korea and internationally. The company offers specialty and regular polyester yarns. It sells its polyester products under the Acepora brand. Daehan Synthetic Fiber Co., Ltd. was founded in 1963 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "100-852",
        "website": "http://www.daehansf.co.kr",
        "market_cap": "Large Cap"
    },
    "004830.KS": {
        "short_name": "Duksung",
        "long_name": "Duksung Co., Ltd.",
        "summary": "Duksung Co., Ltd. produces and sells synthetic leathers in South Korea. It offers artificial leathers, synthetic resins, materials for cosmetics, polishing pads, textiles, wet dressing products, and intermediate organic material products for OLEDs. The company was formerly known as Duksung Chemical Industry Co. and changed its name to Duksung Co., Ltd. in March 2000. Duksung Co., Ltd. was founded in 1966 and is headquartered in Suwon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "16677",
        "website": "http://www.duksung21.com",
        "market_cap": "Large Cap"
    },
    "004835.KS": {
        "short_name": "Duksung(1P)",
        "long_name": "Duksung Co., Ltd.",
        "summary": "Duksung Co., Ltd. produces and sells synthetic leathers in South Korea. It offers artificial leathers, synthetic resins, materials for cosmetics, polishing pads, textiles, wet dressing products, and intermediate organic material products for OLEDs. The company was formerly known as Duksung Chemical Industry Co. and changed its name to Duksung Co., Ltd. in March 2000. Duksung Co., Ltd. was founded in 1966 and is headquartered in Suwon, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Suwon-si",
        "zipcode": "16677",
        "website": "http://www.duksung21.com",
        "market_cap": "Large Cap"
    },
    "008500.KS": {
        "short_name": "IljeongInd",
        "long_name": "Iljeong Industrial Co.,Ltd",
        "summary": "Iljeong Industrial Co.Ltd. provides car seat fabrics to automobile makers in Korea. Its moquette, tricot, woven, plush jacquard, jersey, single knit, and headliner fabrics are used in car seat fabrics, head linings, door trims, arms rests, and sun visors. The company also provides upholstery fabrics that are used in sofas and chairs in hotel and homes. Iljeong Industrial Co.Ltd. was founded in 1973 and is headquartered in Ansan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Ansan-Si",
        "zipcode": "425-866",
        "website": "http://www.iljeong.co.kr",
        "market_cap": "Large Cap"
    },
    "010600.KS": {
        "short_name": "WELLBIOTEC",
        "long_name": "Wellbiotec Co., Ltd.",
        "summary": "Wellbiotec Co., Ltd. produces and sells leather products in South Korea and internationally. The company provides leather products for shoes, bags, car seats, and handle covers. It also offers logistics consulting, container, warehouse/clearance, and transportation agency services; product research and development, consulting, distribution, and sales; and general and specialized medicines, health functional products, diagnosis kits, cosmeceuticals, and other products. In addition, the company is involved in casting agency, celebrity development, content production, and multi-channel network; and food and beverages businesses. The company was founded in 1975 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "06170",
        "website": "http://www.wellbiotec.com",
        "market_cap": "Large Cap"
    },
    "011300.KS": {
        "short_name": "Seongan",
        "long_name": "SEONGAN CO., Ltd.",
        "summary": "SEONGAN CO., Ltd., a textile company, manufactures, exports, and sells fabric related products in Korea and internationally. The company offers dress, blouse, jackets/pants, prints and specialized, interior woven fabrics; white thobe and uniforms; and tops/dress, and prints and specialized fabrics. It offers its products under STARTEX, Kuntex, and SOFSIL brand names. SEONGAN CO., Ltd. was founded in 1953 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.startex.co.kr",
        "market_cap": "Large Cap"
    },
    "016450.KS": {
        "short_name": "HansaeYes24Holdings",
        "long_name": "Hansae Yes24 Holdings Co., Ltd",
        "summary": "Hansae Yes24 Holdings Co., Ltd., through its subsidiaries, produces and sells fabrics in South Korea and internationally. It offers baby clothes under the Moimoln brand name; operates a kid sports multi play shop; operates an online bookstore; publishes books/textbooks; distributes cultural products, including music, DVD/Blu-ray, and gift products; offers ticket booking services; and provides digital contents, such as Web novels, light novels, and comics. The company was formerly known as Hansae Co. Ltd. and changed its name to Hansae Yes24 Holdings Co., Ltd. in 2009. Hansae Yes24 Holdings Co., Ltd. was founded in 1982 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "07242",
        "website": "http://www.hansaeyes24.com",
        "market_cap": "Large Cap"
    },
    "079980.KS": {
        "short_name": "HUVIS",
        "long_name": "Huvis Corporation",
        "summary": "Huvis Corporation develops, manufactures, and sells chemicals and fiber materials in South Korea and internationally. The company offers staple fibers, including spinning, non-woven and non-woven special, and stuffing fibers for use in automobile, furniture, sanitary product, cleaner, filter, non-woven fabric, civil/construction material, clothing, sport wear, premium padding, innerwear, bedding, accessories, and interior applications; and filament yarns, such as apparel, casual sports, interior, and eco products for use in women and men suits, outdoor wear, swimsuits, casual wear, seat covers, beddings, and wet tissues. It also provides regular, homo-PET, and specialty PET resins that are used in filament yarns, staple fibers, various PET bottles, industrial materials, films, sheets, and masterbatches; and Meta Aramid and polyphenylene sulfide super fibers for use in protection garment, safety garment, industrial material, insulation material, automotive heat-resisting material, and industrial filter applications. In addition, the company offers non-woven, high tenacity yarn, spunbond, geogrid, and monofilament industrial materials that are used in various areas comprising industrial, consumer, civil engineering/construction, and sanitary applications. Huvis Corporation was founded in 2000 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.huvis.com",
        "market_cap": "Large Cap"
    },
    "111110.KS": {
        "short_name": "Hojeon",
        "long_name": "Hojeon Limited",
        "summary": "Hojeon Limited, a clothing company, produces and sells garments in South Korea, Indonesia, and Vietnam. It offers woven sportswear, special functional outdoor clothing, and sports team's uniforms. The company was founded in 1985 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": null,
        "website": "http://www.hojeon.co.kr",
        "market_cap": "Large Cap"
    },
    "144620.KS": {
        "short_name": "KOLON MATERIALS",
        "long_name": "Kolon Materials, Inc.",
        "summary": "Kolon Materials, Inc. provides textile products worldwide. It offers nylon and polyester yarn products; and fabrics. The company is based in Gwacheon, South Korea. Kolon Materials, Inc. is a subsidiary of Kolon Industries, Inc.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Gwacheon",
        "zipcode": null,
        "website": "http://www.kolonmaterials.com",
        "market_cap": "Large Cap"
    },
    "155660.KS": {
        "short_name": "DSR",
        "long_name": "DSR Corp",
        "summary": "DSR Corporation manufactures and sells wires and wire ropes worldwide. It offers fiber ropes, slings/webbings, wire ropes, and wires for various applications, such as mooring, lifting, fishing, oil and gas, mining, leisure, logging, crane, automotive, general use, electronics, construction, agriculture, and consumer goods. The company was founded in 1940 and is headquartered in Busan, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Busan",
        "zipcode": null,
        "website": "http://www.dsrcorp.com",
        "market_cap": "Large Cap"
    },
    "298020.KS": {
        "short_name": "HYOSUNG TNC",
        "long_name": "Hyosung TNC Corporation",
        "summary": "Hyosung TNC Corporation manufactures fiber in South Korea and internationally. It offers spandex for the textile industry under the creora brand name; nylon textile filaments, such as micro-fine denier yarn, nylon polyester yarn, bonding yarn, high tenacity yarn, hollow yarn, cool touch yarn, high luster yarn, and far-infrared yarn, as well as recyclable nylon; and polyester fibers, including cotton-replicating polyester yarn, cool touch yarn, odor-resistant yarn, heat generating yarn, latent crimped yarn, far-infrared yarn, and recycled polyester fiber. The company also provides general apparel, workwear, and industrial fabrics; and dyed products comprising nylon 2-way spandex, polyester 2-way spandex, multiple microdenier fiber, cotton union cloth, and polyester fabrics. In addition, it offers marketing services in the trading sector with steel, chemicals, and LED markets. Further, the company operates a cold/frozen storage warehouse in the Seoul Metropolitan Area. Hyosung TNC Corporation was founded in 1957 and is headquartered in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Consumer Cyclical",
        "industry": "Textile Manufacturing",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "state": null,
        "city": "Seoul",
        "zipcode": "04144",
        "website": "http://www.hyosungtnc.com",
        "market_cap": "Large Cap"
    }
}