{"07K.F": {"short_name": "KRAKATAU STEEL PER.RP 500", "long_name": "PT Krakatau Steel (Persero) Tbk", "summary": "PT Krakatau Steel (Persero) Tbk, together with its subsidiaries, engages in the production and trading of iron and steel products in Indonesia and internationally. It operates through five segments: Steel Products, Real Estate and Hotels, Engineering and Construction, Port Services Provider, and Other Services. The Steel Products segment is primarily involved in production and sale of steel products, such as sponge iron, slabs, billets, hot rolled coils, cold rolled coils, and wire rods; and steel pipes, reinforcing bars, and steel wires, as well as services related to steel, including coating and tolling services. The Real Estate and Hotels segment develops and sells industrial estates with the infrastructure, and hotels and sport facilities. The Engineering and Construction segment is involved in the construction, industrial engineering, planning, and contracting of various types of buildings; export and import of goods; and provision of services and software related to the aforementioned activities. The Port Services Provider segment offers pier services for berthing, loading, and unloading goods and containers; and sea port support, warehousing, and transportation services. The Other Services segment provides information technology, medical, electricity, and water distribution services for industrial and residence needs. It also engages in the production of reinforcing bars, and deformed and plain bars; and coal and mining business. PT Krakatau Steel (Persero) Tbk was founded in 1970 and is headquartered in Cilegon, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Steel", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Cilegon"}, "15B.F": {"short_name": "SEMEN BATURAJA  RP 100", "long_name": "PT Semen Baturaja (Persero) Tbk", "summary": "PT Semen Baturaja (Persero) Tbk produces and distributes cement in Indonesia. The company offers ordinary Portland cement type I, II, and V, as well as Portland composite cement. It also engages in the trading, construction, and land logistics businesses. The company was founded in 1974 and is headquartered in Palembang, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Palembang"}, "878.SG": {"short_name": "Chandra Asri Petrochem.Tbk, PTR", "long_name": "PT. Chandra Asri Petrochemical Tbk", "summary": "PT. Chandra Asri Petrochemical Tbk, together with its subsidiaries, operates as an integrated petrochemical company in Indonesia and internationally. It operates through Olefin, Polyolefin, Styrene Monomer, Butadiene, and Tanks and Jetty Rental segments. The company offers olefins, such as ethylene, propylene, mixed C4, pyrolysis gasoline, and pyrolysis fuel oil. It also provides polyethylene products, including linear low density and high density polyethylene under the Asrene brand name used in films, injection molding, blow molding, pipe, and monofilament, as well as agriculture films, plastic packaging, fishnet, tarpaulin, clean water pipes, jerry cans, cosmetics, and food grade bottles applications; and resin under the Grene brand name for environmental friendly shopping bags, compost bags, disposal bags, bags on roll, etc. In addition, the company offers polypropylene products, which consist of homopolymer, random copolymer, and impact copolymer under Trilene brand name used for use in flexible packaging, household appliances, yarn, non-woven bags, furniture, automotive, and electronic parts. Further, it provides styrene monomer that produces polystyrene, expanded polystyrene, styrene acrylonitrile, acrylonitrile butadiene styrene (ABS), styrene butadiene rubber (SBR), styrene butadiene latex (SBL), and unsaturated polyester resin for use in shoe soles, drinking cups, food containers, automotive and electronic parts, building block toys, and helmets; and butadiene for the production of ABS, SBL, SBR, and polybutadiene rubber used in rubber boots, rubber gloves, shoe soles, adhesives, and sealants. The company also exports its products. PT. Chandra Asri Petrochemical Tbk is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "ADMG.JK": {"short_name": "Polychem Indonesia Tbk", "long_name": "PT. Polychem Indonesia Tbk", "summary": "PT. Polychem Indonesia Tbk engages in the chemical and polyester businesses. The company operates through Polyester and Petrochemical segments. It offers mono ethylene glycol, di ethylene glycol, tri ethylene glycol, and various ethoxylate products; and petrochemicals. It also provides polyester chips, partially oriented yarns, polyester staple fibers, and drawn textured yarns. The company markets its products in Asia, the Middle East, the United States, Canada, Latin America, Europe, and Africa. PT. Polychem Indonesia Tbk was founded in 1978 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "AGII.JK": {"short_name": "Aneka Gas Industri Tbk.", "long_name": "PT Aneka Gas Industri Tbk", "summary": "PT Aneka Gas Industri Tbk produces, markets, and sells industrial gases in Indonesia. The company offers air gases, including oxygen, nitrogen, and argon; fuel gases, such as liquid propane, natural, and liquid petroleum gas; mixed gases comprising compressed natural, environmental calibration, and exhaust emissions engine gases; rare gases consisting of helium, neon, krypton, and xenon; specialty gases, including sulfur hexafluoride, sterilization gas, and ammonia; and synthetic gases, such as hydrogen, acetylene, carbon dioxide, carbon monoxide, nitrous oxide, epoxyethane, and sulfur dioxide. It also provides medical oxygen/respiration gas, medical nitrous oxide gas, medical air gas, medical nitrogen gas, medical CO2, lung function mix gases, calibration gas for blood analysis, laser gas for surgery, and cryopreservation gas. In addition, the company offers medical supply equipment, medical monitoring systems, modular operating theatre products, onsite gas systems, gas handling and cutting equipment, and safety equipment, as well as installation services. Further, it engages in the transportation and storage of low temperature fluids; and provision of low temperature containers for biological specimens, as well as construction, wholesale and retail, gas trading, and car and motorcycle repair and maintenance activities. The company operates approximately 104 filling stations. It serves agriculture and agri, food and beverage, glass, automotive, shipping, spacecraft, aeronautic, mining, oil and gas, machinery and construction, metallurgy, pulp and paper, specialty gas, and electronic and semiconductor industries. PT Aneka Gas Industri Tbk was founded in 1916 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "AKTA.F": {"short_name": "PT ANEKA TAMBANG  RP 100", "long_name": "PT Aneka Tambang Tbk", "summary": "PT Aneka Tambang Tbk operates as a diversified mining and metals company in Indonesia. The company operates through three segments: Nickel, Precious Metals and Refinery, and Bauxite and Alumina. It is involved in the exploration, excavation, processing, and marketing of nickel ore, ferronickel, gold, silver, bauxite, and coal. The company also engages in the construction, trading, industry, agriculture, printing, and ground transportation businesses; manufacture and sale of stainless steel; and provision of industrial area management and heavy equipment rental services. It also exports its products. The company was founded in 1968 and is headquartered in Jakarta, Indonesia. PT Aneka Tambang Tbk is a subsidiary of PT Indonesia Asahan Aluminium (Persero).", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "ALDO.JK": {"short_name": "Alkindo Naratama Tbk.", "long_name": "PT Alkindo Naratama Tbk", "summary": "PT Alkindo Naratama Tbk produces and sells various paper products in Indonesia. It operates through Paper Converting, Chemical, and Polymer segments. The company offers papercore products, such as STD cores for packaging film, stretch, construction film, and paper mill industries; WG cores for PP film, PE film, coated paper, and towel and tissue paper industries; SPC cores to minimize surface markings, and enhance winding and unwinding characteristics; and Prime cores for delicate plastic and metal foils. It also provides POY, FDY, and drawn textured yarn papertubes for use in various machines in textile yarn and synthetic fibers industries; honeycomb pallets and boxes, layers and pads, furniture cores, and textile boards/spacers under the HEXCELL name; and supporting products, including edge, L-shape, and outer and inner diameter protectors. The company was founded in 1989 and is based in Bandung, Indonesia. PT Alkindo Naratama Tbk is a subsidiary of PT Golden Arista International.", "currency": "IDR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bandung"}, "ALKA.JK": {"short_name": "Alakasa Industrindo Tbk", "long_name": "PT Alakasa Industrindo Tbk", "summary": "PT Alakasa Industrindo Tbk, through its subsidiaries, operates in the aluminum industry in Indonesia. The company operates through Aluminium Industry and Trading segments. It engages in the aluminum extrusion activity; and trading of raw materials, including aluminum raw materials. The company also exports its products. PT Alakasa Industrindo Tbk was founded in 1972 and is based in East Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Timur"}, "ALMI.JK": {"short_name": "Alumindo Light Metal Industry T", "long_name": "PT Alumindo Light Metal Industry Tbk", "summary": "PT Alumindo Light Metal Industry Tbk manufactures and sells flat rolled aluminum products in Indonesia, the United States, Asia, Europe, Australia, and Middle East. It offers various aluminum products in the form of sheets, coils, and circles; embossed aluminum products primarily for use as roofing, siding, and surface decorations; and aluminum foils. The company provides its products for various applications, such as air cargo containers, cigarette packaging, condensors and fin stocks, cooking utensils, curtain walls, food containers and gasmats, food packaging, packaging caps, pharmaceutical packaging, reflectors, and trains. PT Alumindo Light Metal Industry Tbk was founded in 1978 and is headquartered in Surabaya, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "ANTM.JK": {"short_name": "Aneka Tambang Tbk.", "long_name": "PT Aneka Tambang Tbk", "summary": "PT Aneka Tambang Tbk operates as a diversified mining and metals company in Indonesia. The company operates through three segments: Nickel, Precious Metals and Refinery, and Bauxite and Alumina. It is involved in the exploration, excavation, processing, and marketing of nickel ore, ferronickel, gold, silver, bauxite, and coal. The company also engages in the construction, trading, industry, agriculture, printing, and ground transportation businesses; manufacture and sale of stainless steel; and provision of industrial area management and heavy equipment rental services. It also exports its products. The company was founded in 1968 and is headquartered in Jakarta, Indonesia. PT Aneka Tambang Tbk is a subsidiary of PT Indonesia Asahan Aluminium (Persero).", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BAJA.JK": {"short_name": "Saranacentral Bajatama Tbk.", "long_name": "PT Saranacentral Bajatama Tbk", "summary": "PT Saranacentral Bajatama Tbk engages in manufacturing and trading of steel products in Indonesia. The company operates through four segments: Galvanized, Saranalume, Colouring, and Non Production. It offers galvanized coated steel, zinc/aluminum coated steel, and painted steel products. The company markets its products under the SARAN brand. Its products are used in various applications, including building and constructions; electrical and machinery; motor vehicles; office and equipment; and others, as well as residential, industrial, and commercial roofing and cladding; and curve roofing. PT Saranacentral Bajatama Tbk was founded in 1993 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Steel", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BISI.JK": {"short_name": "BISI International Tbk.", "long_name": "PT BISI International Tbk", "summary": "PT BISI International Tbk, together with its subsidiaries, produces and sells hybrid seeds for field crops and horticulture plants in Indonesia. It operates through Corn, Vegetable and Fruit, Paddy, Pesticides and Fertilizers, and Others segments. The company offers hybrid corn and paddy seeds; horticulture seeds for vegetables and fruits, such as sweet corn, peppers, cucumbers, bitter gourd, cabbage, seedless, watermelon, tomatoes, broccoli, and cauliflower; and agricultural productivity inputs, which include pesticides, herbicides, fungicides, and fertilizers. It also engages in wholesale trading of fruits, vegetables, paddy and field crops, and seeds. The company was formerly known as PT Benihinti Suburintani and changed its name to PT BISI International Tbk in October 2006. PT BISI International Tbk was founded in 1983 and is headquartered in Sidoarjo, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Agricultural Inputs", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Sidoarjo"}, "BRMS.JK": {"short_name": "Bumi Resources Minerals Tbk.", "long_name": "PT Bumi Resources Minerals Tbk", "summary": "PT Bumi Resources Minerals Tbk, through its subsidiaries, engages in the exploration and development of mineral properties in Asia. It operates through three segments: Investments, Holding Company, and Mining and Services. The company explores for lead, zinc, gold, copper, and iron ore. It also invests in shares, funding, and finance related activities. The company was founded in 2003 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BRPT.JK": {"short_name": "Barito Pacific Tbk.", "long_name": "PT Barito Pacific Tbk", "summary": "PT Barito Pacific Tbk, together with its subsidiaries, produces petrochemicals. It operates through Petrochemical, Wood Manufacturing, Building and Hotel Management, Energy and Resources, and Others segments. The company produces petrochemical products, such as olefins comprising ethylene, propylene, py-gas, and mixed C4; polyolefins, including polyethylene and polypropylene; styrene monomer, a material for manufacturing polystyrene (PS), expanded PS, styrene acrylonitrile, acrylonitrile butadiene styrene, styrene butadiene rubber, styrene butadiene latex, and unsaturated polyester resins; and butadiene, a raw material that is used to make styrene butadiene rubber, acrylonitrile butadiene styrene, and styrene butadiene latex. It also produces geothermal energy with total installed capacity of 875 MW through its operating assets in Wayang Windu, Salak, and Darajat. In addition, the company manages properties; develops industrial and commercial properties, commercial complexes, office spaces, and factory buildings; owns and manages a hotel; and provides storage tank terminal and jetty management services for chemical products. Additionally, it produces glue (adhesive). The company was formerly known as PT Barito Pacific Timber Tbk and changed its name to PT Barito Pacific Tbk in 2007. PT Barito Pacific Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "BTON.JK": {"short_name": "Betonjaya Manunggal Tbk.", "long_name": "PT Betonjaya Manunggal Tbk", "summary": "PT Betonjaya Manunggal Tbk engages in the production and sale of round bars in Indonesia. Its products are primarily used in the construction of buildings. The company was founded in 1995 and is headquartered in Gresik, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Steel", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Gresik"}, "CITA.JK": {"short_name": "Cita Mineral Investindo Tbk.", "long_name": "PT Cita Mineral Investindo Tbk", "summary": "PT Cita Mineral Investindo Tbk engages in bauxite mining activities in Indonesia. It offers smelter grade alumina. The company was formerly known as PT Cipta Panel Utama Tbk and changed its name to PT Cita Mineral Investindo Tbk in May 2007. PT Cita Mineral Investindo Tbk was founded in 1992 and is headquartered in Jakarta, Indonesia. PT Cita Mineral Investindo Tbk is a subsidiary of PT Harita Jayaraya Inc.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "CLPI.JK": {"short_name": "Colorpak Indonesia Tbk.", "long_name": "PT Colorpak Indonesia Tbk", "summary": "PT Colorpak Indonesia Tbk, together with its subsidiaries, manufactures and markets printing inks, coatings, and adhesives in Indonesia. The company operates in five segments: Gravure, Film, Adhesive, Coating, and Plastic Resin. It provides flexible and cigarette packaging inks; environmental friendly inks; and PVC leather coatings. The company trades in films, such as bi-axially oriented polypropylene (BOPP), polyethylene terephthalate (PET) film, NYLON, MPET, Aluminium foil, and special films; and solvent base and solventless adhesives; and plastic resins. In addition, it offers various types of liquid inks, including Uniprint Series, a Polyurethane based ink; Cenote, an Ester and Alcohol based ink for PET and OPP; New Unicom for PET dry and extrusion; New Lamiop for BOPP dry and extrusion; D-Lamiop for OPP dry; Hunter for foil, paper, and paper board; Alpha for printing on PP and PE surfaces; Roto Shrink for sleeves PVC and PET; and Fantasy PP for woven bag PP. PT Colorpak Indonesia Tbk also exports its products to Australia and China. The company was founded in 1988 and is headquartered in Tangerang, Indonesia. PT Colorpak Indonesia Tbk is a subsidiary of Ink Color International Pte. Ltd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Tangerang"}, "CTTH.JK": {"short_name": "Citatah Tbk.", "long_name": "PT Citatah Tbk", "summary": "PT Citatah Tbk manufactures and sells marble and marble handicrafts products in Indonesia. The company operates through Limestone and Imported Building Materials segments. Its products include slabs and tiles. The company also exports its products. PT Citatah Tbk was founded in 1974 and is headquartered in Karawang, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Karawang"}, "DKFT.JK": {"short_name": "Central Omega Resources Tbk.", "long_name": "PT Central Omega Resources Tbk", "summary": "PT Central Omega Resources Tbk, through its subsidiaries, engages in the mining and trading of mineral resources in Indonesia. It explores for nickel and copper ores. The company was formerly known as PT Duta Kirana Finance Tbk and changed its name to PT Central Omega Resources Tbk in 2008. PT Central Omega Resources Tbk was founded in 1995 and is headquartered in Jakarta, Indonesia. PT Central Omega Resources Tbk is a subsidiary of PT Jinsheng Mining.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "DPNS.JK": {"short_name": "Duta Pertiwi Nusantara Tbk.", "long_name": "PT Duta Pertiwi Nusantara Tbk", "summary": "PT Duta Pertiwi Nusantara Tbk engages in the glue, chemical, and mining businesses in Indonesia. It operates through two divisions, Glue Industry and Coal Mining. The company offers urea formaldehyde, phenol formaldehyde, urea melamine formaldehyde, and particle board glues and hardeners; semi-finished products, including formaldehyde; hardeners for producing plywood; and additives, such as emission bonding agents, etc. It is also involved in mining coal. The company was founded in 1982 and is headquartered in Pontianak, Indonesia. PT Duta Pertiwi Nusantara Tbk is a subsidiary of PT Dutapermana Makmur.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Pontianak"}, "EKAD.JK": {"short_name": "Ekadharma International Tbk.", "long_name": "PT Ekadharma International Tbk", "summary": "PT Ekadharma International Tbk, together with its subsidiaries, manufactures and markets self-adhesive tapes in Indonesia and Malaysia. The company offers aluminum foil, anti-slip, cloth, double foam, double side, Kraft, masking, metalizing, OPP, OPP printing, PVC electrical insulation, and stationery tapes; stretch films; epoxy, water, and white glues; and glue sticks under the DAIMARU, SUPERFIX, and EKATAPE brands. It is also involved in the trading of carton sealers and stretch wrappers. The company was formerly known as PT Ekadharma Widya Grafika and changed its name to PT Ekadharma International Tbk in 2006. PT Ekadharma International Tbk was founded in 1981 and is headquartered in Tangerang, Indonesia. PT Ekadharma International Tbk is a subsidiary of PT Ekadharma Inti Perkasa.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Tangerang"}, "FPNI.JK": {"short_name": "Lotte Chemical Titan Tbk.", "long_name": "PT Lotte Chemical Titan Tbk", "summary": "PT Lotte Chemical Titan Tbk, together with its subsidiaries, produces and distributes polyethylene products in Indonesia. It produces high density polyethylene, low density polyethylene, and linear low density polyethylene products; and polypropylene homopolymers, and polypropylene random and impact copolymers, as well as imports BOPP films. The company is also involved in the wholesale trade of polyethylene and polypropylene. The company was formerly known as P.T. Titan Kimia Nusantara Tbk and changed its name to PT Lotte Chemical Titan Tbk in April 2013. PT Lotte Chemical Titan Tbk was founded in 1987 and is headquartered in Jakarta, Indonesia. PT Lotte Chemical Titan Tbk is a subsidiary of Lotte Chemical Titan International Sdn. Bhd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "GDST.JK": {"short_name": "Gunawan Dianjaya Steel Tbk.", "long_name": "PT Gunawan Dianjaya Steel Tbk", "summary": "PT Gunawan Dianjaya Steel Tbk produces and sells hot rolled steel plates in Indonesia. It offers steel plates for general use, such as low carbon structural steel plates and high strength low alloy structural steel plates; steel plates for boilers and pressure vessels; and steel plates for ship building, including mild steels and high tensile steels. The company also exports its products. PT Gunawan Dianjaya Steel Tbk was founded in 1989 and is headquartered in Surabaya, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Steel", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "GGRP.JK": {"short_name": "Gunung Raja Paksi Tbk.", "long_name": "PT Gunung Raja Paksi Tbk", "summary": "PT Gunung Raja Paksi Tbk produces and sells steel products in Indonesia and internationally. The company offers slabs, blooms, beam blanks, and billets; coil plates and derivatives; and steel profiles and derivatives, as well as hot steel coils and steel plates. It serves bridge, building, and other projects. The company was formerly known as PT Gunung Naga Mas and changed its name to PT Gunung Raja Paksi Tbk in 1991. PT Gunung Raja Paksi Tbk was founded in 1990 and is headquartered in Bekasi, Indonesia. PT Gunung Raja Paksi Tbk is a subsidiary of Orientstar Pte. Ltd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Steel", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bekasi"}, "HKMU.JK": {"short_name": "HK Metals Utama Tbk.", "long_name": "PT HK Metals Utama Tbk", "summary": "PT HK Metals Utama Tbk manufactures and trades in building and household materials in Indonesia. It offers stainless steel accessories, aluminum coated steel and coil machineries and spare parts, PVC pipes, light steel products, toilet and sanitary wares, and other household materials. The company was founded in 1995 and is headquartered in Bekasi, Indonesia. PT HK Metals Utama Tbk is a subsidiary of PT Hyamn Sukses Abadi.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bekasi"}, "IFII.JK": {"short_name": "Indonesia Fibreboard Industry T", "long_name": "PT Indonesia Fibreboard Industry Tbk", "summary": "PT Indonesia Fibreboard Industry Tbk manufactures and sells wood products in Indonesia, the Middle East, Japan, Southeast Asia, Korea, China, and Taiwan. Its products include high, medium, and low density fiberboards; high moisture resistance wood products; plywood and plywood medium density fiberboard (MDF) products; MDF laminate paper; and veneer wood products. The company was founded in 2007 and is headquartered in Jakarta Utara, Indonesia. PT Indonesia Fibreboard Industry Tbk is a subsidiary of PT Adrindo Intiperkasa.", "currency": "IDR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Utara"}, "IFSH.JK": {"short_name": "Ifishdeco Tbk.", "long_name": "PT Ifishdeco Tbk", "summary": "PT Ifishdeco Tbk engages in the exploration and development of nickel ore properties. The company was founded in 1971 and is based in Central Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "IKP.F": {"short_name": "PT INDAH KIAT  RP 1000", "long_name": "PT Indah Kiat Pulp & Paper Tbk", "summary": "PT Indah Kiat Pulp & Paper Tbk operates in the paper packaging industry in Indonesia, Asia, North and South America, Australia, Africa, and Europe. The company offers white grade papers, brown grade papers, and carton boxes, as well as offset printing services. The company was founded in 1976 and is based in Serang, Indonesia. PT Indah Kiat Pulp & Paper Tbk is a subsidiary of PT Purinusa Ekapersada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Serang"}, "IMPC.JK": {"short_name": "Impack Pratama Industri Tbk.", "long_name": "PT Impack Pratama Industri Tbk", "summary": "PT Impack Pratama Industri Tbk, together with its subsidiaries, manufactures and distributes building materials and plastic products in Indonesia and internationally. The company provides various roofing products, including polycarbonate, vinyl and vinyl composite, uPVC, and fiber reinforced polyester products; aluminum composite panels; sealants and adhesives; packaging products comprising corrugated PP sheet under the Impraboard brand name; and polymer resins, as well as rigid PVC compounds under the POLYVIC and CRYSTAL brands for use in blow molding, extrusion, and film and injection applications. It also develops and rents a business park in the Altira area. In addition, the company distributes plastic products, and adhesives materials or glue; and provides engineering, procurement, and construction services. PT Impack Pratama Industri Tbk was founded in 1981 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "INAI.JK": {"short_name": "Indal Aluminium Industry Tbk.", "long_name": "PT Indal Aluminium Industry Tbk", "summary": "PT Indal Aluminium Industry Tbk manufactures and distributes aluminium products in Indonesia. The company operates through four divisions: Aluminium Industry, Construction Services, Software Services, and General Trading and Investments. It offers architectural products, such as curtain walls, doors, windows, and aluminium composite panels; electronic and precision parts, including heat sinks and precision parts; and ladder products comprising household, tradesmen, heavy duty industrial, and level arc ladders, as well as planks. The company also provides other commodities, which include stainless steel water tanks; aluminium profiles for various parts of transportation, such as body frames and window frames of vans, trucks and other commercial vehicles; and aluminium-extruded products for office room partitions, as well as fabricates aluminium frames for showcases, picture frames, signage profiles, customized chairs, and tables. In addition, it offers constructing services for faÃ§ade design, supply, and installation; sells, maintains, and repairs ERP software; invests in aluminium and coating industries; and manufactures paints. The company also exports its products to Japan, Hong Kong, Thailand, Singapore, Australia, the United States, and other countries in Asia. PT Indal Aluminium Industry Tbk was founded in 1971 and is headquartered in Surabaya, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Aluminum", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "INCF.JK": {"short_name": "Indo Komoditi Korpora Tbk.", "long_name": "PT Indo Komoditi Korpora Tbk", "summary": "PT Indo Komoditi Korpora Tbk engages rubber, dry jelutung, and maklon service businesses. The company was founded in 1982 and is based in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "INCI.JK": {"short_name": "Intanwijaya Internasional Tbk", "long_name": "PT Intanwijaya Internasional Tbk", "summary": "PT Intanwijaya Internasional Tbk manufactures and sells formaldehyde and formaldehyde resin products primarily in Indonesia. The company offers formalin, urea formaldehyde resin, melamine urea formaldehyde resin, phenol formaldehyde resin, urea formaldehyde powder, hardener, catcher, and other products primarily for plywood, block board, and particle board industries. It is also involved in real estate business. The company exports its products. The company was formerly known as PT Intan Wijaya Chemical Industry and changed its name to PT Intanwijaya Internasional Tbk in June 2000. PT Intanwijaya Internasional Tbk was founded in 1981 and is headquartered in West Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Barat"}, "INKP.JK": {"short_name": "Indah Kiat Pulp & Paper Tbk.", "long_name": "PT Indah Kiat Pulp & Paper Tbk", "summary": "PT Indah Kiat Pulp & Paper Tbk operates in the paper packaging industry in Indonesia, Asia, North and South America, Australia, Africa, and Europe. The company offers white grade papers, brown grade papers, and carton boxes, as well as offset printing services. The company was founded in 1976 and is based in Serang, Indonesia. PT Indah Kiat Pulp & Paper Tbk is a subsidiary of PT Purinusa Ekapersada.", "currency": "IDR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Serang"}, "INRU.JK": {"short_name": "Toba Pulp Lestari Tbk.", "long_name": "PT Toba Pulp Lestari Tbk", "summary": "PT. Toba Pulp Lestari Tbk produces and sells pulp in Indonesia, China, Bangladesh, Thailand, and India. The company was formerly known as PT Inti Indorayon Utama Tbk and changed its name to PT. Toba Pulp Lestari Tbk in August 2001. The company was founded in 1983 and is based in Medan, Indonesia. PT. Toba Pulp Lestari Tbk is a subsidiary of Pinnacle Company Pte. Ltd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Medan"}, "INTD.JK": {"short_name": "Inter Delta Tbk", "long_name": "PT Inter Delta Tbk", "summary": "PT Inter Delta Tbk engages in the general trading of film equipment, micro films, chemicals for photography, and electronic equipment in Indonesia. Its products include photo printing papers, films and cameras, photo and paper processing chemicals, and others. The company was founded in 1976 and is headquartered in North Jakarta, Indonesia. PT Inter Delta Tbk is a subsidiary of Peak Aim Development Ltd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Utara"}, "INTP.JK": {"short_name": "Indocement Tunggal Prakarsa Tbk", "long_name": "PT Indocement Tunggal Prakarsa Tbk", "summary": "PT Indocement Tunggal Prakarsa Tbk manufactures and sells cement and ready mix concrete products in Indonesia and internationally. It operates in three segments: Cement, Ready-Mix Concrete, and Aggregates Quarries. The company offers Portland composite, ordinary Portland, Portland Pozzolan, oil well, white, and TR30 white mortar cement products under the Tiga Roda, Rajawali, and Duracem brands. It also involved in the aggregate and trass quarrying; and shipping activities, as well as provides labor supply services. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Indocement Tunggal Prakarsa Tbk is a subsidiary of Birchwood Omnia Limited.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ISSP.JK": {"short_name": "Steel Pipe Industry of Indonesi", "long_name": "PT Steel Pipe Industry of Indonesia Tbk", "summary": "PT Steel Pipe Industry of Indonesia Tbk manufactures and sells steel pipes/tubes and other related products in Indonesia. The company operates through Steel Pipe Mill, Spiral Steel Pipe Mill, Strips and Plate, and Services and Others segments. It provides structural pipes, such as ERW steel pipes for bridge and construction projects, as well as building envelope structural applications; and SAW steel pipes for use in various structural applications, such as foundation work and on piers, bridges, and construction of project buildings. The company also offers water and oil and gas pipes; stainless steel pipes, including ornamental tubes and industrial pipes; galvanized pipes; and steel poles comprising telephone, electric, and lighting poles, as well as mechanical tubes for use in furniture materials, bus frame structures, bicycle frames, and automotive parts. PT Steel Pipe Industry of Indonesia Tbk was founded in 1971 and is headquartered in Surabaya, Indonesia. PT Steel Pipe Industry of Indonesia Tbk is a subsidiary of PT Cakra Bhakti Para Putra.", "currency": "IDR", "sector": "Basic Materials", "industry": "Steel", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "ITP.F": {"short_name": "INDOC.TUNG.P.  RP 500", "long_name": "PT Indocement Tunggal Prakarsa Tbk", "summary": "PT Indocement Tunggal Prakarsa Tbk manufactures and sells cement and ready mix concrete products in Indonesia and internationally. It operates in three segments: Cement, Ready-Mix Concrete, and Aggregates Quarries. The company offers Portland composite, ordinary Portland, Portland Pozzolan, oil well, white, and TR30 white mortar cement products under the Tiga Roda, Rajawali, and Duracem brands. It also involved in the aggregate and trass quarrying; and shipping activities, as well as provides labor supply services. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Indocement Tunggal Prakarsa Tbk is a subsidiary of Birchwood Omnia Limited.", "currency": "EUR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "J5R.SG": {"short_name": "J Resources Asia Pasifik Tbk Re", "long_name": "PT J Resources Asia Pasifik Tbk", "summary": "PT J Resources Asia Pasifik Tbk operates in gold mining sector primarily in Indonesia. The company is involved in the mining and sale of gold and silver. It also provides general trading services. The company was formerly known as PT Pelita Sejahtera Abadi and changed its name to PT J Resources Asia Pasifik Tbk in January 2012. PT J Resources Asia Pasifik Tbk was founded in 2002 and is based in South Jakarta, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Gold", "exchange": "STU", "market": "dr_market", "country": "Indonesia", "city": "South Jakarta"}, "KAYU.JK": {"short_name": "Darmi Bersaudara Tbk.", "long_name": "PT Darmi Bersaudara Tbk", "summary": "PT Darmi Bersaudara Tbk primarily engages in the trading of processed wood products in Indonesia. It offers raw wood, as well as various types of processed wood, such as Merbau, Bengkirai, Kampoor, Keruing, and Meranti for use in decking, E2E, T&G, flooring, door jamb, post beam, finger joint, and window jamb applications. The company also exports its products to China, Nepal, India, Australia, and Europe. PT Darmi Bersaudara Tbk was founded in 1998 and is based in Surabaya, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "KRAS.JK": {"short_name": "Krakatau Steel (Persero) Tbk.", "long_name": "PT Krakatau Steel (Persero) Tbk", "summary": "PT Krakatau Steel (Persero) Tbk, together with its subsidiaries, engages in the production and trading of iron and steel products in Indonesia and internationally. It operates through five segments: Steel Products, Real Estate and Hotels, Engineering and Construction, Port Services Provider, and Other Services. The Steel Products segment is primarily involved in production and sale of steel products, such as sponge iron, slabs, billets, hot rolled coils, cold rolled coils, and wire rods; and steel pipes, reinforcing bars, and steel wires, as well as services related to steel, including coating and tolling services. The Real Estate and Hotels segment develops and sells industrial estates with the infrastructure, and hotels and sport facilities. The Engineering and Construction segment is involved in the construction, industrial engineering, planning, and contracting of various types of buildings; export and import of goods; and provision of services and software related to the aforementioned activities. The Port Services Provider segment offers pier services for berthing, loading, and unloading goods and containers; and sea port support, warehousing, and transportation services. The Other Services segment provides information technology, medical, electricity, and water distribution services for industrial and residence needs. It also engages in the production of reinforcing bars, and deformed and plain bars; and coal and mining business. PT Krakatau Steel (Persero) Tbk was founded in 1970 and is headquartered in Cilegon, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Steel", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Cilegon"}, "LF9.F": {"short_name": "PT SLJ GLOBAL  RP 1000", "long_name": "PT SLJ Global Tbk", "summary": "PT SLJ Global Tbk, together with its subsidiaries, engages in the timber manufacturing, power, and logging businesses in the United States, Indonesia, East Asia, Europe, Australia, and Southeast Asia. It operates through Timber manufacturing, and power plant and logging segments. It manages six natural forest concessions of 770,455 hectares. The company also engages in the industrial plywood and medium density fibre board, as well as mining businesses. In addition, it operates a power plant with a total capacity of 22.5 megawatts. The company was formerly known as PT Sumalindo Lestari Jaya Tbk and changed its name to PT SLJ Global Tbk in December 2012. PT SLJ Global Tbk was founded in 1980 and is headquartered in South Jakarta, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "LF9.MU": {"short_name": "PT SLJ GLOBAL  RP 1000", "long_name": "PT SLJ Global Tbk", "summary": "PT SLJ Global Tbk, together with its subsidiaries, engages in the timber manufacturing, power, and logging businesses in the United States, Indonesia, East Asia, Europe, Australia, and Southeast Asia. It operates through Timber manufacturing, and power plant and logging segments. It manages six natural forest concessions of 770,455 hectares. The company also engages in the industrial plywood and medium density fibre board, as well as mining businesses. In addition, it operates a power plant with a total capacity of 22.5 megawatts. The company was formerly known as PT Sumalindo Lestari Jaya Tbk and changed its name to PT SLJ Global Tbk in December 2012. PT SLJ Global Tbk was founded in 1980 and is headquartered in South Jakarta, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "MUN", "market": "dr_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "LTLS.JK": {"short_name": "Lautan Luas Tbk.", "long_name": "PT Lautan Luas Tbk", "summary": "PT Lautan Luas Tbk manufactures and distributes basic and specialty chemicals for industrial end-users primarily in Indonesia and the Asia-Pacific region. It operates through three segments: Distribution, Manufacturing, and Services. The company provides laboratory services and solutions for corporate customers in the textile, paper, electroplating, leather, and water treatment industries, as well as offers integrated logistics and supply chain, waste water treatment, and information technology solutions. It serves the agriculture, animal feed, coating, electroplating, food and beverages, glass and ceramic, leather, mining and smelter, oil field, packaging, personal and home care, plastic and rubber, pulp and paper, sugar, textile, and water treatment industries. The company was formerly known as Perusahaan Andil Maskapai Dagang dan Industri Lim Teck Lee and changed its name to PT Lautan Luas Tbk in 1965. The company was founded in 1951 and is headquartered in West Jakarta, Indonesia. PT Lautan Luas Tbk is a subsidiary of PT Caturkarsa Megatunggal.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "West Jakarta"}, "MDKA.JK": {"short_name": "Merdeka Copper Gold Tbk.", "long_name": "PT Merdeka Copper Gold Tbk", "summary": "PT Merdeka Copper Gold Tbk engages in the mining business in Indonesia. It explores for gold, silver, copper, and other related minerals, as well as provides mining services. The company holds interests in the Tujuh Bukit Copper/Gold Project; Pani Joint Venture Project; Wetar / Morowali Acid Iron Metal; Tujuh Bukit Gold Production project; and Wetar Copper Production Project. It also offers processing and trading services. The company was formerly known as PT Merdeka Sera and changed its name to PT Merdeka Copper Gold Tbk in December 2014. PT Merdeka Copper Gold Tbk was founded in 2012 and is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "MDKI.JK": {"short_name": "Emdeki Utama Tbk.", "long_name": "PT Emdeki Utama Tbk", "summary": "PT Emdeki Utama Tbk produces and sells calcium carbide in Indonesia and India. The company also produces air conditioners. The company was founded in 1981 and is based in Gresik, Indonesia. PT Emdeki Utama Tbk is a subsidiary of Pt Emde Industri Investama.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Gresik"}, "MOLI.JK": {"short_name": "Madusari Murni Indah Tbk.", "long_name": "PT Madusari Murni Indah Tbk", "summary": "PT. Madusari Murni Indah Tbk, through its subsidiaries, produces, distributes, trades in, and sells food grade ethanol. It also provides carbondioxide gas in liquid and dry forms; and organic and potassium fertilizers. The company sells its products under the Molindo Ethanol, Molindo CO2, and Molindo Fertilizer brands. It serves food and beverage, pharmaceutical, cosmetic, cigarette, hospital, furniture, ink, printing, fuel, and welding industries. The company was founded in 1959 and is headquartered in Malang, Indonesia. PT. Madusari Murni Indah Tbk is subsidiary of Pt Cropsco Panen Indonusa.", "currency": "IDR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Malang"}, "OB8.F": {"short_name": "BARITO PAC.  RP 100", "long_name": "PT Barito Pacific Tbk", "summary": "PT Barito Pacific Tbk, together with its subsidiaries, produces petrochemicals. It operates through Petrochemical, Wood Manufacturing, Building and Hotel Management, Energy and Resources, and Others segments. The company produces petrochemical products, such as olefins comprising ethylene, propylene, py-gas, and mixed C4; polyolefins, including polyethylene and polypropylene; styrene monomer, a material for manufacturing polystyrene (PS), expanded PS, styrene acrylonitrile, acrylonitrile butadiene styrene, styrene butadiene rubber, styrene butadiene latex, and unsaturated polyester resins; and butadiene, a raw material that is used to make styrene butadiene rubber, acrylonitrile butadiene styrene, and styrene butadiene latex. It also produces geothermal energy with total installed capacity of 875 MW through its operating assets in Wayang Windu, Salak, and Darajat. In addition, the company manages properties; develops industrial and commercial properties, commercial complexes, office spaces, and factory buildings; owns and manages a hotel; and provides storage tank terminal and jetty management services for chemical products. Additionally, it produces glue (adhesive). The company was formerly known as PT Barito Pacific Timber Tbk and changed its name to PT Barito Pacific Tbk in 2007. PT Barito Pacific Tbk was founded in 1979 and is headquartered in Jakarta, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "OB9.F": {"short_name": "PT PABRIK KERTAS  RP 1000", "long_name": "PT Pabrik Kertas Tjiwi Kimia Tbk", "summary": "PT Pabrik Kertas Tjiwi Kimia Tbk manufactures and sells paper products in Indonesia. The company operates through two segments, Cultural Paper Products, and Industrial Paper Products and Other. It provides printing and writing, wood free, photocopy, and carbonless papers; and specialty products, such as greaseproof, kraft, and drawing papers, as well as brief cards. The company also offers converting products, which include stationery products, such as exercise books/saddle stitcheads, pads, loose leaf papers, hard cover books, spirals, and binding books; office products comprising envelopes, register rolls, plotters, and computer forms; and shopping bag and packaging products, as well as drawing books, fancy stationery, continuous forms, file folders, and other products. In addition, it provides carton boxes; and chemical products consisting of sodium hypochlorite, hydrochloride acid, chlorine liquid, caporite, calcium chloride, and caustic soda liquid and flake products for various industrial sectors, including water treatment, soap industry, wastewater treatment, etc. The company also exports its products to other Asian countries, Africa, the Middle East, the United States, Europe, and internationally. The company was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Pabrik Kertas Tjiwi Kimia Tbk is a subsidiary of PT Purinusa Ekapersada.", "currency": "EUR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "OKAS.JK": {"short_name": "Ancora Indonesia Resources Tbk.", "long_name": "PT Ancora Indonesia Resources Tbk", "summary": "PT Ancora Indonesia Resources Tbk, together with its subsidiaries, operates in the explosives industry in Indonesia. The company trades in and manufactures ammonium nitrate and nitric acid compounds used as explosives in coal and mineral mining operation, public works, and the cement industry, as well as explosives related accessories. It also provides drilling and work-over of oil well services; blasting services; mining services; and shipping services. The company was formerly known as PT TD Resources, Tbk and changed its name to PT Ancora Indonesia Resources Tbk. in December 2008. The company was founded in 2003 and is headquartered in Jakarta, Indonesia. PT Ancora Indonesia Resources Tbk operates as a subsidiary of PT Multi Berkat Energi.", "currency": "IDR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "PITPF": {"short_name": "INDOCEMENT TUNGGAL PRAKARSA", "long_name": "PT Indocement Tunggal Prakarsa Tbk", "summary": "PT Indocement Tunggal Prakarsa Tbk manufactures and sells cement and ready mix concrete products in Indonesia and internationally. It operates in three segments: Cement, Ready-Mix Concrete, and Aggregates Quarries. The company offers Portland composite, ordinary Portland, Portland Pozzolan, oil well, white, and TR30 white mortar cement products under the Tiga Roda, Rajawali, and Duracem brands. It also involved in the aggregate and trass quarrying; and shipping activities, as well as provides labor supply services. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Indocement Tunggal Prakarsa Tbk is a subsidiary of Birchwood Omnia Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PITPY": {"short_name": "INDOCEMENT TUNGGAL PRAKARSA", "long_name": "PT Indocement Tunggal Prakarsa Tbk", "summary": "PT Indocement Tunggal Prakarsa Tbk manufactures and sells cement and ready mix concrete products in Indonesia and internationally. It operates in three segments: Cement, Ready-Mix Concrete, and Aggregates Quarries. The company offers Portland composite, ordinary Portland, Portland Pozzolan, oil well, white, and TR30 white mortar cement products under the Tiga Roda, Rajawali, and Duracem brands. It also involved in the aggregate and trass quarrying; and shipping activities, as well as provides labor supply services. The company was founded in 1975 and is headquartered in Jakarta, Indonesia. PT Indocement Tunggal Prakarsa Tbk is a subsidiary of Birchwood Omnia Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "POLY.JK": {"short_name": "Asia Pacific Fibers Tbk", "long_name": "PT Asia Pacific Fibers Tbk", "summary": "PT Asia Pacific Fibers Tbk, together with its subsidiaries, engages in the chemical and synthetic fiber manufacturing, weaving and knitting, and other activities related to the textile industry in Indonesia. The company offers purified terephthalic acids, regular and specialized polyester chips, staple fibers, filament yarns, fleece fabrics, and methyl acetate products. It also trades in textile products; and produces ready to wear garments and accessories, as well as provides financial services. The company's products are used in various apparel, furnishing, and industrial textile applications. It serves customers in Europe, the United States, Asia, Africa, Australia, and the Middle East. The company was formerly known as PT Polysindo Eka Perkasa Tbk and changed its name to PT Asia Pacific Fibers Tbk in December 2009. The company was founded in 1984 and is based in Jakarta, Indonesia. PT Asia Pacific Fibers Tbk is a subsidiary of Damiano Investments B.V.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "PSAB.JK": {"short_name": "J Resources Asia Pasifik Tbk.", "long_name": "PT J Resources Asia Pasifik Tbk", "summary": "PT J Resources Asia Pasifik Tbk operates in gold mining sector primarily in Indonesia. The company is involved in the mining and sale of gold and silver. It also provides general trading services. The company was formerly known as PT Pelita Sejahtera Abadi and changed its name to PT J Resources Asia Pasifik Tbk in January 2012. PT J Resources Asia Pasifik Tbk was founded in 2002 and is based in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Gold", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Jakarta"}, "PSGTY": {"short_name": "SEMEN INDONESIA (PERSERO)TBK", "long_name": "PT Semen Indonesia (Persero) Tbk", "summary": "PT Semen Indonesia (Persero) Tbk, together with its subsidiaries, manufactures, packs, and distributes cement in Indonesia and internationally. The company is also involved in limestone and clay mining; cement bag and material manufacturing; industrial real estate development and building rental; ready mix concrete production; and mining, trading, transportation, and construction activities. In addition, it engages in the information system, investment, freight forwarding, general trading, stevedoring, sea transportation, and building materials businesses. The company was formerly known as PT Semen Gresik (Persero) Tbk and changed its name to PT Semen Indonesia (Persero) Tbk in January 2013. PT Semen Indonesia (Persero) Tbk was founded in 1953 and is headquartered in Jakarta Selatan, Indonesia.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "PTCAY": {"short_name": "CHANDRA ASRI PETROCHEMICAL TBK", "long_name": "PT. Chandra Asri Petrochemical Tbk", "summary": "PT. Chandra Asri Petrochemical Tbk, together with its subsidiaries, operates as an integrated petrochemical company in Indonesia and internationally. It operates through Olefin, Polyolefin, Styrene Monomer, Butadiene, and Tanks and Jetty Rental segments. The company offers olefins, such as ethylene, propylene, mixed C4, pyrolysis gasoline, and pyrolysis fuel oil. It also provides polyethylene products, including linear low density and high density polyethylene under the Asrene brand name used in films, injection molding, blow molding, pipe, and monofilament, as well as agriculture films, plastic packaging, fishnet, tarpaulin, clean water pipes, jerry cans, cosmetics, and food grade bottles applications; and resin under the Grene brand name for environmental friendly shopping bags, compost bags, disposal bags, bags on roll, etc. In addition, the company offers polypropylene products, which consist of homopolymer, random copolymer, and impact copolymer under Trilene brand name used for use in flexible packaging, household appliances, yarn, non-woven bags, furniture, automotive, and electronic parts. Further, it provides styrene monomer that produces polystyrene, expanded polystyrene, styrene acrylonitrile, acrylonitrile butadiene styrene (ABS), styrene butadiene rubber (SBR), styrene butadiene latex (SBL), and unsaturated polyester resin for use in shoe soles, drinking cups, food containers, automotive and electronic parts, building block toys, and helmets; and butadiene for the production of ABS, SBL, SBR, and polybutadiene rubber used in rubber boots, rubber gloves, shoe soles, adhesives, and sealants. The company also exports its products. PT. Chandra Asri Petrochemical Tbk is headquartered in Jakarta, Indonesia.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PTHIY": {"short_name": "SOLUSI BANGUN INDONESIA TBK UNS", "long_name": "PT Solusi Bangun Indonesia Tbk", "summary": "PT Solusi Bangun Indonesia Tbk, together with its subsidiaries, produces and distributes cement, ready-mixed concrete, and aggregates in Indonesia and internationally. The company operates through three segments: Cement, Readymix Concrete and Aggregates Quarry, and Other Construction Services. It offers cement and mortar, as well as coarse, fine, and other aggregates. The company also provides construction and consulting services. In addition, it engages in the licensing of aggregates quarry and mining production; and mining activities, as well as provides waste management service for industrial companies. The company was formerly known as PT Holcim Indonesia Tbk and changed its name to PT Solusi Bangun Indonesia Tbk in March 2019. The company was founded in 1971 and is headquartered in Jakarta, Indonesia. PT Solusi Bangun Indonesia Tbk is a subsidiary of PT Semen Indonesia Industri Bangunan.", "currency": "USD", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PTNDF": {"short_name": "VALE INDONESIA TBK", "long_name": "PT Vale Indonesia Tbk", "summary": "PT Vale Indonesia Tbk engages in the exploration and mining, processing, storage, transportation, and marketing of nickel and related mineral products in Indonesia, Canada, and Japan. It operates a concession area of 118,017 hectares located in Sulawesi. The company explores for iron ore and pellets, nickel, coal, copper, and manganese and ferroalloys. It also engages in the provision of railroad, port and terminal, and shipping logistics services; operation of hydroelectric plants in Brazil, Canada, and Indonesia; and steel making activities. The company was formerly known as PT International Nickel Indonesia Tbk and changed its name to PT Vale Indonesia Tbk in September 2011. PT Vale Indonesia Tbk was founded in 1968 and is headquartered in Jakarta, Indonesia. PT Vale Indonesia Tbk is a subsidiary of Vale Canada Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PTNDY": {"short_name": "VALE INDONESIA TBK", "long_name": "PT Vale Indonesia Tbk", "summary": "PT Vale Indonesia Tbk engages in the exploration and mining, processing, storage, transportation, and marketing of nickel and related mineral products in Indonesia, Canada, and Japan. It operates a concession area of 118,017 hectares located in Sulawesi. The company explores for iron ore and pellets, nickel, coal, copper, and manganese and ferroalloys. It also engages in the provision of railroad, port and terminal, and shipping logistics services; operation of hydroelectric plants in Brazil, Canada, and Indonesia; and steel making activities. The company was formerly known as PT International Nickel Indonesia Tbk and changed its name to PT Vale Indonesia Tbk in September 2011. PT Vale Indonesia Tbk was founded in 1968 and is headquartered in Jakarta, Indonesia. PT Vale Indonesia Tbk is a subsidiary of Vale Canada Limited.", "currency": "USD", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PTPIF": {"short_name": "CHANDRA ASRI PETROCHEMICAL TBK", "long_name": "PT. Chandra Asri Petrochemical Tbk", "summary": "PT. Chandra Asri Petrochemical Tbk, together with its subsidiaries, operates as an integrated petrochemical company in Indonesia and internationally. It operates through Olefin, Polyolefin, Styrene Monomer, Butadiene, and Tanks and Jetty Rental segments. The company offers olefins, such as ethylene, propylene, mixed C4, pyrolysis gasoline, and pyrolysis fuel oil. It also provides polyethylene products, including linear low density and high density polyethylene under the Asrene brand name used in films, injection molding, blow molding, pipe, and monofilament, as well as agriculture films, plastic packaging, fishnet, tarpaulin, clean water pipes, jerry cans, cosmetics, and food grade bottles applications; and resin under the Grene brand name for environmental friendly shopping bags, compost bags, disposal bags, bags on roll, etc. In addition, the company offers polypropylene products, which consist of homopolymer, random copolymer, and impact copolymer under Trilene brand name used for use in flexible packaging, household appliances, yarn, non-woven bags, furniture, automotive, and electronic parts. Further, it provides styrene monomer that produces polystyrene, expanded polystyrene, styrene acrylonitrile, acrylonitrile butadiene styrene (ABS), styrene butadiene rubber (SBR), styrene butadiene latex (SBL), and unsaturated polyester resin for use in shoe soles, drinking cups, food containers, automotive and electronic parts, building block toys, and helmets; and butadiene for the production of ABS, SBL, SBR, and polybutadiene rubber used in rubber boots, rubber gloves, shoe soles, adhesives, and sealants. The company also exports its products. PT. Chandra Asri Petrochemical Tbk is headquartered in Jakarta, Indonesia.", "currency": "USD", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "PNK", "market": "us_market", "country": "Indonesia", "city": "Jakarta"}, "PTRO.JK": {"short_name": "Petrosea Tbk.", "long_name": "PT Petrosea Tbk", "summary": "PT Petrosea Tbk provides engineering, construction, mining, and other services to the oil and gas, infrastructure, industrial and manufacturing, and utility sectors in Indonesia and internationally. It operates through three segments: Mining, Services, and Engineering and Construction. The Mining segment provides mining contract services, including overburden stripping, drilling, blasting, lifting, hauling, mine, and mine partnering services. The Services segment offers supply base facilities and port services. The Engineering and Construction segment provides a range of engineering, procurement, and construction services, including technical due diligence, feasibility studies, engineering design, project management, procurement and logistics, plant and equipment hire, and operation and commissioning services. This segment also supplies skilled trade personnel. The company was founded in 1972 and is headquartered in South Tangerang, Indonesia. PT Petrosea Tbk is a subsidiary of PT Indika Energy Tbk.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Tangerang"}, "SAMF.JK": {"short_name": "Saraswanti Anugerah Makmur Tbk.", "long_name": "PT Saraswanti Anugerah Makmur, Tbk", "summary": "PT Saraswanti Anugerah Makmur, Tbk, together with its subsidiaries, engages in the production and distribution of non-subsidized NPK Fertilizers. The company retails various fertilizers and pest eradication products, such as single artificial, compound and mixed, and natural fertilizers; and insecticides, fungicides, rodenticides, herbicides, nematicides, and akarisida. It is also involved in business brokerage activities that regulate the buying and selling of small and medium scale businesses, including professional practice, patent brokerage activities, and valuation activities for antiques, jewelry, and others; and account audits and information on goods or cargo rates, quantity measurement activities, and weather forecasting activities. In addition, the company engages in management and consulting activities that comprise strategic and organizational planning; financial decisions; marketing objectives and policies; human resource planning, practices, and policies; and production scheduling and control planning. It offers its fertilizer products under the FERTINDO, PUPINDO, PHONIKA, PLANTA PLUS, CORNALET, HALEI, PUKALET, KOKA, and PALMO brands. The company was founded in 1998 and is headquartered in Sidoarjo, Indonesia. PT Saraswanti Anugerah Makmur, Tbk is a subsidiary of PT Saraswanti Utama.", "currency": "IDR", "sector": "Basic Materials", "industry": "Agricultural Inputs", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Sidoarjo"}, "SINI.JK": {"short_name": "Singaraja Putra Tbk.", "long_name": "PT Singaraja Putra Tbk", "summary": "PT Singaraja Putra Tbk engages in the wood and accommodation services businesses in Indonesia, the Netherlands, France, Belgium, and the United States. It is also involved in the trading business. The company was founded in 2005 and is based in Bekasi, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bekasi"}, "SMBR.JK": {"short_name": "Semen Baturaja (Persero) Tbk.", "long_name": "PT Semen Baturaja (Persero) Tbk", "summary": "PT Semen Baturaja (Persero) Tbk produces and distributes cement in Indonesia. The company offers ordinary Portland cement type I, II, and V, as well as Portland composite cement. It also engages in the trading, construction, and land logistics businesses. The company was founded in 1974 and is headquartered in Palembang, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Palembang"}, "SMCB.JK": {"short_name": "Solusi Bangun Indonesia Tbk.", "long_name": "PT Solusi Bangun Indonesia Tbk", "summary": "PT Solusi Bangun Indonesia Tbk, together with its subsidiaries, produces and distributes cement, ready-mixed concrete, and aggregates in Indonesia and internationally. The company operates through three segments: Cement, Readymix Concrete and Aggregates Quarry, and Other Construction Services. It offers cement and mortar, as well as coarse, fine, and other aggregates. The company also provides construction and consulting services. In addition, it engages in the licensing of aggregates quarry and mining production; and mining activities, as well as provides waste management service for industrial companies. The company was formerly known as PT Holcim Indonesia Tbk and changed its name to PT Solusi Bangun Indonesia Tbk in March 2019. The company was founded in 1971 and is headquartered in Jakarta, Indonesia. PT Solusi Bangun Indonesia Tbk is a subsidiary of PT Semen Indonesia Industri Bangunan.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "SMGR.JK": {"short_name": "Semen Indonesia (Persero) Tbk.", "long_name": "PT Semen Indonesia (Persero) Tbk", "summary": "PT Semen Indonesia (Persero) Tbk, together with its subsidiaries, manufactures, packs, and distributes cement in Indonesia and internationally. The company is also involved in limestone and clay mining; cement bag and material manufacturing; industrial real estate development and building rental; ready mix concrete production; and mining, trading, transportation, and construction activities. In addition, it engages in the information system, investment, freight forwarding, general trading, stevedoring, sea transportation, and building materials businesses. The company was formerly known as PT Semen Gresik (Persero) Tbk and changed its name to PT Semen Indonesia (Persero) Tbk in January 2013. PT Semen Indonesia (Persero) Tbk was founded in 1953 and is headquartered in Jakarta Selatan, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "SMS2.F": {"short_name": "SEMEN INDON.(PERS.)RP 100", "long_name": "PT Semen Indonesia (Persero) Tbk", "summary": "PT Semen Indonesia (Persero) Tbk, together with its subsidiaries, manufactures, packs, and distributes cement in Indonesia and internationally. The company is also involved in limestone and clay mining; cement bag and material manufacturing; industrial real estate development and building rental; ready mix concrete production; and mining, trading, transportation, and construction activities. In addition, it engages in the information system, investment, freight forwarding, general trading, stevedoring, sea transportation, and building materials businesses. The company was formerly known as PT Semen Gresik (Persero) Tbk and changed its name to PT Semen Indonesia (Persero) Tbk in January 2013. PT Semen Indonesia (Persero) Tbk was founded in 1953 and is headquartered in Jakarta Selatan, Indonesia.", "currency": "EUR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "SPMA.JK": {"short_name": "Suparma Tbk.", "long_name": "PT Suparma Tbk", "summary": "PT Suparma Tbk manufactures and sells paper and packaging paper products in Indonesia. The company's paper products include laminated wrapping and brown Kraft, and sandwiched ribbed Kraft recycle papers; white papers; and carton papers. It also provides bathroom, facial, napkin, and carrier tissues; hand, hand roll, industrial and clinical roll, and kitchen towels; and OEM products. In addition, the company exports its products. The company was formerly known as PT Supar Inpama and changed its name to PT Suparma Tbk in December 1978. PT Suparma Tbk was founded in 1976 and is headquartered in Surabaya, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Surabaya"}, "SQMI.JK": {"short_name": "Wilton Makmur Indonesia Tbk.", "long_name": "PT Wilton Makmur indonesia Tbk", "summary": "PT Wilton Makmur indonesia Tbk, together with its subsidiaries, engages in the gold mining business in Indonesia. The company holds interest in the Ciemas Gold Project that covers a total area of 2,878.5 hectares located in West Java, Indonesia. It is also involved in the coal mining business. The company was formerly known as PT Renuka Coalindo Tbk and changed its name to PT Wilton Makmur indonesia Tbk in October 2019. The company was founded in 2000 and is based in Jakarta Pusat, Indonesia. PT Wilton Makmur indonesia Tbk is a subsidiary of Wolton Resources Holding Pte. Ltd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Gold", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Pusat"}, "SRSN.JK": {"short_name": "Indo Acidatama Tbk", "long_name": "PT Indo Acidatama Tbk", "summary": "PT Indo Acidatama Tbk produces and sells basic and agro chemicals primarily in Indonesia. The company offers ethanol, acetic acid, and ethyl acetate products; and organic plus bio fertilizers under the POMI and BEKA names. It also exports its products. The company was formerly known as PT Sarasa Nugraha Tbk and changed its name to PT Indo Acidatama Tbk in May 2006. PT Indo Acidatama Tbk was founded in 1982 and is based in West Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Barat"}, "SULI.JK": {"short_name": "SLJ Global Tbk.", "long_name": "PT SLJ Global Tbk", "summary": "PT SLJ Global Tbk, together with its subsidiaries, engages in the timber manufacturing, power, and logging businesses in the United States, Indonesia, East Asia, Europe, Australia, and Southeast Asia. It operates through Timber manufacturing, and power plant and logging segments. It manages six natural forest concessions of 770,455 hectares. The company also engages in the industrial plywood and medium density fibre board, as well as mining businesses. In addition, it operates a power plant with a total capacity of 22.5 megawatts. The company was formerly known as PT Sumalindo Lestari Jaya Tbk and changed its name to PT SLJ Global Tbk in December 2012. PT SLJ Global Tbk was founded in 1980 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "TDPM.JK": {"short_name": "Tridomain Performance Materials", "long_name": "PT Tridomain Performance Materials Tbk", "summary": "PT Tridomain Performance Materials Tbk manufactures and sells high performance specialty materials in Indonesia. It offers waterbased resins, solvent-based coating resins, and unsaturated polyester resins, as well as plasticizers and acrylamides. The company's products are used in infrastructure, construction, automotive, environmental, and manufacturing industries. It also operates in the Asia Pacific, the Middle East, Australia, and New Zealand. The company was incorporated in 2003 and is based in Jakarta, Indonesia. PT Tridomain Performance Materials Tbk is a subsidiary of DH Corporation Ltd.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "TIH1.F": {"short_name": "PT TIMAH TBK  RP 50", "long_name": "PT TIMAH Tbk", "summary": "PT TIMAH Tbk engages in tin mining and smelting operations in Indonesia. The company operates through Tin Mining, Coal Mining, Construction, Industry, and Other segments. It offers Banka tin, Mentok tin, Banka low lead, and Kundur tin, as well as tin alloy, solder, and chemical products. The company also provides non tin products, such as coal, aluminum, ferronickel, high and low grade nickel ore, gold, silver, and bauxite; workshop, construction, shipbuilding, and transportation services; engineering and ship repair, property, and health services; and marketing agency services. In addition, it is involved in the agriculture, trading, and distribution businesses. The company also exports its products. The company was founded in 1976 and is headquartered in Bangka, Indonesia. PT TIMAH Tbk is a subsidiary of PT Indonesia Asahan Aluminium (Persero).", "currency": "EUR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Bangka"}, "TINS.JK": {"short_name": "Timah Tbk.", "long_name": "PT TIMAH Tbk", "summary": "PT TIMAH Tbk engages in tin mining and smelting operations in Indonesia. The company operates through Tin Mining, Coal Mining, Construction, Industry, and Other segments. It offers Banka tin, Mentok tin, Banka low lead, and Kundur tin, as well as tin alloy, solder, and chemical products. The company also provides non tin products, such as coal, aluminum, ferronickel, high and low grade nickel ore, gold, silver, and bauxite; workshop, construction, shipbuilding, and transportation services; engineering and ship repair, property, and health services; and marketing agency services. In addition, it is involved in the agriculture, trading, and distribution businesses. The company also exports its products. The company was founded in 1976 and is headquartered in Bangka, Indonesia. PT TIMAH Tbk is a subsidiary of PT Indonesia Asahan Aluminium (Persero).", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Bangka"}, "TIRT.JK": {"short_name": "Tirta Mahakam Resources Tbk", "long_name": "PT Tirta Mahakam Resources Tbk", "summary": "PT Tirta Mahakam Resources Tbk manufactures and sells plywood and related wood products in Indonesia. The company offers general and polyester plywood, blockboard polyester, and floorbase products, as well as structured panels and blockboards. It also exports its products to the United States, Japan, and Europe. The company was formerly known as PT Tirta Mahakam Plywood Industry. The company was founded in 1981 and is headquartered in South Jakarta, Indonesia. PT Tirta Mahakam Resources Tbk is a subsidiary of PT Harita Jayaraya.", "currency": "IDR", "sector": "Basic Materials", "industry": "Lumber & Wood Production", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Selatan"}, "TKIM.JK": {"short_name": "Pabrik Kertas Tjiwi Kimia Tbk.", "long_name": "PT Pabrik Kertas Tjiwi Kimia Tbk", "summary": "PT Pabrik Kertas Tjiwi Kimia Tbk manufactures and sells paper products in Indonesia. The company operates through two segments, Cultural Paper Products, and Industrial Paper Products and Other. It provides printing and writing, wood free, photocopy, and carbonless papers; and specialty products, such as greaseproof, kraft, and drawing papers, as well as brief cards. The company also offers converting products, which include stationery products, such as exercise books/saddle stitcheads, pads, loose leaf papers, hard cover books, spirals, and binding books; office products comprising envelopes, register rolls, plotters, and computer forms; and shopping bag and packaging products, as well as drawing books, fancy stationery, continuous forms, file folders, and other products. In addition, it provides carton boxes; and chemical products consisting of sodium hypochlorite, hydrochloride acid, chlorine liquid, caporite, calcium chloride, and caustic soda liquid and flake products for various industrial sectors, including water treatment, soap industry, wastewater treatment, etc. The company also exports its products to other Asian countries, Africa, the Middle East, the United States, Europe, and internationally. The company was founded in 1972 and is headquartered in Jakarta, Indonesia. PT Pabrik Kertas Tjiwi Kimia Tbk is a subsidiary of PT Purinusa Ekapersada.", "currency": "IDR", "sector": "Basic Materials", "industry": "Paper & Paper Products", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "TPIA.JK": {"short_name": "Chandra Asri Petrochemical Tbk.", "long_name": "PT. Chandra Asri Petrochemical Tbk", "summary": "PT. Chandra Asri Petrochemical Tbk, together with its subsidiaries, operates as an integrated petrochemical company in Indonesia and internationally. It operates through Olefin, Polyolefin, Styrene Monomer, Butadiene, and Tanks and Jetty Rental segments. The company offers olefins, such as ethylene, propylene, mixed C4, pyrolysis gasoline, and pyrolysis fuel oil. It also provides polyethylene products, including linear low density and high density polyethylene under the Asrene brand name used in films, injection molding, blow molding, pipe, and monofilament, as well as agriculture films, plastic packaging, fishnet, tarpaulin, clean water pipes, jerry cans, cosmetics, and food grade bottles applications; and resin under the Grene brand name for environmental friendly shopping bags, compost bags, disposal bags, bags on roll, etc. In addition, the company offers polypropylene products, which consist of homopolymer, random copolymer, and impact copolymer under Trilene brand name used for use in flexible packaging, household appliances, yarn, non-woven bags, furniture, automotive, and electronic parts. Further, it provides styrene monomer that produces polystyrene, expanded polystyrene, styrene acrylonitrile, acrylonitrile butadiene styrene (ABS), styrene butadiene rubber (SBR), styrene butadiene latex (SBL), and unsaturated polyester resin for use in shoe soles, drinking cups, food containers, automotive and electronic parts, building block toys, and helmets; and butadiene for the production of ABS, SBL, SBR, and polybutadiene rubber used in rubber boots, rubber gloves, shoe soles, adhesives, and sealants. The company also exports its products. PT. Chandra Asri Petrochemical Tbk is headquartered in Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Specialty Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "UNIC.JK": {"short_name": "Unggul Indah Cahaya Tbk.", "long_name": "PT Unggul Indah Cahaya Tbk", "summary": "PT Unggul Indah Cahaya Tbk manufactures and sells alkylbenzene chemicals as primary raw material for the production of detergents in Indonesia. The company operates in two segments, Chemicals and Real Estate. It offers linear alkylbenzene and branched alkylbenzene, as well as by-products, such as heavy and light alkylate. The company also manufactures and distributes active detergents of linear alkylbenzene sulfonic acid and sodium lauryl ether sulfate, sodium tripolyphosphate, and phosphate and surfactant. It exports its products to Australia, France, Germany, Japan, Singapore, Vietnam, and the United States. In addition, the company operates as a real estate developer; engages in trading and investment activities; and retails consumer products. PT Unggul Indah Cahaya Tbk was founded in 1983 and is headquartered in South Jakarta, Indonesia.", "currency": "IDR", "sector": "Basic Materials", "industry": "Chemicals", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "South Jakarta"}, "WK0.F": {"short_name": "WIJAYA KARYA BETON RP 100", "long_name": "PT Wijaya Karya Beton Tbk", "summary": "PT Wijaya Karya Beton Tbk manufactures and sells pre-stressed concrete (PC) products in Indonesia. The company offers concrete poles; piles, rounded hollow poles, poles hollow boxes, and cylinder piles; concrete pipe products; PC piles, such as spun, triangle, square hollow, and solid square piles; and railway concrete products, such as railway sleepers, poles, and bridges. It also provides bridge concrete products comprising girder, voided slab, double tee, full depth slab, and half slab concrete products; retaining wall concrete products, such as corrugated, flat prestressed, and flat reinforced concrete sheet piles; maritime concrete products including breakwater and dock components; hydro concrete products; building concrete products, which consists of precast walls, hollow core slabs, concrete slabs, columns, blocks, stairs, beams, and ladders; and ready-mix concrete. In addition, the company engages in the mining and production of split, screen material, etc.; engineering, production, and installation businesses; and provision of patent, inner bore system installation, gantry, and post tensioning services. The company was founded in 1997 and is headquartered in Jakarta, Indonesia. PT Wijaya Karya Beton Tbk is a subsidiary of PT Wijaya Karya (Persero) Tbk.", "currency": "EUR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "FRA", "market": "dr_market", "country": "Indonesia", "city": "Jakarta"}, "WSBP.JK": {"short_name": "Waskita Beton Precast Tbk.", "long_name": "PT Waskita Beton Precast Tbk", "summary": "PT Waskita Beton Precast Tbk manufactures precast, ready mix concrete, and quarry. It operates through three segments: Precast, Ready Mix, and Construction Service. The company provides girders, spun and square piles, concrete barriers, U-gutter, U-ditch, box culverts, diaphragm wall, spider web foundation, CCSP and FCSP, pier head precast, electric pole, railway sleeper, sprigWP, RC pipe, and tetrapod products, as well as full, half, deck, and voided slabs. It also offers supporting services comprising engineering, installation, piling, construction, and post-tensioning services. The company was founded in 2014 and is headquartered in Jakarta Timur, Indonesia. PT Waskita Beton Precast Tbk is a subsidiary of PT Waskita Karya (Persero) Tbk.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Timur"}, "WTON.JK": {"short_name": "Wijaya Karya Beton Tbk.", "long_name": "PT Wijaya Karya Beton Tbk", "summary": "PT Wijaya Karya Beton Tbk manufactures and sells pre-stressed concrete (PC) products in Indonesia. The company offers concrete poles; piles, rounded hollow poles, poles hollow boxes, and cylinder piles; concrete pipe products; PC piles, such as spun, triangle, square hollow, and solid square piles; and railway concrete products, such as railway sleepers, poles, and bridges. It also provides bridge concrete products comprising girder, voided slab, double tee, full depth slab, and half slab concrete products; retaining wall concrete products, such as corrugated, flat prestressed, and flat reinforced concrete sheet piles; maritime concrete products including breakwater and dock components; hydro concrete products; building concrete products, which consists of precast walls, hollow core slabs, concrete slabs, columns, blocks, stairs, beams, and ladders; and ready-mix concrete. In addition, the company engages in the mining and production of split, screen material, etc.; engineering, production, and installation businesses; and provision of patent, inner bore system installation, gantry, and post tensioning services. The company was founded in 1997 and is headquartered in Jakarta, Indonesia. PT Wijaya Karya Beton Tbk is a subsidiary of PT Wijaya Karya (Persero) Tbk.", "currency": "IDR", "sector": "Basic Materials", "industry": "Building Materials", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta"}, "ZINC.JK": {"short_name": "Kapuas Prima Coal Tbk.", "long_name": "PT Kapuas Prima Coal Tbk", "summary": "PT Kapuas Prima Coal Tbk engages in the mining and trading businesses in Indonesia. The company primarily mines iron ore and galena; and produces zinc, lead, and silver ores. Its mining concession area comprises 5,569 hectares. The company was founded in 2005 and is headquartered in Jakarta Utara, Indonesia. PT Kapuas Prima Coal Tbk is a subsidiary of PT Sarana Inti Selaras.", "currency": "IDR", "sector": "Basic Materials", "industry": "Other Industrial Metals & Mining", "exchange": "JKT", "market": "id_market", "country": "Indonesia", "city": "Jakarta Utara"}}