{
    "BISI.JK": {
        "short_name": "BISI International Tbk.",
        "long_name": "PT BISI International Tbk",
        "summary": "PT BISI International Tbk, together with its subsidiaries, produces and sells hybrid seeds for field crops and horticulture plants in Indonesia. It operates through Corn, Vegetable and Fruit, Paddy, Pesticides and Fertilizers, and Others segments. The company offers hybrid corn and paddy seeds; horticulture seeds for vegetables and fruits, such as sweet corn, peppers, cucumbers, bitter gourd, cabbage, seedless, watermelon, tomatoes, broccoli, and cauliflower; and agricultural productivity inputs, which include pesticides, herbicides, fungicides, and fertilizers. It also engages in wholesale trading of fruits, vegetables, paddy and field crops, and seeds. The company was formerly known as PT Benihinti Suburintani and changed its name to PT BISI International Tbk in October 2006. PT BISI International Tbk was founded in 1983 and is headquartered in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61257",
        "website": "http://www.bisi.co.id",
        "market_cap": "Large Cap"
    },
    "NPGF.JK": {
        "short_name": "Nusa Palapa Gemilang Tbk.",
        "long_name": "PT Nusa Palapa Gemilang Tbk",
        "summary": "PT Nusa Palapa Gemilang Tbk produces and sells granule NPK fertilizers and granule micro fertilizers in Indonesia. The company was founded in 2001 and is headquartered in Sidoarjo, Indonesia.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": null,
        "website": "http://www.ptnpg.com",
        "market_cap": "Large Cap"
    },
    "SAMF.JK": {
        "short_name": "Saraswanti Anugerah Makmur Tbk.",
        "long_name": "PT Saraswanti Anugerah Makmur, Tbk",
        "summary": "PT Saraswanti Anugerah Makmur, Tbk, together with its subsidiaries, engages in the production and distribution of non-subsidized NPK Fertilizers. The company retails various fertilizers and pest eradication products, such as single artificial, compound and mixed, and natural fertilizers; and insecticides, fungicides, rodenticides, herbicides, nematicides, and akarisida. It is also involved in business brokerage activities that regulate the buying and selling of small and medium scale businesses, including professional practice, patent brokerage activities, and valuation activities for antiques, jewelry, and others; and account audits and information on goods or cargo rates, quantity measurement activities, and weather forecasting activities. In addition, the company engages in management and consulting activities that comprise strategic and organizational planning; financial decisions; marketing objectives and policies; human resource planning, practices, and policies; and production scheduling and control planning. It offers its fertilizer products under the FERTINDO, PUPINDO, PHONIKA, PLANTA PLUS, CORNALET, HALEI, PUKALET, KOKA, and PALMO brands. The company was founded in 1998 and is headquartered in Sidoarjo, Indonesia. PT Saraswanti Anugerah Makmur, Tbk is a subsidiary of PT Saraswanti Utama.",
        "currency": "IDR",
        "sector": "Basic Materials",
        "industry": "Agricultural Inputs",
        "exchange": "JKT",
        "market": "id_market",
        "country": "Indonesia",
        "state": null,
        "city": "Sidoarjo",
        "zipcode": "61382",
        "website": "http://www.saraswantifertilizer.com",
        "market_cap": "Large Cap"
    }
}