{
    "002174.SZ": {
        "short_name": "YOUZU INTERACTIVE",
        "long_name": "YOOZOO Games Co., Ltd.",
        "summary": "YOOZOO Games Co., Ltd. engages in the development, distribution, publishing, and operation of mobile and Internet games. Its browser-based games include The Legend of the Condor Heroes, Touken Ranbu-online, The Lost Tomb, League of Angels and League of Angels II, The Great Emperor, The General, and Thirty-Six Straragems. The company also offers mobile games, such as The Advisors Alliance, Junior Monkey King, Legacy of Discord-Furious Wings, Junior Three Kingdoms, The Great Emperor-online, Super Fighter, League of Angels, and Kongfu Fantasy, as well as Mob, a mobile developer platform. YOOZOO Games Co., Ltd. was founded in 2009 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "002354.SZ": {
        "short_name": "DALIAN ZEUS ENTERT",
        "long_name": "Dalian Zeus Entertainment Co., Ltd.",
        "summary": "Dalian Zeus Entertainment Co., Ltd. develops and publishes games for mobile devices, PCs, and consoles. It is also involved in the Internet advertising, iOS app distribution, and film and TV production businesses. The company was founded in 2003 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "002425.SZ": {
        "short_name": "KAISER (CHINA) CUL",
        "long_name": "Kaiser (China) Culture Co., LTD",
        "summary": "Kaiser (China) Culture Co., Ltd operates in the Internet entertainment industry. The company is involved in the intellectual property operations; and research, development, and distribution of mobile games. It also produces and invests in films and television dramas, as well as animations; and invests in Internet culture industry. The company was formerly known as Kaiser (China) Holding Co., Ltd. and changed its name to Kaiser (China) Culture Co., Ltd in September 2016. Kaiser (China) Culture Co., Ltd was founded in 1994 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "002517.SZ": {
        "short_name": "KINGNET NETWORK CO",
        "long_name": "Kingnet Network Co., Ltd.",
        "summary": "Kingnet Network Co., Ltd. engages in the development and operation of Web and mobile games. It operates various Internet platform products, such as XY games for Web games platforms; and XY Apple assistant, an application distribution platform, etc. The company also provides layout planning service for high-tech Internet business. In addition, it offers entertainment products. The company was founded in 2008 and is based in Shanghai, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shanghai"
    },
    "002619.SZ": {
        "short_name": "EGLS CO LTD",
        "long_name": "EGLS Co.,Ltd.",
        "summary": "EGLS Co.,Ltd. develops and operates wireless boutique online games. It is involved in the development, operation, and distribution of mobile games, including video games and game engines. The company was formerly known as Zhejiang Dragon Pipe Manufacturing Co., Ltd. and changed its name to EGLS Co.,Ltd. in August 2017. EGLS Co.,Ltd. was founded in 2001 and is based in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "0302.HK": {
        "short_name": "CMGE",
        "long_name": "CMGE Technology Group Limited",
        "summary": "CMGE Technology Group Limited develops, publishes, and operates IP-based games in the People's Republic of China. It offers games related to cultural products and art works, such as icons or characters from animations, novels, and motion pictures. The company was founded in 2009 and is headquartered in Shenzhen, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "036570.KS": {
        "short_name": "NCsoft",
        "long_name": "Ncsoft Corporation",
        "summary": "Ncsoft Corporation develops and publishes multiplayer online games in South Korea and internationally. The company offers casual games, mobile games, and characters games. Ncsoft Corporation was founded in 1997 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "0434.HK": {
        "short_name": "BOYAA",
        "long_name": "Boyaa Interactive International Limited",
        "summary": "Boyaa Interactive International Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. Its Web-based and mobile games include board games; and casual shooting, casual virtual-pet-raising, 8-Ball Pool, and Mahjong games. As of December 31, 2019, the company had a portfolio of 78 online games in 11 versions of languages. It also provides advisory services relating to online game applications. Boyaa Interactive International Limited was founded in 2004 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "0484.HK": {
        "short_name": "FORGAME",
        "long_name": "Forgame Holdings Limited",
        "summary": "Forgame Holdings Limited, an investment holding company, develops, publishes, and operates webgames, and mobile and virtual reality games in the People's Republic of China and internationally. It operates in two segments, Game Business and Internet Micro-credit Business. The company also operates 91wan, a game publishing platform. In addition, it provides information technology; software development; and internet micro-credit services. The company was founded in 2009 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "0777.HK": {
        "short_name": "NETDRAGON",
        "long_name": "NetDragon Websoft Holdings Limited",
        "summary": "NetDragon Websoft Holdings Limited, an investment holding company, develops online and mobile games in the People's Republic of China, the United States, the United Kingdom, and internationally. It engages in the games design, programming and graphics, and online and mobile games operation; online education and related application business; and mobile solution, products, and marketing businesses. The company's games for kids include JumpStart, School of Dragons, Neopets, World of Madagascar, and Math Blaster; and other games comprise Eudemons Online, Conquer Online, Way of the Five, and Adventure Navigation. It also licenses and services developed games; develops and provides products in augmented reality and computer vision with machine learning technology; sells education hardware and software products; and develops properties. The company was formerly known as NetDragon Websoft Inc. and changed its name to NetDragon Websoft Holdings Limited in June 2016. NetDragon Websoft Holdings Limited was founded in 1999 and is headquartered in Fuzhou, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "0799.HK": {
        "short_name": "IGG",
        "long_name": "IGG Inc",
        "summary": "IGG Inc, an investment holding company, engages in the development and operation of mobile and online games in Asia, North America, Europe, and internationally. The company offers free-to-play mobile, browser, PC, and client-based online games in 24 languages. It also licenses online games; and provides customer support services. The company was founded in 2006 and is headquartered in Singapore.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "08IA.F": {
        "short_name": "IDREAMSKY TECH. DL-,0001",
        "long_name": "iDreamSky Technology Holdings Limited",
        "summary": "iDreamSky Technology Holdings Limited operates as a digital entertainment platform in the game publishing market in China. It primarily publishes third-party licensed games and self-developed games to the game players through various mobile application stores and software Websites, as well as through other game publishers. As of December 31, 2019, the company had a portfolio of 60 games, including 23 RPGs, five matching puzzle games, ten casual competition games, six endless running games, and 16 other games. It also offers digital content services, such as games and animation, as well as online and offline integration of entertainment, and information services, including advertising services. In addition, the company provides financing; culture, sports, and entertainment; Internet information; technology promotion and application; and research, experiment, and development services, as well as investment holding activities, and develops internet and software technology and service. The company was founded in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "0E3.SG": {
        "short_name": "Cherrypick Games S.A. Inhaber-A",
        "long_name": "Cherrypick Games S.A.",
        "summary": "Cherrypick Games S.A. creates and markets games for various gaming platforms worldwide. Its games include My Hospital, Auctioneer, Must Deliver, Sports Hero, TDH New Season, Touchdown Hero, and Double Juggle. The company was founded in 2014 and is headquartered in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "0KY.F": {
        "short_name": "KAYAC INC.",
        "long_name": "KAYAC Inc.",
        "summary": "KAYAC Inc. engages in the game-related business in Japan. It also operates a game community under the name Lobi; Tonamel, a tournament format where organizers manage their tournaments; and Pla-cole, a matching service for couples and wedding planners, as well as provides esports event planning and management, distribution, and production services under the Well Played name. In addition, the company offers home funeral, real estate, and trading services. KAYAC Inc. was founded in 1998 and is headquartered in Kamakura, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kamakura"
    },
    "0NY.F": {
        "short_name": "CODEMASTERS GROUP  LS-,01",
        "long_name": "Codemasters Group Holdings plc",
        "summary": "Codemasters Group Holdings plc, together with its subsidiaries, develops and sells racing games in the United Kingdom, rest of Europe, the United States, Australia, and internationally. The company's game portfolio comprise F1 series, GRID, DiRT Rally 2.0, and ONRUSH. It also offers interactive entertainment software. The company was incorporated in 2007 and is headquartered in Southam, the United Kingdom.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "Southam"
    },
    "0SG.F": {
        "short_name": "ENAD GLOBAL 7 AB",
        "long_name": "Enad Global 7 AB (publ)",
        "summary": "Enad Global 7 AB (publ) develops, markets, publishes, and distributes PC, console and mobile games worldwide. The company was formerly known as Toadman Interactive AB (publ) and changed its name to Enad Global 7 AB (publ) in March 2020. Enad Global 7 AB (publ) was founded in 2013 and is headquartered in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "0YG.SG": {
        "short_name": "Ultimate Games S.A. Inhaber-Akt",
        "long_name": "Ultimate Games S.A.",
        "summary": "Ultimate Games S.A. engages in the production and distribution of games for various platforms worldwide. It provides computer and mobile games, as well as games for consoles through various distribution platforms. The company is based in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "1022.HK": {
        "short_name": "FEIYU",
        "long_name": "Feiyu Technology International Company Ltd.",
        "summary": "Feiyu Technology International Company Ltd., an investment holding company, develops, operates, and distributes mobile, Web, and personal computer games in Mainland China. The company's games portfolio includes Carrot Fantasy, Shen Xian Dao, San Guo Zhi Ren, Super Phantom Cat, Horcrux College, Peace in Chang'an, Kung Fu Da Huang Dou, and Rise of Heroes. As of December 31, 2019, it had approximately 227.2 million cumulative registered users, including 172.1 million users for Web games and 55.1 million users for mobile games; 562.8 million cumulative activated downloads for casual games; and 33.4 million cumulative registered users for HTML5 game. The company was founded in 2009 and is headquartered in Xiamen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xiamen"
    },
    "1119.HK": {
        "short_name": "IDREAMSKY",
        "long_name": "iDreamSky Technology Holdings Limited",
        "summary": "iDreamSky Technology Holdings Limited operates as a digital entertainment platform in the game publishing market in China. It primarily publishes third-party licensed games and self-developed games to the game players through various mobile application stores and software Websites, as well as through other game publishers. As of December 31, 2019, the company had a portfolio of 60 games, including 23 RPGs, five matching puzzle games, ten casual competition games, six endless running games, and 16 other games. It also offers digital content services, such as games and animation, as well as online and offline integration of entertainment, and information services, including advertising services. In addition, the company provides financing; culture, sports, and entertainment; Internet information; technology promotion and application; and research, experiment, and development services, as well as investment holding activities, and develops internet and software technology and service. The company was founded in 2011 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "11C.SG": {
        "short_name": "11 bit studios SA Inhaber-Aktie",
        "long_name": "11 bit studios S.A.",
        "summary": "11 bit studios S.A. develops and sells cross-platform video games worldwide. The company sells its video games through specialized Internet platforms. 11 bit studios S.A. was founded in 2009 and is based in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "181710.KS": {
        "short_name": "NHN",
        "long_name": "NHN Corporation",
        "summary": "NHN Corporation, an IT company, provides gaming, payment, entertainment, IT, and advertisement solutions in South Korea and internationally. It offers PAYCO, a payment service for online and offline stores; and NHN KCP, an integrated e-payment service. The company also provides comico, a Webtoon platform; Bugs, a music portal operating music streaming and online music distribution business; Ticketlink, a concert, culture, and sports ticket booking service; and Doctortour, a travel service that offers various travel packages. In addition, it offers Shop by, an online shopping mall solution, Godomall 5, an e-commerce solution for small and medium sized markets, TOAST, an integrated cloud solution; TOAST Cam, a smart cloud IP camera; TOAST File, a personal cloud service that helps file storage and management; and TOAST Cloud Center, a cloud data center. Further, the company provides NHN ACE, an integrated advertisement and marketing platform; OPEN Ads, a marketing data curation service; More, an onsite marketing solution; I am School, an education management platform; and Pink Diary, a female health care app for Korean society of obstetricians and gynecologists developed based on consultation by doctors. The company was formerly known as NHN Entertainment Corp. and changed its name to NHN Corporation in April 2019. NHN Corporation was founded in 2013 and is headquartered in Seongnam, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seongnam-si"
    },
    "1961.HK": {
        "short_name": "JIU ZUN DIGITAL",
        "long_name": "Jiu Zun Digital Interactive Entertainment Group Holdings Limited",
        "summary": "Jiu Zun Digital Interactive Entertainment Group Holdings Limited operates as a digital entertainment content provider in the People's Republic of China. The company develops and operates mobile games, primarily casual mobile games, as well as multi-player and boutique mobile games. It also distributes digital media content, such as e-magazines, comics, and music. The company was founded in 2011 and is headquartered in Guangzhou, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "1BY.F": {
        "short_name": "BOYAA INTER.INTL DL-00005",
        "long_name": "Boyaa Interactive International Limited",
        "summary": "Boyaa Interactive International Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. Its Web-based and mobile games include board games; and casual shooting, casual virtual-pet-raising, 8-Ball Pool, and Mahjong games. As of December 31, 2019, the company had a portfolio of 78 online games in 11 versions of languages. It also provides advisory services relating to online game applications. Boyaa Interactive International Limited was founded in 2004 and is headquartered in Shenzhen, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "1G9.F": {
        "short_name": "GUMI INC.",
        "long_name": "gumi Inc.",
        "summary": "gumi Inc. provides online games for mobiles in Japan and internationally. It also engages in block chain business; and XR business comprising VR, AR, MR, etc. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2100.HK": {
        "short_name": "BAIOO",
        "long_name": "BAIOO Family Interactive Limited",
        "summary": "BAIOO Family Interactive Limited, an investment holding company, develops and operates children's online entertainment destination and other businesses in the People's Republic of China. The company operates through Online Entertainment Business and Other Businesses segments. It primarily focuses on genres, including female-oriented, pet-raising, and collection games, as well as comic adapted nijigen games. The company's principal products comprise Web-based virtual world, such as Aobi Island, Aola Star, Light of Aoya, and Legend of Aoqi, as well as mobile games comprising Zaowufaze and Helix Waltz. It also operates various online comic series that include Aola Star: Parallel Universe and Shiwuyu. In addition, the company provides online interactive entertainment and education services for children; and software and information technology services, as well as researches and develops computer software. The company was founded in 2009 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "2121.T": {
        "short_name": "MIXI. INC",
        "long_name": "mixi, Inc.",
        "summary": "mixi, Inc. engages in the entertainment and lifestyle businesses in Japan. It offers Monster Strike, Kotodaman, and Monster Strike Stadium gaming applications; TIPSTAR, a freemium online betting app; Chariloto, a keirin and auto race betting ticket sales site; Chiba Jets Funabashi; netkeiba.com, a national horse racing resource; and Weekly Baseball Online, a baseball information site. The company also provides FamilyAlbum, a family photo and video sharing app; minimo, a salon artist booking app; mixi, a social networking service that offers space for friendly communication; KARASTA, a karaoke video community; Find Job!, a job recruitment info site for the IT and web industries; and OKURU, a photo gift service. It also provides employment opportunities for people with disabilities; operates XFLAG stores that offer merchandise from game; organizes events; and produces and sells various goods, as well as manages professional sports team, and businesses related to publicly operated competitions and other services. The company was formerly known as eMecury Co., Ltd. and changed its name to mixi, Inc. in February 2006. mixi, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "251270.KS": {
        "short_name": "Netmarble",
        "long_name": "Netmarble Corporation",
        "summary": "Netmarble Corporation, along with its subsidiaries, develops and publishes online and mobile games in South Korea and internationally. It also engages in apparel, asset management, real estate development, and advertising and marketing businesses. The company was founded in 2000 and is based in Seoul, South Korea.",
        "currency": "KRW",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "KSC",
        "market": "kr_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "2AK.F": {
        "short_name": "SPIFFBET AB",
        "long_name": "Spiffbet AB",
        "summary": "Spiffbet AB engages in the development of games and platforms in Sweden. The company was founded in 2011 and is headquartered in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "2AV.F": {
        "short_name": "ENTHUSIAST GAMING HLDG",
        "long_name": "Enthusiast Gaming Holdings Inc.",
        "summary": "Enthusiast Gaming Holdings Inc. engages in the media, events, and eSports businesses worldwide. The company's digital media platform includes 100+ gaming related websites and 900 YouTube channels. It also operates Luminosity Gaming, an eSports franchise; owns and operates Enthusiast Gaming Live Expo, a gaming expo; and hosts other gaming events. Enthusiast Gaming Holdings Inc. is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "2B6.F": {
        "short_name": "BAIOO FAMILY INTERACTIVE",
        "long_name": "BAIOO Family Interactive Limited",
        "summary": "BAIOO Family Interactive Limited, an investment holding company, develops and operates children's online entertainment destination and other businesses in the People's Republic of China. The company operates through Online Entertainment Business and Other Businesses segments. It primarily focuses on genres, including female-oriented, pet-raising, and collection games, as well as comic adapted nijigen games. The company's principal products comprise Web-based virtual world, such as Aobi Island, Aola Star, Light of Aoya, and Legend of Aoqi, as well as mobile games comprising Zaowufaze and Helix Waltz. It also operates various online comic series that include Aola Star: Parallel Universe and Shiwuyu. In addition, the company provides online interactive entertainment and education services for children; and software and information technology services, as well as researches and develops computer software. The company was founded in 2009 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "2NY2.F": {
        "short_name": "E-PLAY DIGITAL",
        "long_name": "ePlay Digital Inc.",
        "summary": "ePlay Digital Inc., through its subsidiary, Mobovivo Inc., provides a social game engine and content marketing platform to engage audiences in Canada. Its solutions integrate TV, video, sports, daily fantasy, and social games into multiplatform destinations and campaigns for brands, sports teams, and venues. The company also operates an augmented reality sports, esports, and entertainment game platform. ePlay Digital Inc. is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "2Q0.F": {
        "short_name": "AMPD VENTURES INC",
        "long_name": "AMPD Ventures Inc.",
        "summary": "AMPD Ventures Inc., a technology company, provides cloud and computing solutions to games and digital media companies in Canada and the United States. It offers solutions for video games and eSports, digital media production, big data analysis, collection, and visualization applications. The company also provides AMPD Metal, a bare metal server product; AMPD Gallium, a private cloud product; AMPD Cloud Plus; AMPD Storage solutions; AMPD Virtual Workstation; AMPD Multi-CDN; AMPD Virtual Studio, a suite of solutions and products designed to create the infrastructure-less studio; AMPD Game Hosting; AMPD Studio; and AMPD Remote Render products and solutions. AMPD Ventures Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "2QW.SG": {
        "short_name": "Varsav Game Studios S.A. Inhabe",
        "long_name": "VARSAV Game Studios S.A.",
        "summary": "VARSAV Game Studios S.A. focuses on games and applications development in Poland. The company produces and publishes PC and mobile games, including virtual reality and augmented reality. It also offers advisory services for technological companies. The company was formerly known as Varsav VR S.A. VARSAV Game Studios S.A. is based in Warsaw, Poland. VARSAV Game Studios S.A. is a subsidiary of Varsav SA.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "2XY.F": {
        "short_name": "SCIPLAY CORP. CL.ADL-,001",
        "long_name": "SciPlay Corporation",
        "summary": "SciPlay Corporation develops and publishes digital games on mobile and Web platforms worldwide. The company offers seven games, which include social casino games, such as Jackpot Party Casino, Gold Fish Casino, Hot Shot Casino, and Quick Hit Slots, as well as casual games comprising MONOPOLY Slots, Bingo Showdown, and 88 Fortunes Slots. Its social casino games include slots-style game play, as well as table games-style game play; and casual games blend slots-style or bingo game play with adventure game features. The company was formerly known as SG Social Games Corporation and changed its name to SciPlay Corporation in March 2019. SciPlay Corporation was founded in 1997 and is based in Las Vegas, Nevada. SciPlay Corporation is a subsidiary of Scientific Games Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "2XY.SG": {
        "short_name": "SciPlay Corp. Registered Shs Cl",
        "long_name": "SciPlay Corporation",
        "summary": "SciPlay Corporation develops and publishes digital games on mobile and Web platforms worldwide. The company offers seven games, which include social casino games, such as Jackpot Party Casino, Gold Fish Casino, Hot Shot Casino, and Quick Hit Slots, as well as casual games comprising MONOPOLY Slots, Bingo Showdown, and 88 Fortunes Slots. Its social casino games include slots-style game play, as well as table games-style game play; and casual games blend slots-style or bingo game play with adventure game features. The company was formerly known as SG Social Games Corporation and changed its name to SciPlay Corporation in March 2019. SciPlay Corporation was founded in 1997 and is based in Las Vegas, Nevada. SciPlay Corporation is a subsidiary of Scientific Games Corporation.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "300113.SZ": {
        "short_name": "HANGZHOU SHUNWANG",
        "long_name": "Hangzhou Shunwang Technology Co,Ltd",
        "summary": "Hangzhou Shunwang Technology Co,Ltd provides Internet bar platform services in China. It develops gaming tournament platform for game players and Internet bar, as well as offers marketing services to Internet-based game companies. The company was founded in 2005 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "300315.SZ": {
        "short_name": "OURPALM CO LTD",
        "long_name": "Ourpalm Co., Ltd.",
        "summary": "Ourpalm Co., Ltd. develops, publishes, and operates smart mobile and social Web games, and Websites. It also engages in the TV, film, and music production, as well as celebrity representation activities. The company was founded in 2004 and is headquartered in Beijing, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300418.SZ": {
        "short_name": "BEIJING KUNLUN TEC",
        "long_name": "Beijing Kunlun Tech Co., Ltd.",
        "summary": "Beijing Kunlun Tech Co., Ltd. engages in the research, development, and distribution of mobile game platform in China and internationally. It also operates software store. The company was formerly known as Kunlun Ltd. and changed its name to Beijing Kunlun Tech Co., Ltd. in March 2011. Beijing Kunlun Tech Co., Ltd. was founded in 2008 and is based in Beijing, China. Beijing Kunlun Tech Co., Ltd. is a subsidiary of Beijing Kunlun World Wide Technology Share Co., Ltd.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Beijing"
    },
    "300459.SZ": {
        "short_name": "ZHEJIANG JINKE CUL",
        "long_name": "Zhejiang Jinke Culture Industry Co., LTD.",
        "summary": "Zhejiang Jinke Culture Industry Co., LTD. engages in the production, distribution, and operation of online early-childhood education business in China and internationally. The company primarily develops Talking Tom Cat Family and My Angela mobile applications for parents and children. It also researches, develops, produces, and sells SPC, the oxygen bleaching assistant used in chemical production. The company was formerly known as Zhejiang Jinke Entertainment Culture Co., Ltd. and changed its name to Zhejiang Jinke Culture Industry Co., LTD. in July 2017. Zhejiang Jinke Culture Industry Co., LTD. was founded in 2007 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "300467.SZ": {
        "short_name": "SICHUAN XUN YOU NE",
        "long_name": "Sichuan Xunyou Network Technology Co., Ltd.",
        "summary": "Sichuan Xunyou Network Technology Co., Ltd. develops and provides online games in China. It offers online games solving the problems of online game card machine, dropped calls, delay, login, and other issues. The company was founded in 2006 and is headquartered in Chengdu, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Chengdu"
    },
    "300533.SZ": {
        "short_name": "SHENZHEN BINGCHUAN",
        "long_name": "Shenzhen Bingchuan Network Co.,Ltd.",
        "summary": "Shenzhen Bingchuan Network Co.,Ltd. operates as an online gaming company in China, Hong Kong, Taiwan, Malaysia, Vietnam, Thailand, Singapore, Japan, South Korea, Australia, and internationally. It develops games, such as Longwu and Expedition mobile games, Titan, Guigu and Shadow Warriors, expedition, Long Wu, and Undefeated legend. The company was founded in 2008 and is based in Shenzhen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": "Shenzhen"
    },
    "3635.T": {
        "short_name": "KOEI TECMO HOLDINGS CO LTD",
        "long_name": "Koei Tecmo Holdings Co., Ltd.",
        "summary": "Koei Tecmo Holdings Co., Ltd., together with its subsidiaries, operates as an entertainment company in Japan, North America, Europe, rest of Asia, and internationally. The company operates through Entertainment, Amusement, and Real Estate segments. The Entertainment segment develops and sells entertainment contents. It offers software for personal computers and gaming consoles. The Amusement segment develops commercial amusements; and manages amusement arcades. The Real Estate segment engages in the operation, management, and lease of real estate properties. It is also involved in the venture capital and other activities. The company was founded in 2009 and is headquartered in Yokohama, Japan. Koei Tecmo Holdings Co., Ltd. is a subsidiary of Koyu Holdings Co., Ltd.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Yokohama"
    },
    "3656.T": {
        "short_name": "KLAB INC",
        "long_name": "KLab Inc.",
        "summary": "KLab Inc., together with its subsidiaries, plans, develops, operates, and publishes online mobile games worldwide. It also supports game development projects by providing full or partial funding for creating games; and provides advice for mobile game development and platforms for game design, as well as offers mobile game software development toolkits and server infrastructure solutions. In addition, the company provides marketing strategies, such as promotional activities, IP acquisition, planning and operations assistance, and support for global launches. KLab Inc. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3659.T": {
        "short_name": "NEXON CO LTD",
        "long_name": "NEXON Co., Ltd.",
        "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3664.T": {
        "short_name": "MOBCAST HLDGS INC",
        "long_name": "Mobcast Holdings Inc.",
        "summary": "Mobcast Holdings Inc., together with its subsidiaries, engages in gaming business in Japan and internationally. It operates game platform under the Mobcast brand name. The company engages in the production business of games and digital contents; and cooking contents business, such as kitchen miscellaneous good and restaurant management. It also offers internet related services, system development, and web design services; and investment, merger and acquisition, advisory, and fund management contracts services. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3667.T": {
        "short_name": "ENISH INC",
        "long_name": "enish,inc.",
        "summary": "enish,inc. plans, develops, and manages social application games in Japan. The company was founded in 2009 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3672.T": {
        "short_name": "ALTPLUSINC",
        "long_name": "AltPlus Inc.",
        "summary": "AltPlus Inc. engages in the planning, development, and direction of social games. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3686.T": {
        "short_name": "DLE INC",
        "long_name": "DLE Inc.",
        "summary": "DLE Inc. engages in the entertainment business in Japan. The company's activities include animation, live entertainment, music, mobile app and game development, and event planning; production management, concept designing, and other activities; and marketing solutions. It is also involved in the movies and television, and fashion businesses; and operation of in-house studios. The company was formerly known as Pasania, Ltd. and changed its name to DLE Inc. in October 2003. DLE Inc. was founded in 2001 and is based in Tokyo, Japan. DLE Inc. operates as a subsidiary of Asahi Broadcasting Group Holdings Corporation.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3758.T": {
        "short_name": "AERIA INC",
        "long_name": "Aeria Inc.",
        "summary": "Aeria Inc. offers content and information technology services. It operates through IT Service, Content, and Asset Management segments. The company develops, distributes, and operates games for smartphones and tablets; offers data services; and rents and sells real estate properties, as well as invests in companies. The company was founded in 2002 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3760.T": {
        "short_name": "CAVE INTERACTIVE CO LTD",
        "long_name": "CAVE Interactive CO.,LTD.",
        "summary": "CAVE Interactive CO.,LTD. develops content for media and entertainment industries in Japan. It is involved in developing social games and social media applications; planning, developing, and managing online services and games; performing project planning and system development for mobile information services; and developing commercial arcade and home console-oriented games. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3765.T": {
        "short_name": "GUNGHO ONLINE ENTERTAINMENT",
        "long_name": "GungHo Online Entertainment, Inc.",
        "summary": "GungHo Online Entertainment, Inc. plans, develops, operates, and distributes online computer games, smartphone applications, and console games. The company was formerly known as ONSale Co., Ltd. and changed its name to GungHo Online Entertainment, Inc. in August 2002. GungHo Online Entertainment, Inc. was founded in 1998 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3793.T": {
        "short_name": "DRECOM CO.LTD",
        "long_name": "Drecom Co.,Ltd.",
        "summary": "Drecom Co.,Ltd. plans and develops content for smartphones in Japan. It engages in games and media business. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3798.HK": {
        "short_name": "HOMELAND ITL",
        "long_name": "Homeland Interactive Technology Ltd.",
        "summary": "Homeland Interactive Technology Ltd. engages in the development and operation of mobile games in the People's Republic of China. Its game portfolio consists of categories of games, such as mahjong, poker, and casual games. The company also distributes third-party mobile games. Homeland Interactive Technology Ltd. was founded in 2009 and is headquartered in Xiamen, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Xiamen"
    },
    "3851.T": {
        "short_name": "NIPPON ICHI SOFTWARE INC.",
        "long_name": "Nippon Ichi Software, Inc.",
        "summary": "Nippon Ichi Software, Inc. develops and sells computer software in Japan, other Asian countries, North America, and Europe. It develops software for consumer and handheld game machines, mobiles, smart phones, arcades, and web; and produces content of various genres. The company was founded in 1993 and is headquartered in Kakamigahara, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kakamigahara"
    },
    "3903.T": {
        "short_name": "GUMI INC",
        "long_name": "gumi Inc.",
        "summary": "gumi Inc. provides online games for mobiles in Japan and internationally. It also engages in block chain business; and XR business comprising VR, AR, MR, etc. The company was founded in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3904.T": {
        "short_name": "KAYAK INC",
        "long_name": "KAYAC Inc.",
        "summary": "KAYAC Inc. develops social network games in Japan. It also operates a game community under the name Lobi; and Tonamel, a tournament format where organizers manage their tournaments; Pla-cole, a matching service for couples and wedding planners, as well as provides esports event planning and management, distribution, and production services under the Well Played name. In addition, the company offers home funeral and real estate services. KAYAC Inc. was founded in 1998 and is headquartered in Kamakura, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kamakura"
    },
    "3911.T": {
        "short_name": "AIMING INC",
        "long_name": "Aiming Inc.",
        "summary": "Aiming Inc. engages in the production and development of online games for PCs, browsers, smartphones, home consoles, and mobile phones in Japan. The company was founded in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3928.T": {
        "short_name": "MYNET INC",
        "long_name": "Mynet Inc.",
        "summary": "Mynet Inc. provides game services in Japan. The company engages in redesigning of game, developing new functions, creating attractive characters, and improving the communication experience. It also operates CroPro, a mutual customer network for smartphone games; owns a range of high-quality assets; and provides data / AI solutions, such as Optim Robo, a marketing AI service that promotes customer acquisition and royal customerization for long-term service operation. The company was incorporated in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3932.T": {
        "short_name": "AKATSUKI INC",
        "long_name": "Akatsuki Inc.",
        "summary": "Akatsuki Inc. engages in the mobile game and live experience businesses primarily in Japan. It develops mobiles games. The company also operates Asobuild, an entertainment facility service site; Pong!Pong!, a ping pong table activity and projection mapping service site; Sotoasobi, a service site to provide reservations for outdoor and leisure activities; and Daigomi, a Cheese restaurants. In addition, it provides Crayon, an app development support services to artists, creators, and athletes; a media franchise project of both music and audio drama CDs on themes of Jazz; and operates Kumarba Channel, an education and entertainment channel distributed through YouTube platform. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3935.T": {
        "short_name": "EDIA CO LTD",
        "long_name": "Edia Co., Ltd.",
        "summary": "Edia Co., Ltd. provides game and life entertainment services. It also offers its various solutions for mobile terminals, such as mobile and smart phones, portable game machines, and portable navigation systems. The company was founded in 1999 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3LV.F": {
        "short_name": "LEOVEGAS AB",
        "long_name": "LeoVegas AB (publ)",
        "summary": "LeoVegas AB (publ), a mobile gaming company, engages in the mobile casino business in Nordic countries, rest of Europe, and internationally. It offers casino games, such as slots, jackpots, and table games, as well as live casinos; poker, bingo, and lotteries; and sports betting. The company also provides its games through tablets and desktop computers. LeoVegas AB (publ) offers approximately 1,500 games from 60 game providers for mobile devices. The company was incorporated in 2010 and is headquartered in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "3ND.F": {
        "short_name": "NETDRAGON WEBS.HLDG.DL-01",
        "long_name": "NetDragon Websoft Holdings Limited",
        "summary": "NetDragon Websoft Holdings Limited, an investment holding company, develops online and mobile games in the People's Republic of China, the United States, the United Kingdom, and internationally. It engages in the games design, programming and graphics, and online and mobile games operation; online education and related application business; and mobile solution, products, and marketing businesses. The company's games for kids include JumpStart, School of Dragons, Neopets, World of Madagascar, and Math Blaster; and other games comprise Eudemons Online, Conquer Online, Way of the Five, and Adventure Navigation. It also licenses and services developed games; develops and provides products in augmented reality and computer vision with machine learning technology; sells education hardware and software products; and develops properties. The company was formerly known as NetDragon Websoft Inc. and changed its name to NetDragon Websoft Holdings Limited in June 2016. NetDragon Websoft Holdings Limited was founded in 1999 and is headquartered in Fuzhou, China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Fuzhou"
    },
    "4334.T": {
        "short_name": "YUKE'S CO LTD",
        "long_name": "YUKE'S Co.,Ltd.",
        "summary": "YUKE'S Co.,Ltd. designs, develops, creates, and distributes gaming software in Japan and internationally. It offers WWE, UFC, pro wrestling, action, and other games for PS4, XBOX ONE, PS3, XBOX 360, Wii, PS2, PSP, DS, arcade, Nintendo Switch, PC, GC, DC, N64, and other platforms. The company was founded in 1993 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sakai"
    },
    "4728.T": {
        "short_name": "TOSE CO LTD",
        "long_name": "Tose Co., Ltd.",
        "summary": "Tose Co., Ltd. plans, develops, and operates home video game software, and mobile and Internet content worldwide. It also develops commercial-use game and pachinko/pachislot machines software; and smartphone games, apps, and Websites; various Web-based business systems, such as operational systems, system apps, and IT infrastructure; and partial commissioned elements that are indispensable for creating video game software, including game backgrounds, graphic designs of characters and others, as well as background music, sound effects, and other audio-related areas. In addition, the company supports for content promotion; sale of programs to local TV stations; license business with local companies, as well as provides content distribution services for smartphones. Further, it engages in the planning, development and operation of network-based content, such as home karaoke music distribution and digital comic distribution. Tose Co., Ltd. was founded in 1979 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "4994.TW": {
        "short_name": "X-LEGEND ENTERTAINMENT CO LTD",
        "long_name": "X-Legend Entertainment Co., Ltd.",
        "summary": "X-Legend Entertainment Co., Ltd., together with its subsidiaries, researches, develops, publishes, operates, markets, and services online and mobile games. The company publishes games in approximately 14 language versions in Taiwan, Hong Kong, Japan, China, North America, Korea, Germany, France, Malaysia, Thailand, Indonesia, Portugal, Spain, Italy, and Russia. It offers multiplayer online role-playing games, casual and puzzle games, and data and software services, as well as engages in international trading business. In addition, the company engages in the manufacture of computer and peripheral devices; wholesale and retail of information software; information software, information processing, electronic information supply, general advertising, and online certification services; intellectual property right business; and management consultation business. X-Legend Entertainment Co., Ltd. was founded in 2002 and is headquartered in Taipei City, Taiwan.",
        "currency": "TWD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "TAI",
        "market": "tw_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "4AW.F": {
        "short_name": "NACON SA EO1",
        "long_name": "Nacon S.A.",
        "summary": "Nacon S.A. designs and distributes gaming accessories in France and internationally. The company offers accessories, including headsets, microphones, controllers, racing wheels, gaming chairs, keyboards, mice, mats, audio accessories, and console accessories. It also develops and publishes video games in various categories, such as action-adventure, racing, sport, and simulation. The company was founded in 2019 and is based in Fretin, France. Nacon S.A. is a subsidiary of BigBen Interactive SA.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Fretin"
    },
    "5ASA.F": {
        "short_name": "ASIASOFT CORP.-NVDR-0,5",
        "long_name": "Asiasoft Corporation Public Company Limited",
        "summary": "Asiasoft Corporation Public Company Limited, together with its subsidiaries, engages in the provision and distribution of online game services in Thailand, Singapore, Malaysia, the Philippines, and internationally. The company operates through two segments: Online Game and Distribution. The Online Game segment provides online game services through Internet using servers. The Distribution segment distributes game products, as well as provides payment channel services. The company publishes the games under the PlayPark brand. It also offers @Cafe, which brings online games to Internet cafe gamers, and offers promotional media and various marketing activities for members; @Cash that is an in-game credits top-up system and helps in payments through multiple channels; and @Key, a security device for online games services. The company was formerly known as B.M. Media (Thailand) Company Limited. Asiasoft Corporation Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "5JJ.SG": {
        "short_name": "Jujubee S.A. Inhaber-Aktien ZY ",
        "long_name": "Jujubee S.A.",
        "summary": "Jujubee S.A. operates as a games development studio in Poland. The company develops games for various platforms, including iOS, Android, Mac, PC, and consoles. It develops games under the Take Off - The Flight Simulator, Realpolitiks, Kursk, Suspect in Sight!, FLASHOUT 2, Suspect: The Run!, FLASHOUT 3D, and Spellcrafter names. The company was founded in 2012 and is based in Katowice, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Katowice"
    },
    "5WF.F": {
        "short_name": "GAMING CORPS AB",
        "long_name": "Gaming Corps AB (publ)",
        "summary": "Gaming Corps AB (publ) develops videogames and interactive entertainment in Sweden. The company was founded in 2013 and is based in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "603258.SS": {
        "short_name": "HANGZHOU ELECTRONIC SOUL NETWOR",
        "long_name": "Hangzhou Electronic Soul Network Technology Co., Ltd.",
        "summary": "Hangzhou Electronic Soul Network Technology Co., Ltd., develops and publishes online and mobile games in Asia. It offers h5 games, VR games, consoles, stand-alone games, and apps platforms, as well as comics and electric competitions. The company was founded in 2008 and is based in Hangzhou, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Hangzhou"
    },
    "6033.T": {
        "short_name": "EXTREME CO LTD",
        "long_name": "Extreme Co.,Ltd.",
        "summary": "Extreme Co.,Ltd. engages in entertainment business in Japan. The company is involved in the provision of B2B solutions; and B2C contents development, including publishing games, localizing games from overseas, and licensing business. It serves financial companies, government offices, communication enterprises, and mobile game publishers. Extreme Co.,Ltd. was founded in 2005 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "603444.SS": {
        "short_name": "G-BITS NETWORK TECHNOLOGY (XIAM",
        "long_name": "G-bits Network Technology (Xiamen) Co., Ltd.",
        "summary": "G-bits Network Technology (Xiamen) Co., Ltd. develops and operates of video games. It offers client, Web, mobile, and VR games. The company was founded in 2004 and is based in Xiamen, China.",
        "currency": "CNY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SHH",
        "market": "cn_market",
        "country": "China",
        "city": "Xiamen"
    },
    "6428.T": {
        "short_name": "OIZUMI CORP",
        "long_name": "OIZUMI Corporation",
        "summary": "OIZUMI Corporation manufactures and sells amusement machines and related devices and equipment in Japan. The company offers pachislot machines, preparatory devices, WICA series products, eco equipment, and medal supply collect products. It also leases and manages real estate properties. The company was founded in 1974 and is headquartered in Atsugi, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Atsugi"
    },
    "6460.T": {
        "short_name": "SEGA SAMMY HLDGS INC",
        "long_name": "Sega Sammy Holdings Inc.",
        "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6552.T": {
        "short_name": "GAMEWITH INC",
        "long_name": "GameWith Inc.",
        "summary": "GameWith Inc. provides game information services in Japan. The company operates GameWith, a service that provides information and functions related to games. It offers game guide, which provides game-playing tips; and game review information to find a new game. The company also provides a community that allows game users to communicate with each other, as well as offers video streaming services. GameWith Inc. was founded in 2013 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "6820.HK": {
        "short_name": "FRIENDTIMES",
        "long_name": "FriendTimes Inc.",
        "summary": "FriendTimes Inc., through its subsidiaries, develops, publishes, and operates ancient Chinese style female-oriented mobile games in the People's Republic of China and internationally. Its mobile games include Legend of Empress, Fate: Royal Revenge, Royal Chaos, Rise of Queendom, Yokai Kitchen, and other products. FriendTimes Inc. was founded in 2010 and is headquartered in Suzhou, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Suzhou"
    },
    "6860.HK": {
        "short_name": "FINGERTANGO",
        "long_name": "FingerTango Inc.",
        "summary": "FingerTango Inc., an investment holding company, develops, operates, and publishes mobile games in the People's Republic of China. The company publishes and sells simulation mobile games. As of December 31, 2019, it had approximately 167.7 million cumulative registered users. FingerTango Inc. was founded in 2013 and is headquartered in Tianhe, China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Tianhe"
    },
    "6899.HK": {
        "short_name": "OURGAME",
        "long_name": "Ourgame International Holdings Limited",
        "summary": "Ourgame International Holdings Limited, an investment holding company, develops and operates online card and board games in the People's Republic of China and internationally. The company operates through three segments: Lianzhong Group, Peerless Group, and eSports Business. It operates an integrated online game platform that offers personal computer (PC) games and provides services through its PC client portals, such as Ourgame Hall; and distributes mobile games and provides services primarily for Android and iOS operating systems through third-party distribution and payment channels, including mobile operators. The company also provides web games through its ourgame.com website; and hosts games and offers on-going updates and technical support services for the operation of self-developed and licensed games, as well as prevents, detects, and resolves in-game cheating and hacking activities. In addition, it distributes games developed and operated by third-party developers; provides computer related technical support services; offers television production, brand licensing, tour management, and consulting services in Gibraltar; and organizes and broadcasts online to offline mind-sports events, tournaments, TV shows, and contents. Ourgame International Holdings Limited was founded in 1998 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "6BO.SG": {
        "short_name": "Bloober Team S.A. Inhaber-Aktie",
        "long_name": "Bloober Team SA",
        "summary": "Bloober Team SA operates as an independent producer of video games worldwide. It develops games for Sony consoles, including PlayStation Vita and PlayStation 4. The company was founded in 2008 and is based in KrakÃ³w, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "KrakÃ³w"
    },
    "6P5.F": {
        "short_name": "PLAYWAY S.A.  ZY-,10",
        "long_name": "PlayWay S.A.",
        "summary": "PlayWay S.A. produces and publishes PC and mobile video games in Poland, Western Europe, North America, Germany, and internationally. It sells its products through STEAM, AppStore, and GooglePlay platforms. The company was founded in 2011 and is headquartered in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "6P5.SG": {
        "short_name": "PlayWay S.A. Inhaber-Aktien ZY-",
        "long_name": "PlayWay S.A.",
        "summary": "PlayWay S.A. produces and publishes PC and mobile video games in Poland, Western Europe, North America, Germany, and internationally. It sells its products through STEAM, AppStore, and GooglePlay platforms. The company was founded in 2011 and is headquartered in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "6V2.SG": {
        "short_name": "Vivid Games S.A. Inhaber-Aktien",
        "long_name": "Vivid Games S.A.",
        "summary": "Vivid Games S.A. develops and produces mobile games in Europe. The company was founded in 2006 and is headquartered in Bydgoszcz, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Bydgoszcz"
    },
    "7803.T": {
        "short_name": "BUSHIROAD INC",
        "long_name": "Bushiroad Inc.",
        "summary": "Bushiroad Inc. plans, develops, produces, and sells various trading card games in Japan. It also offers online mobile games; plans, produces, and manages music and video content, as well as merchandise. In addition, the company creates and distributes character goods to toy stores, general retailers, and hobby shops; manufactures and sells items for capsule toy vending machines; produces arcade prizes; and operates an e-commerce shop. Further, it edits and publishes Gekkan Bushiroad, a monthly magazine full of comics and TCG information; produces television programs; operates an Internet radio platform; and provides product planning and media agency services. Additionally, the company offers voice actor management services; pro-wrestling entertainment services, as well as management of fan club; and advertisement agency services. Bushiroad Inc. was founded in 2007 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7844.T": {
        "short_name": "MARVELOUS INC",
        "long_name": "Marvelous Inc.",
        "summary": "Marvelous Inc. produces and provides entertainment content in Japan. The company engages in the planning, development, and operation of online games for App stores, Google Play, and SNS platforms, as well as online games for PCs, mobiles, smartphones, tablets, etc.; planning, development, production, and sells of game software for home game consoles; production of content for market needs; and planning, development, operation, and sale of amusement enclosures. It also produces animation products; creates, commercializes, and distributes music and video content; and plans and produces stage-based and musical works based on comics, animation, and games, as well as provides theater entertainment. Marvelous Inc. was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7974.T": {
        "short_name": "NINTENDO CO LTD",
        "long_name": "Nintendo Co., Ltd.",
        "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "7CD.F": {
        "short_name": "CD PROJEKT S.A. C  ZY 1",
        "long_name": "CD Projekt S.A.",
        "summary": "CD Projekt S.A., through its subsidiaries, engages in the development and digital distribution of videogames worldwide. It operates through two segments, CD PROJEKT RED and GOG.com. The company's product portfolio comprises The Witche; The Witcher 2: Assassins of Kings; The Witcher 3: Wild Hunt, Hearts of Stone games, and Blood and Wine; Thronebreaker: The Witcher Tales; Gwent: The Witcher Card game; and Cyberpunk 2077, as well as online multiplayer games. It also distributes digital videogames through online channels directly to individual users; and its games for various hardware platforms using traditional distribution channels and digital distribution platforms. The company exports its products in Europe, North America, South America, Asia, Australia, and Africa. CD Projekt S.A. is headquartered in Warsaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "7CR.F": {
        "short_name": "PLAYGON GAMES INC.",
        "long_name": "Playgon Games Inc.",
        "summary": "Playgon Games Inc. operates in the daily fantasy sports (DFS) industry. The company offers DFS software and network, which enables its licensed customers to offer a customized and branded DFS product to their end users. It serves gaming operators, such as sports books, land-based groups, media companies, big database groups, and others. The company was formerly known as Global Daily Fantasy Sports Inc. and changed its name to Playgon Games Inc. in July 2020. Playgon Games Inc. was incorporated in 1985 and is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "7NX.F": {
        "short_name": "NEXON CO. LTD",
        "long_name": "NEXON Co., Ltd.",
        "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7NX.SG": {
        "short_name": "Nexon Co. Ltd Registered Shares",
        "long_name": "NEXON Co., Ltd.",
        "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7QT.F": {
        "short_name": "AKATSUKI INC.",
        "long_name": "Akatsuki Inc.",
        "summary": "Akatsuki Inc. engages in the mobile game and live experience businesses primarily in Japan. It develops mobiles games. The company also operates Asobuild, an entertainment facility service site; Pong!Pong!, a ping pong table activity and projection mapping service site; Sotoasobi, a service site to provide reservations for outdoor and leisure activities; and Daigomi, a Cheese restaurants. In addition, it provides Crayon, an app development support services to artists, creators, and athletes; a media franchise project of both music and audio drama CDs on themes of Jazz; and operates Kumarba Channel, an education and entertainment channel distributed through YouTube platform. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "7XA.SG": {
        "short_name": "Artifex Mundi S.A. Inhaber-Akti",
        "long_name": "Artifex Mundi S.A.",
        "summary": "Artifex Mundi S.A. develops and publishes video games worldwide. It provides approximately 40 game titles for various platforms, including PC, Mac, iPhone, iPad, Android, Windows, Xbox One, and PlayStation. The company is headquartered in Zabrze, Poland. Artifex Mundi S.A. was formerly a subsidiary of ZSK Progres s.c.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Zabrze"
    },
    "8267.HK": {
        "short_name": "LINEKONG",
        "long_name": "Linekong Interactive Group Co., Ltd.",
        "summary": "Linekong Interactive Group Co., Ltd., an investment holding company, researches, develops, and publishes online games in the People's Republic of China and internationally. It operates through two segments, Game Business and Film Business. The company distributes its self-developed games and licensed games through its own game distribution channels, third-party game distribution channels, payment collection channels, and prepaid game card distributors. It also offers technology consulting and services; and produces and distributes film and television drama series. The company was formerly known as Linekong Interactive Co., Ltd. and changed its name to Linekong Interactive Group Co., Ltd. in June 2015. Linekong Interactive Group Co., Ltd. was founded in 2007 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "8282.HK": {
        "short_name": "GAMEONE",
        "long_name": "Gameone Holdings Limited",
        "summary": "Gameone Holdings Limited, an integrated game developer, develops, operates, publishes, and distributes mobile, online PC, and web games in Hong Kong, the People's Republic of China, and Taiwan. It serves game players. The company was founded in 1999 and is headquartered in North Point, Hong Kong.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "Hong Kong",
        "city": "North Point"
    },
    "8FE.SG": {
        "short_name": "Forever Entertainment S.A. Inha",
        "long_name": "Forever Entertainment S.A.",
        "summary": "Forever Entertainment S.A. produces and publishes video games in Poland and internationally. The company publishes its games in Nintendo Switch, PC, Xbox One, Playstation 4, PS Vita, Nintendo 3DS, iOS, and Android. Forever Entertainment S.A. was founded in 2010 and is based in Gdynia, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Gdynia"
    },
    "8LG.F": {
        "short_name": "SUPER LEAGUE GAMING -,001",
        "long_name": "Super League Gaming, Inc.",
        "summary": "Super League Gaming, Inc. operates an amateur esports content network. The company engages in capturing, generating, aggregating, and distributing content in various esports through social media, live streaming, and video-on-demand, as well as continuous gameplay and leaderboards. It offers Framerate, an independent social video esports network with user-generated reels; and Minehut, a social and gameplay forum for the avid Minecraft community. The company was formerly known as Nth Games, Inc. and changed its name to Super League Gaming, Inc. in June 2015. Super League Gaming, Inc. was incorporated in 2014 and is based in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "8LG.MU": {
        "short_name": "SUPER LEAGUE GAMING -,001",
        "long_name": "Super League Gaming, Inc.",
        "summary": "Super League Gaming, Inc. operates an amateur esports content network. The company engages in capturing, generating, aggregating, and distributing content in various esports through social media, live streaming, and video-on-demand, as well as continuous gameplay and leaderboards. It offers Framerate, an independent social video esports network with user-generated reels; and Minehut, a social and gameplay forum for the avid Minecraft community. The company was formerly known as Nth Games, Inc. and changed its name to Super League Gaming, Inc. in June 2015. Super League Gaming, Inc. was incorporated in 2014 and is based in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "9684.T": {
        "short_name": "SQUARE ENIX HOLDINGS CO.LTD.",
        "long_name": "Square Enix Holdings Co., Ltd.",
        "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9697.T": {
        "short_name": "CAPCOM CO LTD",
        "long_name": "Capcom Co., Ltd.",
        "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "9766.T": {
        "short_name": "KONAMI HOLDINGS CORPORATION",
        "long_name": "Konami Holdings Corporation",
        "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "9990.HK": {
        "short_name": "ARCHOSAUR GAMES",
        "long_name": "Archosaur Games Inc.",
        "summary": "Archosaur Games Inc., an investment holding company, engages in the development and operation of mobile games in the People's Republic of China and internationally. The company operates Development and Licensing, and Integrated Game Publishing and Operation segments. It primarily focuses on the development of massively multiplayer online role-playing games. The company was founded in 1997 and is headquartered in Beijing, the People's Republic of China.",
        "currency": "HKD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HKG",
        "market": "hk_market",
        "country": "China",
        "city": "Beijing"
    },
    "ADTR": {
        "short_name": "ALLIANCE MEDIA HLDGS INC",
        "long_name": "Alliance Media Holdings Inc.",
        "summary": "Alliance Media Holdings Inc., an integrated video game company, publishes and distributes video game consoles, peripherals, accessories, and software in the United States. The company operates through three divisions: Distribution and Re-Manufacturing, Publishing, and Development. The Distribution and Re-Manufacturing division engages in the wholesale distribution of video games, hardware, and accessories; and re-manufacturing activities. The Publishing division publishes original games, as well as third-party games on PC/Mac, mobile, and console platforms. The Development division develops games. The company was formerly known as Alliance Distributors Holding Inc. and changed its name to Alliance Media Holdings Inc. in June 2015. Alliance Media Holdings Inc. was founded in 2003 and is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "ADVBOX.ST": {
        "short_name": "Adventure Box Technology AB",
        "long_name": "Adventure Box Technology AB (publ)",
        "summary": "Adventure Box Technology AB (publ) develops a platform that allows users to create, share, and play computer games online. It engages in the development, operation, and marketing of the Adventure Box platform; and provision of licensing and consulting services. The company was founded in 2014 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "AIM.F": {
        "short_name": "AIMING INC.",
        "long_name": "Aiming Inc.",
        "summary": "Aiming Inc. engages in the production and development of online games for PCs, browsers, smartphones, home consoles, and mobile phones in Japan. The company was founded in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "AIY.F": {
        "short_name": "ACTIVISION BLIZZARD INC.",
        "long_name": "Activision Blizzard, Inc.",
        "summary": "Activision Blizzard, Inc., together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offer downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it operate esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. Activision Blizzard, Inc. was incorporated in 1979 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "AKAFF": {
        "short_name": "AKATSUKI INC",
        "long_name": "Akatsuki Inc.",
        "summary": "Akatsuki Inc. engages in the mobile game and live experience businesses primarily in Japan. It develops mobiles games. The company also operates Asobuild, an entertainment facility service site; Pong!Pong!, a ping pong table activity and projection mapping service site; Sotoasobi, a service site to provide reservations for outdoor and leisure activities; and Daigomi, a Cheese restaurants. In addition, it provides Crayon, an app development support services to artists, creators, and athletes; a media franchise project of both music and audio drama CDs on themes of Jazz; and operates Kumarba Channel, an education and entertainment channel distributed through YouTube platform. The company was founded in 2010 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "ALDNE.PA": {
        "short_name": "DONTNOD",
        "long_name": "Don't Nod Entertainment S.A.",
        "summary": "Don't Nod Entertainment S.A. develops and sells video games worldwide. It offers games in various genres, including adventure, action, and role play for consoles, PCs, smartphones, tablets, Mac, and TVs. The company was founded in 2008 and is based in Paris, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "ALFOC.PA": {
        "short_name": "FOCUS HOME INT",
        "long_name": "Focus Home Interactive Société anonyme",
        "summary": "Focus Home Interactive SociÃ©tÃ© Anonyme publishes and distributes games worldwide. It offers games for various platforms and consoles, such as PS4, XBOX ONE, PS3, XBOX 360, MAC, NINTENDO DS/3DS, PS VITA/PSP, IPHONE/IPAD, and LINUX, as well as for use in PCs. The company distributes its titles through stores, as well as through the downloading platforms. Focus Home Interactive SociÃ©tÃ© Anonyme was founded in 1996 and is based in Paris, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "AMPD.CN": {
        "short_name": "AMPDVent",
        "long_name": "AMPD Ventures Inc.",
        "summary": "AMPD Ventures Inc., a technology company, provides cloud and computing solutions to games and digital media companies in Canada and the United States. It offers solutions for video games and eSports, digital media production, big data analysis, collection, and visualization applications. The company also provides AMPD Metal, a bare metal server product; AMPD Gallium, a private cloud product; AMPD Cloud Plus; AMPD Storage solutions; AMPD Virtual Workstation; AMPD Multi-CDN; AMPD Virtual Studio, a suite of solutions and products designed to create the infrastructure-less studio; AMPD Game Hosting; AMPD Studio; and AMPD Remote Render products and solutions. AMPD Ventures Inc. is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "ARLUF": {
        "short_name": "ARISTOCRAT LEISURE",
        "long_name": "Aristocrat Leisure Limited",
        "summary": "Aristocrat Leisure Limited, together with its subsidiaries, engages in the development, assembly, sale, distribution, and servicing of games and systems in the Americas, Australia, New Zealand, and internationally. The company offers gaming content; and platforms and systems, including electronic gaming machines, digital social games, and casino management systems, as well as social web and mobile gaming services. It also provides cabinets and gaming products. Aristocrat Leisure Limited was incorporated in 1984 and is based in North Ryde, Australia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "North Ryde"
    },
    "AS-R.BK": {
        "short_name": "ASIASOFT CORPORATION PUBLIC COM",
        "long_name": "Asiasoft Corporation Public Company Limited",
        "summary": "Asiasoft Corporation Public Company Limited, together with its subsidiaries, engages in the provision and distribution of online game services in Thailand, Singapore, Malaysia, the Philippines, and internationally. The company operates through two segments: Online Game and Distribution. The Online Game segment provides online game services through Internet using servers. The Distribution segment distributes game products, as well as provides payment channel services. The company publishes the games under the PlayPark brand. It also offers @Cafe, which brings online games to Internet cafe gamers, and offers promotional media and various marketing activities for members; @Cash that is an in-game credits top-up system and helps in payments through multiple channels; and @Key, a security device for online games services. The company was formerly known as B.M. Media (Thailand) Company Limited. Asiasoft Corporation Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "AS.BK": {
        "short_name": "ASIASOFT CORPORATION PUBLIC COM",
        "long_name": "Asiasoft Corporation Public Company Limited",
        "summary": "Asiasoft Corporation Public Company Limited, together with its subsidiaries, engages in the provision and distribution of online game services in Thailand, Singapore, Malaysia, the Philippines, and internationally. The company operates through two segments: Online Game and Distribution. The Online Game segment provides online game services through Internet using servers. The Distribution segment distributes game products, as well as provides payment channel services. The company publishes the games under the PlayPark brand. It also offers @Cafe, which brings online games to Internet cafe gamers, and offers promotional media and various marketing activities for members; @Cash that is an in-game credits top-up system and helps in payments through multiple channels; and @Key, a security device for online games services. The company was formerly known as B.M. Media (Thailand) Company Limited. Asiasoft Corporation Public Company Limited was founded in 2001 and is headquartered in Bangkok, Thailand.",
        "currency": "THB",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SET",
        "market": "th_market",
        "country": "Thailand",
        "city": "Bangkok"
    },
    "ATA-SDB.ST": {
        "short_name": "Atari SA SDB",
        "long_name": "Atari SA",
        "summary": "Atari SA operates as a multi-platform, interactive entertainment, and licensing products company worldwide. The company offers video games; monetization of games through multiple channels, multimedia production, and licensing activities; regulated online casino games; Atari VCS, the new personal computer (PC), a hybrid system combining a PC and a console-type environment; and Atari Partners, which covers investments in technology companies, primarily by licensing the Atari brand and the blockchain activity/Atari Token. It owns and/or manages a portfolio of approximately 200 games and franchises under the Asteroids, Centipede, Missile Command, Pong, and RollerCoaster Tycoon brands. The company was formerly known as Infogrames Entertainment SA and changed its name to Atari SA in May 2009. Atari SA was founded in 1972 and is headquartered in Paris, France.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "France",
        "city": "Paris"
    },
    "ATA.PA": {
        "short_name": "ATARI",
        "long_name": "Atari SA",
        "summary": "Atari SA operates as a multi-platform, interactive entertainment, and licensing products company worldwide. The company offers video games; monetization of games through multiple channels, multimedia production, and licensing activities; regulated online casino games; Atari VCS, the new personal computer (PC), a hybrid system combining a PC and a console-type environment; and Atari Partners, which covers investments in technology companies, primarily by licensing the Atari brand and the blockchain activity/Atari Token. It owns and/or manages a portfolio of approximately 200 games and franchises under the Asteroids, Centipede, Missile Command, Pong, and RollerCoaster Tycoon brands. The company was formerly known as Infogrames Entertainment SA and changed its name to Atari SA in May 2009. Atari SA was founded in 1972 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Paris"
    },
    "ATIG": {
        "short_name": "ATLANTIS INTERNET GROUP CORP",
        "long_name": "Atlantis Internet Group Corp.",
        "summary": "Atlantis Internet Group Corp. creates and develops casino games in the United States and internationally. It offers various gaming products, including online casino games, casino management software, central server systems, and slot machine software, as well as develops gaming networks and land based casinos. The company also distributes gaming equipment. Atlantis Internet Group Corp. was founded in 2000 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "ATVI": {
        "short_name": "Activision Blizzard, Inc",
        "long_name": "Activision Blizzard, Inc.",
        "summary": "Activision Blizzard, Inc., together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offer downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it operate esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. Activision Blizzard, Inc. was incorporated in 1979 and is headquartered in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "ATVI.MX": {
        "short_name": "ACTIVISION BLIZZARD INC",
        "long_name": "Activision Blizzard, Inc.",
        "summary": "Activision Blizzard, Inc., together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offer downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it operate esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. Activision Blizzard, Inc. was incorporated in 1979 and is headquartered in Santa Monica, California.",
        "currency": "MXN",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "ATVI.VI": {
        "short_name": "ACTIVISION BLIZZARD INC",
        "long_name": "Activision Blizzard, Inc.",
        "summary": "Activision Blizzard, Inc., together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offer downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it operate esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. Activision Blizzard, Inc. was incorporated in 1979 and is headquartered in Santa Monica, California.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "ATVI34.SA": {
        "short_name": "ACTIVISION  DRN",
        "long_name": "Activision Blizzard, Inc.",
        "summary": "Activision Blizzard, Inc., together with its subsidiaries, develops and distributes content and services on video game consoles, personal computers (PC), and mobile devices in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through three segments: Activision Publishing, Inc.; Blizzard Entertainment, Inc.; and King Digital Entertainment. It develops, publishes, and sells interactive software products and entertainment content for the console and PC platforms through retail and digital channels, including subscription, full-game, and in-game sales, as well as by licensing software to third-party or related-party companies; and offer downloadable content. The company also maintains a proprietary online gaming service, Battle.net that facilitates the creation of user generated content, digital distribution, and online social connectivity in its games; and develops and publishes interactive entertainment content and services primarily on mobile platforms, such as Android and iOS, as well as distributes its content and services on the PC platform primarily through Facebook. In addition, it operate esports leagues and offer digital advertising content; and provides warehousing, logistics, and sales distribution services to third-party publishers of interactive entertainment software, as well as manufacturers of interactive entertainment hardware products. The company's key product franchises include Call of Duty, World of Warcraft, Diablo, Hearthstone, Overwatch, and Candy Crush. It serves retailers and distributors, including mass-market retailers, first party digital storefronts, consumer electronics stores, discount warehouses, and game specialty stores through third-party distribution and licensing arrangements. Activision Blizzard, Inc. was incorporated in 1979 and is headquartered in Santa Monica, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "AVID": {
        "short_name": "Avid Technology, Inc.",
        "long_name": "Avid Technology, Inc.",
        "summary": "Avid Technology, Inc. develops, markets, sells, and supports software and integrated solutions for video and audio content creation, management, and distribution worldwide. The company's video products and solutions include the Media Composer, a cloud-enabled solution used to edit video content; NEXIS shared storage systems; Maestro solutions for the integration of virtual sets, augmented reality, and video wall control into existing workflows; AirSpeed 5000 and AirSpeed 5500 on-air server solutions; and MediaCentral, a media production suite. Its audio products and solutions comprise Pro Tools digital audio software solutions to facilitate the audio production process; Sibelius solution to create, edit, and publish musical scores; S6 line of complementary control surfaces and consoles; S1 and S4 audio control surfaces; and VENUE | S6L live sound system for mixing audio for live sound reinforcement. The company also provides Avid Link, a mobile application to connect with other artists, producers, mixers, composers, editors, videographers, movie makers, and graphic designers; FastServe video server that assists broadcasters in making the move to UHD and IP based workflows with a new and modular architecture; and hardware products, such as I/O devices, interfaces, and audio and video processing equipment. In addition, it offers various service contracts and support plans; professional services, such as workflow design and consulting, program and project management, system installation and commissioning, and custom development and role-based product level training; and public and private training to customers and alliance partners, as well as develops and licenses curriculum content for use by third party Avid Learning partners to deliver training to customers, users, and alliance partners. The company was incorporated in 1987 and is headquartered in Burlington, Massachusetts.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Burlington"
    },
    "AXNVF": {
        "short_name": "AXION VENTURES INC",
        "long_name": "Axion Ventures Inc.",
        "summary": "Axion Ventures Inc., an investment issuer, primarily focuses on investments in the online video gaming sector and other information technology sectors. The company is involved in the provision of game development, game design, and licensing of published games and software; and development of digital insurance products. It also provides fintech consulting services; and training classes of game design. The company is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BCDMF": {
        "short_name": "KUUHUBB INC",
        "long_name": "Kuuhubb Inc.",
        "summary": "Kuuhubb Inc., through its subsidiaries, operates as a mobile game development and publishing company. It creates games and applications for female audience with a focus on relaxation, expression, and entertainment segments. The company offers Recolor, a digital coloring book application. It also develops Neybers, an interior design game application; My Hospital, a simulation game application; Dance Talent, a mobile game application; and Tiles & Tales game in a new story-based format. Kuuhubb Inc. markets its products through various third-party platforms. The company was formerly known as Delrand Resources Limited and changed its name to KuuHubb Inc. in June 2017. Kuuhubb Inc. is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "BETS.CN": {
        "short_name": "i3Interactive",
        "long_name": "i3 Interactive Inc.",
        "summary": "i3 Interactive Inc. engages in the development and provision of online and mobile sports mobile sports betting products. It offers BlitzBet, a sportsbook and casino platform; and Line Movement, a personality-driven website focusing on individuals brought on board to place entertainment and information at the forefront of all arms of media. i3 Interactive Inc. is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BHAT": {
        "short_name": "Blue Hat Interactive Entertainm",
        "long_name": "Fujian Blue Hat Interactive Entertainment Technology Ltd.",
        "summary": "Fujian Blue Hat Interactive Entertainment Technology Ltd. designs, produces, promotes, and sells animated toys with mobile games features, intellectual property, and peripheral derivatives features worldwide. Fujian Blue Hat Interactive Entertainment Technology Ltd. was incorporated in 2010 and is based in Xiamen, China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NCM",
        "market": "us_market",
        "country": "China",
        "city": "Xiamen"
    },
    "BIDS.L": {
        "short_name": "BIDSTACK GROUP PLC ORD 0.5P",
        "long_name": "Bidstack Group Plc",
        "summary": "Bidstack Group Plc, together with its subsidiaries, operates as an advertising technology company in the United Kingdom. It provides dynamic, targeted, and automated native in-game advertising for the global video games industry across multiple platforms, including mobile, PC, and console. The company also offers content security and assurance services to cross platform advertisers. It serves game publishers, owners, developers, advertising agencies, brands, and programmatic advertising platforms. The company is based in London, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "BILI": {
        "short_name": "Bilibili Inc.",
        "long_name": "Bilibili Inc.",
        "summary": "Bilibili Inc. provides online entertainment services for the young generations in the People's Republic of China. It offers a platform that covers a range of genres and media formats, including videos, live broadcasting, and mobile games. Bilibili Inc. has a strategic collaboration agreement with Tencent Holdings Limited for sharing and operating existing and additional anime and games on its platform in China. The company was founded in 2009 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "BLITF": {
        "short_name": "I3 INTERACTIVE INC",
        "long_name": "i3 Interactive Inc.",
        "summary": "i3 Interactive Inc. engages in the development and provision of online and mobile sports mobile sports betting products. It offers BlitzBet, a sportsbook and casino platform; and Line Movement, a personality-driven website focusing on individuals brought on board to place entertainment and information at the forefront of all arms of media. i3 Interactive Inc. is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BLKCF": {
        "short_name": "GLOBAL GAMING TECHNOLOGIES CORP",
        "long_name": "Global Gaming Technologies Corp.",
        "summary": "Global Gaming Technologies Corp., a gaming industry holding company, engages in the eSports, mobile and console games, and digital interactive entertainment businesses. It publishes mobile games; offers St. Noire, a cinematic board game; and provides Gamesquare, a video game API solution that enables electronic sports games, as well as operates eSports betting platform. The company was formerly known as Global Blockchain Technologies Corp. and changed its name to Global Gaming Technologies Corp. in February 2019. Global Gaming Technologies Corp. was incorporated in 2010 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BMVB.F": {
        "short_name": "VERSUS SYS INC.",
        "long_name": "Versus Systems Inc.",
        "summary": "Versus Systems Inc. operates a business-to-business software platform that allows video game publishers and developers to offer prize-based matches of their games to their players in Canada and the United States. The company is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BP.V": {
        "short_name": "BACKSTAGEPLAY INC",
        "long_name": "Backstageplay Inc.",
        "summary": "Backstageplay Inc., an Internet entertainment and marketing company, engages in online gaming platform business. The company operates backstageplay.com, a gamification platform that connects online gaming operations with artists, their music, virtual goods, and their fans. Its platform enables artist partners to connect with their fans by rewarding participation and game-play activity through virtual goods and prizing. The company was formerly known as Oramericas Corp. and changed its name to Backstageplay Inc. in February 2016. Backstageplay Inc. is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "BRGGF": {
        "short_name": "BRAGG GAMING GROUP INC",
        "long_name": "Bragg Gaming Group Inc.",
        "summary": "Bragg Gaming Group Inc. provides B2B online gaming technology services worldwide. It offers turnkey solution, including an omni-channel retail, online, and mobile iGaming platforms, as well as casino content aggregator, lottery, marketing, and operational services. The company also provides GIVEMESPORT, a Facebook sport publisher; and GIVEMEBET, a sports book. Bragg Gaming Group Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "BUBL.ST": {
        "short_name": "Bublar Group AB",
        "long_name": "Bublar Group AB (publ)",
        "summary": "Bublar Group AB (publ), together with its subsidiaries, operates as an eXtended Reality (XR) technology company. It specializes in augmented reality (AR) and virtual reality (VR). The company offers XR solutions in e-commerce, entertainment, training, and manufacturing. It also offers virtual training, visualization, super power, and real-world platforms; and VR and AR headsets, hand controls, and eye-tracking controls, as well as software for application development. In addition, the company develops location-based AR games; and educational and training programs for airborne surveillance. It serves companies and consumer clusters worldwide. The company was founded in 2015 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "CCOEF": {
        "short_name": "CAPCOM CO LTD",
        "long_name": "Capcom Co., Ltd.",
        "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "CCOEY": {
        "short_name": "CAPCOM CO LTD",
        "long_name": "Capcom Co., Ltd.",
        "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "CDM.L": {
        "short_name": "CODEMASTERS GROUP HOLDINGS PLC ",
        "long_name": "Codemasters Group Holdings plc",
        "summary": "Codemasters Group Holdings plc, together with its subsidiaries, develops and sells racing games in the United Kingdom, rest of Europe, the United States, Australia, and internationally. The company's game portfolio comprise F1 series, GRID, DiRT Rally 2.0, and ONRUSH. It also offers interactive entertainment software. The company was incorporated in 2007 and is headquartered in Southam, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Southam"
    },
    "CLIS": {
        "short_name": "CLICKSTREAM CORPORATION",
        "long_name": "ClickStream Corporation",
        "summary": "ClickStream Corporation focuses on the development and implementation of play synchronized mobile app and digital gaming platform. Its platform, WinQuik is designed to enable its users to have fun, interact, and compete against each other in order to win real money and prizes. WinQuik is in production with shows featuring celebrity hosts Joshua Dobbs, Brian Baldinger, Howie Schwab, Amber Theoharis, Mykel Hawke, and Jordan Andino on sports, survival, entertainment, the Bible, space, food, and others. The company is based in Los Angeles, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Los Angeles"
    },
    "COUV": {
        "short_name": "CORPORATE UNIVERSE INC",
        "long_name": "Corporate Universe, Inc.",
        "summary": "Corporate Universe, Inc. was formerly known as Inicia Incorporated and changed its name to Corporate Universe Inc. in September 2010. Corporate Universe, Inc. is based in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "CPK.F": {
        "short_name": "CAPCOM CO.LTD",
        "long_name": "Capcom Co., Ltd.",
        "summary": "Capcom Co., Ltd. plans, develops, manufactures, sells, and distributes home video games, online games, mobile games, and arcade games in Japan and internationally. It operates through Digital Contents, Arcade Operations, Amusement Equipments, and Other Businesses segments. The Digital Contents segment develops and sells packaged and digital game content for consumer home video game platforms, as well as mobile content and PC online games. The Arcade Operations segment operates Plaza Capcom amusement facilities primarily in commercial complexes, as well as hosts various events. The Amusement Equipments segment is involved in the development, manufacture, and sale of frames and LCD devices for gaming machines, as well as software. The Other Businesses segment publishes walkthrough and strategy guides, as well as game art books; licenses movies, animated television programs, music CDs and merchandise. Capcom Co., Ltd. was founded in 1979 and is headquartered in Osaka, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "DEAL.V": {
        "short_name": "PLAYGON GAMES INC",
        "long_name": "Playgon Games Inc.",
        "summary": "Playgon Games Inc. operates in the daily fantasy sports (DFS) industry. The company offers DFS software and network, which enables its licensed customers to offer a customized and branded DFS product to their end users. It serves gaming operators, such as sports books, land-based groups, media companies, big database groups, and others. The company was formerly known as Global Daily Fantasy Sports Inc. and changed its name to Playgon Games Inc. in July 2020. Playgon Games Inc. was incorporated in 1985 and is based in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "DEP1.F": {
        "short_name": "DEEPMARKIT CORP.",
        "long_name": "DeepMarkit Corp.",
        "summary": "DeepMarkit Corp. develops and operates digital marketing and promotions platform for retailers and other businesses. Its DeepMarkit platform offers a range of promotion products and services that focuses on game driven experiences and supporting various promotion models, such as sweepstakes, giveaways, and contests. The company was formerly known as Challenger Deep Resources Corp. and changed its name to DeepMarkit Corp. in October 2015. DeepMarkit Corp. was incorporated in 2007 and is headquartered in Calgary, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "DIB.MI": {
        "short_name": "DIGITAL BROS",
        "long_name": "Digital Bros S.p.A.",
        "summary": "Digital Bros S.p.A. develops, publishes, distributes, and markets video games in Europe, the Americas, and internationally. It operates through Premium Games, Free to Play, Italian Distribution, and Other activities segment. The Premium Games segment acquires and distributes video games content rights on digital marketplaces, such as Steam, Sony PlayStation Network, Microsoft Xbox Live, Epic Game Store, etc., as well as through an international sales network; and publishes video games under 505 Games brand name. The Free to Play segment develops and publishes video games and applications that are available free of charge on digital marketplaces under the 505 Games Mobile brand name. The Italian Distribution segment purchases and distributes video games under the Halifax brand; and Yu-Gi-Oh! trading card games through newsstand distribution channel in Italy. The Other Activities segment organizes video game training and professional update courses. Digital Bros S.p.A. was founded in 1989 and is based in Milan, Italy.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "MIL",
        "market": "it_market",
        "country": "Italy",
        "city": "Milan"
    },
    "DOZC.F": {
        "short_name": "BACKSTAGEPLAY INC.",
        "long_name": "Backstageplay Inc.",
        "summary": "Backstageplay Inc., an Internet entertainment and marketing company, engages in online gaming platform business. The company operates backstageplay.com, a gamification platform that connects online gaming operations with artists, their music, virtual goods, and their fans. Its platform enables artist partners to connect with their fans by rewarding participation and game-play activity through virtual goods and prizing. The company was formerly known as Oramericas Corp. and changed its name to Backstageplay Inc. in February 2016. Backstageplay Inc. is based in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "E2N.MU": {
        "short_name": "ENDOR AG",
        "long_name": "Endor AG",
        "summary": "Endor AG develops and markets high-end input devices for game consoles and PCs in Germany. The company provides steering wheels and controllers, player mice, pedals, mounts, shifters, and racing products. It sells its products under the Fanatec brand in Asia and Europe through distributors, as well as through its subsidiary in the United States. Endor AG was founded in 1997 and is based in Landshut, Germany.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Germany",
        "city": "Landshut"
    },
    "E2N.SG": {
        "short_name": "ENDOR AG Inhaber-Aktien o.N.",
        "long_name": "Endor AG",
        "summary": "Endor AG develops and markets high-end input devices for game consoles and PCs in Germany. The company provides steering wheels and controllers, player mice, pedals, mounts, shifters, and racing products. It sells its products under the Fanatec brand in Asia and Europe through distributors, as well as through its subsidiary in the United States. Endor AG was founded in 1997 and is based in Landshut, Germany.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Germany",
        "city": "Landshut"
    },
    "EA": {
        "short_name": "Electronic Arts Inc.",
        "long_name": "Electronic Arts Inc.",
        "summary": "Electronic Arts Inc. develops, markets, publishes, and distributes games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. The company develops and publishes games and services across various genres, such as sports, first-person shooter, action, role-playing, and simulation primarily under the Battlefield, The Sims, Apex Legends, Need for Speed, and Plants v. Zombies brands; and license games from others, including FIFA, Madden NFL, and Star Wars brands. It also provides advertising services; and licenses its games to third parties to distribute and host its games. The company markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. It has a strategic partnership with KLab Inc. for game development and operation. Electronic Arts Inc. was founded in 1982 and is headquartered in Redwood City, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Redwood City"
    },
    "EAIN34.SA": {
        "short_name": "ELECTR ARTS DRN",
        "long_name": "Electronic Arts Inc.",
        "summary": "Electronic Arts Inc. develops, markets, publishes, and distributes games, content, and services for game consoles, PCs, mobile phones, and tablets worldwide. The company develops and publishes games and services across various genres, such as sports, first-person shooter, action, role-playing, and simulation primarily under the Battlefield, The Sims, Apex Legends, Need for Speed, and Plants v. Zombies brands; and license games from others, including FIFA, Madden NFL, and Star Wars brands. It also provides advertising services; and licenses its games to third parties to distribute and host its games. The company markets and sells its games and services through digital distribution and retail channels, as well as directly to mass market retailers, specialty stores, and distribution arrangements. It has a strategic partnership with KLab Inc. for game development and operation. Electronic Arts Inc. was founded in 1982 and is headquartered in Redwood City, California.",
        "currency": "BRL",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "SAO",
        "market": "br_market",
        "country": "United States",
        "city": "Redwood City"
    },
    "EARI": {
        "short_name": "ENTERTAINMENT ARTS RESEARCH INC",
        "long_name": "Entertainment Arts Research Inc.",
        "summary": "Entertainment Arts Research Inc., a multimedia company, engages in the multimedia production, instructional design, educational research, and work force education businesses in Georgia. The company develops and produces applications for its virtual reality platform. Entertainment Arts Research, Inc. is based in Atlanta, Georgia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Atlanta"
    },
    "EG7.ST": {
        "short_name": "Enad Global 7 AB",
        "long_name": "Enad Global 7 AB (publ)",
        "summary": "Enad Global 7 AB (publ) develops, markets, publishes, and distributes PC, console and mobile games worldwide. The company was formerly known as Toadman Interactive AB (publ) and changed its name to Enad Global 7 AB (publ) in March 2020. Enad Global 7 AB (publ) was founded in 2013 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "EGLX.TO": {
        "short_name": "ENTHUSIAST GAMING HOLDINGS INC",
        "long_name": "Enthusiast Gaming Holdings Inc.",
        "summary": "Enthusiast Gaming Holdings Inc. engages in the media, events, and eSports businesses worldwide. The company's digital media platform includes 100+ gaming related websites and 900 YouTube channels. It also operates Luminosity Gaming, an eSports franchise; owns and operates Enthusiast Gaming Live Expo, a gaming expo; and hosts other gaming events. Enthusiast Gaming Holdings Inc. is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "TOR",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "EI4.F": {
        "short_name": "SQUARE ENIX HLDGS CO.LTD.",
        "long_name": "Square Enix Holdings Co., Ltd.",
        "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "EMBRAC-B.ST": {
        "short_name": "Embracer Group AB ser. B",
        "long_name": "Embracer Group AB (publ)",
        "summary": "Embracer Group AB (publ), together with its subsidiaries, develops and publishes PC and console games for the gaming market in Europe, the United States, Sweden, and internationally. The company's game catalogue consists of 190 owned franchises, such as Saints Row, Goat Simulator, Dead Island, Darksiders, Metro, MX vs ATV, Kingdoms of Amalur, TimeSplitters, Satisfactory, Wreckfest, Insurgency, World War Z, and others. It also publishes games for various partners. In addition, the company publishes and distributes films. It distributes games through retailers and digital distributors. The company was formerly known as THQ Nordic AB (publ) and changed its name to Embracer Group AB (publ) in October 2019. Embracer Group AB (publ) was incorporated in 1999 and is headquartered in Karlstad, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Karlstad"
    },
    "ENDRF": {
        "short_name": "ENDOR AG",
        "long_name": "Endor AG",
        "summary": "Endor AG develops and markets high-end input devices for game consoles and PCs in Germany. The company provides steering wheels and controllers, player mice, pedals, mounts, shifters, and racing products. It sells its products under the Fanatec brand in Asia and Europe through distributors, as well as through its subsidiary in the United States. Endor AG was founded in 1997 and is based in Landshut, Germany.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Germany",
        "city": "Landshut"
    },
    "ENGMF": {
        "short_name": "ENTHUSIAST GAMING HOLDINGS INC",
        "long_name": "Enthusiast Gaming Holdings Inc.",
        "summary": "Enthusiast Gaming Holdings Inc. engages in the media, events, and eSports businesses worldwide. The company's digital media platform includes 100+ gaming related websites and 900 YouTube channels. It also operates Luminosity Gaming, an eSports franchise; owns and operates Enthusiast Gaming Live Expo, a gaming expo; and hosts other gaming events. Enthusiast Gaming Holdings Inc. is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "EPY.CN": {
        "short_name": "ePlayDigital",
        "long_name": "ePlay Digital Inc.",
        "summary": "ePlay Digital Inc., through its subsidiary, Mobovivo Inc., provides a social game engine and content marketing platform to engage audiences in Canada. Its solutions integrate TV, video, sports, daily fantasy, and social games into multiplatform destinations and campaigns for brands, sports teams, and venues. The company also operates an augmented reality sports, esports, and entertainment game platform. ePlay Digital Inc. is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "EPYFF": {
        "short_name": "E PLAY DIGITAL INC",
        "long_name": "ePlay Digital Inc.",
        "summary": "ePlay Digital Inc., through its subsidiary, Mobovivo Inc., provides a social game engine and content marketing platform to engage audiences in Canada. Its solutions integrate TV, video, sports, daily fantasy, and social games into multiplatform destinations and campaigns for brands, sports teams, and venues. The company also operates an augmented reality sports, esports, and entertainment game platform. ePlay Digital Inc. is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "EQG.V": {
        "short_name": "EQUBE GAMING LIMITED",
        "long_name": "eQube Gaming Limited",
        "summary": "eQube Gaming Limited designs, develops, distributes, licenses, and sells technology-based electronic bingo and social gaming solutions for the gaming markets in Canada, the United States, and Ireland. The company operates through two segments, eBingo and Linked Games. Its products include bingo software, such as event bingo management system, Gecko player interface, session play, Xtra games, virtual flash board, and virtual ball blower; bingo tools; bingo hardware and consumables; and The Tringos. The company serves licensed gaming operators. Its customers include provincial gaming regulators in Canada; tribal operators, the U.S. Army, and other facility operators in the United States; and independent licensed gaming operators in Europe. eQube Gaming Limited is based in Edmonton, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Edmonton"
    },
    "ESH.AX": {
        "short_name": "ESPORTS FPO",
        "long_name": "Esports Mogul Limited",
        "summary": "Esports Mogul Limited engages in the esports media and software business in Australia and Singapore. The company owns and operates the mogul.gg tournament platform, an online esports tournament and matchmaking platform. The company was formerly known as eSports Mogul Asia Pacific Limited and changed its name to Esports Mogul Limited in May 2019. Esports Mogul Limited is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "F51.SG": {
        "short_name": "Farm 51 Group S.A., The Inhaber",
        "long_name": "The Farm 51 Group Spólka Akcyjna",
        "summary": "The Farm 51 Group SpÃ³lka Akcyjna develops computer games and virtual reality applications. It also operates as a licensed developer for Microsoft, Sony, and Apple iOS. The company was founded in 2005 and is based in Gliwice, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Gliwice"
    },
    "FDEV.L": {
        "short_name": "FRONTIER DEVELOPMENTS PLC ORD 0",
        "long_name": "Frontier Developments plc",
        "summary": "Frontier Developments plc develops and publishes video games for personal computers and videogame consoles in the United Kingdom. It develops games across various platforms using its cross platform technology. The company was founded in 1994 and is headquartered in Cambridge, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Cambridge"
    },
    "FH0.F": {
        "short_name": "FORGAME HLDGS LTD DL-0001",
        "long_name": "Forgame Holdings Limited",
        "summary": "Forgame Holdings Limited, an investment holding company, develops, publishes, and operates webgames, and mobile and virtual reality games in the People's Republic of China and internationally. It operates in two segments, Game Business and Internet Micro-credit Business. The company also operates 91wan, a game publishing platform. In addition, it provides information technology; software development; and internet micro-credit services. The company was founded in 2009 and is headquartered in Guangzhou, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Guangzhou"
    },
    "FLEXM.ST": {
        "short_name": "Flexion Mobile Plc",
        "long_name": "Flexion Mobile Plc",
        "summary": "Flexion Mobile Plc operates a distribution platform for third party free-to-play games on the Android market worldwide. It offers global distribution, automated enabling, and full services. The company's global distribution offers platform for android games developers; full service provides enabling, testing, updates, billing, channel management, distribution, compliance customer, and settlement reporting; and automated enabling comprise enabling and enhancement. It also provides distribution channels account management, developer's revenue reconciliation and settlement, and game files enhancement services. The company was founded in 2001 and is headquartered in London, the United Kingdom.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "FRZT": {
        "short_name": "FREEZE TAG INC",
        "long_name": "Freeze Tag, Inc.",
        "summary": "Freeze Tag, Inc. develops and publishes mobile social games for consumers and businesses worldwide. The company markets its products through direct-to-consumer digital storefronts, such as Apple's App Store, the Google Play Store, and Amazon's App Store; and directly through its own Websites, such as freezetag.com and store.freezetag.com. It also publishes titles on other platforms, such as the Facebook App Store and Mac App Store, as well as on PC download portals, such as Big Fish Games and Gamehouse. The company was founded in 2005 and is headquartered in Tustin, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Tustin"
    },
    "FZKA.F": {
        "short_name": "THE9 LTD.ADR/30 DL-,01",
        "long_name": "The9 Limited",
        "summary": "The9 Limited, together with its subsidiaries, operates and develops online games in the People's Republic of China. The company offers online games, including multiplayer online games, mobile games, Web games, and TV games. It also develops mobile games, including CrossFire New Mobile Game and Audition; and provides technical consulting services. The company was formerly known as GameNow.net Limited and changed its name to The9 Limited in February 2004. The9 Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "China",
        "city": "Shanghai"
    },
    "G03.F": {
        "short_name": "GUNGHO ONLINE ENTMT",
        "long_name": "GungHo Online Entertainment, Inc.",
        "summary": "GungHo Online Entertainment, Inc. plans, develops, operates, and distributes online computer games, smartphone applications, and console games. The company was formerly known as ONSale Co., Ltd. and changed its name to GungHo Online Entertainment, Inc. in August 2002. GungHo Online Entertainment, Inc. was founded in 1998 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "GBNW": {
        "short_name": "GLOBAL ENERGY NETWORKS CORP",
        "long_name": "Global Energy Networks Corp.",
        "summary": "Global Networks Corp. offers server-based gaming software and kiosk products for the casino industry. The company's proprietary technology allows operators to manage and deploy multi game terminals and other gaming hardware. Its technology also allows for customer relationship management and customized deployment programs for casino games. The company was formerly known as GIC Global Intertainment Corp. Global Networks Corp. was incorporated in 1997 and is based in North Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "North Vancouver"
    },
    "GCOR.ST": {
        "short_name": "Gaming Corps AB",
        "long_name": "Gaming Corps AB (publ)",
        "summary": "Gaming Corps AB (publ) develops videogames and interactive entertainment in Sweden. The company was founded in 2013 and is based in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "GENTF": {
        "short_name": "G5 ENTERTAINMENT AB",
        "long_name": "G5 Entertainment AB (publ)",
        "summary": "G5 Entertainment AB (publ) develops and publishes free-to-play games for smartphones and tablets in Sweden. Its portfolio of games includes Jewels of Rome, Hidden City, Mahjong Journey, Homicide Squad, The Secret Society, and Wordplay. The company distributes games through Apple App Store, Google Play, Microsoft Store, and Amazon Appstore. G5 Entertainment AB (publ) was founded in 2001 and is headquartered in Stockholm, Sweden.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "GIFN.F": {
        "short_name": "GIGAMEDIA LTD  TA 10",
        "long_name": "GigaMedia Limited",
        "summary": "GigaMedia Limited provides digital entertainment services in Taiwan and Hong Kong. The company operates FunTown, a digital entertainment portal that offers mobile and browser-based casual games through -branded platform. It offers MahJong, a traditional Chinese tile based game; casual card and table games; online card games; and chance-based games, including bingo, lotto, horse racing, Sic-Bo, slots, and various casual games. The company also provides sports games and role-playing games, such as Tales Runner, a multi-player online obstacle running game; Yume 100, a story -based game that targets female players; Akaseka, a female-oriented game; and Shinobi Master New Link, a male-oriented game. GigaMedia Limited was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "GIGM": {
        "short_name": "GigaMedia Limited",
        "long_name": "GigaMedia Limited",
        "summary": "GigaMedia Limited provides digital entertainment services in Taiwan and Hong Kong. The company operates FunTown, a digital entertainment portal that offers mobile and browser-based casual games through -branded platform. It offers MahJong, a traditional Chinese tile based game; casual card and table games; online card games; and chance-based games, including bingo, lotto, horse racing, Sic-Bo, slots, and various casual games. The company also provides sports games and role-playing games, such as Tales Runner, a multi-player online obstacle running game; Yume 100, a story -based game that targets female players; Akaseka, a female-oriented game; and Shinobi Master New Link, a male-oriented game. GigaMedia Limited was founded in 1998 and is headquartered in Taipei, Taiwan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Taiwan",
        "city": "Taipei"
    },
    "GIX.F": {
        "short_name": "EMERGE GAMING LTD",
        "long_name": "Emerge Gaming Limited",
        "summary": "Emerge Gaming Limited develops and markets an online eSport and gaming tournament platform in Eastern Europe and South Africa. It develops Arcade X online gaming platform, which focuses on skill based tournaments and matches, where players compete to enhance their user rankings/status in the virtual gaming world and for digital merchandise to enhance their gaming experience, as well as offers a market place that gives players the opportunity to enter pay-to-play competitions and tournaments. The company is based in Perth, Australia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Perth"
    },
    "GLUU": {
        "short_name": "Glu Mobile Inc.",
        "long_name": "Glu Mobile Inc.",
        "summary": "Glu Mobile Inc. develops, publishes, and markets a portfolio of free-to-play mobile games for the users of smartphones and tablet devices. It publishes titles primarily in four genres, including lifestyle, casual, mid-core, and sports and outdoors. The company's portfolio of compelling games based on its own intellectual property, such as Cooking Dash, Covet Fashion, Deer Hunter, Design Home, Diner DASH Adventures, and QuizUp, as well as games based on or significantly incorporating third party licensed brands, including Kim Kardashian: Hollywood, MLB Tap Sports Baseball, and Restaurant Dash with Gordon Ramsay, as well as Disney Sorcerer's Arena. It markets, sells, and distributes its games primarily through direct-to-consumer digital storefronts, such as the Apple App Store, Google Play Store, and others. The company was formerly known as Sorrent, Inc. and changed its name to Glu Mobile Inc. in May 2005. Glu Mobile Inc. was founded in 2001 and is headquartered in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "GMGI": {
        "short_name": "GOLDEN MATRIX GROUP INC",
        "long_name": "Golden Matrix Group, Inc.",
        "summary": "Golden Matrix Group, Inc., a gaming technology company, develops and owns online gaming IP, and builds social gaming platforms for its customers located primarily in the Asia Pacific region. Its gaming IP includes tools for marketing, acquisition, retention and monetization of users. The company's platform is accessed through desktop and mobile applications. The company was formerly known as Source Gold Corp. and changed its name to Golden Matrix Group, Inc. in March 2016. Golden Matrix Group, Inc. was founded in 2008 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "GRVY": {
        "short_name": "GRAVITY Co., Ltd.",
        "long_name": "Gravity Co., Ltd.",
        "summary": "Gravity Co., Ltd. develops, publishes, and distributes online games in South Korea, Japan, the United States, Canada, Taiwan, the Philippines, Thailand, Indonesia, Hong Kong, and internationally. It offers a massively multiplayer online role-playing game, including Ragnarok Online, Requiem, Dragonica, Ragnarok Online II, and Ragnarok Prequel II, as well as Ragnarok Clicker, a Web browser-based role-playing game. The company's mobile games portfolio includes Ragnarok M: Eternal Love; Dawn Break; MR! PORORO; Ragnarok CRUSH; RO Click H5; Blood War M; Ragnarok H5; Ragnarok Tactics; and the Color of Dream Fantasy, Latale. It also provides console games, such as Ragnarok DS for Nintendo DS; Ragnarok: The Princess of Light and Darkness for PlayStation Portable; Ragnarok Odyssey for PlayStation Vita; Double Dragon II for Xbox 360; and Ragnarok Odyssey Ace for PlayStation Vita and PlayStation 3.In addition, the company offers games for IPTV; and markets dolls, stationery, food, and other character-based merchandises, as well as game manuals, monthly magazines, and other publications. Further, it provides system development and maintenance services, as well as system integration services to third parties. As of December 31, 2019, it owned 125 registered domain names. The company was founded in 2000 and is headquartered in Seoul, South Korea. Gravity Co., Ltd. is a subsidiary of GungHo Online Entertainment, Inc.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "South Korea",
        "city": "Seoul"
    },
    "HHRN.F": {
        "short_name": "BIDSTACK GROUP  LS -,005",
        "long_name": "Bidstack Group Plc",
        "summary": "Bidstack Group Plc, together with its subsidiaries, operates as an advertising technology company in the United Kingdom. It provides dynamic, targeted, and automated native in-game advertising for the global video games industry across multiple platforms, including mobile, PC, and console. The company also offers content security and assurance services to cross platform advertisers. It serves game publishers, owners, developers, advertising agencies, brands, and programmatic advertising platforms. The company is based in London, the United Kingdom.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United Kingdom",
        "city": "London"
    },
    "HTSF": {
        "short_name": "HEARTSOFT INC",
        "long_name": "Heartsoft, Inc.",
        "summary": "Heartsoft, Inc. engages in the design and publishing of its own proprietary educational software products for distribution to the education market and consumer market. Its products are sold through an internal sales organization; national and international resellers; United States based catalogers with an annual aggregate circulation in excess of 5,000,000 catalogs; and online through four corporate Web Sites, www.heartsoft.com, www.internet-safari.com, www.thinkology com, and www.isafari.com. The company's product line consists of approximately 50 educational software programs that assist young children in pre-kindergarten through the 6th grade to practice and learn basic curriculum subjects. Its INTERNET SAFARI, designed for children ages four through 12 years to help simplify their use of the Internet, is a full-featured secure Internet browser for children that utilizes the sights and sounds of a jungle safari user interface with cartoons, sounds, and a host of proprietary features. The company was founded in 1988 and is based in Broken Arrow, Oklahoma.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Broken Arrow"
    },
    "I91.F": {
        "short_name": "IGG INC.  DL-,0000025",
        "long_name": "IGG Inc",
        "summary": "IGG Inc, an investment holding company, engages in the development and operation of mobile and online games in Asia, North America, Europe, and internationally. The company offers free-to-play mobile, browser, PC, and client-based online games in 24 languages. It also licenses online games; and provides customer support services. The company was founded in 2006 and is headquartered in Singapore.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "ICI.AX": {
        "short_name": "ICANDY FPO",
        "long_name": "iCandy Interactive Limited",
        "summary": "iCandy Interactive Limited, an investment holding company, develops and publishes mobile games and digital entertainment worldwide. It develops software for interactive digital media; and intellectual properties for software applications and games. The company was incorporated in 2015 and is headquartered in Melbourne, Australia. ICandy Interactive Limited is a subsidiary of Fatfish Internet Pte Ltd.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "IENT": {
        "short_name": "I ENTERTAINMENT NETWORK",
        "long_name": "iEntertainment Network, Inc.",
        "summary": "iEntertainment Network, Inc. develops and operates retail and online military simulation games. The company offers multiplayer and single-player games. The company was formerly known as Interactive Magic, Inc. and changed its name to iEntertainment Network, Inc. in 1998. The company was founded in 1994 and is based in Cary, North Carolina.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Cary"
    },
    "IFGA.F": {
        "short_name": "ATARI S.A.  EO 0,01",
        "long_name": "Atari SA",
        "summary": "Atari SA operates as a multi-platform, interactive entertainment, and licensing products company worldwide. The company offers video games; monetization of games through multiple channels, multimedia production, and licensing activities; regulated online casino games; Atari VCS, the new personal computer (PC), a hybrid system combining a PC and a console-type environment; and Atari Partners, which covers investments in technology companies, primarily by licensing the Atari brand and the blockchain activity/Atari Token. It owns and/or manages a portfolio of approximately 200 games and franchises under the Asteroids, Centipede, Missile Command, Pong, and RollerCoaster Tycoon brands. The company was formerly known as Infogrames Entertainment SA and changed its name to Atari SA in May 2009. Atari SA was founded in 1972 and is headquartered in Paris, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Paris"
    },
    "IGGGF": {
        "short_name": "IGG INC",
        "long_name": "IGG Inc",
        "summary": "IGG Inc, an investment holding company, engages in the development and operation of mobile and online games in Asia, North America, Europe, and internationally. The company offers free-to-play mobile, browser, PC, and client-based online games in 24 languages. It also licenses online games; and provides customer support services. The company was founded in 2006 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "IMGX": {
        "short_name": "IMAGE METRICS INC",
        "long_name": "Image Metrics, Inc.",
        "summary": "Image Metrics, Inc. provides technology-based facial animation services for entertainment and film industries in the United States, Canada, and Europe. Its products are used primarily in the production of computer games and high-budget films. Image Metrics, Inc. was founded in 2000 and is headquartered in El Segundo, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "El Segundo"
    },
    "INSE": {
        "short_name": "Inspired Entertainment, Inc.",
        "long_name": "Inspired Entertainment, Inc.",
        "summary": "Inspired Entertainment, Inc., a business-to-business gaming technology company, supplies virtual sports and server based gaming (SBG) products to regulated lottery, betting, and gaming operators worldwide. The company operates through three segments: SBG, Virtual Sports, and Acquired Businesses. It designs, develops, markets, and distributes a portfolio of games through its digital network architecture for licensed betting offices, casinos, gaming hall operators, bingo operators, and regulated operators of lotteries, as well as government-affiliated operators. The company also designs, develops, markets, and distributes ultra-high-definition games that create an always-on sports wagering experience for virtual sports retail and digital operators. In addition, it offers SBG and virtual sports content through its remote gaming servers. Further, the company operates analog gaming and amusement machines for pubs, adult gaming centers, motorway service stations, and holiday resorts. Inspired Entertainment, Inc. is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "IPUB": {
        "short_name": "INDIEPUB ENTERTAINMENT INC",
        "long_name": "indiePub Entertainment, Inc.",
        "summary": "indiePub Entertainment, Inc. engages in the development, publishing, and distribution of interactive entertainment software for digital distribution channels in the United States. The company's entertainment software is used on major consoles, handheld gaming devices, personal computers, tablets, and mobile smart-phone devices. It also develops and publishes downloadable games for connected services; and operates indiePub.com, an innovative content creation site. The company sells its products to national and regional retailers, and national distributors. The company was formerly known as Zoo Entertainment, Inc. and changed its name to indiePub Entertainment, Inc. in May 2012. indiePub Entertainment, Inc. is based in Blue Ash, Ohio.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Blue Ash"
    },
    "ITVI": {
        "short_name": "INTERACT-TV INC",
        "long_name": "Interact-TV, Inc.",
        "summary": "Interact-TV, Inc. operates as a multifaceted multi-media development company. It primarily develops film and radio digital production and broadcasting platforms. The company operates Internet TV and radio channels. It also provides full service distribution and music services for bands and other labels; develops and distributes video game software products; and publishes and distributes books. The company was founded in 2000 and is based in Wilmington, Delaware.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Wilmington"
    },
    "KIDZ.V": {
        "short_name": "KIDOZ INC",
        "long_name": "Kidoz Inc.",
        "summary": "Kidoz Inc. develops and sells kid-tech software products in Western Europe; Central, Eastern, and Southern Europe; and North America. It also owns and develops mobile KidSafe advertising network. The company's products include Rooplay, the cloud-based EduGame system for kids to learn and play; Garfield's Bingo, live on facebook messenger, android, and iOS; and Trophy Bingo, live across mobile platforms. The company was formerly known as Shoal Games Ltd. and changed its name to Kidoz Inc. in April 2019. Kidoz Inc. was incorporated in 1987 and is based in The Valley, Anguilla.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Anguilla",
        "city": "The Valley"
    },
    "KNAMF": {
        "short_name": "KONAMI HOLDINGS CORPORATION",
        "long_name": "Konami Holdings Corporation",
        "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KNM.L": {
        "short_name": "KONAMI HOLDINGS CORPORATION JPY",
        "long_name": "Konami Holdings Corporation",
        "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KNMCY": {
        "short_name": "KONAMI HOLDINGS CORPORATION",
        "long_name": "Konami Holdings Corporation",
        "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KOA.F": {
        "short_name": "KONAMI HOLDINGS",
        "long_name": "Konami Holdings Corporation",
        "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KOAA.F": {
        "short_name": "KONAMI HOLDINGS ADR",
        "long_name": "Konami Holdings Corporation",
        "summary": "Konami Holdings Corporation, together with its subsidiaries, primarily engages in the digital entertainment business. It operates through four segments: Digital Entertainment, Health & Fitness, Gaming & Systems, and Pachislot & Pachinko Machines. The Digital Entertainment segment manufactures and sells digital content and related products, including mobile games, arcade games, card games, and computer and video games. The Health & Fitness segment operates health and fitness clubs, as well as designs, manufactures, and sells fitness machines and health products. The Gaming & Systems segment designs, manufactures, sells, and services gaming machines and casino management systems. The Pachislot & Pachinko Machines segment researches, designs, produces, and sells pachinko slot and pachinko machines. It operates in Japan and other Asia/Oceania countries, the United States, and Europe. The company was formerly known as Konami Corporation and changed its name to Konami Holdings Corporation in October 2015. Konami Holdings Corporation was founded in 1969 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "KS3.F": {
        "short_name": "KEYWORDS STUDIOS  LS -,01",
        "long_name": "Keywords Studios plc",
        "summary": "Keywords Studios plc provides integrated outsourced creative and technical services to the video game industry. It offers art creation services related to the production of graphical art assets for inclusion in the video game, including concept art creation, as well as 2D and 3D art asset production and animation. The company also provides audio/voice-over services, including script translation, actor selection, and talent management through pre-production, audio direction, recording, and post-production, as well as offers music licencing or music soundtracks selling services. In addition, it offers localization services related to translation and cultural adaptation of in-game text and audio scripts in various game platforms and genres; and localization testing services consisting of testing the linguistic correctness and cultural acceptability of computer games. Further, the company provides functional testing services related to quality assurance services provided to game producers to ensure game functions. Additionally, the company provides player support services related to the live operations support, such as community management, player support, and associated services to producers of games, as well as software engineering services for developing video games. It serves game companies and publishers. The company operates in Ireland, the United States, Canada, the United Kingdom, Switzerland, Japan, Italy, France, India, Germany, Singapore, Spain, Poland, Brazil, China, and Mexico. Keywords Studios plc was founded in 1998 and is headquartered in Dublin, Ireland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Ireland",
        "city": "Dublin"
    },
    "KSFTF": {
        "short_name": "KINGSOFT CORP",
        "long_name": "Kingsoft Corporation Limited",
        "summary": "Kingsoft Corporation Limited, an investment holding company, operates as a software and Internet service company in Mainland China, Hong Kong, and internationally. It operates through three segments: Entertainment Software; Cloud Services; and Office Software and Services and Others. The Entertainment Software segment engages in the research and development of games; and provision of online games, mobile games, and casual game services. The Cloud Services segment provides cloud computing, storage and delivery, and comprehensive cloud-based solutions. The Office Software and Services and Others segment designs, researches and develops, sells, and markets office software products and services of WPS Office. It also engages in the operation and distribution of games; marketing and operation of SMS, and wireless service of online games and application software; sale and operation of office application software; marketing and operation of entertainment software products; and research, development, and distribution of consumer application software. Kingsoft Corporation Limited was founded in 1988 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "KUU.V": {
        "short_name": "KUUHUBB INC",
        "long_name": "Kuuhubb Inc.",
        "summary": "Kuuhubb Inc., through its subsidiaries, operates as a mobile game development and publishing company. It creates games and applications for female audience with a focus on relaxation, expression, and entertainment segments. The company offers Recolor, a digital coloring book application. It also develops Neybers, an interior design game application; My Hospital, a simulation game application; Dance Talent, a mobile game application; and Tiles & Tales game in a new story-based format. Kuuhubb Inc. markets its products through various third-party platforms. The company was formerly known as Delrand Resources Limited and changed its name to KuuHubb Inc. in June 2017. Kuuhubb Inc. is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "KWS.L": {
        "short_name": "KEYWORDS STUDIOS PLC ORD 1P",
        "long_name": "Keywords Studios plc",
        "summary": "Keywords Studios plc provides integrated outsourced creative and technical services to the video game industry. It offers art creation services related to the production of graphical art assets for inclusion in the video game, including concept art creation, as well as 2D and 3D art asset production and animation. The company also provides audio/voice-over services, including script translation, actor selection, and talent management through pre-production, audio direction, recording, and post-production, as well as offers music licencing or music soundtracks selling services. In addition, it offers localization services related to translation and cultural adaptation of in-game text and audio scripts in various game platforms and genres; and localization testing services consisting of testing the linguistic correctness and cultural acceptability of computer games. Further, the company provides functional testing services related to quality assurance services provided to game producers to ensure game functions. Additionally, the company provides player support services related to the live operations support, such as community management, player support, and associated services to producers of games, as well as software engineering services for developing video games. It serves game companies and publishers. The company operates in Ireland, the United States, Canada, the United Kingdom, Switzerland, Japan, Italy, France, India, Germany, Singapore, Spain, Poland, Brazil, China, and Mexico. Keywords Studios plc was founded in 1998 and is headquartered in Dublin, Ireland.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Ireland",
        "city": "Dublin"
    },
    "LEO.ST": {
        "short_name": "LeoVegas AB",
        "long_name": "LeoVegas AB (publ)",
        "summary": "LeoVegas AB (publ), a mobile gaming company, engages in the mobile casino business in Nordic countries, rest of Europe, and internationally. It offers casino games, such as slots, jackpots, and table games, as well as live casinos; poker, bingo, and lotteries; and sports betting. The company also provides its games through tablets and desktop computers. LeoVegas AB (publ) offers approximately 1,500 games from 60 game providers for mobile devices. The company was incorporated in 2010 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "LUSI": {
        "short_name": "MMA GLOBAL INC",
        "long_name": "MMA Global Inc.",
        "summary": "MMA Global Inc., a development stage company, engages in locating, developing, and commercializing food-related business opportunities in the State of Louisiana. It offers a line of packaged dry products, coffee products, and sauce products. The company markets its packaged dry products under the Louisiana Food Company brand name; coffee products under the Voodoo Roast brand name; and sauce products under The Quarter's brand name. It sells its food product lines to distributors, as well as directly to retailers and to consumers over the Internet. The company was formerly known as Louisiana Food Company and changed its name to MMA Global Inc. in September 2018. MMA Global Inc.was founded in 2010 and is based in Baton Rouge, Louisiana.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Baton Rouge"
    },
    "MAGI.ST": {
        "short_name": "MAG Interactive AB",
        "long_name": "MAG Interactive AB (publ)",
        "summary": "MAG Interactive AB (publ) develops and publishes mobile games worldwide. The company provides casual and social games. It distributes its games through virtual app stores for Android and iOS operating systems. The company was founded in 2010 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "MHK.MU": {
        "short_name": "MAG INTERACTIVE AB (PUBL)",
        "long_name": "MAG Interactive AB (publ)",
        "summary": "MAG Interactive AB (publ) develops and publishes mobile games worldwide. The company provides casual and social games. It distributes its games through virtual app stores for Android and iOS operating systems. The company was founded in 2010 and is headquartered in Stockholm, Sweden.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "MIXIF": {
        "short_name": "MIXI. INC",
        "long_name": "mixi, Inc.",
        "summary": "mixi, Inc. engages in the entertainment and lifestyle businesses in Japan. It offers Monster Strike, Kotodaman, and Monster Strike Stadium gaming applications; TIPSTAR, a freemium online betting app; Chariloto, a keirin and auto race betting ticket sales site; Chiba Jets Funabashi; netkeiba.com, a national horse racing resource; and Weekly Baseball Online, a baseball information site. The company also provides FamilyAlbum, a family photo and video sharing app; minimo, a salon artist booking app; mixi, a social networking service that offers space for friendly communication; KARASTA, a karaoke video community; Find Job!, a job recruitment info site for the IT and web industries; and OKURU, a photo gift service. It also provides employment opportunities for people with disabilities; operates XFLAG stores that offer merchandise from game; organizes events; and produces and sells various goods, as well as manages professional sports team, and businesses related to publicly operated competitions and other services. The company was formerly known as eMecury Co., Ltd. and changed its name to mixi, Inc. in February 2006. mixi, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MKT.V": {
        "short_name": "DEEPMARKIT CORP",
        "long_name": "DeepMarkit Corp.",
        "summary": "DeepMarkit Corp. develops and operates digital marketing and promotions platform for retailers and other businesses. Its DeepMarkit platform offers a range of promotion products and services that focuses on game driven experiences and supporting various promotion models, such as sweepstakes, giveaways, and contests. The company was formerly known as Challenger Deep Resources Corp. and changed its name to DeepMarkit Corp. in October 2015. DeepMarkit Corp. was incorporated in 2007 and is headquartered in Calgary, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "MKTDF": {
        "short_name": "DEEPMARKIT CORP",
        "long_name": "DeepMarkit Corp.",
        "summary": "DeepMarkit Corp. develops and operates digital marketing and promotions platform for retailers and other businesses. Its DeepMarkit platform offers a range of promotion products and services that focuses on game driven experiences and supporting various promotion models, such as sweepstakes, giveaways, and contests. The company was formerly known as Challenger Deep Resources Corp. and changed its name to DeepMarkit Corp. in October 2015. DeepMarkit Corp. was incorporated in 2007 and is headquartered in Calgary, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Calgary"
    },
    "MLLLF": {
        "short_name": "ENGINE MEDIA HOLDINGS INC",
        "long_name": "Engine Media Holdings, Inc.",
        "summary": "Engine Media Holdings, Inc., together with its subsidiaries, engages in the development and sale of gaming applications. It provides e-sport or sporting event or tournament services; offers content management system, video software, mobile applications, and e-sports data platform solutions; sources, creates, and places advertising campaigns that run-in company's network of publisher sites; and provides installation and website design services, as well as data analysis report delivery. The company also offers Esports platform for online tournaments; content publishing, engagement, and monetization; data analytics and intellectual property solutions; UMG Online, an esports website for daily tournaments and ladders; and racing titles. The company was formerly known as Torque Esports Corp. and changed its name to Engine Media Holdings, Inc. in August 2020. The company was incorporated in 2011 and is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "MSGM": {
        "short_name": "Motorsport Games Inc.",
        "long_name": "Motorsport Games Inc.",
        "summary": "Motorsport Games Inc., a Motorsport Network company, combines video games with esports competitions and content for racing fans and gamers worldwide. The company develops and publishes video games for iconic motorsport racing series, including NASCAR and the British Touring Car Championship. The company is an esports partner of choice for NASCAR, 24 Hours of Le Mans, Formula E, BTCC, the FIA World Rallycross Championship, and others. Motorsport Games Inc. was founded in 2018 and is headquartered in Miami, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NCM",
        "market": "us_market",
        "country": "United States",
        "city": "Miami"
    },
    "MTG-A.ST": {
        "short_name": "Modern Times Group MTG AB ser. ",
        "long_name": "Modern Times Group Mtg AB",
        "summary": "Modern Times Group MTG AB, through its subsidiaries, operates as a digital entertainment company in the United States, Sweden, Denmark, Germany, rest of Europe, and internationally. It operates through Esport and Gaming segments. The Esport segment operates national and international tournaments, as well as grassroots amatuer cups, leagues, matchmaking systems, and festivals; and engages in the gaming technology, event management, advertising, and TV and content production business. This segment offers its products under the ESL and Dreamhack brands. The Gaming segment develops and publishes mobile and online games under the InnoGames and Kongregate names. The company was founded in 1987 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "MTG-B.ST": {
        "short_name": "Modern Times Group MTG AB ser. ",
        "long_name": "Modern Times Group Mtg AB",
        "summary": "Modern Times Group MTG AB, through its subsidiaries, operates as a digital entertainment company in the United States, Sweden, Denmark, Germany, rest of Europe, and internationally. It operates through Esport and Gaming segments. The Esport segment operates national and international tournaments, as well as grassroots amatuer cups, leagues, matchmaking systems, and festivals; and engages in the gaming technology, event management, advertising, and TV and content production business. This segment offers its products under the ESL and Dreamhack brands. The Gaming segment develops and publishes mobile and online games under the InnoGames and Kongregate names. The company was founded in 1987 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "MXN.F": {
        "short_name": "MIXI INC.",
        "long_name": "mixi, Inc.",
        "summary": "mixi, Inc. engages in the entertainment and lifestyle businesses in Japan. It offers Monster Strike, Kotodaman, and Monster Strike Stadium gaming applications; TIPSTAR, a freemium online betting app; Chariloto, a keirin and auto race betting ticket sales site; Chiba Jets Funabashi; netkeiba.com, a national horse racing resource; and Weekly Baseball Online, a baseball information site. The company also provides FamilyAlbum, a family photo and video sharing app; minimo, a salon artist booking app; mixi, a social networking service that offers space for friendly communication; KARASTA, a karaoke video community; Find Job!, a job recruitment info site for the IT and web industries; and OKURU, a photo gift service. It also provides employment opportunities for people with disabilities; operates XFLAG stores that offer merchandise from game; organizes events; and produces and sells various goods, as well as manages professional sports team, and businesses related to publicly operated competitions and other services. The company was formerly known as eMecury Co., Ltd. and changed its name to mixi, Inc. in February 2006. mixi, Inc. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "N9G.F": {
        "short_name": "NEOGAMES S.A.  EO 1",
        "long_name": "NeoGames S.A.",
        "summary": "NeoGames S.A. provides a suite of iLottery technology solutions worldwide. The company offers a suite of technology solutions that include technology platforms, a range of value-added services, and a game studio with a portfolio of games for the offering of draw based games and instant tickets through personal computers, smartphones, and handheld devices. It develops and operates online lotteries and games that allows lottery operators to distribute lottery products through online sales channels using the company's technology. The company also offers software development and platforms sub-licensing services; and regulation and compliance, payment processing, risk management, player relationship management, and player value optimization services. NeoGames S.A. is headquartered in Tel Aviv, Israel.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "NACON.PA": {
        "short_name": "NACON",
        "long_name": "Nacon S.A.",
        "summary": "Nacon S.A. designs and distributes gaming accessories in France and internationally. The company offers accessories, including headsets, microphones, controllers, racing wheels, gaming chairs, keyboards, mice, mats, audio accessories, and console accessories. It also develops and publishes video games in various categories, such as action-adventure, racing, sport, and simulation. The company was founded in 2019 and is based in Fretin, France. Nacon S.A. is a subsidiary of BigBen Interactive SA.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Fretin"
    },
    "NCTY": {
        "short_name": "The9 Limited - American Deposit",
        "long_name": "The9 Limited",
        "summary": "The9 Limited, together with its subsidiaries, operates and develops online games in the People's Republic of China. The company offers online games, including multiplayer online games, mobile games, Web games, and TV games. It also develops mobile games, including CrossFire New Mobile Game and Audition; and provides technical consulting services. The company was formerly known as GameNow.net Limited and changed its name to The9 Limited in February 2004. The9 Limited was founded in 1999 and is headquartered in Shanghai, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "China",
        "city": "Shanghai"
    },
    "NEXOF": {
        "short_name": "NEXON CO LTD",
        "long_name": "NEXON Co., Ltd.",
        "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "NEXOY": {
        "short_name": "NEXON CO LTD",
        "long_name": "NEXON Co., Ltd.",
        "summary": "NEXON Co., Ltd. produces, develops, and services PC online and mobile games. It operates through five segments: Japan, Korea, China, North America, and Others. The company's PC online game titles include MapleStory, Dungeon & Fighter, and EA SPORTS FIFA ONLINE 4. It offers approximately 60 online games in 190 countries. The company was formerly known as NEXON Japan Co., Ltd. and changed its name to NEXON Co., Ltd. in April 2009. The company was founded in 1994 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "NGMS": {
        "short_name": "NeoGames S.A.",
        "long_name": "NeoGames S.A.",
        "summary": "NeoGames S.A. provides a suite of iLottery technology solutions worldwide. The company offers a suite of technology solutions that include technology platforms, a range of value-added services, and a game studio with a portfolio of games for the offering of draw based games and instant tickets through personal computers, smartphones, and handheld devices. It develops and operates online lotteries and games that allows lottery operators to distribute lottery products through online sales channels using the company's technology. The company also offers software development and platforms sub-licensing services; and regulation and compliance, payment processing, risk management, player relationship management, and player value optimization services. NeoGames S.A. is headquartered in Tel Aviv, Israel.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NGM",
        "market": "us_market",
        "country": "Israel",
        "city": "Tel Aviv"
    },
    "NITRO.ST": {
        "short_name": "Nitro Games Oyj",
        "long_name": "Nitro Games Oyj",
        "summary": "Nitro Games Oyj develops and publishes games for smartphones and tablets worldwide. It also provides development services to third parties in the form of contracting work. The company was founded in 2007 and is headquartered in Kotka, Finland.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Finland",
        "city": "Kotka"
    },
    "NTDOF": {
        "short_name": "NINTENDO CO LTD",
        "long_name": "Nintendo Co., Ltd.",
        "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "NTDOY": {
        "short_name": "NINTENDO CO LTD",
        "long_name": "Nintendo Co., Ltd.",
        "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "NTEK": {
        "short_name": "NANOTECH ENTERTAINMENT INC",
        "long_name": "NanoTech Entertainment, Inc.",
        "summary": "NanoTech Entertainment, Inc. provides entertainment and communications products. It offers cloud based advertising platforms based on glass-free 3D visualization technology, including point of sale display solutions, retail advertising displays, promotional kiosks, and creative window displays. The company also provides applications for mobile phones, tablets, and server based social media tools, including NanoTweet, a tool that allows the user to set a series of keywords to be searched for using Google Alerts. In addition, it develops and publishes technology for the emerging IPTV market for various platforms, including 4K media players, displays, and accessories; publishes original content, and licenses and broadcasts licensed content; and develops and licenses proprietary TV technology to third parties. Further, the company operates 4K Studios that offers triple-flash scanning and 4K UltraHD digital video services. NanoTech Entertainment, Inc. was founded in 2004 and is headquartered in San Jose, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Jose"
    },
    "NTO.F": {
        "short_name": "NINTENDO CO. LTD",
        "long_name": "Nintendo Co., Ltd.",
        "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "NTOA.F": {
        "short_name": "NINTENDO UNS.ADR 1/8/O.N.",
        "long_name": "Nintendo Co., Ltd.",
        "summary": "Nintendo Co., Ltd., together with its subsidiaries, develops, manufactures, and distributes electronic entertainment products in Japan, the Americas, Europe, and internationally. It offers video game platforms, playing cards, Karuta, and other products; and handheld and home console hardware systems and related software. The company was formerly known as Nintendo Playing Card Co., Ltd. and changed its name to Nintendo Co., Ltd. in 1963. Nintendo Co., Ltd. was founded in 1889 and is headquartered in Kyoto, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Kyoto"
    },
    "NVNT": {
        "short_name": "NOVINT TECHNOLOGIES INC",
        "long_name": "Novint Technologies, Inc.",
        "summary": "Novint Technologies, Inc. engages in the development and sale of 3D haptics products and equipment in New Mexico. It offers Falcon 3D Touch Haptic Controller, a human-computer user interface and related accessories, which allows the user to experience the sense of touch when using a computer, while holding its interchangeable handle. The company was incorporated in 1999 and is based in Rockville Centre, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rockville Centre"
    },
    "NXTGMS.HE": {
        "short_name": "Next Games Oyj",
        "long_name": "Next Games Oyj",
        "summary": "Next Games Oyj develops and publishes mobile games in North America, Finland, rest of Europe, and internationally. It develops mobile games based on entertainment franchises. The company's portfolio of games include The Walking Dead: Our World, The Walking Dead: No Man's Land, and Compass Point: West. It distributes games through the Apple App Store and Google Play platforms. The company was founded in 2013 and is based in Helsinki, Finland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Helsinki"
    },
    "OI4.F": {
        "short_name": "OIZUMI CORP.",
        "long_name": "OIZUMI Corporation",
        "summary": "OIZUMI Corporation manufactures and sells amusement machines and related devices and equipment in Japan. The company offers pachislot machines, preparatory devices, WICA series products, eco equipment, and medal supply collect products. It also leases and manages real estate properties. The company was founded in 1974 and is headquartered in Atsugi, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Atsugi"
    },
    "OTGLF": {
        "short_name": "CD PROJEKT SA",
        "long_name": "CD Projekt S.A.",
        "summary": "CD Projekt S.A., through its subsidiaries, engages in the development and digital distribution of videogames worldwide. It operates through two segments, CD PROJEKT RED and GOG.com. The company's product portfolio comprises The Witche; The Witcher 2: Assassins of Kings; The Witcher 3: Wild Hunt, Hearts of Stone games, and Blood and Wine; Thronebreaker: The Witcher Tales; Gwent: The Witcher Card game; and Cyberpunk 2077, as well as online multiplayer games. It also distributes digital videogames through online channels directly to individual users; and its games for various hardware platforms using traditional distribution channels and digital distribution platforms. The company exports its products in Europe, North America, South America, Asia, Australia, and Africa. CD Projekt S.A. is headquartered in Warsaw, Poland.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "OTGLY": {
        "short_name": "CD PROJEKT SA UNSPON ADS EACH R",
        "long_name": "CD Projekt S.A.",
        "summary": "CD Projekt S.A., through its subsidiaries, engages in the development and digital distribution of videogames worldwide. It operates through two segments, CD PROJEKT RED and GOG.com. The company's product portfolio comprises The Witche; The Witcher 2: Assassins of Kings; The Witcher 3: Wild Hunt, Hearts of Stone games, and Blood and Wine; Thronebreaker: The Witcher Tales; Gwent: The Witcher Card game; and Cyberpunk 2077, as well as online multiplayer games. It also distributes digital videogames through online channels directly to individual users; and its games for various hardware platforms using traditional distribution channels and digital distribution platforms. The company exports its products in Europe, North America, South America, Asia, Australia, and Africa. CD Projekt S.A. is headquartered in Warsaw, Poland.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Poland",
        "city": "Warsaw"
    },
    "PDX.ST": {
        "short_name": "Paradox Interactive AB",
        "long_name": "Paradox Interactive AB (publ)",
        "summary": "Paradox Interactive AB (publ) develops and publishes games and brands for PC, mobile, and console platforms primarily in the United States, the United Kingdom, China, Germany, France, Russia, and Scandinavia. The company publishes titles, as well as music and books. Its game portfolio comprises approximately 100 titles and brands, including Stellaris, Europa Universalis, Hearts of Iron, Crusader Kings, Cities: Skylines, Surviving Mars, Prison Architect, Magicka, Age of Wonders, and the World of Darkness. The company was founded in 1998 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "PLAY.CN": {
        "short_name": "BlocplayEntInc.",
        "long_name": "Blocplay Entertainment Inc.",
        "summary": "Blocplay Entertainment Inc. develops platforms and publishes video games. The company was formerly known as Stompy Bot Corporation and changed its name to Blocplay Entertainment Inc. in February 2018. Blocplay Entertainment Inc. was incorporated in 2014 and is based in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "PLGC": {
        "short_name": "PLAYLOGIC ENTERTAINMENT INC",
        "long_name": "Playlogic Entertainment Inc.",
        "summary": "Playlogic Entertainment Inc. publishes, markets, and sells interactive entertainment products. Its portfolio includes video game software and other digital entertainment products, which include online casino and slot, blackjack, roulette, and video poker games. The company publishes on interactive entertainment hardware platforms, PCs, and handheld and mobile devices. It serves customers through distributors, as well as its website and other online distribution channels. Playlogic Entertainment Inc. was formerly known as Donar Enterprises Inc. and changed its name in August 2005. The company was incorporated in 2001 and is based in Amsterdam, the Netherlands. As of July 27, 2010, Playlogic Entertainment Inc. is in reorganization.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Netherlands",
        "city": "Amsterdam"
    },
    "PLGNF": {
        "short_name": "PLAYGON GAMES INC",
        "long_name": "Playgon Games Inc.",
        "summary": "Playgon Games Inc. operates in the daily fantasy sports (DFS) industry. The company offers DFS software and network, which enables its licensed customers to offer a customized and branded DFS product to their end users. It serves gaming operators, such as sports books, land-based groups, media companies, big database groups, and others. The company was formerly known as Global Daily Fantasy Sports Inc. and changed its name to Playgon Games Inc. in July 2020. Playgon Games Inc. was incorporated in 1985 and is based in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "PLTK": {
        "short_name": "Playtika Holding Corp.",
        "long_name": "Playtika Holding Corp.",
        "summary": "Playtika Holding Corporation develops mobile games worldwide. The company owns a portfolio of casual and casino-themed games. It distributes its games to the end customer through various web and mobile platforms, such as Apple, Facebook, Google, and other web and mobile platforms and its own proprietary platforms. The company was founded in 2010 and is headquartered in Herzliya Pituarch, Israel.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Israel",
        "city": "Herzliya Pituarch"
    },
    "PLY.AX": {
        "short_name": "PLAYSIDE FPO",
        "long_name": "PlaySide Studios Limited",
        "summary": "PlaySide Studios Limited develops mobile video games in Australia. It provides titles in a range of categories, including self-published games based on original intellectual property and games developed in collaboration with studios, such as Disney, Pixar, Warner Bros, and Nickelodeon. The company's portfolio consists of 52 titles that are delivered across 4 platforms, which include mobile, virtual reality, augmented reality, and PC. The company was incorporated in 2011 and is headquartered in Port Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Port Melbourne"
    },
    "PONGF": {
        "short_name": "ATARI",
        "long_name": "Atari SA",
        "summary": "Atari SA operates as a multi-platform, interactive entertainment, and licensing products company worldwide. The company offers video games; monetization of games through multiple channels, multimedia production, and licensing activities; regulated online casino games; Atari VCS, the new personal computer (PC), a hybrid system combining a PC and a console-type environment; and Atari Partners, which covers investments in technology companies, primarily by licensing the Atari brand and the blockchain activity/Atari Token. It owns and/or manages a portfolio of approximately 200 games and franchises under the Asteroids, Centipede, Missile Command, Pong, and RollerCoaster Tycoon brands. The company was formerly known as Infogrames Entertainment SA and changed its name to Atari SA in May 2009. Atari SA was founded in 1972 and is headquartered in Paris, France.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Paris"
    },
    "POPR.V": {
        "short_name": "POPREACH CORPORATION",
        "long_name": "PopReach Corporation",
        "summary": "PopReach Corporation operates as a free-to-play mobile game publisher in North America, Europe, Australia, and internationally. It focuses on acquiring and optimizing proven game franchises. The company owns 12 game franchises, including Smurfs' Village, Kitchen Scramble, Gardens of Time, City Girl Life, War of Nations, and Kingdoms of Camelot. The company is headquartered in Toronto, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VAN",
        "market": "ca_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "POPRF": {
        "short_name": "POPREACH CORPORATION",
        "long_name": "PopReach Corporation",
        "summary": "PopReach Corporation operates as a free-to-play mobile game publisher in North America, Europe, Australia, and internationally. It focuses on acquiring and optimizing proven game franchises. The company owns 12 game franchises, including Smurfs' Village, Kitchen Scramble, Gardens of Time, City Girl Life, War of Nations, and Kingdoms of Camelot. The company is headquartered in Toronto, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "R0F.F": {
        "short_name": "ROVIO ENTERTAINMENT OYJ",
        "long_name": "Rovio Entertainment Oyj",
        "summary": "Rovio Entertainment Oyj, a games-first entertainment company, creates, develops, and publishes mobile games in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It operates through Games, Brand Licensing, and Other segments. The company offers various mobile games through mobile application stores; produces movies; and licenses the Angry Birds brand to consumer and entertainment products, as well as develops a cloud-based game service. It also provides physical merchandise, including toys and apparel, as well as location-based entertainment, such as activity parks; and books and comics, animated series, and digital products. Rovio Entertainment Oyj was founded in 2003 and is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "RDML": {
        "short_name": "RED MILE ENTERTAINMENT INC",
        "long_name": "Red Mile Entertainment Inc.",
        "summary": "Red Mile Entertainment Inc. develops and publishes entertainment software. The company develops products for console video game systems, personal computers, and other interactive entertainment platforms.. The company sells its games directly to distributors and retailers in North America. The company was founded in 2004 and is based in San Anselmo, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Anselmo"
    },
    "REMEDY.HE": {
        "short_name": "Remedy Entertainment Oyj",
        "long_name": "Remedy Entertainment Oyj",
        "summary": "Remedy Entertainment Oyj develops and sells console and computer games in Finland. It primarily creates cinematic action games. The company was founded in 1995 and is based in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "RFV.SG": {
        "short_name": "Don't Nod Entertainment S.A. Ac",
        "long_name": "Don't Nod Entertainment S.A.",
        "summary": "Don't Nod Entertainment S.A. develops and sells video games worldwide. It offers games in various genres, including adventure, action, and role play for consoles, PCs, smartphones, tablets, Mac, and TVs. The company was founded in 2008 and is based in Paris, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "France",
        "city": "Paris"
    },
    "RHRD.F": {
        "short_name": "CONTAGIOUS GAMING INC.",
        "long_name": "Contagious Gaming Inc.",
        "summary": "Contagious Gaming Inc. develops and provides software solutions for gaming and lottery markets primarily in Canada. The company offers an integrated end-end platform, which manages various aspects of real-money gaming, including gaming engine, player management tools, game application interface, payment systems interface, data feed handler, affiliate management, presentation layer, and proprietary centralized eWallet. It also provides Web-based and mobile content for lottery, and real-money and social gaming applications; and Goal Time, an in-play pari-mutuel sports betting platform. Contagious Gaming Inc. is headquartered in Vancouver, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "RIVX": {
        "short_name": "RIVEX TECHNOLOGY CORP",
        "long_name": "Rivex Technology Corp.",
        "summary": "Rivex Technology Corp. does not have significant operations. The company is seeking new business opportunities with established business entities for merger with or acquisition of a target business. Previously, it was engaged in the development and sale of mobile games for Apple and Android platforms. The company was founded in 2014 and is based in Kalispell, Montana.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Kalispell"
    },
    "RNWA.F": {
        "short_name": "REALNETWORKS NEW  DL-,001",
        "long_name": "RealNetworks, Inc.",
        "summary": "RealNetworks, Inc. provides digital media applications and services. Its Consumer Media segment offers RealPlayer media player, a software that enables consumers to discover, play, download, manage, and edit digital video, stream audio and video, download and save photos and videos from the web, transfer and share content on social networks, and edit their own photo and video content. This segment also licenses its codec technology to electronic equipment, microchip, and integrated circuit manufacturers. The company's Mobile Services segment provides digital media services to mobile and online service providers as software as a service offerings, which include intercarrier messaging services; Kontxt, a text message management, anti-spam, and classification product; ringback tone that enables callers to hear subscriber-selected music or messages; business intelligence, and subscriber management and billing for the carriers; RealTimes, a photo and video sharing platform that offers to wireless carriers for integration in their hosted cloud solutions; and SAFR, a computer vision platform. Its Games segment develops, publishes, and distributes casual games, including time-management, board, card, puzzle, word, and hidden-object games. It offers its casual games through mobile devices, digital downloads, and subscription play. The company also develops and markets software products and services. RealNetworks, Inc. provides its products and services through direct and indirect channels comprising public relations, trade shows, events, and speaking opportunities; online channels, including social media; third party distribution partners; and third-party distribution channels, such as application storefronts, search engines, online portals, and content publishers. It offers its software and services to consumers, mobile carriers, device manufacturers, system integrators, and other businesses. The company was founded in 1994 and is headquartered in Seattle, Washington.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "Seattle"
    },
    "RNWK": {
        "short_name": "RealNetworks, Inc.",
        "long_name": "RealNetworks, Inc.",
        "summary": "RealNetworks, Inc. provides digital media applications and services. Its Consumer Media segment offers RealPlayer media player, a software that enables consumers to discover, play, download, manage, and edit digital video, stream audio and video, download and save photos and videos from the web, transfer and share content on social networks, and edit their own photo and video content. This segment also licenses its codec technology to electronic equipment, microchip, and integrated circuit manufacturers. The company's Mobile Services segment provides digital media services to mobile and online service providers as software as a service offerings, which include intercarrier messaging services; Kontxt, a text message management, anti-spam, and classification product; ringback tone that enables callers to hear subscriber-selected music or messages; business intelligence, and subscriber management and billing for the carriers; RealTimes, a photo and video sharing platform that offers to wireless carriers for integration in their hosted cloud solutions; and SAFR, a computer vision platform. Its Games segment develops, publishes, and distributes casual games, including time-management, board, card, puzzle, word, and hidden-object games. It offers its casual games through mobile devices, digital downloads, and subscription play. The company also develops and markets software products and services. RealNetworks, Inc. provides its products and services through direct and indirect channels comprising public relations, trade shows, events, and speaking opportunities; online channels, including social media; third party distribution partners; and third-party distribution channels, such as application storefronts, search engines, online portals, and content publishers. It offers its software and services to consumers, mobile carriers, device manufacturers, system integrators, and other businesses. The company was founded in 1994 and is headquartered in Seattle, Washington.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Seattle"
    },
    "ROVIO.HE": {
        "short_name": "Rovio Entertainment Corporation",
        "long_name": "Rovio Entertainment Oyj",
        "summary": "Rovio Entertainment Oyj, a games-first entertainment company, creates, develops, and publishes mobile games in North America, Latin America, Europe, the Middle East, Africa, and the Asia Pacific. It operates through Games, Brand Licensing, and Other segments. The company offers various mobile games through mobile application stores; produces movies; and licenses the Angry Birds brand to consumer and entertainment products, as well as develops a cloud-based game service. It also provides physical merchandise, including toys and apparel, as well as location-based entertainment, such as activity parks; and books and comics, animated series, and digital products. Rovio Entertainment Oyj was founded in 2003 and is headquartered in Espoo, Finland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "HEL",
        "market": "fi_market",
        "country": "Finland",
        "city": "Espoo"
    },
    "RYU.F": {
        "short_name": "SEGA SAMMY HOLDINGS INC.",
        "long_name": "Sega Sammy Holdings Inc.",
        "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "S7T1.F": {
        "short_name": "BLOCPLAY ENTERTAINMENT",
        "long_name": "Blocplay Entertainment Inc.",
        "summary": "Blocplay Entertainment Inc. develops platforms and publishes video games. The company was formerly known as Stompy Bot Corporation and changed its name to Blocplay Entertainment Inc. in February 2018. Blocplay Entertainment Inc. was incorporated in 2014 and is based in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SCFR": {
        "short_name": "SECURITY FIRST INTL HOLDINGS IN",
        "long_name": "GamesGamesGames Technology, Inc.",
        "summary": "GamesGamesGames Technology, Inc. focuses on the development, acquisition, and marketing of software applications, client-side and mobile software applications, and video game titles for various platforms. It intends to develop software, primarily video games, smartphone, and Web-based applications for various platforms, such as Microsoft's Xbox, Sony Playstation, and PClApple platforms, as well as for the Android and iPhone mobile systems. The company was formerly known as Security First International Holdings, Inc. and changed its name to GamesGamesGames Technology, Inc. in February 2012. GamesGamesGames Technology, Inc. is based in Pensacola, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Pensacola"
    },
    "SCPL": {
        "short_name": "SciPlay Corporation",
        "long_name": "SciPlay Corporation",
        "summary": "SciPlay Corporation develops and publishes digital games on mobile and Web platforms worldwide. The company offers seven games, which include social casino games, such as Jackpot Party Casino, Gold Fish Casino, Hot Shot Casino, and Quick Hit Slots, as well as casual games comprising MONOPOLY Slots, Bingo Showdown, and 88 Fortunes Slots. Its social casino games include slots-style game play, as well as table games-style game play; and casual games blend slots-style or bingo game play with adventure game features. The company was formerly known as SG Social Games Corporation and changed its name to SciPlay Corporation in March 2019. SciPlay Corporation was founded in 1997 and is based in Las Vegas, Nevada. SciPlay Corporation is a subsidiary of Scientific Games Corporation.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "SE": {
        "short_name": "Sea Limited",
        "long_name": "Sea Limited",
        "summary": "Sea Limited engages in the digital entertainment, e-commerce, and digital financial service businesses in Southeast Asia, Latin America, rest of Asia, and internationally. It provides Garena digital entertainment platform for users to access mobile and PC online games, as well as eSports operations; and access to other entertainment content, such as livestreaming of gameplay and social features , such as user chat and online forums. The company also operates Shopee e-commerce platform, a mobile-centric marketplace that offers integrated payment and logistics infrastructure and seller services. In addition, it offers SeaMoney digital financial services to individuals and businesses, including e-wallet and payment services AirPay, ShopeePay, ShopeePayLater, and other digital financial services brands; and payment processing services for Shopee. The company was formerly known as Garena Interactive Holding Limited and changed its name to Sea Limited in April 2017. Sea Limited was founded in 2009 and is headquartered in Singapore.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "Singapore",
        "city": "Singapore"
    },
    "SF.ST": {
        "short_name": "Stillfront Group AB",
        "long_name": "Stillfront Group AB (publ)",
        "summary": "Stillfront Group AB (publ), through its subsidiaries, designs, develops, markets, publishes, and distributes digital games in Europe, North America, the United Kingdom, and the Middle East and North Africa region. The company's games portfolio include Albion Online, Battle pirates, Big Farm: Mobile Harvest, BitLife, eRepublik.com, Call of War, Conflict of Nations: World War 3, Goodgame Empire, Hollywood Story, Home Design Makeover!, Imperia Online, My Story, Nida Harb 3, OFM, Property Brothers Home Design, Shakes & Fidget, Siege: World War II, The Horus Heresy: Legions, and Trivia Star. Its games portfolio also include Unravel Two, War and Peace: American Civil War, War Commander: Rogue Assault, Word Collect, Word nut, What's the Pic, Adult Coloring Book, Letter Soup, World at War: WW2, War Commander, Vega Conflict, Tabou Stories, ManagerZone Football and Hockey, Strike of Nations, Supremacy 1914, World at War, Empire: Four Kingdoms, and GemStone. The company is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "SGAMF": {
        "short_name": "SEGA SAMMY HLDGS INC",
        "long_name": "Sega Sammy Holdings Inc.",
        "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SGAMY": {
        "short_name": "SEGA SAMMY HLDGS INC",
        "long_name": "Sega Sammy Holdings Inc.",
        "summary": "Sega Sammy Holdings Inc., through its subsidiaries, engages in the game machine, entertainment contents, and resort businesses. The company's Pachislot and Pachinko Machines Business segment develops, manufactures, and sells pachislot and pachinko machines. Its Entertainment Contents Business segment is involved in the development and sale of digital game software, packaged game software, and amusement machines; development and operation of amusement centers; planning, production, and sale of animated films; and development, manufacture, and sale of toys. The company's Resort Business segment develops and operates hotels and golf courses, etc. in integrated resorts business and other facilities businesses. Sega Sammy Holdings Inc. was founded in 2004 and is based in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SGNI": {
        "short_name": "STEMGEN INC",
        "long_name": "StemGen, Inc.",
        "summary": "StemGen, Inc. engages in the community offering and management of online competitions in the motorsports arena. It offers a virtual-to-real platform in the motorsports industry. The company is based in Angleton, Texas.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Angleton"
    },
    "SKLZ": {
        "short_name": "Skillz Inc.",
        "long_name": "Skillz Inc.",
        "summary": "Skillz Inc. develops and operates an e-sports platform that connects and hosts mobile games and mobile e-sports tournaments through competitions in the United States and internationally. It offers Skillz that helps developers build franchises by enabling social competition in their games and distribute prizes. The company's Skillz operates as a tournament platform where mobile gamers can use their skills to compete for cash and prizes. Skillz Inc. was formerly known as Lookout Gaming LLC. The company was founded in 2012 and is based in San Francisco, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "city": "San Francisco"
    },
    "SL4A.F": {
        "short_name": "BRAGG GAMING GRP NEW",
        "long_name": "Bragg Gaming Group Inc.",
        "summary": "Bragg Gaming Group Inc. provides B2B online gaming technology services worldwide. It offers turnkey solution, including an omni-channel retail, online, and mobile iGaming platforms, as well as casino content aggregator, lottery, marketing, and operational services. The company also provides GIVEMESPORT, a Facebook sport publisher; and GIVEMEBET, a sports book. Bragg Gaming Group Inc. is headquartered in Toronto, Canada.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "SLGG": {
        "short_name": "Super League Gaming, Inc.",
        "long_name": "Super League Gaming, Inc.",
        "summary": "Super League Gaming, Inc. operates an amateur esports content network. The company engages in capturing, generating, aggregating, and distributing content in various esports through social media, live streaming, and video-on-demand, as well as continuous gameplay and leaderboards. It offers Framerate, an independent social video esports network with user-generated reels; and Minehut, a social and gameplay forum for the avid Minecraft community. The company was formerly known as Nth Games, Inc. and changed its name to Super League Gaming, Inc. in June 2015. Super League Gaming, Inc. was incorporated in 2014 and is based in Santa Monica, California.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "Santa Monica"
    },
    "SOPK": {
        "short_name": "SOUTHPEAK INTERACTIVE CORPORATI",
        "long_name": "SouthPeak Interactive Corporation",
        "summary": "SouthPeak Interactive Corporation develops, markets, and publishes interactive entertainment software. The company offers videogames for various gaming and entertainment hardware platforms, including home videogame consoles, such as Microsoft Xbox 360, Nintendo Wii, and Sony PS3 and PS2; for handheld platforms, including Nintendo DS, Nintendo DSi, Sony PlayStation Portable, Sony PSPgo, and Apple iPhone; for game applications for the Next Generation NVIDIA Tegra mobile processor, which is used in Droid phones and tablets; and for personal computers. It serves various customers ranging from casual players to hardcore gaming enthusiasts. The company sells its products to retailers and distributors in North America and the United Kingdom, and primarily to distributors in the rest of Europe, Australia, and Asia. SouthPeak Interactive Corporation was founded in 1996 and is based in Midlothian, Virginia.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Midlothian"
    },
    "SPIFF.ST": {
        "short_name": "Spiffbet AB",
        "long_name": "Spiffbet AB",
        "summary": "Spiffbet AB engages in the development of games and platforms in Sweden. The company was founded in 2011 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "SPLY": {
        "short_name": "SOCIALPLAY USA INC",
        "long_name": "SocialPlay USA, Inc.",
        "summary": "SocialPlay USA, Inc. focuses on provision of marketing, monetization, and support services for the companies in gaming and mobile application markets in the United States and Canada. The company was formerly known as Artesanias Corp. and changed its name to SocialPlay USA, Inc. in July 2015. SocialPlay USA, Inc. was founded in 2013 and is based in Las Vegas, Nevada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Las Vegas"
    },
    "SPYR": {
        "short_name": "SPYR INC",
        "long_name": "SPYR, Inc.",
        "summary": "SPYR, Inc., through its subsidiary, SPYR APPS, LLC, engages in developing, publishing, and co-publishing mobile games and applications. The company was formerly known as Eat at Joe's, Ltd. and changed its name to SPYR, Inc. in March 2015. SPYR, Inc. was incorporated in 1988 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "SQNNY": {
        "short_name": "SQUARE ENIX HOLDINGS CO.LTD.",
        "long_name": "Square Enix Holdings Co., Ltd.",
        "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "SQNXF": {
        "short_name": "SQUARE ENIX HOLDINGS CO.LTD.",
        "long_name": "Square Enix Holdings Co., Ltd.",
        "summary": "Square Enix Holdings Co., Ltd. operates in the content and service businesses in Japan, North America, Europe, and rest of Asia. It operates through four segments: Digital Entertainment, Amusement, Publication, and Merchandising. The company's Digital Entertainment segment plans, develops, distributes, and operates digital entertainment content primarily in the form of games. This segment offers digital entertainment content for various customer usage environments, including personal computers and smart devices, as well as consumer game consoles, such as handheld game machines. Its Amusement segment is involved in the operation of amusement facilities. This segment also engages in the planning, development, distribution, and rental of arcade game machines and related products for amusement facilities. The company's Publication segment publishes and licenses comic magazines, comic books, and game-related books. Its Merchandising segment plans, produces, distributes, and licenses derivative products. The company publishes, distributes, and licenses entertainment content under the SQUARE ENIX and TAITO brands. Square Enix Holdings Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "STAR-B.ST": {
        "short_name": "Starbreeze AB ser. B",
        "long_name": "Starbreeze AB (publ)",
        "summary": "Starbreeze AB (publ) operates as an independent creator, publisher, and distributor of entertainment products in Sweden, rest of Europe, the United States, and Asia. The company operates through four segments: Starbreeze Games, Publishing, VR Tech & Operations, and Other. It develops and publishes games for PC and console, as well as other platforms, such as mobile. The company also develops technology and software products in virtual reality; and operates VR parks. Starbreeze AB (publ) was founded in 1998 and is headquartered in Stockholm, Sweden.",
        "currency": "SEK",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STO",
        "market": "se_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "STIE": {
        "short_name": "SANTARO INTERACTIVE ENTMT CO",
        "long_name": "Santaro Interactive Entertainment Company",
        "summary": "Santaro Interactive Entertainment Company designs, develops, and operates 3D online games primarily in the People's Republic of China and Korea. The company develops and operates Web-based massive multiplayer online role-playing games, mobile games, and browser game platforms, as well as provides related products and services. It also sells virtual and physical prepaid game cards with a range of game points through third-party distributors. In addition, the company provides game art design services for third-party game companies. Santaro Interactive Entertainment Company was founded in 2006 and is based in Beijing, the People's Republic of China.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Beijing"
    },
    "STLFF": {
        "short_name": "STILLFRONT GROUP AB",
        "long_name": "Stillfront Group AB (publ)",
        "summary": "Stillfront Group AB (publ), through its subsidiaries, designs, develops, markets, publishes, and distributes digital games in Europe, North America, the United Kingdom, and the Middle East and North Africa region. The company's games portfolio include Albion Online, Battle pirates, Big Farm: Mobile Harvest, BitLife, eRepublik.com, Call of War, Conflict of Nations: World War 3, Goodgame Empire, Hollywood Story, Home Design Makeover!, Imperia Online, My Story, Nida Harb 3, OFM, Property Brothers Home Design, Shakes & Fidget, Siege: World War II, The Horus Heresy: Legions, and Trivia Star. Its games portfolio also include Unravel Two, War and Peace: American Civil War, War Commander: Rogue Assault, Word Collect, Word nut, What's the Pic, Adult Coloring Book, Letter Soup, World at War: WW2, War Commander, Vega Conflict, Tabou Stories, ManagerZone Football and Hockey, Strike of Nations, Supremacy 1914, World at War, Empire: Four Kingdoms, and GemStone. The company is headquartered in Stockholm, Sweden.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Sweden",
        "city": "Stockholm"
    },
    "SUMGF": {
        "short_name": "SUMO GROUP PLC",
        "long_name": "Sumo Group Plc",
        "summary": "Sumo Group Plc, together with its subsidiaries, designs, develops, and provides video games in the United Kingdom, India, and Canada. The company develops games across a range of console platforms, PC, handheld, and mobile devices. It also offers creative and development services to entertainment industry, including games, TV, films, and visual effects. The company was founded in 2003 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United Kingdom",
        "city": "Sheffield"
    },
    "SUMO.L": {
        "short_name": "SUMO GROUP PLC ORD GBP0.01",
        "long_name": "Sumo Group Plc",
        "summary": "Sumo Group Plc, together with its subsidiaries, designs, develops, and provides video games in the United Kingdom, India, and Canada. The company develops games across a range of console platforms, PC, handheld, and mobile devices. It also offers creative and development services to entertainment industry, including games, TV, films, and visual effects. The company was founded in 2003 and is headquartered in Sheffield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Sheffield"
    },
    "TAPM": {
        "short_name": "TAPINATOR INC",
        "long_name": "Tapinator, Inc.",
        "summary": "Tapinator, Inc. develops and publishes mobile games and applications on the iOS, Google Play, and Amazon platforms in North America, Europe, and Asia. Its portfolio includes approximately 300 mobile gaming titles, such as Video Poker Classic, Solitaire Dash, and Crypto Trillionaire. The company was founded in 2013 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "TBU.SG": {
        "short_name": "T-Bull S.A. Inhaber-Aktien ZY-,",
        "long_name": "T-Bull S.A.",
        "summary": "T-Bull S.A. engages in the design, manufacture, and distribution of games for mobile devices in Poland. The company's games include Tank Battle Heroes, Idle Racing GO, Top Speed, Moto Rider GO, Traffic Xtreme 3D, Best Sniper, Racing Xtreme, Top Boat, Road Racing, and Top Bike. It provides its games through various platforms. The company is based in Wroclaw, Poland.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Poland",
        "city": "Wroclaw"
    },
    "TH9A.F": {
        "short_name": "EMBRACER GROUP AB B O.N.",
        "long_name": "Embracer Group AB (publ)",
        "summary": "Embracer Group AB (publ), together with its subsidiaries, develops and publishes PC and console games for the gaming market in Europe, the United States, Sweden, and internationally. The company's game catalogue consists of 190 owned franchises, such as Saints Row, Goat Simulator, Dead Island, Darksiders, Metro, MX vs ATV, Kingdoms of Amalur, TimeSplitters, Satisfactory, Wreckfest, Insurgency, World War Z, and others. It also publishes games for various partners. In addition, the company publishes and distributes films. It distributes games through retailers and digital distributors. The company was formerly known as THQ Nordic AB (publ) and changed its name to Embracer Group AB (publ) in October 2019. Embracer Group AB (publ) was incorporated in 1999 and is headquartered in Karlstad, Sweden.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Sweden",
        "city": "Karlstad"
    },
    "THQQF": {
        "short_name": "EMBRACER GROUP AB",
        "long_name": "Embracer Group AB (publ)",
        "summary": "Embracer Group AB (publ), together with its subsidiaries, develops and publishes PC and console games for the gaming market in Europe, the United States, Sweden, and internationally. The company's game catalogue consists of 190 owned franchises, such as Saints Row, Goat Simulator, Dead Island, Darksiders, Metro, MX vs ATV, Kingdoms of Amalur, TimeSplitters, Satisfactory, Wreckfest, Insurgency, World War Z, and others. It also publishes games for various partners. In addition, the company publishes and distributes films. It distributes games through retailers and digital distributors. The company was formerly known as THQ Nordic AB (publ) and changed its name to Embracer Group AB (publ) in October 2019. Embracer Group AB (publ) was incorporated in 1999 and is headquartered in Karlstad, Sweden.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Sweden",
        "city": "Karlstad"
    },
    "TKE.DE": {
        "short_name": "TAKE-TWO INTERACT. SOFTW.",
        "long_name": "Take-Two Interactive Software, Inc.",
        "summary": "Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company offers its products under the Rockstar Games and 2K labels, as well as under Private Division and Social Point labels. It develops and publishes action/adventure products under the Grand Theft Auto, Max Payne, Midnight Club, and Red Dead Redemption names; and offers episodes, content, and virtual currency. The company also develops brands in other genres, including the LA Noire, Bully, and Manhunt franchises. In addition, the company publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, and Borderlands. Further, it publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series. It also offers Kerbal Space Program, The Outer Worlds, Ancestors the Humankind Odyssey under Private Division. Additionally, the company offers free-to-play mobile games, such as Dragon City and Monster Legends. Its products are designed for console gaming systems, including Sony's PlayStation 4; Microsoft's Xbox One; the Nintendo Switch; and personal computers comprising smartphones and tablets. The company provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was founded in 1993 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "GER",
        "market": "de_market",
        "country": "United States",
        "city": "New York"
    },
    "TKE.F": {
        "short_name": "TAKE-TWO INTERACT. SOFTW.",
        "long_name": "Take-Two Interactive Software, Inc.",
        "summary": "Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company offers its products under the Rockstar Games and 2K labels, as well as under Private Division and Social Point labels. It develops and publishes action/adventure products under the Grand Theft Auto, Max Payne, Midnight Club, and Red Dead Redemption names; and offers episodes, content, and virtual currency. The company also develops brands in other genres, including the LA Noire, Bully, and Manhunt franchises. In addition, the company publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, and Borderlands. Further, it publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series. It also offers Kerbal Space Program, The Outer Worlds, Ancestors the Humankind Odyssey under Private Division. Additionally, the company offers free-to-play mobile games, such as Dragon City and Monster Legends. Its products are designed for console gaming systems, including Sony's PlayStation 4; Microsoft's Xbox One; the Nintendo Switch; and personal computers comprising smartphones and tablets. The company provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was founded in 1993 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "United States",
        "city": "New York"
    },
    "TM17.L": {
        "short_name": "TEAM17 GROUP PLC ORD GBP0.01",
        "long_name": "Team17 Group PLC",
        "summary": "Team17 Group PLC, together with its subsidiaries, develops video games label for independent developers worldwide. The company develops and publishes video games for the digital and physical market. Its portfolio comprises approximately 100 games, including the Worms franchise, Overcooked, and The Escapists. Team17 Group PLC was founded in 1990 and is based in Wakefield, the United Kingdom.",
        "currency": "GBp",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United Kingdom",
        "city": "Wakefield"
    },
    "TSCRF": {
        "short_name": "SCORE MEDIA AND GAMING INC",
        "long_name": "Score Media and Gaming Inc.",
        "summary": "Score Media and Gaming Inc. operates as a sports media company in North America. It offers theScore, a mobile sports application that delivers customizable news, scores, stats, and notifications for various leagues and sports; and theScore esports, which produces and shares original video content pieces across its web and social platforms, including features and documentaries on high-profile teams, games, and players from across the esports scene, as well as highlights and interviews. The company also provides theScore Bet, a mobile sports betting platform that delivers various pre-game and in-game markets and betting options, lightning-fast scores, and in-game data comprising early cash-out, and easy and secure deposit and withdrawal options. In addition, it operates theScore.com, a web platform that provides sports news, scores, and video and editorial content written by original sports voices. The company was incorporated in 2012 and is based in Toronto, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Toronto"
    },
    "TTWO": {
        "short_name": "Take-Two Interactive Software, ",
        "long_name": "Take-Two Interactive Software, Inc.",
        "summary": "Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company offers its products under the Rockstar Games and 2K labels, as well as under Private Division and Social Point labels. It develops and publishes action/adventure products under the Grand Theft Auto, Max Payne, Midnight Club, and Red Dead Redemption names; and offers episodes, content, and virtual currency. The company also develops brands in other genres, including the LA Noire, Bully, and Manhunt franchises. In addition, the company publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, and Borderlands. Further, it publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series. It also offers Kerbal Space Program, The Outer Worlds, Ancestors the Humankind Odyssey under Private Division. Additionally, the company offers free-to-play mobile games, such as Dragon City and Monster Legends. Its products are designed for console gaming systems, including Sony's PlayStation 4; Microsoft's Xbox One; the Nintendo Switch; and personal computers comprising smartphones and tablets. The company provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was founded in 1993 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "TTWO.VI": {
        "short_name": "TAKE-TWO INTERACTIVE SOFTWARE",
        "long_name": "Take-Two Interactive Software, Inc.",
        "summary": "Take-Two Interactive Software, Inc. develops, publishes, and markets interactive entertainment solutions for consumers worldwide. The company offers its products under the Rockstar Games and 2K labels, as well as under Private Division and Social Point labels. It develops and publishes action/adventure products under the Grand Theft Auto, Max Payne, Midnight Club, and Red Dead Redemption names; and offers episodes, content, and virtual currency. The company also develops brands in other genres, including the LA Noire, Bully, and Manhunt franchises. In addition, the company publishes various entertainment properties across various platforms and a range of genres, such as shooter, action, role-playing, strategy, sports, and family/casual entertainment under the BioShock, Mafia, Sid Meier's Civilization, XCOM series, and Borderlands. Further, it publishes sports simulation titles comprising NBA 2K series, a basketball video game; the WWE 2K professional wrestling series. It also offers Kerbal Space Program, The Outer Worlds, Ancestors the Humankind Odyssey under Private Division. Additionally, the company offers free-to-play mobile games, such as Dragon City and Monster Legends. Its products are designed for console gaming systems, including Sony's PlayStation 4; Microsoft's Xbox One; the Nintendo Switch; and personal computers comprising smartphones and tablets. The company provides its products through physical retail, digital download, online platforms, and cloud streaming services. Take-Two Interactive Software, Inc. was founded in 1993 and is headquartered in New York, New York.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "VIE",
        "market": "at_market",
        "country": "United States",
        "city": "New York"
    },
    "UBI.PA": {
        "short_name": "UBISOFT ENTERTAIN",
        "long_name": "Ubisoft Entertainment SA",
        "summary": "Ubisoft Entertainment SA produce, publishes, and distributes video games for consoles, PC, smartphones, and tablets in both physical and digital formats worldwide. The company designs and develops software, including scenarios, layouts, and game rules, as well as develops design tools and game engines. It is also involved in the development in the area of online and mobile gaming; and film business. The company distributes Ubisoft products to retailers and independent wholesalers. Ubisoft Entertainment SA has a strategic partnership with Tencent; and collaboration with Lucasfilm Games. The company was founded in 1986 and is headquartered in Montreuil, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PAR",
        "market": "fr_market",
        "country": "France",
        "city": "Montreuil"
    },
    "UBSFF": {
        "short_name": "UBISOFT ENTERTAINMENT",
        "long_name": "Ubisoft Entertainment SA",
        "summary": "Ubisoft Entertainment SA produce, publishes, and distributes video games for consoles, PC, smartphones, and tablets in both physical and digital formats worldwide. The company designs and develops software, including scenarios, layouts, and game rules, as well as develops design tools and game engines. It is also involved in the development in the area of online and mobile gaming; and film business. The company distributes Ubisoft products to retailers and independent wholesalers. Ubisoft Entertainment SA has a strategic partnership with Tencent; and collaboration with Lucasfilm Games. The company was founded in 1986 and is headquartered in Montreuil, France.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Montreuil"
    },
    "UBSFY": {
        "short_name": "UBISOFT ENTERTAINMENT",
        "long_name": "Ubisoft Entertainment SA",
        "summary": "Ubisoft Entertainment SA produce, publishes, and distributes video games for consoles, PC, smartphones, and tablets in both physical and digital formats worldwide. The company designs and develops software, including scenarios, layouts, and game rules, as well as develops design tools and game engines. It is also involved in the development in the area of online and mobile gaming; and film business. The company distributes Ubisoft products to retailers and independent wholesalers. Ubisoft Entertainment SA has a strategic partnership with Tencent; and collaboration with Lucasfilm Games. The company was founded in 1986 and is headquartered in Montreuil, France.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "France",
        "city": "Montreuil"
    },
    "UEN.F": {
        "short_name": "UBISOFT ENTMT IN.EO-,0775",
        "long_name": "Ubisoft Entertainment SA",
        "summary": "Ubisoft Entertainment SA produce, publishes, and distributes video games for consoles, PC, smartphones, and tablets in both physical and digital formats worldwide. The company designs and develops software, including scenarios, layouts, and game rules, as well as develops design tools and game engines. It is also involved in the development in the area of online and mobile gaming; and film business. The company distributes Ubisoft products to retailers and independent wholesalers. Ubisoft Entertainment SA has a strategic partnership with Tencent; and collaboration with Lucasfilm Games. The company was founded in 1986 and is headquartered in Montreuil, France.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "France",
        "city": "Montreuil"
    },
    "VRVR": {
        "short_name": "VIRTUAL INTERACTIVE TECHNO CORP",
        "long_name": "Virtual Interactive Technologies Corp.",
        "summary": "Virtual Interactive Technologies Corp. provides financing solutions for independent video game developers worldwide. It finances the development of video game projects to be released on various gaming platforms in exchange for a royalty stream on the games. The company was founded in 2016 and is headquartered in Denver, Colorado.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Denver"
    },
    "VS": {
        "short_name": "Versus Systems Inc.",
        "long_name": "Versus Systems Inc.",
        "summary": "Versus Systems Inc. operates a business-to-business software platform that allows video game publishers and developers to offer prize-based matches of their games to their players in Canada and the United States. The company is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NCM",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "VS.CN": {
        "short_name": "VersusSystems",
        "long_name": "Versus Systems Inc.",
        "summary": "Versus Systems Inc. operates a business-to-business software platform that allows video game publishers and developers to offer prize-based matches of their games to their players in Canada and the United States. The company is headquartered in Vancouver, Canada.",
        "currency": "CAD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "CNQ",
        "market": "ca_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "VSQTF": {
        "short_name": "VICTORY SQUARE TECHNOLOGIES INC",
        "long_name": "Victory Square Technologies Inc.",
        "summary": "Victory Square Technologies Inc. is a private equity and venture capital firm specializing in incubation, acquisition and invests in startups, and provides the senior leadership and resources needed to growth. Through its portfolio companies it focuses on technologies in blockchain, machine learning, artificial intelligence, and virtual reality/augmented reality, finance, health, real estate, insurance, mobile gaming, film, esports, cannabis, sports betting, and education. The company formerly known as Fantasy 6 Sports Inc. and changed its name to Victory Square Technologies Inc. in June 2017. Victory Square Technologies Inc. was incorporated in 2015 and is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    },
    "WINR": {
        "short_name": "SIMPLICITY ESPORTS AND GAMING C",
        "long_name": "Simplicity Esports and Gaming Company",
        "summary": "Simplicity Esports and Gaming Company operates as an esports company in the United States and India. It owns and operates games and entertainment centers, as well as e-sports gaming centers. It offers an interactive and fun experience to customers at its centers; blending augmented reality and virtual reality and other games; indoor entertainment; and food and beverage options to corporate customers, families, friends, and children. The company was formerly known as Smaaash Entertainment Inc. and changed its name to Simplicity Esports and Gaming Company in January 2019. Simplicity Esports and Gaming Company was incorporated in 2017 and is based in Boca Raton, Florida.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Boca Raton"
    },
    "YVR": {
        "short_name": "Liquid Media Group Ltd.",
        "long_name": "Liquid Media Group Ltd.",
        "summary": "Liquid Media Group Ltd. operates as a media and entertainment company. The company provides video game products primarily for the casual-game consumers; and publishes video games for interactive entertainment hardware platforms. It also offers gaming, visual effects (VFX), and production services; and distributes third-party film and TV content through its digital platforms. Liquid Media Group Ltd. is headquartered in Vancouver, Canada.",
        "currency": "USD",
        "sector": "Communication Services",
        "industry": "Electronic Gaming & Multimedia",
        "exchange": "NMS",
        "market": "us_market",
        "country": "Canada",
        "city": "Vancouver"
    }
}