{
  "IQCD.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Chemicals",
    "long_name": "Industries Qatar Q.P.S.C.",
    "market": "qa_market",
    "sector": "Basic Materials",
    "short_name": "Industries Qatar QPSC",
    "state": null,
    "summary": "Industries Qatar Q.P.S.C., through its subsidiaries, engages in the petrochemical, fertilizer, and steel businesses primarily in Qatar. Its Petrochemicals segment produces and sells ethylene, polyethylene, methyl-tertiary-butyl-ether, methanol, caustic soda, ethylene dichloride, vinyl chloride monomer, Sulphur, pyrolysis gasoline, mixed LPG, and other petrochemical products. The company's Fertilizers segment produces and sells urea, ammonia, melamine, and urea formaldehyde condensate. Its Steel segment produces and sells direct reduced and hot briquetted iron; and steel coils, bars, billets, and other products. The company also exports its products. The company was founded in 1969 and is headquartered in Doha, Qatar. Industries Qatar Q.P.S.C. is a subsidiary of Qatar Petroleum.",
    "website": "http://www.iq.com.qa",
    "zipcode": null
  },
  "MPHC.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Chemicals",
    "long_name": "Mesaieed Petrochemical Holding Company Q.P.S.C.",
    "market": "qa_market",
    "sector": "Basic Materials",
    "short_name": "Mesaieed Petrochemical Holding ",
    "state": null,
    "summary": "Mesaieed Petrochemical Holding Company Q.P.S.C., through its subsidiaries, manufactures and sells petrochemical products in Qatar, the Middle East, Asia, Africa, Indian sub-continent, and Europe. The company operates through two segments, Petrochemicals and Chlor-Alkali. It is involved in the production and sale of ethylene, polyolefins, 1-hexene, C4+, polyethylene, normal alpha olefins, pyrolysis gasoline, C3 and C4, caustic soda, ethylene dichloride, vinyl chloride monomer, and hydrochloric acid. The company was founded in 2013 and is headquarterd in Doha, Qatar. Mesaieed Petrochemical Holding Company Q.P.S.C. is a subsidiary of Qatar Petroleum.",
    "website": "http://www.mphc.com.qa",
    "zipcode": null
  },
  "QAMC.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Aluminum",
    "long_name": "Qatar Aluminium Manufacturing Company Q.P.S.C.",
    "market": "qa_market",
    "sector": "Basic Materials",
    "short_name": "Qatar Aluminium Manufacturing Q",
    "state": null,
    "summary": "Qatar Aluminium Manufacturing Company Q.P.S.C. produces and sells aluminum products in Asia, Europe, and the United States. It offers extrusion ingots and foundry alloys for the use in automotive, construction, and engineering industries, as well as in the manufacturing of consumer goods. The company was founded in 2018 and is headquartered in Doha, Qatar. Qatar Aluminium Manufacturing Company Q.P.S.C. is a subsidiary of Qatar Petroleum.",
    "website": "http://www.qamco.com.qa",
    "zipcode": null
  },
  "QIGD.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Building Materials",
    "long_name": "Qatari Investors Group Q.S.C.",
    "market": "qa_market",
    "sector": "Basic Materials",
    "short_name": "Qatari Investors Group QPSC",
    "state": null,
    "summary": "Qatari Investors Group Q.S.C. engages in cement manufacturing, investments, real estate, security systems, trading, and retail businesses primarily in Qatar. The company offers project engineering, fabrication and erection, commissioning, and post-commissioning services; administrative management and consultation services for construction, elevator, normal adjustment and central, showroom, building material, marble, and ceramic projects; and design, manufacturing supply, and erection services for steel structures and pre-engineered steel buildings. It also provides container line, air and sea freight, custom and project cargo clearance, heavy lift movement, break and dry bulk cargo carriers, freight forwarding, project logistics, warehousing, and distribution; invests in, develops, and rents properties; and provides real estate consultancy services. In addition, the company restores and renovates buildings; arranges indoor areas; provides garden landscaping services; constructs swimming pools; and designs, engineers, assembles, installs, commissions, and maintains integrated security, safety, closed circuit television, access control, fire alarm, industrial surveillance and monitoring, public address and voice evacuation, perimeter protection, road blocking, and X-ray systems. Further, it offers electronics displays and LED video screens for the sports industry; display signage for the hotel and hospitality industry, clubs, schools, sports venues, airport, and traffic installations; and specialized vehicles for civil defense, construction, road sweeping, and other government institutions. Additionally, it builds tennis and volleyball courts, and other sports-related fields; supplies and installs sports and fitness equipment; brokerages shares; provides management and investment funds; manages and markets shares and securities; and trades in construction material, equipment, and trucks. The company was founded in 2006 and is headquartered in Doha, Qatar.",
    "website": "http://www.qatariinvestors.com",
    "zipcode": null
  },
  "QNCD.QA": {
    "city": "Doha",
    "country": "Qatar",
    "currency": "QAR",
    "exchange": "DOH",
    "industry": "Building Materials",
    "long_name": "Qatar National Cement Company (Q.P.S.C.)",
    "market": "qa_market",
    "sector": "Basic Materials",
    "short_name": "Qatar National Cement QPSC",
    "state": null,
    "summary": "Qatar National Cement Company (Q.P.S.C.) manufactures and sells cement, washed sand, and other by-products in Qatar. It offers ordinary Portland cement, sulphate resistant cement, hydrated and calcined lime, Portland pulverized fuel ash cement, and calcium carbonate. The company was founded in 1965 and is headquartered in Doha, Qatar.",
    "website": "http://www.qatarcement.com",
    "zipcode": null
  }
}
