{
    "QIGD.QA": {
        "short_name": "Qatari Investors Group QPSC",
        "long_name": "Qatari Investors Group Q.S.C.",
        "summary": "Qatari Investors Group Q.S.C. engages in cement manufacturing, investments, real estate, security systems, trading, and retail businesses primarily in Qatar. The company offers project engineering, fabrication and erection, commissioning, and post-commissioning services; administrative management and consultation services for construction, elevator, normal adjustment and central, showroom, building material, marble, and ceramic projects; and design, manufacturing supply, and erection services for steel structures and pre-engineered steel buildings. It also provides container line, air and sea freight, custom and project cargo clearance, heavy lift movement, break and dry bulk cargo carriers, freight forwarding, project logistics, warehousing, and distribution; invests in, develops, and rents properties; and provides real estate consultancy services. In addition, the company restores and renovates buildings; arranges indoor areas; provides garden landscaping services; constructs swimming pools; and designs, engineers, assembles, installs, commissions, and maintains integrated security, safety, closed circuit television, access control, fire alarm, industrial surveillance and monitoring, public address and voice evacuation, perimeter protection, road blocking, and X-ray systems. Further, it offers electronics displays and LED video screens for the sports industry; display signage for the hotel and hospitality industry, clubs, schools, sports venues, airport, and traffic installations; and specialized vehicles for civil defense, construction, road sweeping, and other government institutions. Additionally, it builds tennis and volleyball courts, and other sports-related fields; supplies and installs sports and fitness equipment; brokerages shares; provides management and investment funds; manages and markets shares and securities; and trades in construction material, equipment, and trucks. The company was founded in 2006 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    },
    "QNCD.QA": {
        "short_name": "Qatar National Cement QPSC",
        "long_name": "Qatar National Cement Company (Q.P.S.C.)",
        "summary": "Qatar National Cement Company (Q.P.S.C.) manufactures and sells cement and washed sand in Qatar. It offers ordinary Portland cement, sulphate resistant cement, hydrated and calcined lime, Portland pulverized fuel ash cement, and calcium carbonate. The company was founded in 1965 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "city": "Doha"
    }
}