{
    "AHCS.QA": {
        "short_name": "Aamal QPSC",
        "long_name": "Aamal Company Q.P.S.C.",
        "summary": "Aamal Company Q.P.S.C., together with its subsidiaries, engages in the property, trading and distribution, industrial manufacturing, and managed services businesses in Qatar and internationally. The company's Property segment is involved in leasing the facilities of retail outlet complex, real estate investments, and property rental businesses. Its Trading and Distribution segment engages in wholesale and/or retail distribution of pharmaceutical and consumable items, automotive goods, home appliances, medical equipment, tires, lubricants, batteries, car spare parts, and office supplies products. This segment also provides industrial printing and laminating solutions; supplies, installs, commissions, and maintains air conditioning and refrigeration equipment; offers hospital information systems; and operates a chain of pharmacies, as well as sells footwear and general commercial trading products, and engages in clinical activities. The company's Industrial Manufacturing segment is involved in the manufacture, wholesale, and/or retail distribution of electric cables and tools, aggregates, ready-mix concrete, cement blocks and bricks, interlocking slabs, curb stone, and concrete pipes; provision of services in relation to industrial investment, repair, and construction of power plants; purchasing and leasing of ships; trading electromechanical equipment and cables; and management of industrial enterprises. Its Managed Services segment offers housekeeping and cleaning, facilities and support, energy, and entertainment and amusement services; and IT support, business process outsourcing, travel agency, and call center services. The company also trades in light emitting diode lamps and other lighting products; and provides facilities management, energy, and building maintenance and cleaning services. Aamal Company Q.P.S.C. was founded in 2001 and is headquartered in Doha, Qatar. Aamal Company Q.P.S.C. is a subsidiary of Al Faisal Holding Company W.L.L.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.aamal.com.qa"
    },
    "GWCS.QA": {
        "short_name": "Gulf Warehousing QPSC",
        "long_name": "Gulf Warehousing Company Q.P.S.C.",
        "summary": "Gulf Warehousing Company Q.P.S.C., together with its subsidiaries, provides logistics and freight forwarding services in Qatar and internationally. The company operates through four segments: Logistics Operation, Freight Forwarding, Rentals, and Others. It offers handling, packaging and repackaging, inventory management, international moving and relocation, express courier, retail distribution, and consulting services, as well as inland transportation of goods for storage; and freight forwarding services through land, sea or air. The company also provides transportation and information technology services; and records management services, including digitization of documents, storage of physical and digital documents, time-bound document retrieval, indexing and cataloging accessed by document management systems, and secure destruction of physical and digital documents, as well as develops, operates, and manages warehouses. In addition, it is involved in chemical, food, and other consumables trading businesses; and the provision of marine services, such as yard operations, liner representation, port agency services, cruise ship hosting, and husbandry service. It serves aviation, telecommunication, manufacturing, government, banking and financial, oil and gas, sports and event management, fine arts, records management, healthcare, and small and medium enterprises. Gulf Warehousing Company Q.P.S.C. was founded in 2003 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": "9763",
        "website": "http://www.gwclogistics.com"
    },
    "IGRD.QA": {
        "short_name": "Investment Holding Group QPSC",
        "long_name": "Investment Holding Group - Q.P.S.C.",
        "summary": "Investment Holding Group - Q.P.S.C., together with its subsidiaries, engages in various trading and investment activities in Qatar. It operates through four segments: Contracting, Specialized Contracting, Trading, and Water Treatment & Related Maintenance. The company undertakes projects related to hotels, airports, conference centers, and educational facilities, as well as offers civil contracting services. It also engages in the trading of fire alarms, security systems, and related contracting activities; contracting for wellness and pools, water features, water treatments, and after sale maintenance and services; and installation and maintenance of electro mechanical works. In addition, the company is involved in the trading of electrical equipment, switch gears, light and instrument electrical tools, and electrical and construction materials; and wood, steel, food, chemical, and building materials, as well as engages in electromechanical equipment installation and maintenance works. Further, it offers mechanical, electrical, and plumbing contracting services. The company was founded in 1975 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Engineering & Construction",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.ihgqatar.com"
    },
    "QGTS.QA": {
        "short_name": "Qatar Gas Transport Ltd QPSC",
        "long_name": "Qatar Gas Transport Company Limited (Nakilat) (QPSC)",
        "summary": "Qatar Gas Transport Company Limited (Nakilat) (QPSC), together with its subsidiaries, operates as a shipping and maritime company in Qatar. The company is involved in the chartering of vessels; ship repair and offshore construction activities; fabrication, construction, and assembly of offshore and onshore structures; and provision of pipe fabrication and solutions, module fabrication and assembly, and onshore field and modular construction services. It also offers towage services through owned and operated tug boats, pilot boats, line boats, crew boats, and other harbor crafts, as well as towing, escorting, berthing, pilot support, afloat and ashore line handling services, emergency response, and marine maintenance support. In addition, the company provides agency and logistic support services, custom formalities, husbandry services, bunker coordination services, crew change and administration services, spare and supply services, and drydocking support services; and various support services to vessels, such as chandlery services, storage facilities, and logistics and related services. Its fleet consists of 29 wholly-owned and 40 jointly-owned vessels; 4 LPG carriers; 1 floating storage regasification unit vessel; and 25 tugs and marine support vessels. The company was founded in 2004 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://nakilat.com"
    },
    "QIMD.QA": {
        "short_name": "Qatar Industrial Manufacturing ",
        "long_name": "Qatar Industrial Manufacturing Company Q.P.S.C.",
        "summary": "Qatar Industrial Manufacturing Company Q.P.S.C., together with its subsidiaries, engages in industrial manufacturing and various types of industrial investments in Qatar and internationally. The company produces treated sand for construction and agricultural uses; paving stones and kerb stones; facial tissues, toilet rolls, kitchen rolls, and M Tork rolls; sulphuric acid for local and export markets; and non-colored and colored aluminum profiles. It serves petrochemicals, chemicals and building materials, and food industries. The company was founded in 1990 and is headquartered in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.qimc.com.qa"
    },
    "QNNS.QA": {
        "short_name": "Qatar Navigation QPSC",
        "long_name": "Qatar Navigation Q.P.S.C.",
        "summary": "Qatar Navigation Q.P.S.C. operates as a diversified maritime and logistics company in the State of Qatar, Singapore, the United Arab Emirates, and Germany. The company's Milaha Capital segment provides corporate finance advisory services; and manages the portfolio of financial and real estate investments. Its Milaha Maritime & Logistics segment offers logistics, warehousing, container feeder shipping, non-vessel operating common carrier operations, bulk shipping, shipping agencies, port management and operations, shipyard, and steel fabrication services. Its Milaha Offshore segment provides offshore support services to the oil and gas industry through a fleet of offshore service vessels, which include safety standby vessels, anchor handling tugs, crew and work boats, and dynamic positioning vessels, as well as saturation diving services. The company's Milaha Trading segment trades in trucks, heavy equipment, machinery, and lubrication brands; offers after sales service; and owns and operates a travel agency. Its Milaha Gas and Petrochem segment owns, manages, and operates a fleet of LPG and liquefied natural gas carriers; and provides ocean transportation services to international energy and industrial companies. This segment also owns and manages a fleet of product tankers and one crude carrier, as well as operates various product tankers in partnership with international trading and shipping companies. The company also engages in heavy vehicle selling, cargo handling, fabrication and installation of offshore structures, land transport, vessel chartering, real estate maintenance, warehousing; securities investment activities; trading building and industrial materials, and aggregates; and foreign shipping agency activities. In addition, it owns, hires, purchases, sells, operates, manages, and repairs various ships. Qatar Navigation Q.P.S.C. was incorporated in 1957 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Marine Shipping",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.milaha.com"
    },
    "SIIS.QA": {
        "short_name": "Salam International Investment ",
        "long_name": "Salam International Investment Limited Q.P.S.C.",
        "summary": "Salam International Investment Limited Q.P.S.C. establishes, incorporates, acquires, and owns enterprises in contracting, energy and industry, consumer and luxury products, technology, real estate, and development sectors in Qatar and internationally. It provides information technology, IT consulting, electronic system installation and maintenance, and mechanical services; and building and facility management, investment, and oil and gas services. The company also engages in civil contracting and furniture trading activities; trading and maintenance of refrigerators, water coolers, and air conditioners; consulting and managerial studies; and manufacturing of switchgears and transformers. In addition, it is involved in trading of chemical materials and furniture, water equipment, IT equipment, and computer networks; maintenance of oil equipment; steel works; furniture and interior, and aluminum works; managing restaurants and bakeries; real estate; interior design; and furniture and interiors manufacturing businesses. Further, the company engages in the retail and wholesale of luxury consumer products; marketing and offices facility, and photography trading and related services businesses; construction and supply of landscaping related materials; and manufacture of bowls and boxes of cardboards. Salam International Investment Limited Q.P.S.C. was founded in 1952 and is based in Doha, Qatar.",
        "currency": "QAR",
        "sector": "Industrials",
        "industry": "Conglomerates",
        "exchange": "DOH",
        "market": "qa_market",
        "country": "Qatar",
        "state": null,
        "city": "Doha",
        "zipcode": null,
        "website": "http://www.salaminternational.com"
    }
}