{"0RX.F": {"short_name": "REDX PHARMA  LS -,01", "long_name": "Redx Pharma Plc", "summary": "Redx Pharma Plc engages in drug discovery, pre-clinical development, and licensing activities in the United Kingdom. It discovers and develops small molecule drugs for treating anti-cancer and fibrosis targets in the areas of unmet medical needs. The company is developing RXC004, a porcupine inhibitor, which has completed Phase I clinical development for the treatment of colorectal, pancreatic, biliary, and gastric cancers, as well as melanoma; ROCK inhibitor for treating inflammatory intestinal fibrosis; RXC007, a Rho-associated protein kinase 2 inhibitors for the treatment of orphan disease, idiopathic pulmonary fibrosis, non-alcoholic steatohepatitis, and other systemic fibrotic conditions; and Porcupine (RXC006), which is in Phase I for the treatment of lung fibrosis. Redx Pharma Plc has a research collaboration agreement with Jazz Pharmaceuticals plc to discover and develop drug candidates for two cancer targets in the Ras/Raf/MAP kinase pathway. The company was founded in 2010 and is based in Macclesfield, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Macclesfield"}, "1RT.F": {"short_name": "NUFORMIX PLC  LS -,001", "long_name": "Nuformix plc", "summary": "Nuformix plc, a pharmaceutical development company, develops drugs using cocrystal technology in the United Kingdom. Its lead programs include NXP001, which is used for oncology supportive care; and NXP002 for use in the treatment of fibrosis. The company is also developing NXP004, which is under the pre-clinical stage for the treatment of multiple forms of fibrosis in various human tissues. It has an agreement with VistaGen Therapeutics, Inc. to develop co-crystal-based formulations of AV-101 for the treatment of various central nervous system conditions. The company also has an option agreement with Oxilio Ltd. to provide consultancy services for developing and exploiting NXP001 for the treatment of cancer. Nuformix plc was founded in 2008 and is headquartered in Cambridge, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cambridge"}, "25I.F": {"short_name": "IMMUPHARMA PLC  LS-,10", "long_name": "ImmuPharma plc", "summary": "ImmuPharma plc, a biopharmaceutical company, discovers and develops peptide-based therapeutics. Its peptide-based therapeutics are used in the therapy areas of autoimmunity, anti-infectives, metabolism, and cancer. The company's lead product candidate is the Lupuzor, an autophagy immunomodulator, which is in Phase III clinical trial for the treatment of lupus, an autoimmune chronic inflammatory disease. Its other product candidate includes IPP-204106, a peptide to modulate angiogenesis with application in cancer and ophthalmology; and BioGlucagon a therapy for low sugar events in diabetes. ImmuPharma plc has a collaboration arrangement with Centre National de la Recherche Scientifique for the development of a peptide technology platform for treating diabetes with glucagon-like peptide -1 agonists, as well as development of peptides as glucagon antagonists to treat type I and type II diabetes; and license and development agreement with Avion Pharmaceuticals LLC. The company was founded in 1999 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "2EM.DE": {"short_name": "ERGOMED PLC  LS -,01", "long_name": "Ergomed plc", "summary": "Ergomed plc, together with its subsidiaries, provides clinical trial planning, management, and monitoring; and drug safety and medical information services in the United Kingdom and Rest of Europe, the Middle East, Africa, North America, Asia, and Australia. It operates through two segments, Clinical Research Outsourcing and Pharmacovigilance. The company provides and manages clinical development, trial management, and pharmacovigilance services for pharmaceutical and generics companies, as well as small and mid-sized drug development companies. It focuses on various therapeutic areas, including oncology, haematology, allergy, respiratory, neurology, and CNS, as well as develops orphan drugs. The company also provides site support services. Ergomed plc was formerly known as Ergomed Clinical Research Limited and changed its name to Ergomed plc in June 2014. Ergomed plc was founded in 1997 and is headquartered in Guildford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "GER", "market": "de_market", "country": "United Kingdom", "city": "Guildford"}, "2EM.F": {"short_name": "ERGOMED PLC  LS -,01", "long_name": "Ergomed plc", "summary": "Ergomed plc, together with its subsidiaries, provides clinical trial planning, management, and monitoring; and drug safety and medical information services in the United Kingdom and Rest of Europe, the Middle East, Africa, North America, Asia, and Australia. It operates through two segments, Clinical Research Outsourcing and Pharmacovigilance. The company provides and manages clinical development, trial management, and pharmacovigilance services for pharmaceutical and generics companies, as well as small and mid-sized drug development companies. It focuses on various therapeutic areas, including oncology, haematology, allergy, respiratory, neurology, and CNS, as well as develops orphan drugs. The company also provides site support services. Ergomed plc was formerly known as Ergomed Clinical Research Limited and changed its name to Ergomed plc in June 2014. Ergomed plc was founded in 1997 and is headquartered in Guildford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Guildford"}, "3HY.F": {"short_name": "ARIX BIOSCIENCE LS-,00001", "long_name": "Arix Bioscience plc", "summary": "Arix Bioscience plc is a venture capital firm specializing in all stages of growth, seed stage, preclinical and clinical stage assets, startup, early stage, mid venture, late stage, growth capital investments as well as private and public equity. The firm seeks to invest in biotech companies, novel therapeutics, innovative technologies, medical innovation comprising healthcare and life sciences. It seeks to invest globally. The firm employs an evergreen approach to funding. It primarily makes investments from its own balance sheet. The firm prefers to take board seat. The firm exit when the optimum value has been reached. Arix Bioscience plc is formerly known as Perceptive Bioscience Investments Limited. Arix Bioscience plc was founded in 2015 and is based in London, United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "51B.F": {"short_name": "BIOVENTIX PLC  LS -,05", "long_name": "Bioventix PLC", "summary": "Bioventix PLC creates, manufactures, and supplies sheep monoclonal antibodies (SMAs) for diagnostic applications worldwide. The company offers a portfolio of purified SMAs for thyroid, vitamin D, cardiac, drugs of abuse, fertility, infectious disease, oncology, and miscellaneous indications. It also provides contract SMAs and recombinant services. The company was founded in 2003 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "5HU.F": {"short_name": "HEMOGENYX PHARM.PLC LS-01", "long_name": "Hemogenyx Pharmaceuticals Plc", "summary": "Hemogenyx Pharmaceuticals Plc, a preclinical-stage biotechnology company, focuses on the discovery, development, and commercialization of novel therapies and treatments for blood diseases. It is developing products for bone marrow/hematopoietic stem cell BM/HSC transplant market, including CDX bi-specific antibody and CAR-T therapy for eliminating relapsed and/or refractory acute myeloid leukaemia, acute lymphoblastic leukaemia, and myelodysplastic syndrome; and Human Postnatal Hemogenic Endothelial Cells, a cell therapy product for BM/HSC transplants. Hemogenyx Pharmaceuticals Plc has collaboration with GlobalCo. Hemogenyx Pharmaceuticals Plc was founded in 2013 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "5KW.F": {"short_name": "SKINBIO THERAP  LS-,01", "long_name": "SkinBioTherapeutics Plc", "summary": "SkinBioTherapeutics plc, a life science company, engages in the research and development of lysates derived from the human microbiome on skin. The company focuses on the development of SkinBiotix technology for use in cosmetic, infection control, and eczema applications. It has an agreement with Croda International Plc for the design and manufacture of a new active cosmetic skincare ingredient based on its SkinBiotix skin microbiome technology. The company was formerly known as Skinbiotix Ltd and changed its name to SkinBioTherapeutics plc in December 2016. SkinBioTherapeutics plc was incorporated in 2015 and is based in Macclesfield, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Macclesfield"}, "5MPA.F": {"short_name": "MIDATECH PHARMA LS-,001", "long_name": "Midatech Pharma plc", "summary": "Midatech Pharma plc focuses on the research and development of oncology and rare disease products in the United Kingdom, rest of Europe, and internationally. The company is developing MTD201, a long acting dose of Octreotide for the treatment of acromegaly and neuroendocrine tumors; and MTX110, a direct delivery treatment for diffuse intrinsic pontine glioma. It also offers drug delivery platforms, such as Q-Sphera, a microencapsulation and polymer-depot sustained release drug delivery platform; MidaSolve, an oligosaccharide nanotechnology used to solubilize drugs so that they can be administered in liquid form directly and locally into tumors; and MidaCore, a gold nanoparticle used for targeting sites of disease by using chemotherapeutic agents or immunotherapeutic agents. Midatech Pharma plc was founded in 2000 and is headquartered in Cardiff, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cardiff"}, "5MPD.F": {"short_name": "MIDATECH PHARMA SP.ADR/5", "long_name": "Midatech Pharma plc", "summary": "Midatech Pharma plc focuses on the research and development of oncology and rare disease products in the United Kingdom, rest of Europe, and internationally. The company is developing MTD201, a long acting dose of Octreotide for the treatment of acromegaly and neuroendocrine tumors; and MTX110, a direct delivery treatment for diffuse intrinsic pontine glioma. It also offers drug delivery platforms, such as Q-Sphera, a microencapsulation and polymer-depot sustained release drug delivery platform; MidaSolve, an oligosaccharide nanotechnology used to solubilize drugs so that they can be administered in liquid form directly and locally into tumors; and MidaCore, a gold nanoparticle used for targeting sites of disease by using chemotherapeutic agents or immunotherapeutic agents. Midatech Pharma plc was founded in 2000 and is headquartered in Cardiff, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cardiff"}, "6A3A.F": {"short_name": "AUTOLUS THERAP. SP.ADR/1", "long_name": "Autolus Therapeutics plc", "summary": "Autolus Therapeutics plc, a clinical-stage biopharmaceutical company, develops T cell therapies for the treatment of hematological malignancies and solid tumors. The company is developing AUTO1 and AUTO3 for B cell malignancies; AUTO2 for the treatment of multiple myeloma; AUTO4 and AUTO 5 for T cell lymphoma; and AUTO6 and AUTO7 to treat solid tumors. The company was founded in 2014 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "71M.F": {"short_name": "MYOVANT SCIENC. DL-,00001", "long_name": "Myovant Sciences Ltd.", "summary": "Myovant Sciences Ltd., a clinical-stage biopharmaceutical company, focuses on developing and commercializing therapies for women's health and endocrine diseases. The company's lead product is relugolix, an oral, once-daily, small molecule that acts as a gonadotropin-releasing hormone receptor antagonist for the treatment of heavy menstrual bleeding related with uterine fibroids, endometriosis-associated pain, and advanced prostate cancer. It is also developing MVT-602, an oligopeptide kisspeptin agonist, for the treatment of female infertility as part of assisted reproduction. Myovant Sciences Ltd. has collaboration with Pfizer Inc. to develop and commercialize relugolix in oncology and women's health. The company was formerly known as Roivant Endocrinology Ltd. and changed its name to Myovant Sciences Ltd. in May 2016. The company was founded in 2016 and is based in London, the United Kingdom. As of December 27, 2019, Myovant Sciences Ltd. operates as a subsidiary of Sumitovant Biopharma Ltd.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "7DC.F": {"short_name": "DIACEUTICS PLC  LS-,002", "long_name": "Diaceutics PLC", "summary": "Diaceutics Plc provides data, data analytics, and implementation services for pharmaceutical companies worldwide. It offers diagnostic landscape services, such as patient journey, lab mapping, diagnostic regulation, turnaround time, and sample availability analysis services; diagnostic tracking services, including lab tracking, patient insights, and physician segmentation services; and diagnostic payers research, diagnostic clinical landscape, integrated mapping research, buying process research, and testers/non-testers research services. The company also provides diagnostic planning services consisting of strategic and tactical planning, launch planning, diagnostic partner selection, and financial forecast services; commercialization services comprising content creation; LabEd/workshops, diagnostic adboards, conference support, and proficiency testing services; and Diagnostic reimbursement services. Diaceutics Plc was founded in 2005 and is headquartered in Belfast, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Belfast"}, "82C.F": {"short_name": "CIRCASSIA GROUP PLC", "long_name": "Circassia Group Plc", "summary": "Circassia Group Plc, a specialty pharmaceutical company, focuses on the development and commercialization of respiratory products. It operates through three segments: NIOX, Chronic Obstructive Pulmonary Disease (COPD), and LungFit. The company markets NIOX and NIOX VERO for use in asthma diagnosis and management; Tudorza for the treatment of COPD; and Duaklir, a fixed-dose combination of the long-acting muscarinic antagonist aclidinium bromide and long-acting beta agonist formoterol fumarate, which is administered twice-daily through the breath actuated Pressair inhaler for the maintenance treatment of COPD. It is also developing LungFit, a portable ventilator-compatible system that utilizes an electric voltage to produce precise quantities of nitric oxide from the nitrogen and oxygen in air. The company markets its products directly to specialists in the United States, the United Kingdom, China, Italy, and Germany, as well as through a network of partners internationally. Circassia Group Plc has a collaboration agreement with AstraZeneca to promote Tudorza and Duaklir for COPD treatment; and the United States and Chinese commercial rights to LungFit. The company was formerly known as Circassia Pharmaceuticals plc and changed its name to Circassia Group Plc in May 2020. Circassia Group Plc was founded in 2006 and is headquartered in Oxford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Oxford"}, "8EV.F": {"short_name": "EVGEN PHARMA PLC LS-,0025", "long_name": "Evgen Pharma plc", "summary": "Evgen Pharma plc, a clinical stage drug development company, engages in developing sulforaphane based medicines for the treatment of multiple diseases. Its core technology is Sulforadex, which include synthetic and stabilized analogues of the naturally occurring compound sulforaphane. The company's lead product is SFX-01, a synthetic version of sulforaphane stabilised that is in Phase II clinical trials for the treatment of metastatic breast cancer and subarachnoid haemorrhage, as well as in preclinical stage for multiple sclerosis and clinical stage to treat prostate cancer, autism, non-alcoholic steatohepatitis, and chronic kidney diseases. Evgen Pharma plc was founded in 2007 and is headquartered in Wilmslow, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Wilmslow"}, "A1V.F": {"short_name": "APTORUM GROUP LTD A DL1", "long_name": "Aptorum Group Limited", "summary": "Aptorum Group Limited, a pharmaceutical company, engages in the discovery, development, and commercialization of therapeutic assets to treat diseases with unmet medical needs, particularly infectious diseases and cancers. Its pipeline through the establishment of drug discovery platforms enable the discovery of new therapeutics assets, such as systematic screening of existing approved drug molecules, and microbiome-based research platform for treatments of metabolic diseases. The company is also pursuing therapeutic and diagnostic projects in neurology, gastroenterology, metabolic disorders, women's health, and other disease areas. It also has projects focused on surgical robotics and natural supplement for women undergoing menopause and experiencing related symptoms. Aptorum Group Limited was incorporated in 2010 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "A8C1.F": {"short_name": "ABCAM PLC  LS -,002", "long_name": "Abcam plc", "summary": "Abcam plc, a life sciences company, researches, develops, and distributes biological reagents and tools for research, drug discovery, and diagnostics in the United States, China, Japan, Europe, the Middle East, Africa, and rest of Asia Pacific. The company offers various research products, including primary and secondary antibodies; ELISA and matched antibody pairs; cell and tissue imaging tools; cellular and biochemical assays; proteins and peptides; proteomics tools; agonists, antagonists, activators, and inhibitors; lysates; and multiplex assays. Its research products are used in the areas of cancer, cardiovascular, cell biology, developmental biology, epigenetics, nuclear signaling, immunology, metabolism, microbiology, neuroscience, signal transduction, and stem cells. Further, the company offers diagnostic and therapeutic solutions. The company also sells its products online. Abcam plc was founded in 1998 and is headquartered in Cambridge, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cambridge"}, "A8C3.F": {"short_name": "ABCAM PLC SP.ADR 1 LS-002", "long_name": "Abcam plc", "summary": "Abcam plc, a life sciences company, researches, develops, and distributes biological reagents and tools for research, drug discovery, and diagnostics in the United States, China, Japan, Europe, the Middle East, Africa, and rest of Asia Pacific. The company offers various research products, including primary and secondary antibodies; ELISA and matched antibody pairs; cell and tissue imaging tools; cellular and biochemical assays; proteins and peptides; proteomics tools; agonists, antagonists, activators, and inhibitors; lysates; and multiplex assays. Its research products are used in the areas of cancer, cardiovascular, cell biology, developmental biology, epigenetics, nuclear signaling, immunology, metabolism, microbiology, neuroscience, signal transduction, and stem cells. Further, the company offers diagnostic and therapeutic solutions. The company also sells its products online. Abcam plc was founded in 1998 and is headquartered in Cambridge, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cambridge"}, "ABC.L": {"short_name": "ABCAM PLC ORD 0.2P", "long_name": "Abcam plc", "summary": "Abcam plc, a life sciences company, researches, develops, and distributes biological reagents and tools for research, drug discovery, and diagnostics in the United States, China, Japan, Europe, the Middle East, Africa, and rest of Asia Pacific. The company offers various research products, including primary and secondary antibodies; ELISA and matched antibody pairs; cell and tissue imaging tools; cellular and biochemical assays; proteins and peptides; proteomics tools; agonists, antagonists, activators, and inhibitors; lysates; and multiplex assays. Its research products are used in the areas of cancer, cardiovascular, cell biology, developmental biology, epigenetics, nuclear signaling, immunology, metabolism, microbiology, neuroscience, signal transduction, and stem cells. Further, the company offers diagnostic and therapeutic solutions. The company also sells its products online. Abcam plc was founded in 1998 and is headquartered in Cambridge, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cambridge"}, "ABCM": {"short_name": "Abcam plc", "long_name": "Abcam plc", "summary": "Abcam plc, a life sciences company, researches, develops, and distributes biological reagents and tools for research, drug discovery, and diagnostics in the United States, China, Japan, Europe, the Middle East, Africa, and rest of Asia Pacific. The company offers various research products, including primary and secondary antibodies; ELISA and matched antibody pairs; cell and tissue imaging tools; cellular and biochemical assays; proteins and peptides; proteomics tools; agonists, antagonists, activators, and inhibitors; lysates; and multiplex assays. Its research products are used in the areas of cancer, cardiovascular, cell biology, developmental biology, epigenetics, nuclear signaling, immunology, metabolism, microbiology, neuroscience, signal transduction, and stem cells. Further, the company offers diagnostic and therapeutic solutions. The company also sells its products online. Abcam plc was founded in 1998 and is headquartered in Cambridge, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Cambridge"}, "ABCZF": {"short_name": "ABCAM PLC", "long_name": "Abcam plc", "summary": "Abcam plc, a life sciences company, researches, develops, and distributes biological reagents and tools for research, drug discovery, and diagnostics in the United States, China, Japan, Europe, the Middle East, Africa, and rest of Asia Pacific. The company offers various research products, including primary and secondary antibodies; ELISA and matched antibody pairs; cell and tissue imaging tools; cellular and biochemical assays; proteins and peptides; proteomics tools; agonists, antagonists, activators, and inhibitors; lysates; and multiplex assays. Its research products are used in the areas of cancer, cardiovascular, cell biology, developmental biology, epigenetics, nuclear signaling, immunology, metabolism, microbiology, neuroscience, signal transduction, and stem cells. Further, the company offers diagnostic and therapeutic solutions. The company also sells its products online. Abcam plc was founded in 1998 and is headquartered in Cambridge, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Cambridge"}, "ACPH.BR": {"short_name": "ACACIA PHARMA", "long_name": "Acacia Pharma Group plc", "summary": "Acacia Pharma Group plc, a hospital pharmaceutical company, discovers, develops, and commercializes pharmaceutical products for the patients undergoing surgery, other invasive procedures, or cancer chemotherapy treatments in the United States and internationally. The company's lead product is BAREMSIS, an intravenous amisulpride for the treatment and prophylaxis of post-operative nausea and vomiting. Its products also comprise APD403, an intravenous and oral amisulpride that has completed Phase II clinical trials for the chemotherapy-induced nausea and vomiting treatment; and BYFAVO, an ultra-short-acting and reversible intravenous benzodiazepine sedative/anesthetic, which has completed Phase III clinical trials for the use in invasive medical procedures, such as colonoscopy and bronchoscopy. The company's products are primarily serves anesthesiologists and oncologists. Acacia Pharma Group plc was founded in 2007 and is based in Cambridge, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "BRU", "market": "be_market", "country": "United Kingdom", "city": "Cambridge"}, "ADAP": {"short_name": "Adaptimmune Therapeutics plc", "long_name": "Adaptimmune Therapeutics plc", "summary": "Adaptimmune Therapeutics plc, a clinical-stage biopharmaceutical company, focuses on providing novel cell therapies primarily to patients with solid tumors in the United States. The company's specific peptide enhanced affinity receptor (SPEAR) T-cell platform enables it to identify cancer targets. It also develops ADP-A2M4 that is in phase I clinical trial for solid tumor indication that include urothelial, melanoma, head and neck, ovarian, non-small cell lung cancer (NSCLC), esophageal, gastric, synovial sarcoma, and myxoid round cell liposarcoma cancers; ADP-A2AFP that is in phase I clinical trial for hepatocellular carcinoma; ADP-A2M4CD8, which is in phase I clinical trial for SPEAR T-cell; and ADP-A2M10 that is in the phase I clinical trials for the treatment of NSCLC, as well as urothelial, melanoma, and head and neck cancers. The company has a strategic collaboration and license agreement with GSK to research, develop, and commercialize NY-ESO T-cell therapy; and collaboration agreement with Noile-Immune Biotech Inc. to develop SPEAR T-cells in combination with Noile-Immune's PRIME technology. It also has a co-development and co-commercialization agreement with Universal Cells, Inc to targets co-developing T-cell therapy. Adaptimmune Therapeutics plc was founded in 2008 and is headquartered in Abingdon, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Abingdon"}, "AKTX": {"short_name": "Akari Therapeutics Plc", "long_name": "Akari Therapeutics, Plc", "summary": "Akari Therapeutics, Plc, a clinical-stage biopharmaceutical company, focuses on the development and commercialization of treatments for a range of rare and orphan autoimmune and inflammatory diseases. Its lead product candidate is Coversin, a second-generation complement inhibitor that is in Phase II clinical trial for the treatment of autoimmune and inflammatory diseases, including paroxysmal nocturnal hemoglobinuria, guillain barrÃ© syndrome, and atypical hemolytic uremic syndrome. Akari Therapeutics, Plc is based in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "ALIMM.BR": {"short_name": "IMMUPHARMA", "long_name": "ImmuPharma plc", "summary": "ImmuPharma plc, a biopharmaceutical company, discovers and develops peptide-based therapeutics. Its peptide-based therapeutics are used in the therapy areas of autoimmunity, anti-infectives, metabolism, and cancer. The company's lead product candidate is the Lupuzor, an autophagy immunomodulator, which is in Phase III clinical trial for the treatment of lupus, an autoimmune chronic inflammatory disease. Its other product candidate includes IPP-204106, a peptide to modulate angiogenesis with application in cancer and ophthalmology; and BioGlucagon a therapy for low sugar events in diabetes. ImmuPharma plc has a collaboration arrangement with Centre National de la Recherche Scientifique for the development of a peptide technology platform for treating diabetes with glucagon-like peptide -1 agonists, as well as development of peptides as glucagon antagonists to treat type I and type II diabetes; and license and development agreement with Avion Pharmaceuticals LLC. The company was founded in 1999 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "BRU", "market": "be_market", "country": "United Kingdom", "city": "London"}, "APM": {"short_name": "Aptorum Group Limited", "long_name": "Aptorum Group Limited", "summary": "Aptorum Group Limited, a pharmaceutical company, engages in the discovery, development, and commercialization of therapeutic assets to treat diseases with unmet medical needs, particularly infectious diseases and cancers. Its pipeline through the establishment of drug discovery platforms enable the discovery of new therapeutics assets, such as systematic screening of existing approved drug molecules, and microbiome-based research platform for treatments of metabolic diseases. The company is also pursuing therapeutic and diagnostic projects in neurology, gastroenterology, metabolic disorders, women's health, and other disease areas. It also has projects focused on surgical robotics and natural supplement for women undergoing menopause and experiencing related symptoms. Aptorum Group Limited was incorporated in 2010 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "APM.PA": {"short_name": "APTORUM GROUP CL A", "long_name": "Aptorum Group Limited", "summary": "Aptorum Group Limited, a pharmaceutical company, engages in the discovery, development, and commercialization of therapeutic assets to treat diseases with unmet medical needs, particularly infectious diseases and cancers. Its pipeline through the establishment of drug discovery platforms enable the discovery of new therapeutics assets, such as systematic screening of existing approved drug molecules, and microbiome-based research platform for treatments of metabolic diseases. The company is also pursuing therapeutic and diagnostic projects in neurology, gastroenterology, metabolic disorders, women's health, and other disease areas. It also has projects focused on surgical robotics and natural supplement for women undergoing menopause and experiencing related symptoms. Aptorum Group Limited was incorporated in 2010 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PAR", "market": "fr_market", "country": "United Kingdom", "city": "London"}, "ARIX.L": {"short_name": "ARIX BIOSCIENCE PLC ORD 0.001P", "long_name": "Arix Bioscience plc", "summary": "Arix Bioscience plc is a venture capital firm specializing in all stages of growth, seed stage, preclinical and clinical stage assets, startup, early stage, mid venture, late stage, growth capital investments as well as private and public equity. The firm seeks to invest in biotech companies, novel therapeutics, innovative technologies, medical innovation comprising healthcare and life sciences. It seeks to invest globally. The firm employs an evergreen approach to funding. It primarily makes investments from its own balance sheet. The firm prefers to take board seat. The firm exit when the optimum value has been reached. Arix Bioscience plc is formerly known as Perceptive Bioscience Investments Limited. Arix Bioscience plc was founded in 2015 and is based in London, United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "AUTL": {"short_name": "Autolus Therapeutics plc", "long_name": "Autolus Therapeutics plc", "summary": "Autolus Therapeutics plc, a clinical-stage biopharmaceutical company, develops T cell therapies for the treatment of hematological malignancies and solid tumors. The company is developing AUTO1 and AUTO3 for B cell malignancies; AUTO2 for the treatment of multiple myeloma; AUTO4 and AUTO 5 for T cell lymphoma; and AUTO6 and AUTO7 to treat solid tumors. The company was founded in 2014 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "AVCT.L": {"short_name": "AVACTA GROUP PLC ORD 10P", "long_name": "Avacta Group Plc", "summary": "Avacta Group Plc offers reagents and therapeutics based on Affimer technology for diagnostic and research applications in the United Kingdom, North America, Asia, and rest of Europe. It operates in Diagnostics, Therapeutics, and Animal Health segments. The company develops custom Affimer proteins for customer products and in-house diagnostic assays. It also develops novel cancer immunotherapies combining proprietary platforms; and provides tools and contract services to assist diagnosis of conditions in animals to enable faster treatment for veterinarians. The company has a research partnership with Moderna Therapeutics; research collaboration with pre|CISION technology incorporates a substrate that is sensitive to cleavage by fibroblast activation protein; co-development partnership agreement with Bach Biosciences LLP to develop Affimer drug conjugate therapies; drug development collaboration with LG Chem Life Sciences; a partnership with Selexis to develop cell line for clinical manufacturing, and with Tufts University School of Medicine for developing Affimer drug conjugate therapies; a collaboration with Cytiva to develop and manufacture an Affimer-based point-of-care rapid test; and a collaboration with Adeptrix to develop Affimer-based COVID-19 antigen tests. Avacta Group Plc was incorporated in 2003 and is based in Wetherby, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Wetherby"}, "BCYC": {"short_name": "Bicycle Therapeutics plc", "long_name": "Bicycle Therapeutics plc", "summary": "Bicycle Therapeutics plc, a clinical-stage biopharmaceutical company, develops a class of medicines for diseases that are underserved by existing therapeutics. Its lead product candidate is BT1718, a bicycle toxin conjugate (BTC), which is in Phase I/IIa clinical trials targeting tumors that express Membrane Type 1 matrix metalloprotease. The company's oncology product candidates also comprise BT5528, a BTC that is in a Phase I/IIa clinical trial targeting EphA2; BT8009, which is in preclinical studies targeting Nectin-4; and CD137, an immune cell co-stimulatory molecule that is in preclinical stage. In addition, it is developing THR-149, a plasma kallikrein inhibitor that completed Phase I clinical trials for the treatment of diabetic macular edema. Further, the company collaborates with biopharmaceutical companies and organizations to develop programs in therapeutic areas, such as anti-infective, cardiovascular, ophthalmology, and respiratory indications. Bicycle Therapeutics plc has a clinical trial and license agreement with the Cancer Research Technology Limited and CRUK; research collaboration agreements with AstraZeneca, Sanofi, Oxurion, and the Dementia Discovery Fund; and discovery collaboration and license agreement with Genentech for the discovery and development of Bicycle peptides for multiple immuno-oncology targets. The company was incorporated in 2009 and is headquartered in Cambridge, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Cambridge"}, "BVXP.L": {"short_name": "BIOVENTIX PLC ORD 5P", "long_name": "Bioventix PLC", "summary": "Bioventix PLC creates, manufactures, and supplies sheep monoclonal antibodies (SMAs) for diagnostic applications worldwide. The company offers a portfolio of purified SMAs for thyroid, vitamin D, cardiac, drugs of abuse, fertility, infectious disease, oncology, and miscellaneous indications. It also provides contract SMAs and recombinant services. The company was founded in 2003 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "CIR.L": {"short_name": "CIRCASSIA GROUP PLC ORD 0.08P", "long_name": "Circassia Group Plc", "summary": "Circassia Group Plc, a specialty pharmaceutical company, focuses on the development and commercialization of respiratory products. It operates through three segments: NIOX, Chronic Obstructive Pulmonary Disease (COPD), and LungFit. The company markets NIOX and NIOX VERO for use in asthma diagnosis and management; Tudorza for the treatment of COPD; and Duaklir, a fixed-dose combination of the long-acting muscarinic antagonist aclidinium bromide and long-acting beta agonist formoterol fumarate, which is administered twice-daily through the breath actuated Pressair inhaler for the maintenance treatment of COPD. It is also developing LungFit, a portable ventilator-compatible system that utilizes an electric voltage to produce precise quantities of nitric oxide from the nitrogen and oxygen in air. The company markets its products directly to specialists in the United States, the United Kingdom, China, Italy, and Germany, as well as through a network of partners internationally. Circassia Group Plc has a collaboration agreement with AstraZeneca to promote Tudorza and Duaklir for COPD treatment; and the United States and Chinese commercial rights to LungFit. The company was formerly known as Circassia Pharmaceuticals plc and changed its name to Circassia Group Plc in May 2020. Circassia Group Plc was founded in 2006 and is headquartered in Oxford, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Oxford"}, "CRO.F": {"short_name": "OPEN ORPHAN PLC  LS-,001", "long_name": "Open Orphan plc", "summary": "Open Orphan plc operates as a clinical research organization pharmaceutical services company with a focus on virology, vaccine studies, and orphan drugs in the United Kingdom, Ireland, France, the Netherlands, Germany, and Singapore. It operates a virtual rep, a pharmaceutical commercialization platform for rare/orphan disease space; and develops Genomic Health Data platform, a collection of infectious disease progression data. The company also provides consulting and clinical trial services to pharmaceutical, biotechnology, and medical device organizations. In addition, it offers hVIVO COVID Clear Test, an antibody test for employers in the United Kingdom and Ireland. The company is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "DDDD.L": {"short_name": "4D PHARMA PLC ORD 0.25P", "long_name": "4D pharma plc", "summary": "4D pharma plc, together with its subsidiaries, engages in the research, development, and production of live biotherapeutic products. The company's development programs include Blautix for irritable bowel syndrome and Thetanix for paediatric crohn's disease. It also develops immuno-oncology products comprising MRx0518, MRx0573, and MRx1299 for solid tumors, and MRx0518 for pancreatic cancer; respiratory products, such as MRx-4DP0004 for asthma and COVID-19; central nervous system products, including MRx0005 and MRx0029 for neurodegeneration; and platform products comprising vaccines and autoimmune. 4D pharma plc has a collaboration agreement with Merck & Co., Inc. to conduct a clinical trial evaluating the combination of Keytruda and MRx0518 in patients with solid tumours. The company was formerly known as Schosween 18 Limited. 4D pharma plc was founded in 2014 and is headquartered in Leeds, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Leeds"}, "DXRX.L": {"short_name": "DIACEUTICS PLC ORD GBP0.002", "long_name": "Diaceutics PLC", "summary": "Diaceutics Plc provides data, data analytics, and implementation services for pharmaceutical companies worldwide. It offers diagnostic landscape services, such as patient journey, lab mapping, diagnostic regulation, turnaround time, and sample availability analysis services; diagnostic tracking services, including lab tracking, patient insights, and physician segmentation services; and diagnostic payers research, diagnostic clinical landscape, integrated mapping research, buying process research, and testers/non-testers research services. The company also provides diagnostic planning services consisting of strategic and tactical planning, launch planning, diagnostic partner selection, and financial forecast services; commercialization services comprising content creation; LabEd/workshops, diagnostic adboards, conference support, and proficiency testing services; and Diagnostic reimbursement services. Diaceutics Plc was founded in 2005 and is headquartered in Belfast, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Belfast"}, "EAJF.F": {"short_name": "VALIRX PLC  LS-,001", "long_name": "ValiRx plc", "summary": "ValiRx plc, a biotechnology oncology focused company, engages in developing novel therapeutics and associated biomarkers for cancer in the United Kingdom. The company's lead drug candidates include VAL201, an anti-cancer therapeutic that is in Phase I/II trials for the treatment of prostate cancer and other indications of hormone induced unregulated growth, including endometriosis; VAL301, a reformulation of VAL201, which is in pre-clinical development for the treatment of women with endometriosis; and VAL401, a reformulation of generic drug Risperidone, which has completed Phase II clinical trial for the treatment of non-small cell lung cancer. Its drug candidates also comprise VAL101, a candidate produced by GeneICE technology platform to modulate BCl2 expression Â\u0096 implicated in cancers. ValiRx plc has collaboration agreement with Oncolytika Limited and Black Cat Bio Limited to develop and evaluate BC201 for patients suffering a hyperimmune response to Coronavirus SARS-CoV2 infection. The company was incorporated in 2000 and is based in Hatfield, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Hatfield"}, "EMMLF": {"short_name": "OKYO PHARMA LTD", "long_name": "OKYO Pharma Limited", "summary": "OKYO Pharma Limited operates as a life sciences and biopharmaceutical company in the United Kingdom. Its pre-clinical development program includes Chemerin for the treatment of ocular inflammation, dry eye disease, and ocular neuropathic pain; and BAM8, a non-opioid analgesic. OKYO Pharma Limited is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "ERGO.L": {"short_name": "ERGOMED PLC ORD 1P", "long_name": "Ergomed plc", "summary": "Ergomed plc, together with its subsidiaries, provides clinical trial planning, management, and monitoring; and drug safety and medical information services in the United Kingdom and Rest of Europe, the Middle East, Africa, North America, Asia, and Australia. It operates through two segments, Clinical Research Outsourcing and Pharmacovigilance. The company provides and manages clinical development, trial management, and pharmacovigilance services for pharmaceutical and generics companies, as well as small and mid-sized drug development companies. It focuses on various therapeutic areas, including oncology, haematology, allergy, respiratory, neurology, and CNS, as well as develops orphan drugs. The company also provides site support services. Ergomed plc was formerly known as Ergomed Clinical Research Limited and changed its name to Ergomed plc in June 2014. Ergomed plc was founded in 1997 and is headquartered in Guildford, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Guildford"}, "ETX.L": {"short_name": "E-THERAPEUTICS PLC ORD 0.1P", "long_name": "e-therapeutics plc", "summary": "e-Therapeutics plc engages in the discovery of drugs through its proprietary network-driven drug discovery platform in the United Kingdom. It is developing two NDD-derived immuno-oncology programs, including tryptophan catabolism and immune checkpoint modulation. The company, through its subsidiary, Searchbolt Limited, develops search engine technology. The company has collaborations with C4X Holdings PLC, Intellegens, Biorelate, Novo Nordisk, and Galapagos NV. e-Therapeutics plc was founded in 2001 and is based in Long Hanborough, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Long Hanborough"}, "EVG.L": {"short_name": "EVGEN PHARMA PLC ORD 0.25P", "long_name": "Evgen Pharma plc", "summary": "Evgen Pharma plc, a clinical stage drug development company, engages in developing sulforaphane based medicines for the treatment of multiple diseases. Its core technology is Sulforadex, which include synthetic and stabilized analogues of the naturally occurring compound sulforaphane. The company's lead product is SFX-01, a synthetic version of sulforaphane stabilised that is in Phase II clinical trials for the treatment of metastatic breast cancer and subarachnoid haemorrhage, as well as in preclinical stage for multiple sclerosis and clinical stage to treat prostate cancer, autism, non-alcoholic steatohepatitis, and chronic kidney diseases. Evgen Pharma plc was founded in 2007 and is headquartered in Wilmslow, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Wilmslow"}, "FAB.L": {"short_name": "FUSION ANTIBODIES PLC ORD 4P", "long_name": "Fusion Antibodies plc", "summary": "Fusion Antibodies plc, a contract research organization, engages in the research, development, and manufacture of recombinant proteins and antibodies primarily for cancer and infectious diseases in the United Kingdom, the rest of Europe, North America, and internationally. The company offers monoclonal antibody discovery and development services; and a range of antibody engineering services for various stages of therapeutic and diagnostic antibody development. It also engages in the humanization of antibodies, antibody developability, affinity maturation, and antibody reformatting activities. In addition, the company provides antibody sequencing services; custom expression and purification of recombinant proteins; transient protein expression; and cell line development services, as well as antibody analysis services. It serves pharmaceuticals, biotech, and diagnostic companies. The company has a collaboration partnership with Celonic AG for the development of high yield stable cell lines. Fusion Antibodies plc was incorporated in 2000 and is headquartered in Belfast, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Belfast"}, "FRLN": {"short_name": "Freeline Therapeutics Holdings ", "long_name": "Freeline Therapeutics Holdings plc", "summary": "Freeline Therapeutics Holdings plc operates as a clinical-stage systemic adeno-associated virus (AAV)-based gene therapy company. Its advanced product candidate is FLT180a, a gene therapy product candidate that is being evaluated in a Phase 1/2 dose-finding clinical trials in adult males for the treatment of patients with moderate or severe hemophilia B. The company's products also include FLT190, which is in dose-escalating Phase 1/2 clinical trials for the treatment of Fabry disease; FLT201, a liver-directed gene therapy product candidate to treat type 1 Gaucher disease; and FLT210, a liver-directed gene therapy product candidate for the treatment of hemophilia A. In addition, it has research programs in various indications for systemic gene therapy. The company was founded in 2015 and is headquartered in Stevenage, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Stevenage"}, "FRPRF": {"short_name": "4D PHARMA PLC", "long_name": "4D pharma plc", "summary": "4D pharma plc, together with its subsidiaries, engages in the research, development, and production of live biotherapeutic products. The company's development programs include Blautix for irritable bowel syndrome and Thetanix for paediatric crohn's disease. It also develops immuno-oncology products comprising MRx0518, MRx0573, and MRx1299 for solid tumors, and MRx0518 for pancreatic cancer; respiratory products, such as MRx-4DP0004 for asthma and COVID-19; central nervous system products, including MRx0005 and MRx0029 for neurodegeneration; and platform products comprising vaccines and autoimmune. 4D pharma plc has a collaboration agreement with Merck & Co., Inc. to conduct a clinical trial evaluating the combination of Keytruda and MRx0518 in patients with solid tumours. The company was formerly known as Schosween 18 Limited. 4D pharma plc was founded in 2014 and is headquartered in Leeds, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Leeds"}, "FSTX": {"short_name": "F-star Therapeutics, Inc.", "long_name": "F-star Therapeutics, Inc.", "summary": "F-star Therapeutics, Inc., a clinical-stage biopharmaceutical company develops tetravalent bispecific antibodies for cancer therapy. Its medicines used in immuno-oncology treatments. The company plans for the initiation of a Phase I, open label, first-in-human clinical study of FS222, a bispecific antibody targeting CD137 (4-1BB) and PD-L1. The company is based in Cambridge, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Cambridge"}, "GBE.F": {"short_name": "GENUS PLC  LS-,1", "long_name": "Genus plc", "summary": "Genus plc operates as an animal genetics company in North America, Latin America, the United Kingdom, rest of Europe, the Middle East, Russia, Africa, and Asia. The company operates through three segments: Genus PIC, Genus ABS, and Research and Development. It sells sows, boars, and semen to breed pigs with various characteristics for pork production under the PIC brand. The company also sells bull semen and embryos to breed calves with various characteristics for milk and beef production under the ABS, Genus, and Bovec brands. In addition, it offers semen sexing, in vitro fertilization, reproductive, and other technical services to farmers. Genus plc has a strategic porcine collaboration with Beijing Capital Agribusiness Co. Ltd to research, develop, register, and market porcine reproductive and respiratory syndrome virus resistant pigs. The company was incorporated in 1994 and is based in Basingstoke, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Basingstoke"}, "GENSF": {"short_name": "GENUS", "long_name": "Genus plc", "summary": "Genus plc operates as an animal genetics company in North America, Latin America, the United Kingdom, rest of Europe, the Middle East, Russia, Africa, and Asia. The company operates through three segments: Genus PIC, Genus ABS, and Research and Development. It sells sows, boars, and semen to breed pigs with various characteristics for pork production under the PIC brand. The company also sells bull semen and embryos to breed calves with various characteristics for milk and beef production under the ABS, Genus, and Bovec brands. In addition, it offers semen sexing, in vitro fertilization, reproductive, and other technical services to farmers. Genus plc has a strategic porcine collaboration with Beijing Capital Agribusiness Co. Ltd to research, develop, register, and market porcine reproductive and respiratory syndrome virus resistant pigs. The company was incorporated in 1994 and is based in Basingstoke, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Basingstoke"}, "GNS.L": {"short_name": "GENUS PLC ORD 10P", "long_name": "Genus plc", "summary": "Genus plc operates as an animal genetics company in North America, Latin America, the United Kingdom, rest of Europe, the Middle East, Russia, Africa, and Asia. The company operates through three segments: Genus PIC, Genus ABS, and Research and Development. It sells sows, boars, and semen to breed pigs with various characteristics for pork production under the PIC brand. The company also sells bull semen and embryos to breed calves with various characteristics for milk and beef production under the ABS, Genus, and Bovec brands. In addition, it offers semen sexing, in vitro fertilization, reproductive, and other technical services to farmers. Genus plc has a strategic porcine collaboration with Beijing Capital Agribusiness Co. Ltd to research, develop, register, and market porcine reproductive and respiratory syndrome virus resistant pigs. The company was incorporated in 1994 and is based in Basingstoke, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Basingstoke"}, "GYX.F": {"short_name": "FUTURA MEDICAL  LS-,002", "long_name": "Futura Medical plc", "summary": "Futura Medical plc, a pharmaceutical company, researches and develops pharmaceutical drugs and medical devices for the consumer healthcare markets focusing on sexual health and pain relief management. The company offers CSD500, a condom that contains erectogenic gel. It is also developing MED3000, a topical gel for the treatment of erectile dysfunction that has completed Phase III clinical trials. In addition, the company develops pain relief products, including TPR100, a topical diclofenac pain relief gel; CBD100, a topical cannabidiol formulation; and TIB200, a topical ibuprofen pain relief gel. Futura Medical plc was incorporated in 2001 and is headquartered in Guildford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Guildford"}, "HEMO.L": {"short_name": "HEMOGENYX PHARMACEUTICALS PLC O", "long_name": "Hemogenyx Pharmaceuticals Plc", "summary": "Hemogenyx Pharmaceuticals Plc, a preclinical-stage biotechnology company, focuses on the discovery, development, and commercialization of novel therapies and treatments for blood diseases. It is developing products for bone marrow/hematopoietic stem cell BM/HSC transplant market, including CDX bi-specific antibody and CAR-T therapy for eliminating relapsed and/or refractory acute myeloid leukaemia, acute lymphoblastic leukaemia, and myelodysplastic syndrome; and Human Postnatal Hemogenic Endothelial Cells, a cell therapy product for BM/HSC transplants. Hemogenyx Pharmaceuticals Plc has collaboration with GlobalCo. Hemogenyx Pharmaceuticals Plc was founded in 2013 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "HOPHF": {"short_name": "HEMOGENYX PHARMACEUTICALS PLC", "long_name": "Hemogenyx Pharmaceuticals Plc", "summary": "Hemogenyx Pharmaceuticals Plc, a preclinical-stage biotechnology company, focuses on the discovery, development, and commercialization of novel therapies and treatments for blood diseases. It is developing products for bone marrow/hematopoietic stem cell BM/HSC transplant market, including CDX bi-specific antibody and CAR-T therapy for eliminating relapsed and/or refractory acute myeloid leukaemia, acute lymphoblastic leukaemia, and myelodysplastic syndrome; and Human Postnatal Hemogenic Endothelial Cells, a cell therapy product for BM/HSC transplants. Hemogenyx Pharmaceuticals Plc has collaboration with GlobalCo. Hemogenyx Pharmaceuticals Plc was founded in 2013 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "I9SA.F": {"short_name": "VERONA PHARMA SP.ADR 8", "long_name": "Verona Pharma plc", "summary": "Verona Pharma plc, a clinical stage biopharmaceutical company, focuses on develops and commercializes therapies for the treatment of respiratory diseases with unmet medical needs. Its product candidate, ensifentrine (RPL554), is an inhaled, dual inhibitor of the enzymes phosphodiesterase 3 and 4 that acts as both a bronchodilator and an anti-inflammatory agent in a single compound. The formulations of ensifentrine are under development for the treatment chronic obstructive pulmonary disease (COPD): nebulized ensifentrine is in Phase 2b clinical development for the maintenance treatment of COPD; and a dry powder inhaler and a pressurized metered-dose inhaler. The company also focuses on developing ensifentrine for the treatment of cystic fibrosis and asthma. Verona Pharma plc was founded in 2005 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "IMM.L": {"short_name": "IMMUPHARMA PLC ORD 10P", "long_name": "ImmuPharma plc", "summary": "ImmuPharma plc, a biopharmaceutical company, discovers and develops peptide-based therapeutics. Its peptide-based therapeutics are used in the therapy areas of autoimmunity, anti-infectives, metabolism, and cancer. The company's lead product candidate is the Lupuzor, an autophagy immunomodulator, which is in Phase III clinical trial for the treatment of lupus, an autoimmune chronic inflammatory disease. Its other product candidate includes IPP-204106, a peptide to modulate angiogenesis with application in cancer and ophthalmology; and BioGlucagon a therapy for low sugar events in diabetes. ImmuPharma plc has a collaboration arrangement with Centre National de la Recherche Scientifique for the development of a peptide technology platform for treating diabetes with glucagon-like peptide -1 agonists, as well as development of peptides as glucagon antagonists to treat type I and type II diabetes; and license and development agreement with Avion Pharmaceuticals LLC. The company was founded in 1999 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "IXI.L": {"short_name": "IXICO PLC ORD 1P", "long_name": "IXICO plc", "summary": "IXICO plc provides data analytics services to the biopharmaceutical industry in the United States, the United Kingdom, Europe, and internationally. It provides collection, analysis, management, and reporting services on data generated in the course of a clinical study. The company's technologies include Assessa, a secure online digital platform that provides clinical decision support for patient selection and post-marketing surveillance; and TrialTracker, a platform that delivers imaging services designed to manage the complex imaging workflow from image upload, QC, and reading/analysis to reporting and data transfer. The company offers end-to-end imaging services, primarily in the fields of Alzheimer's, Parkinson's, Huntington's, multiple sclerosis, cerebrovascular, and progressive supranuclear palsy diseases; and engages in the data collection and analysis of neurological diseases. Its services are used to select patients for clinical trials, assess the safety and efficacy of new drugs in development, and in post marketing surveillance. The company was incorporated in 1995 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "MAH0.F": {"short_name": "MEREO BIOPH. ADR  LS-,003", "long_name": "Mereo BioPharma Group plc", "summary": "Mereo BioPharma Group plc, a biopharmaceutical company, acquires, develops, and commercializes therapeutics for the treatment of oncology and rare diseases. Its lead product candidate, etigilimab (OMP-313M32), an antibody T-cell immunoreceptor with Ig and ITIM domains, which is in Phase 1b clinical trial for the treatment of tumor. The company also develops Navicixizumab (OMP-305B83) that is in Phase 1a clinical trial for the treatment of the late line ovarian cancer; Acumapimod (BCT-197), a p38 MAP kinase inhibitor that has completed Phase II clinical trial to treat acute exacerbations of chronic obstructive pulmonary disease; and Leflutrozole (BGS-649), an oral aromatase inhibitor for the treatment of hypogonadotropic hypogonadism. In addition, it develops rare disease product candidates, including Setrusumab (BPS-804), a novel antibody, which is in Phase IIb clinical trial for the treatment of osteogenesis imperfect; and Alvelestat (MPH-966), an oral small molecule that is in Phase II clinical trial to treat Alpha-1 antitrypsin deficiency. Mereo BioPharma Group plc was founded in 2015 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "MAH0.SG": {"short_name": "Mereo Biopharma Group Ltd. Reg.", "long_name": "Mereo BioPharma Group plc", "summary": "Mereo BioPharma Group plc, a biopharmaceutical company, acquires, develops, and commercializes therapeutics for the treatment of oncology and rare diseases. Its lead product candidate, etigilimab (OMP-313M32), an antibody T-cell immunoreceptor with Ig and ITIM domains, which is in Phase 1b clinical trial for the treatment of tumor. The company also develops Navicixizumab (OMP-305B83) that is in Phase 1a clinical trial for the treatment of the late line ovarian cancer; Acumapimod (BCT-197), a p38 MAP kinase inhibitor that has completed Phase II clinical trial to treat acute exacerbations of chronic obstructive pulmonary disease; and Leflutrozole (BGS-649), an oral aromatase inhibitor for the treatment of hypogonadotropic hypogonadism. In addition, it develops rare disease product candidates, including Setrusumab (BPS-804), a novel antibody, which is in Phase IIb clinical trial for the treatment of osteogenesis imperfect; and Alvelestat (MPH-966), an oral small molecule that is in Phase II clinical trial to treat Alpha-1 antitrypsin deficiency. Mereo BioPharma Group plc was founded in 2015 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "STU", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "MREO": {"short_name": "Mereo BioPharma Group plc", "long_name": "Mereo BioPharma Group plc", "summary": "Mereo BioPharma Group plc, a biopharmaceutical company, acquires, develops, and commercializes therapeutics for the treatment of oncology and rare diseases. Its lead product candidate, etigilimab (OMP-313M32), an antibody T-cell immunoreceptor with Ig and ITIM domains, which is in Phase 1b clinical trial for the treatment of tumor. The company also develops Navicixizumab (OMP-305B83) that is in Phase 1a clinical trial for the treatment of the late line ovarian cancer; Acumapimod (BCT-197), a p38 MAP kinase inhibitor that has completed Phase II clinical trial to treat acute exacerbations of chronic obstructive pulmonary disease; and Leflutrozole (BGS-649), an oral aromatase inhibitor for the treatment of hypogonadotropic hypogonadism. In addition, it develops rare disease product candidates, including Setrusumab (BPS-804), a novel antibody, which is in Phase IIb clinical trial for the treatment of osteogenesis imperfect; and Alvelestat (MPH-966), an oral small molecule that is in Phase II clinical trial to treat Alpha-1 antitrypsin deficiency. Mereo BioPharma Group plc was founded in 2015 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NGM", "market": "us_market", "country": "United Kingdom", "city": "London"}, "MTP": {"short_name": "Midatech Pharma PLC", "long_name": "Midatech Pharma plc", "summary": "Midatech Pharma plc focuses on the research and development of oncology and rare disease products in the United Kingdom, rest of Europe, and internationally. The company is developing MTD201, a long acting dose of Octreotide for the treatment of acromegaly and neuroendocrine tumors; and MTX110, a direct delivery treatment for diffuse intrinsic pontine glioma. It also offers drug delivery platforms, such as Q-Sphera, a microencapsulation and polymer-depot sustained release drug delivery platform; MidaSolve, an oligosaccharide nanotechnology used to solubilize drugs so that they can be administered in liquid form directly and locally into tumors; and MidaCore, a gold nanoparticle used for targeting sites of disease by using chemotherapeutic agents or immunotherapeutic agents. Midatech Pharma plc was founded in 2000 and is headquartered in Cardiff, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NCM", "market": "us_market", "country": "United Kingdom", "city": "Cardiff"}, "MTPH.L": {"short_name": "MIDATECH PHARMA PLC ORD 0.1P", "long_name": "Midatech Pharma plc", "summary": "Midatech Pharma plc focuses on the research and development of oncology and rare disease products in the United Kingdom, rest of Europe, and internationally. The company is developing MTD201, a long acting dose of Octreotide for the treatment of acromegaly and neuroendocrine tumors; and MTX110, a direct delivery treatment for diffuse intrinsic pontine glioma. It also offers drug delivery platforms, such as Q-Sphera, a microencapsulation and polymer-depot sustained release drug delivery platform; MidaSolve, an oligosaccharide nanotechnology used to solubilize drugs so that they can be administered in liquid form directly and locally into tumors; and MidaCore, a gold nanoparticle used for targeting sites of disease by using chemotherapeutic agents or immunotherapeutic agents. Midatech Pharma plc was founded in 2000 and is headquartered in Cardiff, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cardiff"}, "MYOV": {"short_name": "Myovant Sciences Ltd.", "long_name": "Myovant Sciences Ltd.", "summary": "Myovant Sciences Ltd., a clinical-stage biopharmaceutical company, focuses on developing and commercializing therapies for women's health and endocrine diseases. The company's lead product is relugolix, an oral, once-daily, small molecule that acts as a gonadotropin-releasing hormone receptor antagonist for the treatment of heavy menstrual bleeding related with uterine fibroids, endometriosis-associated pain, and advanced prostate cancer. It is also developing MVT-602, an oligopeptide kisspeptin agonist, for the treatment of female infertility as part of assisted reproduction. Myovant Sciences Ltd. has collaboration with Pfizer Inc. to develop and commercialize relugolix in oncology and women's health. The company was formerly known as Roivant Endocrinology Ltd. and changed its name to Myovant Sciences Ltd. in May 2016. The company was founded in 2016 and is based in London, the United Kingdom. As of December 27, 2019, Myovant Sciences Ltd. operates as a subsidiary of Sumitovant Biopharma Ltd.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "London"}, "N04A.F": {"short_name": "NUCANA  SP.ADR 1/ LS-,04", "long_name": "NuCana plc", "summary": "NuCana plc, a clinical-stage biopharmaceutical company, engages in the development of products for the treatment of cancer. The company develops its products based on its proprietary ProTide technology. Its lead product candidate includes Acelarin, which is in Phase Ib and Phase III clinical trials for the treatment of patients with biliary tract cancer; a Phase II clinical trial for the treatment of patients with platinum-resistant ovarian cancer; Phase Ib clinical trial for the treatment of patients with biliary cancer; and Phase III clinical trial for the treatment of patients with metastatic pancreatic cancer. The company is also developing NUC-3373, a ProTide transformation of the active anti-cancer metabolite of 5-fluorouracil, which is in Phase I clinical trial for the treatment of patients with advanced solid tumors; and NUC-7738, a nucleoside analog that is in Phase I clinical trial for the treatment of patients with advanced solid tumors and hematological tumors. NuCana plc has a research, collaboration, and license agreement with Cardiff University and University College Cardiff Consultants Ltd. for the design, synthesis, characterization, and evaluation of ProTides; and an assignment, license, and collaboration agreement with Cardiff ProTides Ltd. The company was formerly known as NuCana BioMed Limited and changed its name to NuCana plc in August 2017. NuCana plc was incorporated in 1997 and is headquartered in Edinburgh, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Edinburgh"}, "NCNA": {"short_name": "NuCana plc", "long_name": "NuCana plc", "summary": "NuCana plc, a clinical-stage biopharmaceutical company, engages in the development of products for the treatment of cancer. The company develops its products based on its proprietary ProTide technology. Its lead product candidate includes Acelarin, which is in Phase Ib and Phase III clinical trials for the treatment of patients with biliary tract cancer; a Phase II clinical trial for the treatment of patients with platinum-resistant ovarian cancer; Phase Ib clinical trial for the treatment of patients with biliary cancer; and Phase III clinical trial for the treatment of patients with metastatic pancreatic cancer. The company is also developing NUC-3373, a ProTide transformation of the active anti-cancer metabolite of 5-fluorouracil, which is in Phase I clinical trial for the treatment of patients with advanced solid tumors; and NUC-7738, a nucleoside analog that is in Phase I clinical trial for the treatment of patients with advanced solid tumors and hematological tumors. NuCana plc has a research, collaboration, and license agreement with Cardiff University and University College Cardiff Consultants Ltd. for the design, synthesis, characterization, and evaluation of ProTides; and an assignment, license, and collaboration agreement with Cardiff ProTides Ltd. The company was formerly known as NuCana BioMed Limited and changed its name to NuCana plc in August 2017. NuCana plc was incorporated in 1997 and is headquartered in Edinburgh, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Edinburgh"}, "NFX.L": {"short_name": "NUFORMIX PLC ORD 0.1P", "long_name": "Nuformix plc", "summary": "Nuformix plc, a pharmaceutical development company, develops drugs using cocrystal technology in the United Kingdom. Its lead programs include NXP001, which is used for oncology supportive care; and NXP002 for use in the treatment of fibrosis. The company is also developing NXP004, which is under the pre-clinical stage for the treatment of multiple forms of fibrosis in various human tissues. It has an agreement with VistaGen Therapeutics, Inc. to develop co-crystal-based formulations of AV-101 for the treatment of various central nervous system conditions. The company also has an option agreement with Oxilio Ltd. to provide consultancy services for developing and exploiting NXP001 for the treatment of cancer. Nuformix plc was founded in 2008 and is headquartered in Cambridge, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cambridge"}, "NSCI.L": {"short_name": "NETSCIENTIFIC PLC ORD 5P", "long_name": "NetScientific plc", "summary": "NetScientific plc is a venture capital firm specializing in seed, early and mid stage investments. The firm focuses to invest in transformative biomedical and healthcare technologies focusing on digital health, diagnostics, and therapeutics sectors. It also prefers to invest in companies that significantly improve the health and well-being of people with chronic diseases. Within digital health it focuses on data analytics, wearable technologies, and devices. The firm seeks to invest in companies based in European developed markets and in the United States. It typically invests up to $15 million, but may consider larger amounts. It prefers to hold a controlling interest in all principal subsidiaries. The firm prefers to invest through its balance sheet investments. NetScientific plc was founded in 2008 and is based in London, United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "OB3.F": {"short_name": "OPTIBIOTIX HLTH PLC LS-02", "long_name": "OptiBiotix Health Plc", "summary": "Optibiotix Health Plc, a life sciences company, engages in the research and development of microbiome modulators primarily in the United Kingdom. The company identifies and develops microbial strains, compounds, and formulations for use in food ingredients, supplements, and active compounds that impacts human physiology deriving potential health benefits. Its products include Slimbiome, a natural ingredient, which offers a healthy and hunger-free weight management system; CholBiome, a food supplement for maintaining healthy levels of cholesterol; Lactobacillus plantarum LPLDL, a probiotic that aids elements of cardiovascular and wellbeing; LPGOS, a galactooligosaccharid that ID used in food products and applications, which helps in reducing cardiovascular risk factors and enhancing health; and Sweetbiotix, a sweetener for use in food products and beverages. The company's products prevents and manages chronic lifestyle diseases, including obesity, hypercholesterolemia and lipid profiles, and diabetes. Optibiotix Health Plc has an agreement with Fondazione Edmund Mach - Centro Ricerca e Innovazione to jointly fund and carry out a research project examining the role of its microbiome products to improve sleep, stress, and anxiety. The company was founded in 2012 and is headquartered in York, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "York"}, "OBD.L": {"short_name": "OXFORD BIODYNAMICS PLC ORD GBP0", "long_name": "Oxford BioDynamics Plc", "summary": "Oxford BioDynamics Plc, a biotechnology company, discovers and develops biomarkers for use within the pharmaceutical and biotechnology industry primarily in the United Kingdom and Malaysia. The company provides EpiSwitch, a proprietary technology platform for the discovery, evaluation, validation, and monitoring of epigenetic biomarkers known as chromosome conformation signatures. It has collaboration agreements with Holos Life Sciences Pte. Ltd. to develop non-invasive epigenetic biomarkers associated with sports-related concussions; and Casa Sollievo della Sofferenza to identify EpiSwitch biomarkers for the blood-based diagnosis of Autism Spectrum Disorder. The company also has a strategic partnership with Boca Biolistics LLC to provide a range of blood samples from COVID-19 patients with clinical information on disease severity. Oxford BioDynamics Plc was founded in 2007 and is headquartered in Oxford, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Oxford"}, "OCY.SG": {"short_name": "Oncimmune Holdings PLC Register", "long_name": "Oncimmune Holdings plc", "summary": "Oncimmune Holdings plc develops and commercializes technologies that enable cancer diagnosis in the United Kingdom, North America, Europe, and internationally. It offers EarlyCDT-Lung, a blood test for early detection of lung cancer. The company also develops SeroTag, a platform that is used to discover and validate biomarkers that can help stratify patients in multiple cancer indications, infectious diseases, and with various autoimmune diseases; and NavigAID disease-specific stratification panels. Oncimmune Holdings plc was incorporated in 2015 and is based in Nottingham, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "STU", "market": "dr_market", "country": "United Kingdom", "city": "Nottingham"}, "OKYO.L": {"short_name": "OKYO PHARMA LIMITED ORD NPV", "long_name": "OKYO Pharma Limited", "summary": "OKYO Pharma Limited operates as a life sciences and biopharmaceutical company in the United Kingdom. Its pre-clinical development program includes Chemerin for the treatment of ocular inflammation, dry eye disease, and ocular neuropathic pain; and BAM8, a non-opioid analgesic. OKYO Pharma Limited is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "OMY.SG": {"short_name": "Synairgen PLC Registered Shares", "long_name": "Synairgen plc", "summary": "Synairgen plc discovers and develops drugs for respiratory diseases. It develops inhaled interferon beta (IFN-Ã\u009f), which is in Phase-II clinical trials for the treatment of asthma caused by the common cold and flu; IFN-Ã\u009f that is in Phase-II clinical trial for the treatment or prevention of chronic obstructive pulmonary disease exacerbations caused by the common cold and flu; and LOXL2 inhibitor, which has completed Phase I clinical trial for the treatment of idiopathic pulmonary fibrosis (IPF) and non-alcoholic fatty liver diseases. The company has a licensing and collaboration agreement with Pharmaxis Ltd. to develop a LOXL2 inhibitor; and a strategic collaboration with Parexel Biotech on pivotal Phase III trial for the study of inhaled COVID-19 treatment. Synairgen plc was incorporated in 2004 and is headquartered in Southampton, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "STU", "market": "dr_market", "country": "United Kingdom", "city": "Southampton"}, "ONC.L": {"short_name": "ONCIMMUNE HOLDINGS PLC ORD 1P", "long_name": "Oncimmune Holdings plc", "summary": "Oncimmune Holdings plc develops and commercializes technologies that enable cancer diagnosis in the United Kingdom, North America, Europe, and internationally. It offers EarlyCDT-Lung, a blood test for early detection of lung cancer. The company also develops SeroTag, a platform that is used to discover and validate biomarkers that can help stratify patients in multiple cancer indications, infectious diseases, and with various autoimmune diseases; and NavigAID disease-specific stratification panels. Oncimmune Holdings plc was incorporated in 2015 and is based in Nottingham, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Nottingham"}, "OPTI.L": {"short_name": "OPTIBIOTIX HEALTH PLC ORD 2P", "long_name": "OptiBiotix Health Plc", "summary": "Optibiotix Health Plc, a life sciences company, engages in the research and development of microbiome modulators primarily in the United Kingdom. The company identifies and develops microbial strains, compounds, and formulations for use in food ingredients, supplements, and active compounds that impacts human physiology deriving potential health benefits. Its products include Slimbiome, a natural ingredient, which offers a healthy and hunger-free weight management system; CholBiome, a food supplement for maintaining healthy levels of cholesterol; Lactobacillus plantarum LPLDL, a probiotic that aids elements of cardiovascular and wellbeing; LPGOS, a galactooligosaccharid that ID used in food products and applications, which helps in reducing cardiovascular risk factors and enhancing health; and Sweetbiotix, a sweetener for use in food products and beverages. The company's products prevents and manages chronic lifestyle diseases, including obesity, hypercholesterolemia and lipid profiles, and diabetes. Optibiotix Health Plc has an agreement with Fondazione Edmund Mach - Centro Ricerca e Innovazione to jointly fund and carry out a research project examining the role of its microbiome products to improve sleep, stress, and anxiety. The company was founded in 2012 and is headquartered in York, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "York"}, "ORPH.L": {"short_name": "OPEN ORPHAN PLC ORD 0.1P", "long_name": "Open Orphan plc", "summary": "Open Orphan plc operates as a clinical research organization pharmaceutical services company with a focus on virology, vaccine studies, and orphan drugs in the United Kingdom, Ireland, France, the Netherlands, Germany, and Singapore. It operates a virtual rep, a pharmaceutical commercialization platform for rare/orphan disease space; and develops Genomic Health Data platform, a collection of infectious disease progression data. The company also provides consulting and clinical trial services to pharmaceutical, biotechnology, and medical device organizations. In addition, it offers hVIVO COVID Clear Test, an antibody test for employers in the United Kingdom and Ireland. The company is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ORTX": {"short_name": "Orchard Therapeutics plc", "long_name": "Orchard Therapeutics plc", "summary": "Orchard Therapeutics plc, a biopharmaceutical company, develops gene therapies for serious and life-threatening rare diseases in the United Kingdom, European Union, and the United States. The company's gene therapy approach seeks to transform a patient's hematopoietic stem cells into a gene-modified drug product to treat the patient's disease through a single administration. It provides Strimvelis, a gammaretroviral-based product for the treatment of adenosine deaminase-severe combined immunodeficiency (ADA-SCID). The company's clinical development products comprise OTL-101 for the treatment of ADA-SCID; OTL-200 to treat metachromatic leukodystrophy; OTL-103 for the treatment of Wiskott-Aldrich syndrome; OTL-102 for X-linked chronic granulomatous disease; and OTL-300 for transfusion-dependent beta-thalassemia. Its preclinical programs include OTL-203 for mucopolysaccharidosis type I, OTL-201 for mucopolysaccharidosis type MPS-IIIA, and OTL-202 for mucopolysaccharidosis type IIIB. The company was formerly known as Orchard Rx Limited. Orchard Therapeutics plc was founded in 2015 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "OT1A.F": {"short_name": "ORCHARD THERAP.SP.ADRS/1", "long_name": "Orchard Therapeutics plc", "summary": "Orchard Therapeutics plc, a biopharmaceutical company, develops gene therapies for serious and life-threatening rare diseases in the United Kingdom, European Union, and the United States. The company's gene therapy approach seeks to transform a patient's hematopoietic stem cells into a gene-modified drug product to treat the patient's disease through a single administration. It provides Strimvelis, a gammaretroviral-based product for the treatment of adenosine deaminase-severe combined immunodeficiency (ADA-SCID). The company's clinical development products comprise OTL-101 for the treatment of ADA-SCID; OTL-200 to treat metachromatic leukodystrophy; OTL-103 for the treatment of Wiskott-Aldrich syndrome; OTL-102 for X-linked chronic granulomatous disease; and OTL-300 for transfusion-dependent beta-thalassemia. Its preclinical programs include OTL-203 for mucopolysaccharidosis type I, OTL-201 for mucopolysaccharidosis type MPS-IIIA, and OTL-202 for mucopolysaccharidosis type IIIB. The company was formerly known as Orchard Rx Limited. Orchard Therapeutics plc was founded in 2015 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "OXB.L": {"short_name": "OXFORD BIOMEDICA PLC ORD 50P", "long_name": "Oxford Biomedica plc", "summary": "Oxford Biomedica plc, a biopharmaceutical company, engages in the research, development, and bioprocessing of lentiviral vector and cell therapy products for the treatment of various diseases in Europe and internationally. The company operates in two segments, Platform and Product. Its LentiVector platform technology integrates genes into non-dividing cells, including neurons in the brain and retinal cells in the eye, as well as accommodates multiple therapeutic genes. The company's products under development stage include OXB-302 that targets haematological tumours with a CAR-T 5T4; OXB-203, which is in pre-clinical stage for the treatment of wet age-related macular degeneration; OXB-202 for the treatment of corneal graft rejection; OXB-204, a lentiviral-based therapy for the ocular disease Leber's congenital amaurosis variant 10; OXB-103 (ALS) for central nervous system; and OXB-401 for liver indication. Its partnered products in development stage comprise AXO-Lenti-PD that is in a Phase I/II trial preparation for the treatment of Parkinson's disease; SAR 422459, which is in a Phase II trial for the treatment of Stargardt disease; and SAR 421869 that is in Phase I/II trial for the treatment of Usher syndrome 1B. Oxford Biomedica plc has partnerships with Novartis, Bristol Myers Squibb, Sanofi, Axovant Gene Therapies, Orchard Therapeutics, Boehringer Ingelheim, the UK Cystic Fibrosis Gene Therapy Consortium, Imperial Innovations, Santen Pharmaceutical Co Ltd, Microsoft Research, and Vaccines Manufacturing and Innovation Centre. The company also has a research collaboration agreement with Papyrus Therapeutics, Inc. to assess the impact and therapeutic benefit of PYTX-002, a gene replacement therapy to confer cellular pharmacy properties on a CAR-T cell therapy. It has a discovery collaboration with PhoreMost Limited to develop CAR-T cell therapies. Oxford Biomedica plc was founded in 1995 and is headquartered in Oxford, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Oxford"}, "OXBDF": {"short_name": "OXFORD BIOMEDICA", "long_name": "Oxford Biomedica plc", "summary": "Oxford Biomedica plc, a biopharmaceutical company, engages in the research, development, and bioprocessing of lentiviral vector and cell therapy products for the treatment of various diseases in Europe and internationally. The company operates in two segments, Platform and Product. Its LentiVector platform technology integrates genes into non-dividing cells, including neurons in the brain and retinal cells in the eye, as well as accommodates multiple therapeutic genes. The company's products under development stage include OXB-302 that targets haematological tumours with a CAR-T 5T4; OXB-203, which is in pre-clinical stage for the treatment of wet age-related macular degeneration; OXB-202 for the treatment of corneal graft rejection; OXB-204, a lentiviral-based therapy for the ocular disease Leber's congenital amaurosis variant 10; OXB-103 (ALS) for central nervous system; and OXB-401 for liver indication. Its partnered products in development stage comprise AXO-Lenti-PD that is in a Phase I/II trial preparation for the treatment of Parkinson's disease; SAR 422459, which is in a Phase II trial for the treatment of Stargardt disease; and SAR 421869 that is in Phase I/II trial for the treatment of Usher syndrome 1B. Oxford Biomedica plc has partnerships with Novartis, Bristol Myers Squibb, Sanofi, Axovant Gene Therapies, Orchard Therapeutics, Boehringer Ingelheim, the UK Cystic Fibrosis Gene Therapy Consortium, Imperial Innovations, Santen Pharmaceutical Co Ltd, Microsoft Research, and Vaccines Manufacturing and Innovation Centre. The company also has a research collaboration agreement with Papyrus Therapeutics, Inc. to assess the impact and therapeutic benefit of PYTX-002, a gene replacement therapy to confer cellular pharmacy properties on a CAR-T cell therapy. It has a discovery collaboration with PhoreMost Limited to develop CAR-T cell therapies. Oxford Biomedica plc was founded in 1995 and is headquartered in Oxford, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Oxford"}, "OXOA.F": {"short_name": "OXFORD BIOMEDICA  LS-,50", "long_name": "Oxford Biomedica plc", "summary": "Oxford Biomedica plc, a biopharmaceutical company, engages in the research, development, and bioprocessing of lentiviral vector and cell therapy products for the treatment of various diseases in Europe and internationally. The company operates in two segments, Platform and Product. Its LentiVector platform technology integrates genes into non-dividing cells, including neurons in the brain and retinal cells in the eye, as well as accommodates multiple therapeutic genes. The company's products under development stage include OXB-302 that targets haematological tumours with a CAR-T 5T4; OXB-203, which is in pre-clinical stage for the treatment of wet age-related macular degeneration; OXB-202 for the treatment of corneal graft rejection; OXB-204, a lentiviral-based therapy for the ocular disease Leber's congenital amaurosis variant 10; OXB-103 (ALS) for central nervous system; and OXB-401 for liver indication. Its partnered products in development stage comprise AXO-Lenti-PD that is in a Phase I/II trial preparation for the treatment of Parkinson's disease; SAR 422459, which is in a Phase II trial for the treatment of Stargardt disease; and SAR 421869 that is in Phase I/II trial for the treatment of Usher syndrome 1B. Oxford Biomedica plc has partnerships with Novartis, Bristol Myers Squibb, Sanofi, Axovant Gene Therapies, Orchard Therapeutics, Boehringer Ingelheim, the UK Cystic Fibrosis Gene Therapy Consortium, Imperial Innovations, Santen Pharmaceutical Co Ltd, Microsoft Research, and Vaccines Manufacturing and Innovation Centre. The company also has a research collaboration agreement with Papyrus Therapeutics, Inc. to assess the impact and therapeutic benefit of PYTX-002, a gene replacement therapy to confer cellular pharmacy properties on a CAR-T cell therapy. It has a discovery collaboration with PhoreMost Limited to develop CAR-T cell therapies. Oxford Biomedica plc was founded in 1995 and is headquartered in Oxford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Oxford"}, "PLPL": {"short_name": "PLANDAI BIOTECHNOLOGY INC", "long_name": "Plandaí Biotechnology, Inc.", "summary": "PlandaÃ­ Biotechnology, Inc. focuses on the production of proprietary botanical extracts for the nutriceutical and pharmaceutical industries. It is developing Phytofare Catechin Complex, a botanical extract derived from green tea harvested in the Senteeko Tea Estate in Mpumalanga, South Africa; and Phytofare citrus complex, a citrus extract, as well as extracts from tomato fruit, Artemisia, and cannabis. The company also produces and sells timber and agricultural products from its farm and tea estate holdings in South Africa. PlandaÃ­ Biotechnology, Inc. is based in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "PYC.L": {"short_name": "PHYSIOMICS PLC ORD 0.4P", "long_name": "Physiomics Plc", "summary": "Physiomics Plc provides consulting services to pharmaceutical companies in the areas of outsourced quantitative pharmacology and computational biology in the United Kingdom, the European Union, and the United States. It offers modeling, simulation, and data analysis services covering various ranges of oncology research and development using its proprietary Virtual Tumour predictive software. The company also develops technology for use in the field of personalized medicine. Physiomics Plc was incorporated in 2001 and is based in Oxford, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Oxford"}, "PYPB.F": {"short_name": "IXICO PLC  LS -,01", "long_name": "IXICO plc", "summary": "IXICO plc provides data analytics services to the biopharmaceutical industry in the United States, the United Kingdom, Europe, and internationally. It provides collection, analysis, management, and reporting services on data generated in the course of a clinical study. The company's technologies include Assessa, a secure online digital platform that provides clinical decision support for patient selection and post-marketing surveillance; and TrialTracker, a platform that delivers imaging services designed to manage the complex imaging workflow from image upload, QC, and reading/analysis to reporting and data transfer. The company offers end-to-end imaging services, primarily in the fields of Alzheimer's, Parkinson's, Huntington's, multiple sclerosis, cerebrovascular, and progressive supranuclear palsy diseases; and engages in the data collection and analysis of neurological diseases. Its services are used to select patients for clinical trials, assess the safety and efficacy of new drugs in development, and in post marketing surveillance. The company was incorporated in 1995 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "REDX.L": {"short_name": "REDX PHARMA PLC ORD 1P", "long_name": "Redx Pharma Plc", "summary": "Redx Pharma Plc engages in drug discovery, pre-clinical development, and licensing activities in the United Kingdom. It discovers and develops small molecule drugs for treating anti-cancer and fibrosis targets in the areas of unmet medical needs. The company is developing RXC004, a porcupine inhibitor, which has completed Phase I clinical development for the treatment of colorectal, pancreatic, biliary, and gastric cancers, as well as melanoma; ROCK inhibitor for treating inflammatory intestinal fibrosis; RXC007, a Rho-associated protein kinase 2 inhibitors for the treatment of orphan disease, idiopathic pulmonary fibrosis, non-alcoholic steatohepatitis, and other systemic fibrotic conditions; and Porcupine (RXC006), which is in Phase I for the treatment of lung fibrosis. Redx Pharma Plc has a research collaboration agreement with Jazz Pharmaceuticals plc to discover and develop drug candidates for two cancer targets in the Ras/Raf/MAP kinase pathway. The company was founded in 2010 and is based in Macclesfield, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Macclesfield"}, "RENE.L": {"short_name": "RENEURON GROUP PLC ORD 1P", "long_name": "ReNeuron Group plc", "summary": "ReNeuron Group plc develops and sells cell-based therapies in the United Kingdom. The company engages in the development of CTX stem cell therapy candidate that is in Phase IIb clinical trial for stroke disability; and human retinal progenitor cell therapy that is in Phase I/IIa clinical trial for treating retinitis pigmentosa, a blindness-causing disease. It also developing CTX-derived exosomes, which are Nano-sized packages of information released by CTX cells. ReNeuron Group plc has a research agreement with U.S. biotechnology company in the discovery and development of novel gene silencing-based therapeutics. The company was founded in 1997 and is headquartered in Pencoed, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Pencoed"}, "RNUGF": {"short_name": "RENEURON GROUP", "long_name": "ReNeuron Group plc", "summary": "ReNeuron Group plc develops and sells cell-based therapies in the United Kingdom. The company engages in the development of CTX stem cell therapy candidate that is in Phase IIb clinical trial for stroke disability; and human retinal progenitor cell therapy that is in Phase I/IIa clinical trial for treating retinitis pigmentosa, a blindness-causing disease. It also developing CTX-derived exosomes, which are Nano-sized packages of information released by CTX cells. ReNeuron Group plc has a research agreement with U.S. biotechnology company in the discovery and development of novel gene silencing-based therapeutics. The company was founded in 1997 and is headquartered in Pencoed, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Pencoed"}, "RQE1.F": {"short_name": "RENEURON GRP PLC  LS-,01", "long_name": "ReNeuron Group plc", "summary": "ReNeuron Group plc develops and sells cell-based therapies in the United Kingdom. The company engages in the development of CTX stem cell therapy candidate that is in Phase IIb clinical trial for stroke disability; and human retinal progenitor cell therapy that is in Phase I/IIa clinical trial for treating retinitis pigmentosa, a blindness-causing disease. It also developing CTX-derived exosomes, which are Nano-sized packages of information released by CTX cells. ReNeuron Group plc has a research agreement with U.S. biotechnology company in the discovery and development of novel gene silencing-based therapeutics. The company was founded in 1997 and is headquartered in Pencoed, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Pencoed"}, "RTQ1.F": {"short_name": "AVACTA GROUP PLC  LS-,10", "long_name": "Avacta Group Plc", "summary": "Avacta Group Plc offers reagents and therapeutics based on Affimer technology for diagnostic and research applications in the United Kingdom, North America, Asia, and rest of Europe. It operates in Diagnostics, Therapeutics, and Animal Health segments. The company develops custom Affimer proteins for customer products and in-house diagnostic assays. It also develops novel cancer immunotherapies combining proprietary platforms; and provides tools and contract services to assist diagnosis of conditions in animals to enable faster treatment for veterinarians. The company has a research partnership with Moderna Therapeutics; research collaboration with pre|CISION technology incorporates a substrate that is sensitive to cleavage by fibroblast activation protein; co-development partnership agreement with Bach Biosciences LLP to develop Affimer drug conjugate therapies; drug development collaboration with LG Chem Life Sciences; a partnership with Selexis to develop cell line for clinical manufacturing, and with Tufts University School of Medicine for developing Affimer drug conjugate therapies; a collaboration with Cytiva to develop and manufacture an Affimer-based point-of-care rapid test; and a collaboration with Adeptrix to develop Affimer-based COVID-19 antigen tests. Avacta Group Plc was incorporated in 2003 and is based in Wetherby, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Wetherby"}, "RTRA.F": {"short_name": "TIZIANA LI.ADR /2 LS-,03", "long_name": "Tiziana Life Sciences PLC", "summary": "Tiziana Life Sciences Plc, a clinical stage biotechnology company, focuses on the discovery and development of molecules and related diagnostics to treat diseases in oncology and immunology in the United Kingdom. The company's product pipeline includes Foralumab (TZLS-401), a human anti-CD3 monclonal antibody for the treatment of autoimmune and inflammatory diseases, such GvHD, ulcerative colitis, Crohn's disease, multiple sclerosis, type-1 diabetes, inflammatory bowel diseases, psoriasis, and rheumatoid arthritis; and Milciclib (TZLS-201), which is an orally bioavailable, small molecule inhibitor of cyclin-dependent kinases and Src family kinases for the treatment of hepatocellular carcinoma. It also develops Anti IL-6r (TZLS-501), a human anti-interleukin-6 receptor monoclonal antibody for the treatment of IL6-induced inflammation, primarily to treat hospitalized COVID-19 patients with severe respiratory symptoms; and StemPrintER, a multi-gene signature assay intended for use in patients diagnosed with estrogen-receptor positive ER+/HER2 negative breast cancers. The company was founded in 2013 and is headquartered in London, the United Kingdom. Tiziana Life Sciences Plc is a subsidiary of Planwise Group Limited.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "RVW1.F": {"short_name": "PHYSIOMICS PLC  LS -,004", "long_name": "Physiomics Plc", "summary": "Physiomics Plc provides consulting services to pharmaceutical companies in the areas of outsourced quantitative pharmacology and computational biology in the United Kingdom, the European Union, and the United States. It offers modeling, simulation, and data analysis services covering various ranges of oncology research and development using its proprietary Virtual Tumour predictive software. The company also develops technology for use in the field of personalized medicine. Physiomics Plc was incorporated in 2001 and is based in Oxford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Oxford"}, "S4BA.F": {"short_name": "F-STAR THERAPEUT.DL-,0001", "long_name": "F-star Therapeutics, Inc.", "summary": "F-star Therapeutics, Inc., a clinical-stage biopharmaceutical company develops tetravalent bispecific antibodies for cancer therapy. Its medicines used in immuno-oncology treatments. The company plans for the initiation of a Phase I, open label, first-in-human clinical study of FS222, a bispecific antibody targeting CD137 (4-1BB) and PD-L1. The company is based in Cambridge, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Cambridge"}, "SAR.L": {"short_name": "SAREUM HOLDINGS PLC ORD 0.025P", "long_name": "Sareum Holdings plc", "summary": "Sareum Holdings plc, a specialist drug development company, engages in the discovery and development of therapeutic drugs for cancer and autoimmune diseases. It develops small molecule therapeutic drugs based on its Sareum Kinase Inhibitor Library drug discovery platform. The company's product pipeline includes Checkpoint Kinase 1, Aurora+FLT3 kinase, and TYK2/JAK1 kinase. It has collaborations with Hebei Medical University Biomedical Engineering Center and Sierra Oncology, Inc. The company was founded in 2003 and is based in Cambridge, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cambridge"}, "SBTX.L": {"short_name": "SKINBIOTHERAPEUTICS PLC ORD 1P", "long_name": "SkinBioTherapeutics Plc", "summary": "SkinBioTherapeutics plc, a life science company, engages in the research and development of lysates derived from the human microbiome on skin. The company focuses on the development of SkinBiotix technology for use in cosmetic, infection control, and eczema applications. It has an agreement with Croda International Plc for the design and manufacture of a new active cosmetic skincare ingredient based on its SkinBiotix skin microbiome technology. The company was formerly known as Skinbiotix Ltd and changed its name to SkinBioTherapeutics plc in December 2016. SkinBioTherapeutics plc was incorporated in 2015 and is based in Macclesfield, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Macclesfield"}, "SCLP.L": {"short_name": "SCANCELL HOLDINGS PLC ORD 0.1P", "long_name": "Scancell Holdings plc", "summary": "Scancell Holdings plc engages in the discovery and development of novel vaccines for the treatment of various cancers. The company's product candidates include SCIB1, which is in phase II clinical trial for the treatment of metastatic melanoma; SCIB2 that is in phase I/II combination trials for the treatment of non-small cell lung cancer; and Modi-1, which is in phase I/II clinical trials for the treatment of head and neck, triple negative breast, ovarian, and renal cancers. It also develops Modi-2 that is in pre-clinical trial for the treatment of multiple solid tumors. The company has a research collaboration agreement with BioNTech to develop T-cell receptor based therapeutics; licensing and collaboration agreement with ISA Pharmaceuticals B.V. to use ISA's AMPLIVANT adjuvant technology for the development and commercialization of Modi-1; and collaboration agreements with Cobra Biologics, Centre for Research on Global Virus Infections, the University of Nottingham, and the Nottingham Trent University to develop a vaccine for COVID-19. Scancell Holdings plc was founded in 1997 and is based in Oxford, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Oxford"}, "SCP.F": {"short_name": "SCANCELL HLDGS  LS -,001", "long_name": "Scancell Holdings plc", "summary": "Scancell Holdings plc engages in the discovery and development of novel vaccines for the treatment of various cancers. The company's product candidates include SCIB1, which is in phase II clinical trial for the treatment of metastatic melanoma; SCIB2 that is in phase I/II combination trials for the treatment of non-small cell lung cancer; and Modi-1, which is in phase I/II clinical trials for the treatment of head and neck, triple negative breast, ovarian, and renal cancers. It also develops Modi-2 that is in pre-clinical trial for the treatment of multiple solid tumors. The company has a research collaboration agreement with BioNTech to develop T-cell receptor based therapeutics; licensing and collaboration agreement with ISA Pharmaceuticals B.V. to use ISA's AMPLIVANT adjuvant technology for the development and commercialization of Modi-1; and collaboration agreements with Cobra Biologics, Centre for Research on Global Virus Infections, the University of Nottingham, and the Nottingham Trent University to develop a vaccine for COVID-19. Scancell Holdings plc was founded in 1997 and is based in Oxford, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Oxford"}, "SLN": {"short_name": "Silence Therapeutics Plc - Amer", "long_name": "Silence Therapeutics plc", "summary": "Silence Therapeutics plc focuses on the discovery, development, and delivery of novel RNA therapeutics in hematology, cardiovascular, and other rare and metabolic indications. The company designs short interfering RNA (siRNA) molecules that trigger the RNAi pathway and mediate the degradation of specific target messenger RNAs. It is developing various product candidates, including SLN124 for the treatment of iron overload disorders; SLN360 for the cardiovascular disease with high lipoprotein; and SLN500 for the treatment of complement-mediated diseases. Silence Therapeutics plc has a strategic collaboration with AstraZeneca to discover, develop, and commercialize small interfering RNA therapeutics for the treatment of cardiovascular, renal, metabolic, and respiratory diseases; and collaboration with Genomics England Limited. The company was formerly known as SR Pharma plc and changed its name to Silence Therapeutics plc in May 2007. Silence Therapeutics plc is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "SLN.L": {"short_name": "SILENCE THERAPEUTICS PLC ORD 5P", "long_name": "Silence Therapeutics plc", "summary": "Silence Therapeutics plc focuses on the discovery, development, and delivery of novel RNA therapeutics in hematology, cardiovascular, and other rare and metabolic indications. The company designs short interfering RNA (siRNA) molecules that trigger the RNAi pathway and mediate the degradation of specific target messenger RNAs. It is developing various product candidates, including SLN124 for the treatment of iron overload disorders; SLN360 for the cardiovascular disease with high lipoprotein; and SLN500 for the treatment of complement-mediated diseases. Silence Therapeutics plc has a strategic collaboration with AstraZeneca to discover, develop, and commercialize small interfering RNA therapeutics for the treatment of cardiovascular, renal, metabolic, and respiratory diseases; and collaboration with Genomics England Limited. The company was formerly known as SR Pharma plc and changed its name to Silence Therapeutics plc in May 2007. Silence Therapeutics plc is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "SLNCF": {"short_name": "SILENCE THERAPEUTICS PLC", "long_name": "Silence Therapeutics plc", "summary": "Silence Therapeutics plc focuses on the discovery, development, and delivery of novel RNA therapeutics in hematology, cardiovascular, and other rare and metabolic indications. The company designs short interfering RNA (siRNA) molecules that trigger the RNAi pathway and mediate the degradation of specific target messenger RNAs. It is developing various product candidates, including SLN124 for the treatment of iron overload disorders; SLN360 for the cardiovascular disease with high lipoprotein; and SLN500 for the treatment of complement-mediated diseases. Silence Therapeutics plc has a strategic collaboration with AstraZeneca to discover, develop, and commercialize small interfering RNA therapeutics for the treatment of cardiovascular, renal, metabolic, and respiratory diseases; and collaboration with Genomics England Limited. The company was formerly known as SR Pharma plc and changed its name to Silence Therapeutics plc in May 2007. Silence Therapeutics plc is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "SNG.L": {"short_name": "SYNAIRGEN PLC ORD 1P", "long_name": "Synairgen plc", "summary": "Synairgen plc discovers and develops drugs for respiratory diseases. It develops inhaled interferon beta (IFN-Ã\u009f), which is in Phase-II clinical trials for the treatment of asthma caused by the common cold and flu; IFN-Ã\u009f that is in Phase-II clinical trial for the treatment or prevention of chronic obstructive pulmonary disease exacerbations caused by the common cold and flu; and LOXL2 inhibitor, which has completed Phase I clinical trial for the treatment of idiopathic pulmonary fibrosis (IPF) and non-alcoholic fatty liver diseases. The company has a licensing and collaboration agreement with Pharmaxis Ltd. to develop a LOXL2 inhibitor; and a strategic collaboration with Parexel Biotech on pivotal Phase III trial for the study of inhaled COVID-19 treatment. Synairgen plc was incorporated in 2004 and is headquartered in Southampton, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Southampton"}, "SYGGF": {"short_name": "SYNAIRGEN", "long_name": "Synairgen plc", "summary": "Synairgen plc discovers and develops drugs for respiratory diseases. It develops inhaled interferon beta (IFN-Ã\u009f), which is in Phase-II clinical trials for the treatment of asthma caused by the common cold and flu; IFN-Ã\u009f that is in Phase-II clinical trial for the treatment or prevention of chronic obstructive pulmonary disease exacerbations caused by the common cold and flu; and LOXL2 inhibitor, which has completed Phase I clinical trial for the treatment of idiopathic pulmonary fibrosis (IPF) and non-alcoholic fatty liver diseases. The company has a licensing and collaboration agreement with Pharmaxis Ltd. to develop a LOXL2 inhibitor; and a strategic collaboration with Parexel Biotech on pivotal Phase III trial for the study of inhaled COVID-19 treatment. Synairgen plc was incorporated in 2004 and is headquartered in Southampton, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Southampton"}, "TILS.L": {"short_name": "TIZIANA LIFE SCIENCES PLC ORD 3", "long_name": "Tiziana Life Sciences PLC", "summary": "Tiziana Life Sciences Plc, a clinical stage biotechnology company, focuses on the discovery and development of molecules and related diagnostics to treat diseases in oncology and immunology in the United Kingdom. The company's product pipeline includes Foralumab (TZLS-401), a human anti-CD3 monclonal antibody for the treatment of autoimmune and inflammatory diseases, such GvHD, ulcerative colitis, Crohn's disease, multiple sclerosis, type-1 diabetes, inflammatory bowel diseases, psoriasis, and rheumatoid arthritis; and Milciclib (TZLS-201), which is an orally bioavailable, small molecule inhibitor of cyclin-dependent kinases and Src family kinases for the treatment of hepatocellular carcinoma. It also develops Anti IL-6r (TZLS-501), a human anti-interleukin-6 receptor monoclonal antibody for the treatment of IL6-induced inflammation, primarily to treat hospitalized COVID-19 patients with severe respiratory symptoms; and StemPrintER, a multi-gene signature assay intended for use in patients diagnosed with estrogen-receptor positive ER+/HER2 negative breast cancers. The company was founded in 2013 and is headquartered in London, the United Kingdom. Tiziana Life Sciences Plc is a subsidiary of Planwise Group Limited.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "TLSA": {"short_name": "Tiziana Life Sciences plc - Ame", "long_name": "Tiziana Life Sciences PLC", "summary": "Tiziana Life Sciences Plc, a clinical stage biotechnology company, focuses on the discovery and development of molecules and related diagnostics to treat diseases in oncology and immunology in the United Kingdom. The company's product pipeline includes Foralumab (TZLS-401), a human anti-CD3 monclonal antibody for the treatment of autoimmune and inflammatory diseases, such GvHD, ulcerative colitis, Crohn's disease, multiple sclerosis, type-1 diabetes, inflammatory bowel diseases, psoriasis, and rheumatoid arthritis; and Milciclib (TZLS-201), which is an orally bioavailable, small molecule inhibitor of cyclin-dependent kinases and Src family kinases for the treatment of hepatocellular carcinoma. It also develops Anti IL-6r (TZLS-501), a human anti-interleukin-6 receptor monoclonal antibody for the treatment of IL6-induced inflammation, primarily to treat hospitalized COVID-19 patients with severe respiratory symptoms; and StemPrintER, a multi-gene signature assay intended for use in patients diagnosed with estrogen-receptor positive ER+/HER2 negative breast cancers. The company was founded in 2013 and is headquartered in London, the United Kingdom. Tiziana Life Sciences Plc is a subsidiary of Planwise Group Limited.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "TRX.L": {"short_name": "TISSUE REGENIX GROUP PLC ORD 0.", "long_name": "Tissue Regenix Group plc", "summary": "Tissue Regenix Group plc, a medical technology company, develops and commercializes platform technologies in the field of tissue engineering and regenerative medicine in the United States and internationally. It operates through BioSurgery, Orthopaedics & Dental, Cardiac, and GBM-V divisions. The company provides dCELL technology, a soft tissue decellularisation process that removes DNA and cellular material from biological tissues, the patient's cells can repopulate and colonise, creating new, like-for-like tissue, which is recognized and accepted by the body by reducing the risk of rejection, and stimulating a natural healing process. It also offers BioRinse technology, a natural bone filler solution for osteoinductive to stimulate and regenerate native bone growth. In addition, the company provides DermaPure, a decellularised dermal allograft for orthopaedics, trauma, and woundcare; and SurgiPure XD, a Decellularised xenograft tissue for the repair of hernias and/or body wall defects, which require the use of reinforcing or buttressing material to obtain the desired surgical outcome. Further, it offers OrthoPure XT, a scaffold to replace the damaged tissue that will re-populate with the patient's own cells; ConCelltrate 100, a verified osteoinductive bone matrix; MatrixCellect 100, a demineralised bone matrix; Matrix IQ Dermis, a human-derived dermal graft, which is decellularised to remove cellular components and preserve the biological properties that promote revascularisation, repair, and augmentation of damaged tissue; and Matrix OI FlexIt, a thin pliable demineralised cortical allograft bone sheet. Additionally, the company provides DentalFix, a mineralized particulate allograft that offer osteoconductive properties of natural bone; and develops CardioPure product. The company was incorporated in 2006 and is based in Garforth, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Garforth"}, "UROV": {"short_name": "Urovant Sciences Ltd.", "long_name": "Urovant Sciences Ltd.", "summary": "Urovant Sciences Ltd., a clinical-stage biopharmaceutical company, focuses on developing and commercializing therapies for urologic conditions in the United States. The company's lead product candidate is vibegron, an oral small molecule beta-3 agonist for the treatment of overactive bladder (OAB), OAB in men with benign prostatic hyperplasia, and abdominal pain due to irritable bowel syndrome. It is also developing URO-902, a gene therapy for patients with OAB who have failed oral pharmacological therapy. The company was formerly known as Thalavant Sciences Ltd. and changed its name to Urovant Sciences Ltd. in January 2017. Urovant Sciences Ltd. was founded in 2016 and is based in London, the United Kingdom. Urovant Sciences Ltd. operates as a subsidiary of Sumitovant Biopharma Ltd.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "VAL.L": {"short_name": "VALIRX PLC ORD 0.1P", "long_name": "ValiRx plc", "summary": "ValiRx plc, a biotechnology oncology focused company, engages in developing novel therapeutics and associated biomarkers for cancer in the United Kingdom. The company's lead drug candidates include VAL201, an anti-cancer therapeutic that is in Phase I/II trials for the treatment of prostate cancer and other indications of hormone induced unregulated growth, including endometriosis; VAL301, a reformulation of VAL201, which is in pre-clinical development for the treatment of women with endometriosis; and VAL401, a reformulation of generic drug Risperidone, which has completed Phase II clinical trial for the treatment of non-small cell lung cancer. Its drug candidates also comprise VAL101, a candidate produced by GeneICE technology platform to modulate BCl2 expression Â\u0096 implicated in cancers. ValiRx plc has collaboration agreement with Oncolytika Limited and Black Cat Bio Limited to develop and evaluate BC201 for patients suffering a hyperimmune response to Coronavirus SARS-CoV2 infection. The company was incorporated in 2000 and is based in Hatfield, the United Kingdom.", "currency": "GBp", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Hatfield"}, "VRNA": {"short_name": "Verona Pharma plc", "long_name": "Verona Pharma plc", "summary": "Verona Pharma plc, a clinical stage biopharmaceutical company, focuses on develops and commercializes therapies for the treatment of respiratory diseases with unmet medical needs. Its product candidate, ensifentrine (RPL554), is an inhaled, dual inhibitor of the enzymes phosphodiesterase 3 and 4 that acts as both a bronchodilator and an anti-inflammatory agent in a single compound. The formulations of ensifentrine are under development for the treatment chronic obstructive pulmonary disease (COPD): nebulized ensifentrine is in Phase 2b clinical development for the maintenance treatment of COPD; and a dry powder inhaler and a pressurized metered-dose inhaler. The company also focuses on developing ensifentrine for the treatment of cystic fibrosis and asthma. Verona Pharma plc was founded in 2005 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "XRP1.F": {"short_name": "SILENCE THERAPEUT. LS-,05", "long_name": "Silence Therapeutics plc", "summary": "Silence Therapeutics plc focuses on the discovery, development, and delivery of novel RNA therapeutics in hematology, cardiovascular, and other rare and metabolic indications. The company designs short interfering RNA (siRNA) molecules that trigger the RNAi pathway and mediate the degradation of specific target messenger RNAs. It is developing various product candidates, including SLN124 for the treatment of iron overload disorders; SLN360 for the cardiovascular disease with high lipoprotein; and SLN500 for the treatment of complement-mediated diseases. Silence Therapeutics plc has a strategic collaboration with AstraZeneca to discover, develop, and commercialize small interfering RNA therapeutics for the treatment of cardiovascular, renal, metabolic, and respiratory diseases; and collaboration with Genomics England Limited. The company was formerly known as SR Pharma plc and changed its name to Silence Therapeutics plc in May 2007. Silence Therapeutics plc is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "XRP2.F": {"short_name": "SILENCE THERAP. SP.ADR/1", "long_name": "Silence Therapeutics plc", "summary": "Silence Therapeutics plc focuses on the discovery, development, and delivery of novel RNA therapeutics in hematology, cardiovascular, and other rare and metabolic indications. The company designs short interfering RNA (siRNA) molecules that trigger the RNAi pathway and mediate the degradation of specific target messenger RNAs. It is developing various product candidates, including SLN124 for the treatment of iron overload disorders; SLN360 for the cardiovascular disease with high lipoprotein; and SLN500 for the treatment of complement-mediated diseases. Silence Therapeutics plc has a strategic collaboration with AstraZeneca to discover, develop, and commercialize small interfering RNA therapeutics for the treatment of cardiovascular, renal, metabolic, and respiratory diseases; and collaboration with Genomics England Limited. The company was formerly known as SR Pharma plc and changed its name to Silence Therapeutics plc in May 2007. Silence Therapeutics plc is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Healthcare", "industry": "Biotechnology", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}}