{"AKSEN.IS": {"short_name": "AKSA ENERJI", "long_name": "Aksa Enerji Üretim A.S.", "summary": "Aksa Enerji Ã\u009cretim A.S., an independent power producer, produces and sells electricity in Turkey and Africa. The company produces energy from coal, fuel oil, biogas, natural gas, wind, and hydroelectricity. As of December 31, 2019, it operated 7 power plants with a total installed capacity of 1,946 MW. The company was founded in 1997 and is headquartered in Istanbul, Turkey. Aksa Enerji Ã\u009cretim A.S. is a subsidiary of Kazanci Holding A.S.", "currency": "TRY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Istanbul"}, "AKSUE.IS": {"short_name": "AKSU ENERJI", "long_name": "Aksu Enerji ve Ticaret Anonim Sirketi", "summary": "Aksu Enerji ve Ticaret Anonim Sirketi engages in the operation of hydroelectric power plant in Turkey. It produces and distributes hydroelectric power. The company was founded in 1985 and is headquartered in Isparta, Turkey.", "currency": "TRY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Isparta"}, "ESEN.IS": {"short_name": "ESENBOGA ELEKTRIK", "long_name": "Esenboga Elektrik Üretim A.S.", "summary": "Esenboga Elektrik Ã\u009cretim A.S. invests in solar energy sector in Turkey. The company owns 30 solar power plants with a capacity of 33.79 MWp. It also provides EPC services for solar power plants. The company is based in Ankara, Turkey. Esenboga Elektrik Ã\u009cretim A.S. is a subsidiary of Naturel Yenilenebilir Enerji Ticaret A.S.", "currency": "TRY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Ankara"}, "NATEN.IS": {"short_name": "NATUREL ENERJI", "long_name": "Naturel Yenilenebilir Enerji Ticaret A.S.", "summary": "Naturel Yenilenebilir Enerji Ticaret A.S. operates in the renewable energy sector in Turkey. It develops and operates wind, solar, hydro, geothermal, and biomass power plants. The company also provides wind and solar measurement, and offshore measurement platform services; and wave power, hydrogen and bio energy, CSP technology, and carbon capture/storage services. In addition, it offers solutions for power transmission lines. The company was founded in 2009 and is headquartered in Ankara, Turkey.", "currency": "TRY", "sector": "Utilities", "industry": "Utilities—Renewable", "exchange": "IST", "market": "tr_market", "country": "Turkey", "city": "Ankara"}}