{"1400.T": {"short_name": "RUDEN HOLDINGS CO.LTD.", "long_name": "RUDEN HOLDINGS Co.,Ltd.", "summary": "RUDEN HOLDINGS Co.,Ltd. provides house care services. It offers wall coating services for new houses; and flooring services, as well as remodels interiors and sells home appliances. The company also develops and sells real estate properties; provides real estate brokerage and consulting services; and manages buildings, condominiums, and public facilities, as well as provides cleaning services. Ruden Holdings Co.,Ltd. was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1435.T": {"short_name": "TATERU INC", "long_name": "TATERU, Inc.", "summary": "TATERU, Inc. engages in the real estate technology business in Japan. The company develops and operates TATERU Apartment, an apartment management platform that provides IoT apartment proposals, constructions, and rental management online; Robot Home, which offers Apartment kit, an IoT apartment management platform; and Apartment kit for Owner, an apartment management app to owners of rental properties. It also develops and operates Trip Phone, an IoT device for travelers; and TRIP POD, a hotel management platform. The company was formerly known as Investors Cloud Co., Ltd. and changed its name to TATERU, Inc. in April 2018. TATERU, Inc. was founded in 2006 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1451.T": {"short_name": "KHC LTD", "long_name": "KHC Ltd.", "summary": "KHC Ltd. engages in construction and real estate businesses in Japan. The company was founded in 1981 and is headquartered in Akashi, Japan. KHC Ltd. is a subsidiary of Japan Asia Group Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Akashi"}, "1766.T": {"short_name": "TOKEN CORPORATION", "long_name": "Token Corporation", "summary": "Token Corporation operates as a construction company in Japan. It is involved in the design, construction, operation, and management of apartment buildings and rental condominiums; and construction of general and commercial lease properties. The company also provides tenant recruitment and property management services for rental apartments, condominiums, and retail outlets; and real estate agency services. In addition, it engages in the hotel, advertising, and information businesses. Token Corporation was founded in 1974 and is headquartered in Nagoya, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "1814.T": {"short_name": "DAISUE CONSTRUCTION CO", "long_name": "Daisue Construction Co., Ltd.", "summary": "Daisue Construction Co., Ltd. engages in the construction and real estate businesses in Japan. It is involved in the construction of condominiums; and office, logistics warehouse, factory, medical treatment, ceremonial occasion, etc. The company also repairs, and reinstalls/refurbishes existing buildings. In addition, it is involved in general worker dispatch, paid employment, security, consulting, residential building trading, general insurance agency, and coin parking businesses; and research and development on construction civil work. The company was founded in 1937 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "1847.T": {"short_name": "ICHIKEN CO LTD", "long_name": "Ichiken Co., Ltd.", "summary": "Ichiken Co., Ltd. engages in the construction business in Japan. The company rents and leases buildings; develops housing facilities; and involved in the urban environment projects. It also plans, designs, develops, constructs, administrates, and supervises commercial facilities and stores. The company was formerly known as Daiichi Kensetsu Corporation Ltd. and changed its name to Ichiken Co., Ltd. in 1989. Ichiken Co., Ltd. was founded in 1930 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1878.T": {"short_name": "DAITO TRUST CONSTRUCTION CO", "long_name": "Daito Trust Construction Co.,Ltd.", "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "1925.T": {"short_name": "DAIWA HOUSE INDUSTRY CO", "long_name": "Daiwa House Industry Co.,Ltd.", "summary": "Daiwa House Industry Co., Ltd. engages in the construction business worldwide. It operates through Single-Family Houses; Rental Housing; Condominiums; Existing Homes; Commercial Facilities; Logistics, Business and Corporate Facilities; and Other Businesses segments. The company constructs single-family houses; rents houses; develops, manages, and sells condominiums; purchases, renovates, and resells existing homes; develops commercial facilities; develops and constructs logistics, business, and corporate facilities; and provides real estate agency services. It also manufactures steel and timber housing parts; offers ground survey and reinforcement services; and constructs retail and wholesale, medical and nursing care, office and factory, urban development and industrial park, energy, environmental greening, agriculture, parking and carsharing, and public-private partnership facilities. In addition, the company operates resort hotels and golf courses, business and city hotels, fitness clubs and aesthetic salons, and home centers; provides robotics technologies for use in hospitals, care facilities, factories, and construction sites; manages private homes for the elderly and assisted-living residential facilities for seniors; and offers parking, advertising, travel agency, information technology, and credit card and insurance agency services. Daiwa House Industry Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "2721.T": {"short_name": "J-HOLDINGS CORP", "long_name": "J-Holdings Corp.", "summary": "J-Holdings Corp., together with its subsidiaries, engages in housing, sports, real estate, and IT businesses. It offers real estate consulting, brokerage, and management services; and digital strategy and IT consulting services, as well as develops a real estate tech platform for real estate investors. J-Holdings Corp., was founded in 1993 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2780.T": {"short_name": "KOMEHYO HOLDINGS CO LTD", "long_name": "Komehyo Holdings Co.,Ltd.", "summary": "Komehyo Holdings Co.,Ltd. engages in the purchase and sale of used and new products through stores in Japan. The company offers jewelry, metals, clocks, bags, cloths, cameras, musical instruments, and other stocks, as well as car tire, aluminum wheel, and auto equipment. It is also involved in the lease of real estate properties. The company was founded in 1947 and is based in Nagoya, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "2971.T": {"short_name": "ESCON JAPAN REIT INVESTMENT COR", "long_name": "ESCON JAPAN REIT Investment Corporation", "summary": "Escon Japan REIT Investment Corp. is a real estate investment trust (REIT) focused on commercial facilities and was listed in 2019. It invests intensively in community-oriented commercial facilities and leasehold land located in Japan's four largest metropolitan areas. Es-Con Japan Ltd. serves as its sponsor.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2972.T": {"short_name": "SANKEI REAL ESTATE INC", "long_name": "SANKEI REAL ESTATE Inc.", "summary": "SASANKEI REAL ESTATE Inc. listed on the Tokyo Stock Exchange Real Estate Investment Trust Securities Market (J-REIT market) on March 12, 2019 (TSE code: 2972; abbreviation: SANKEI REAL ESTATE). SANKEI REAL ESTATE invests mainly in major metropolitan areas (Greater Tokyo, Osaka City, and Nagoya City) by setting Â\u0093office buildings,Â\u0094 the asset type representative of Japan's real estate (securitization) market, as the primary investment target, while setting Â\u0093sub assetsÂ\u0094 as the secondary investment target in which a fixed percentage of investments are made. Â\u0093Sub assetsÂ\u0094 are asset types that possess characteristics different from Â\u0093office buildingsÂ\u0094 and which contribute to building a strong portfolio that features both revenue stability and growth capable of withstanding the cyclical real estate market. Based on the investment policy, in terms of external growth, SANKEI REAL ESTATE aims to expand the scale of its assets by establishing an Â\u0093asset recycling business modelÂ\u0094 with the sponsor group (the Sankei Building Group), which undertakes the Â\u0093Urban Development, Hotels & ResortsÂ\u0094 operations of media conglomerate Fuji Media Holdings, and thereby secure a pipeline of Â\u0093office buildingsÂ\u0094 and Â\u0093sub assetsÂ\u0094 developed and/or owned by the sponsor. In terms of internal growth, SANKEI REAL ESTATE aims to maintain and improve earnings of assets under management over the medium to long term by making maximum use of the sponsor group's platform, which covers development, operation, management and various other functions. As its basic philosophy, SANKEI REAL ESTATE aims to maximize unitholder value over the medium to long term by growing with the J-REIT market as a public entity of society that makes each and every person happy under the philosophy of Â\u0093Making people, cities & society happyÂ\u0094 through sponsorship support.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2974.F": {"short_name": "DAIEISANGYO CO LTD", "long_name": "DAIEISANGYO Co.,Ltd.", "summary": "DAIEISANGYO Co.,Ltd. engages in the condominium and housing business in Japan. The company primarily sells newly built condominiums and single-family homes. It is also involved in the development and sale of residential land; housing construction contract; and planning and sale of used homes, as well as planning, design, construction of housing renovation projects. DAIEISANGYO Co.,Ltd. was founded in 1968 and is headquartered in Kitakyushu, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "FKA", "market": "jp_market", "country": "Japan", "city": "Kitakyushu"}, "2975.T": {"short_name": "STAR MICA HLDGS CO", "long_name": "Star Mica Holdings Co., Ltd.", "summary": "Star Mica Holdings Co., Ltd., through its subsidiaries, acquires, renovates, manages, rents, and sells pre-owned condominiums in Japan. The company also provides brokerage services for pre-owned condominium units and other real estate properties; consulting services; and real estate planning and leasing management services. In addition, it offers private banking and investment advisory services. Star Mica Holdings Co., Ltd. was incorporated in 1998 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2978.T": {"short_name": "TSUKURUBA INC", "long_name": "tsukuruba inc.", "summary": "tsukuruba inc. offers technology-powered property-related services. It provides cowcamo, a real estate online brokerage platform for used and renovated properties. The company also offers Shared Workplace that provides solutions related to workplace, including Facility Design for office search, design, and relocation consulting services; HEYSHA, which offers office spaces for startups; and co-ba, a subscription-based co-working offices. The company also offers Creative Team, a community of engineers, designers, and architects comprising tsukuruba studios, a place of experiment that crosses modern design. The company was founded in 2011 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2979.T": {"short_name": "SOSILA LOGISTICS REIT INC", "long_name": "SOSiLA Logistics REIT, Inc.", "summary": "SOSiLA Logistics REIT, Inc. (Â\u0093SOSiLAÂ\u0094) is the first J-REIT sponsored by Sumitomo Corporation. SOSiLA focuses on logistics facilities as the main investment target.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2981.T": {"short_name": "LANDIX INC", "long_name": "Landix Inc.", "summary": "Landix Inc. engages in the real estate matching/consulting, custom housing matching/consulting, real estate development, and real estate tech platform development/operation businesses in Japan. The company was founded in 2001 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "2987.T": {"short_name": "TASUKI CORP", "long_name": "TASUKI Corporation", "summary": "TASUKI Corporation develops apartments and condominiums, urban hotels, resort hotels, and licensed nurseries in Japan. It also develops and operates Taski DayPay, a prepaid prepayment service; and Tuski Funds, an online complete small-scale real estate investment service. The company was founded in 2013 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "300.F": {"short_name": "KENEDIX INC.", "long_name": "Kenedix, Inc.", "summary": "Kenedix, Inc. provides diversified real estate asset investment and management services in Japan. The company's portfolio of assets under management include office buildings, residential properties, hotels, and healthcare, retail, and logistics facilities, as well as other properties. It also provides due diligence, acquisition, financing, leasing, engineering, disposition, and various other services. In addition, the company manages private funds of client investors-pension funds, institutional investors, other investors, and J-REITs. The company was formerly known as Kennedy-Wilson Japan Co., Ltd. and changed its name to Kenedix, Inc. in May 2005. Kenedix, Inc. was founded in 1995 and is headquartered in Tokyo, Japan. As of January 8, 2021, Kenedix, Inc. operates as a subsidiary of SMFL Mirai Partners Co., Ltd.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "3003.T": {"short_name": "HULIC CO LTD", "long_name": "Hulic Co., Ltd.", "summary": "Hulic Co., Ltd. engages in the investment, development, rental, sale, and brokerage of real estate properties in Japan. The company operates through two segments, Real Estate and Insurance. Its property portfolio includes office buildings, commercial buildings, residential and retail properties, hotels, and others. As of December 31, 2019, the company had a portfolio of approximately 254 lease properties. It also engages in the asset management and insurance agency businesses. Hulic Co., Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3010.T": {"short_name": "KACHIKAIHATSU CO L", "long_name": "KachikaiHatsu Co., Ltd.", "summary": "KachikaiHatsu Co., Ltd. operates a chain of hotels in Japan. The company also develops, buys, sells, leases, invests in, and manages real estate properties. KachikaiHatsu Co., Ltd. was founded in 1912 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3226.T": {"short_name": "NIPPON ACCOMMODATIONS FUND INC", "long_name": "Nippon Accommodations Fund Inc.", "summary": "Nippon Accommodations Fund Inc. (hereinafter Â\u0093NAFÂ\u0094) was established on October 12, 2005 as an investment corporation under the Investment Trust and Investment Corporation Act of Japan with Mitsui Fudosan Accommodations Fund Management Co., Ltd. (hereinafter Â\u0093MFAFMÂ\u0094) acting as a sponsor. Registration with the Kanto Local Finance Bureau of the Ministry of Finance was completed on November 11, 2005 and NAF started acquisition of properties on November 30, 2005. NAF is an externally managed real estate fund, formed as an investment corporation. MFAFM, as NAF's asset management company, is engaged in the acquisition, management, and renovation of accommodation assets. MFAFM is a 100% subsidiary of Mitsui Fudosan Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3227.T": {"short_name": "MCUBS MIDCITY INVESTMENT CORP", "long_name": "MCUBS MidCity Investment Corporation", "summary": "MCUBS MidCity Investment Corporation (MidCity) is a REIT focused on office properties. It is managed by Mitsubishi Corp.-UBS Realty Inc. (MC-UBS), an asset management company established as a joint venture between the general trading company, Mitsubishi Corporation, and UBS A.G., a leading European financial institution. Featuring a portfolio balanced among Japan's three major metropolitan areas, it carries out carefully selected investment in properties with stable earnings through its unique strategy utilizing an asset information network from the sponsors.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Chiyoda"}, "3228.T": {"short_name": "SANEI ARCHITECTURE PLANNING CO ", "long_name": "Sanei Architecture Planning Co.,Ltd.", "summary": "Sanei Architecture Planning Co.,Ltd. engages in the real estate business in Japan and internationally. The company designs, builds, and sells single-family houses, apartments, and condominiums. It also acts as a general contractor, as well as undertakes custom-built housing contracts. In addition, the company provides real estate investment properties; develops and sells rental properties; and purchases and rents residential and office buildings, as well as designs offices. Sanei Architecture Planning Co.,Ltd. was founded in 1993 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3231.T": {"short_name": "NOMURA REAL ESTATE HOLDINGS INC", "long_name": "Nomura Real Estate Holdings, Inc.", "summary": "Nomura Real Estate Holdings, Inc. operates as a real estate company in Japan and internationally. The company develops, leases, and manages office buildings, commercial facilities, logistics facilities, and hotels; develops and sells condominiums and houses; operates housing with services for the elderly; develops rental properties; provides Internet advertising services for housing and living assistance services; provides asset management services for real estate securitization, including REITs and private placement funds and securities funds; and provides real estate brokerage and consulting, insurance agency, and real estate information Website management services. The company also engages in the management of properties, such as condominiums, office buildings, and educational facilities; provision of renovation and repair work for tenants; remodeling of condominiums and housing; and provision of cleaning services for condominiums and office buildings. In addition, it participates in, promotes, and supports urban development projects and reconstruction of housing complexes; and manages fitness clubs. The company was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3234.T": {"short_name": "MORI HILLS REIT INVESTMENT CORP", "long_name": "Mori Hills REIT Investment Corporation", "summary": "MHR aims to further enhance the profitability and asset value of its portfolio through growth created by making targeted investment in the Â\u0093City,Â\u0094 while paying close attention to the competitiveness of the Â\u0093CityÂ\u0094 concentrating on central Tokyo, and on the portfolio's ability to create value. Â\u0093CityÂ\u0094 in MHR's definition is not merely a geographic location with an aggregation of buildings, but a Â\u0094spaceÂ\u0094 with multiple uses, such as for work, residence, recreation, rest and study that integrates various economic and cultural activities of the people that gather there. MHR believes that the provision of all urban elements will result in people, products and information concentrating and merging to generate new business models and lifestyles. MHR recognizes its Sponsor, the Mori Building Group, (Mori Building Co., Ltd. being its core company), as being uniquely positioned to realize investments in the Â\u0093City.Â\u0094 By optimally utilizing the comprehensive strengths of the Mori Building Group, which has completed successive large-scale redevelopments in central Tokyo, MHR aims to acquire scarce, premium properties and to enhance the asset value of its portfolio.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3244.T": {"short_name": "SAMTY CO.LTD.", "long_name": "Samty Co., Ltd.", "summary": "Samty Co., Ltd. engages in the real estate business in Japan. It plans, designs, develops, and manages condominiums; and leases and manages properties, such as apartments, office buildings, commercial facilities, hotels, and others. The company is also involved in the development and sale of land; and property holding, tenant recruitment, and property management businesses, as well as provision of construction and construction renovation services. In addition, it operates hotels; and offers asset management services. The company was formerly known as Samty Development Co., Ltd. and changed its name to Samty Co., Ltd. in June 2005. Samty Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "3245.T": {"short_name": "DEAR LIFE CO.LTD", "long_name": "Dear Life Co.,Ltd.", "summary": "Dear Life Co.,Ltd. engages in the real estate business in Japan. It develops residential, commercial, and office buildings; provides real estate planning, design, construction supervision services, etc.; resells residential properties; and invests in real estate properties. The company also provides temporary staffing services for the real estate industry; advertising services; and outsourcing services, such as payment management and delinquency guarantee services to trunk room/rental storage space operator; and operates rental storage spaces. It sells its property through real estate agencies. Dear Life Co.,Ltd. was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3248.T": {"short_name": "EARLY AGE CO LTD", "long_name": "Early Age Co., Ltd.", "summary": "Early Age Co., Ltd. engages in the real estate business in Japan. The company develops, leases, and sells condominiums. It is also involved in the real estate brokerage, consulting, and management operation businesses; and management of parking lot. The company was incorporated in 1986 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3264.T": {"short_name": "ASCOT CORP", "long_name": "Ascot Corp.", "summary": "Ascot Corp. develops and sells real estate properties in Japan. Its property portfolio includes condominiums, detached and terrace houses, office buildings, hotels, and commercial and nursing facilities. The company also rents apartments, condominiums, and offices. In addition, it provides real estate consulting and other services. Ascot Corp. was founded in 1999 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3277.T": {"short_name": "SANSEI LANDIC CO LTD", "long_name": "Sansei Landic Co.,Ltd", "summary": "Sansei Landic Company Limited engages in the real estate and construction businesses in Japan. The company plans, purchases, sells, and manages the limited property rights of the land. It also procures and sells real estate properties that involve rights adjustments relating to leasehold land, properties with existing residence, and other pieces of real estate. In addition, the company plans, designs, constructs, renovates, rehabilitates, reforms, and manages custom designed homes. It offers its products and services in Osaka, Sapporo, Sendai, Tokyo, Musashino, Yokohama, Nagoya, Kyoto, Kansai, and Fukuoka locations. The company was formerly known as Sansei Service Co., Ltd. and changed its name to Sansei Landic Company Limited in February 1997. Sansei Landic Company Limited was founded in 1976 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3278.T": {"short_name": "KENEDIX RESIDENTIAL NEXT INV CO", "long_name": "Kenedix Residential Next Investment Corporation", "summary": "KDR has invested mainly in real estate-related assets which are designated for residential purposes as their principal use (rental housing, etc.) as we strive to realize \"the securing of stable rental revenues and steady growth of our portfolio.\" Since listing in April 2012, the portfolio has grown to more than 160 billion yen in about 6 years.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Residential", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3280.T": {"short_name": "STRUST CO LIMITED", "long_name": "STrust Co.,Ltd.", "summary": "STrust Co.,Ltd. engages in the real estate business in Japan. The company primarily sells condominiums. It is also involved in real estate agency and leasing businesses, as well as the management of condominiums. The company was founded in 1999 and is headquartered in Shimonoseki, Japan. STrust Co.,Ltd. is a subsidiary of Saibu Gas Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Shimonoseki"}, "3282.T": {"short_name": "COMFORIA RESIDENTIAL REIT.INC", "long_name": "Comforia Residential REIT, Inc", "summary": "Since our establishment on June 8, 2010, we have continuously expanded our asset size and gained operational experience. Thanks to all of our unitholders and other stakeholders for their continued support and co-operation CRR was listed on the J-REIT section of the Tokyo Stock Exchange on February 6, 2013. Under our basic policies of Â\u0093investments in residential properties with high growth potentialÂ\u0094 and Â\u0093utilization of the TOKYU FUDOSAN HOLDINGS Group Â\u0094, we will continue to invest on rental residences, mainly in the Tokyo metropolitan area, for singles and small families. We will fully utilize the concept and know-how of the urban rental residence Â\u0093ComforiaÂ\u0094 series, which the TOKYU LAND CORPORATION has produced.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Residential", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3283.T": {"short_name": "NIPPON PROLOGIS REIT INC", "long_name": "Nippon Prologis REIT, Inc.", "summary": "NPR was established on Nov. 7, 2012, based on the Act on Investment Trust and Investment Corporation (investment trust law) and was listed on the REIT Securities Market (J-REIT Market) of the Tokyo Stock Exchange (Â\u0093TSEÂ\u0094) on Feb. 14, 2013 (securities code: 3283).", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3287.T": {"short_name": "HOSHINO RESORTS REIT INC", "long_name": "Hoshino Resorts REIT, Inc.", "summary": "HRR aims to create a system that allows anyone to take part in and enjoy the fruits of the growth of Japan' s tourism industry, so that we can help firmly establish Japan as a major tourist destination. This endeavor will have great social significance if it encourages investment in the tourism industry. HRR believes that the tourism industry can contribute to local economies and play an important role as an Â\u0093aceÂ\u0094 in activating the Japanese economy in this era of decreasing birthrate and aging society. Serving at the core of this important industry, HRR will invest in hotels, ryokans (Japanese-style inns) and ancillary facilities for which stable use is expected in an aim to secure steady growth and stable earnings from a medium- to long-term perspective. In doing so, HRR will strive to continuously increase the investment value for its unitholders.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Hotel & Motel", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3289.T": {"short_name": "TOKYU FUDOSAN HOLDINGS CORPORAT", "long_name": "Tokyu Fudosan Holdings Corporation", "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3293.T": {"short_name": "AZUMA HOUSE CO LTD", "long_name": "Azuma House Co., Ltd.", "summary": "Azuma House Co., Ltd. engages in real estate and construction businesses in Japan. The company constructs and sells condominiums and ready-built homes; sells land; and provides order construction, renovation, and real estate brokerage services. It is also involved in real estate leasing and rental management, leasing brokerage, and care businesses; asset management proposal-rental housing construction; sale of ready-built rental housing properties; and hotel and restaurant businesses. The company was founded in 1977 and is headquartered in Wakayama, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Wakayama"}, "3295.T": {"short_name": "HULIC REIT INC.", "long_name": "Hulic Reit, Inc.", "summary": "The Investment Corporation was listed on the Tokyo Stock Exchange real estate investment trust market on February 7, 2014 with the support of all stakeholders, including unitholders, and gradually expanded its asset size. I've come. The Investment Corporation is investing heavily in Â\u0093Tokyo Commercial Property,Â\u0094 whose sponsor Hulic Co., Ltd. has a wealth of investment track record and know-how, and is expected to generate stable demand in the future and secure stable earnings over the long term. , By investing in Â\u0093next-generation asset plus,Â\u0094 which the Investment Corporation considers to contribute to maximizing the unitholder value in the medium to long term, secure and improve profits in the medium to long term and increase the size and value of assets under management. We aim to achieve growth. We will continue to utilize the sponsor support provided by the Hulic Group for both external and internal growth with the aim of contributing to the interests of our stakeholders, including investors, and to maximize the maximum value of unitholder value over the medium to long term. We are aiming to achieve this. We would like to ask all of you for your continued support.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3297.T": {"short_name": "TOUBUJYUHAN CO LTD", "long_name": "Toubujyuhan Co.,Ltd.", "summary": "Toubujyuhan Co., Ltd. engages in the real estate business in Japan. The company is involved in the real estate trading, leasing, selling, and management businesses, as well as used homes and condominiums remodeling activities. It also sells and rents long-term care and welfare-related products; and undertakes long-term care remodeling work, as well as offers real estate insurance services. The company was founded in 1984 and is headquartered in Shimonoseki, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Shimonoseki"}, "3299.T": {"short_name": "MUGEN ESTATE CO LTD", "long_name": "MUGEN ESTATE Co.,Ltd.", "summary": "MUGEN ESTATE Co.,Ltd. purchases and resells used real estate properties in Japan. The company operates through Real Estate Trading Business, and Real Estate Leasing and Other Business segments. Its property portfolio includes residential-type and investment-type properties, including condominiums, office blocks, buildings, and apartments; and detached houses. The company is also involved in property leasing; interior and exterior refurbishment; property brokerage; and property management businesses. MUGEN ESTATE Co.,Ltd. was founded in 1990 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3300.T": {"short_name": "AMBITION CORPORATION", "long_name": "Ambition Corporation", "summary": "Ambition Corporation buys, sells, and rents real estate properties in Japan and internationally. The company also provides property and rental management, private short-term lodging, insurance, IoT, housekeeping agency, and corporate member services. In addition, it is involved in Internet and corporate sale businesses. Ambition Corporation was incorporated in 2007 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3309.T": {"short_name": "SEKISUI HOUSE REIT INC", "long_name": "Sekisui House Reit, Inc.", "summary": "Sekisui House Reit, Inc. is a real estate investment trust externally managed by Sekisui House Asset Management, Ltd. It invests in the real estate markets of Japan. The firm primarily invests in office buildings, along with such commercial properties as retail properties and hotels. Sekisui House Reit, Inc. was formed on September 8, 2014 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3451.T": {"short_name": "TOSEI REIT INVESTMENT CORPORATI", "long_name": "Tosei Reit Investment Corporation", "summary": "Tosei Reit Investment Corp. is a real estate investment trust externally managed by Tosei Asset Advisors, Inc. The firm invests in relatively small- and medium-sized office buildings, retail facilities, residential properties and hotels. It invests in real estate markets of Japan. The firm was founded in November 27, 2014 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3452.T": {"short_name": "B-LOT COMPANY LIMITED", "long_name": "B-Lot Company Limited", "summary": "B-Lot Company Limited engages in the real estate and financial consulting businesses in Japan. It offers real estate brokerage, development, revitalization, and securitization services; and property management and administrative services, as well as leasing of offices and residences. The company was founded in 2008 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3453.T": {"short_name": "KENEDIX RETAIL REIT CORP", "long_name": "Kenedix Retail REIT Corporation", "summary": "Kenedix Retail REIT Corporation became the first J-REIT (real estate investment trust) to focus primarily on neighborhood, community and other shopping centers that cater to the day-to-day needs of local area customers when it was listed on the Tokyo Stock Exchange in February 2015. Since our IPO, we have steadily accumulated our assets under management, building a stable portfolio of over 220 billion yen in five years.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Retail", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3459.T": {"short_name": "SAMTY RESIDENTIAL INVESTMENT CO", "long_name": "Samty Residential Investment Corporation", "summary": "Samty Residential Investment Corporation engages in the real estate leasing business in Japan. The company owns and leases condominiums, offices, commercial facilities, hotels, and parking lots to individuals and corporate tenants; and plans, develops, and constructs condominiums. It also engages in property management activities. As of January 31, 2020, the company holds a total of 117 real estate properties. Samty Residential Investment Corporation was founded in 2015 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Residential", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3463.T": {"short_name": "ICHIGO HOTEL REIT INV CORP", "long_name": "Ichigo Hotel REIT Investment Corporation", "summary": "Ichigo Hotel REIT Investment Corporation (Â\u0093Ichigo Hotel REITÂ\u0094) was listed on the J-REIT section of the Tokyo Stock Exchange on November 30, 2015. \"Ichigo\" comes from an ancient Japanese proverb, Ichigo Ichie, literally meaning \"One lifetime, One encounter.\" The phrase was first used by a 16th-century master of the tea ceremony, Sen no Rikyu. He called upon his disciples to give total focus and sincerity to each act of the tea ceremony for every guest, because that particular moment will only exist once and must be fully lived and realized. In sharing this Ichigo name, Ichigo Office REIT embraces this philosophy of total, committed engagement to supporting the long-term success and growth of our tenants and shareholders. Ichigo Hotel REIT was established on July 22, 2015 pursuant to the Act on Investment Trusts and Investment Corporations (Â\u0093Investment Trust ActÂ\u0094). Its assets are managed by Ichigo Investment Advisors Co., Ltd., the asset management company for the Ichigo Group and a 100% subsidiary of Ichigo Inc., in accordance with the objectives and policies of asset management specified in the Investment Trust Act and the Articles of Incorporation of Ichigo Hotel REIT. Ichigo Hotel REIT is a specialized hotel REIT formed to invest in hotel properties while making maximum use of the Ichigo Group's experience and know-how in revitalizing real estate. Ichigo Hotel REIT will deploy Ichigo's deep real estate expertise to increase asset profitability via, for example, the strategic and effective use of value-add capex. Ichigo Hotel REIT also expects to pro-actively pursue portfolio growth and economies of scale for shareholders by using the Ichigo Group's robust sourcing capabilities. Ichigo Hotel REIT listed on the Tokyo Stock Exchange in order to raise capital for executing its growth strategy for shareholders and benefit from external growth opportunities and Ichigo's deep value-add expertise and management know-how. We look forward to serving our shareholders and making a positive contribution to Japanese society.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Hotel & Motel", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3464.T": {"short_name": "PROPERTY AGENT INC", "long_name": "Property Agent Inc.", "summary": "Property Agent Inc. engages in the real estate business in Japan. It is also involved in the real estate development and sale, property and rental management, brokerage, and building management, as well as real estate crowdfunding businesses. The company was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3465.T": {"short_name": "KI-STAR REAL ESTATE CO LTD", "long_name": "Ki-Star Real Estate Co.,Ltd", "summary": "KI-Star Real Estate Co.,Ltd operates as a real estate company. It is involved in the detached housing sales, custom-built housing, condominiums, real estate transaction, asset, management, and residential land development businesses. The company was founded in 1990 and is headquartered in Honjo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Honjo"}, "3466.T": {"short_name": "LASALLE LOGIPORT REIT", "long_name": "LaSalle LOGIPORT REIT", "summary": "LLR is a logistics focused J-REIT sponsored by the LaSalle Investment Management group. Over the past couple of years, logistics real estate and its accompanying market size has continued on its path of steady expansion. LLR intends to build a high-quality portfolio with a focus on Tokyo and Osaka, where it believes there is a stable base of demand driven from consumer logistics tenants. It aims to invest in facilities well suited and ones that cater to its tenants' needs for integrated and efficient logistics operations. The LaSalle Group is one of the world's leading real estate investment managers. Within Japan, as a pioneer in the logistics development and investment space, the LaSalle Group has a deep track record with abundant experience in this area of expertise. By leveraging off of the support received from the LaSalle Group, LLR aims to steadily accumulate achievements in internal growth strategies, external growth strategies, and financial strategies, all with the goal of pursuing a policy that enhances asset values and cash flows, for long-term stability on behalf of for its investors.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Chiyoda"}, "3467.T": {"short_name": "AGRATIO URBAN DESIGN INC", "long_name": "Agratio urban design Inc.", "summary": "Agratio urban design Inc. engages in the housing business in Japan. It designs, constructs, and distributes detached houses; and provides research and consulting services for selling houses. The company was founded in 2009 and is headquartered in Shinjuku, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Shinjuku"}, "3469.T": {"short_name": "DUALTAP CO LTD", "long_name": "Dualtap Co., Ltd.", "summary": "Dualtap Co., Ltd. plans, develops, and sells real estate properties in Japan and internationally. It also manages real estate properties; securitizes real estate; and operates as an insurance agency. In addition, it operates Hotel Promote located in Hakodate Shofu. The company was founded in 2006 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3470.T": {"short_name": "MARIMO REGIONAL REVITALIZATION ", "long_name": "Marimo Regional Revitalization REIT, Inc.", "summary": "Marimo Regional Revitalization REIT, Inc. (hereinafter, Â\u0093marimo REITÂ\u0094) was listed on the Tokyo Stock Exchange Real Estate Investment Trust Market as a diversified REIT with a portfolio of residential, retail, hotel and office properties (hereinafter, Â\u0093diversified mix of income-producing real estateÂ\u0094) on July 29, 2016.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3471.T": {"short_name": "MITSUI FUDOSAN LOGISTICS PARK I", "long_name": "Mitsui Fudosan Logistics Park Inc.", "summary": "Mitsui Fudosan Logistics Park Inc. operates as a REIT that engages in the logistics facilities business. Its logistics facilities business include know-how in leasing based on its client network base developed in its office buildings and retail facilities businesses, as well as property management/operation. The company is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3472.T": {"short_name": "OOEDO ONSEN REIT INV CORP", "long_name": "Ooedo Onsen Reit Investment Corporation", "summary": "Ooedo Onsen Reit Investment Corporation (Â\u0093Ooedo Onsen ReitÂ\u0094) was listed on the Real Estate Investment Trust (REIT) section of the Tokyo Stock Exchange on August 31, 2016, as a unique J-REIT specializing in investment mainly in onsen (hot spring) and spa-related facilities. Onsen, a much-loved feature of Japanese life for many centuries, are part of the country's culture that is built into daily lifestyles and leisure activities. In today's aging society, demand for onsen and spas is at an unprecedentedly high level, especially among senior citizens. With the added influx of overseas visitors due to the boom in tourism and rising demand in time-consumption-type industries due to Japan's mature consumer society, we see onsen as a sector with a promising future, supported by a large customer base. Leisure industries centered on onsen facilities, however, need investment and other means of introducing the new operating methods and facility upgrades that will enable them to continually boost customer satisfaction in response to customer needs. This requires access to quality funding from the capital markets. Ooedo Onsen Reit seeks to contribute to revitalizing local industries based on onsen facilities and to popularize onsen culture, making it an extension of everyday life. To this end, we will act as a bridge between onsen-based industries and the capital markets, promoting investment that helps to preserve and expand onsen culture.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Hotel & Motel", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3474.T": {"short_name": "G-FACTORY CO LTD", "long_name": "G-Factory Co.,Ltd.", "summary": "G-Factory Co.,Ltd. engages in the provision of management support services for restaurants. The company also manages restaurants. It serves companies that are developing store-type services, such as restaurants. The company was founded in 2003 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3476.T": {"short_name": "MIRAI CORPORATION", "long_name": "MIRAI Corporation", "summary": "MIRAI Corporation operates as a real estate investment trust. Its property portfolio includes office buildings, hotels, retails properties, and others. The company has elected to be taxed as a real estate investment trust. As a result, it would not be subject to corporate income tax on that portion of its net income that is distributed to shareholders. The company was founded in 2015 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3478.T": {"short_name": "MORI TRUST HOTEL REIT INC", "long_name": "MORI TRUST Hotel Reit, Inc.", "summary": "MORI TRUST Hotel Reit, Inc. operates as a REIT that specializes in hotels investment in Japan. The company is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Hotel & Motel", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3479.T": {"short_name": "TKP CORPORATION", "long_name": "TKP Corporation", "summary": "TKP Corporation provides meeting rooms rental services in Japan and internationally. It also operates hotel banquet halls, business and compact hotels, ryokans, and restaurants. In addition, the company provides outsourcing, travel, party, and catering services; and produces and sells bento. Further, it offers video, audio, and lighting and TV meeting system rental services, as well as interpretation system and MC arrangement services; and call center and BPO services. The company was founded in 2005 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3482.T": {"short_name": "LOADSTAR CAPITAL K K", "long_name": "Loadstar Capital K.K.", "summary": "Loadstar Capital K.K. engages in real estate investment business in Japan. The company invests in, purchases, manages, and sells office buildings, multipurpose buildings, apartment buildings, etc., as well as provides real estate brokerage and consulting services. It also operates OwnersBook, a real estate investment crowdfunding platform; and provides asset management services. The company was founded in 2012 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3484.T": {"short_name": "TENPO INNOVATION CO LTD", "long_name": "Tenpo Innovation Co.,Ltd.", "summary": "Tenpo Innovation Co., Ltd. engages in leasing store properties for restaurants primarily in Tokyo, Japan. The company leases store properties rented from real estate owners to store entrants. It also sells real estate properties. The company was formerly known as Tenpo Renovation Co., Ltd. and changed its name to Tenpo Innovation Co., Ltd. in May 2013. Tenpo Innovation Co., Ltd. was founded in 2005 and is headquartered in Tokyo, Japan. Tenpo Innovation Co., Ltd. is a subsidiary of Crops Corporation.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3488.T": {"short_name": "XYMAX REIT INVESTMENT CORP", "long_name": "XYMAX REIT Investment Corporation", "summary": "XYMAX REIT Investment Corporation (hereinafter, Â\u0093XYMAX REITÂ\u0094) was listed on the Tokyo Stock Exchange Real Estate Investment Trust Securities Market on February 15, 2018. XYMAX REIT is a diversified and publicly traded Japanese real estate investment trust (J-REIT) that has the sponsor support of the XYMAX Group, a leading company in the real estate management industry.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3490.T": {"short_name": "AZPLANNING CO LTD", "long_name": "Azplanning Co.,Ltd.", "summary": "Azplanning Co.,Ltd. engages in the real estate development business in Japan. It is involved in the real estate and business hotel trading activities; leasing of buildings for business, such as stores, offices, warehouses, etc., as business hotels; and provision of real estate management intermediary, architectural renovation, and real estate management incidental services. The company was founded in 1989 and is headquartered in Kawaguchi, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kawaguchi"}, "3492.T": {"short_name": "TAKARA LEBEN REAL ESTATE INV CO", "long_name": "Takara Leben Real Estate Investment Corporation", "summary": "Takara Leben Real Estate Investment Corporation (TLR) was listed on the Tokyo Stock Exchange Real Estate Investment Trust Securities Market on July 27, 2018. TLR is a diversified J-REIT that has companies boasting expertise and know-how backed by an extensive track record in office, residential, hotel, retail and other properties - Takara Leben Co., Ltd., PAG Investment Management Limited, Kyoritsu Maintenance Co., Ltd. and Yamada Denki Co., Ltd.- as sponsors. TLR aims to realize Â\u0093steady growthÂ\u0094 and Â\u0093stable managementÂ\u0094 by utilizing a multi-sponsor management structure that combines the expertise and know-how of each of the sponsors, which boast different strengths. In addition, TLR aims to realize Â\u0093maximization of unitholder value,Â\u0094 Â\u0093creation of a sustainable environmentÂ\u0094 and Â\u0093contribution to communities and societyÂ\u0094 in order to remain the unitholders' diversified J-REIT of choice.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3493.T": {"short_name": "ITOCHU ADVANCE LOGISTICS INV CO", "long_name": "ITOCHU Advance Logistics Investment Corporation", "summary": "Itochu Advance Logistics Investment Corporation is a real estate investment firm specializing in investment in logistics real estate. The firm was founded in 2018 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3494.T": {"short_name": "MULLION CO LTD", "long_name": "Mullion Co., Ltd.", "summary": "Mullion Co., Ltd. provides real estate services in Japan. It owns and manages real estate properties, including residential, store, office properties, as well as offers real estate securitization services. The company also purchases and sells real estate properties. Mullion Co., Ltd. was founded in 1986 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3495.T": {"short_name": "KORYOJYUHAN CO LTD", "long_name": "Koryojyuhan Co., Ltd.", "summary": "Koryojyuhan Co., Ltd. operates as a real estate company. It provides rental agency and monthly apartment handling services; and elderly housing and pay nursing home facilities. The company is also involved in the real estate brokerage and purchase/sale businesses; sale of residential land; and development and sale of real estate properties. In addition, it provides leasing management services, including rental management, vacant house management, and subleasing services; and revenue real estate consulting services. Further, the company operates coin parking, coin laundry, and trunk room and bike garage; and photovoltaic power generation facility. Koryojyuhan Co., Ltd. was founded in 1982 and is headquartered in Mito, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Mito"}, "3496.T": {"short_name": "AZOOM CO LTD", "long_name": "Azoom Co.,Ltd", "summary": "AZoom co., Ltd. engages in buying and selling, mediation, management, and leasing of real estate. It is also involved in business development through Internet; Internet media development and operation; and management of parking lots. The company was founded in 2009 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3497.T": {"short_name": "LETECH CORPORATION", "long_name": "Legal Corporation", "summary": "Legal Corporation engages in the real estate business. It is involved in the housing and commercial development, and conversion and renovation; real estate consulting; facility management; and nursing care businesses. The company also offers real estate rental Services. Legal Corporation was founded in 2000 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "3521.T": {"short_name": "ECONACH HOLDINGS CO LTD", "long_name": "Econach Holdings Co.,Ltd.", "summary": "Econach Holdings Co.,Ltd. engages in the spa business in Japan. The company also manages stocks, as well as sells and leases real estate properties. In addition, it manufactures and sells embroidered laces for women's outerwear. The company was formerly known as Econach Co., Ltd. and changed its name to Econach Holdings Co.,Ltd. in August 2010. The company was founded in 1926 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "3750.T": {"short_name": "FRACTALE CORPORATION", "long_name": "FRACTALE Corporation", "summary": "FRACTALE Corporation engages in the financial, real estate, and asset management businesses in Japan. The company was formerly known as Seven Seas Holdings Co.,Ltd. FRACTALE Corporation was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4321.T": {"short_name": "KENEDIX INC", "long_name": "Kenedix, Inc.", "summary": "Kenedix, Inc. provides diversified real estate asset investment and management services in Japan. The company's portfolio of assets under management include office buildings, residential properties, hotels, and healthcare, retail, and logistics facilities, as well as other properties. It also provides due diligence, acquisition, financing, leasing, engineering, disposition, and various other services. In addition, the company manages private funds of client investors-pension funds, institutional investors, other investors, and J-REITs. The company was formerly known as Kennedy-Wilson Japan Co., Ltd. and changed its name to Kenedix, Inc. in May 2005. Kenedix, Inc. was founded in 1995 and is headquartered in Tokyo, Japan. As of January 8, 2021, Kenedix, Inc. operates as a subsidiary of SMFL Mirai Partners Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4437.T": {"short_name": "GOODDAY HOLDINGS INC", "long_name": "gooddays holdings, Inc.", "summary": "gooddays holdings, Inc. leases housing properties in Japan. It also provides IT services. The company was founded in 2016 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "4D7.F": {"short_name": "DAITO TR. CONSTR.", "long_name": "Daito Trust Construction Co.,Ltd.", "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "5280.T": {"short_name": "YOSHICON CO LTD", "long_name": "Yoshicon Co.,Ltd.", "summary": "Yoshicon Co.,Ltd. processes and sells building and environmental materials. The company also engages in civil engineering and building fortifications; and provides construction supervision services. In addition, it is involved in real estate development and securitization activities. The company was founded in 1949 and is based in Shizuoka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Shizuoka"}, "6064.T": {"short_name": "ACTCALL INC", "long_name": "Actcall Inc.", "summary": "Actcall Inc. engages in the real estate business in Japan. It provides living life related outsourcing services, such as emergency rush and call center services. The company also offers payment solutions for real estate rental management companies and real estate owners, as well as engages in the fintech business. In addition, it operates real estate rental properties, as well as provides office management services. The company was founded in 2005 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "6192.T": {"short_name": "HYAS&CO INC", "long_name": "HyAS&Co. Inc.", "summary": "HyAS&Co. Inc. provides real estate services for individuals in Japan. The company was founded in 2005 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "7187.T": {"short_name": "J-LEASE CO LTD", "long_name": "J-Lease Co.,Ltd.", "summary": "J-Lease Co.,Ltd. engages in the rent debt guarantee business. It also provides real estate rental agency; and administration, management, and buying and selling agency services. The company was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8801.T": {"short_name": "MITSUI FUDOSAN", "long_name": "Mitsui Fudosan Co., Ltd.", "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8803.T": {"short_name": "HEIWA REAL ESTATE CO", "long_name": "Heiwa Real Estate Co., Ltd.", "summary": "Heiwa Real Estate Co., Ltd. operates as a real estate company in Japan. The company develops, leases, administrates, and manages stock exchange buildings, office buildings, commercial facilities, and residential buildings; develops and sells residential buildings; and provides real estate agency services. It is also involved in the building facility maintenance and management, repair work contracting, civil engineering and construction contracting, property management, investment management, real estate brokerage, and insurance agency businesses. In addition, the company engages in the operation of halls and conference rooms, and parking lots; and management of restaurants. Heiwa Real Estate Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8804.T": {"short_name": "TOKYO TATEMONO CO", "long_name": "Tokyo Tatemono Co., Ltd.", "summary": "Tokyo Tatemono Co., Ltd. operates as a real estate company in Japan. The company operates through Commercial Properties, Residence, and Real Estate Service segments. The Commercial Properties segment leases and manages office buildings and commercial facilities. The Residence segment develops and sells condominiums and detached houses; and leases and manages condominiums. The Real Estate Service segment engages in the asset solution, brokerage, consulting, and parking lot operations. The company also engages in the leisure business, which include management and operation of hotels and resort facilities, golf courses, public baths, and spas. Further, the company provides housing and nursing care services for senior citizens. Tokyo Tatemono Co., Ltd. was founded in 1896 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8806.T": {"short_name": "DAIBIRU CORP", "long_name": "Daibiru Corporation", "summary": "Daibiru Corporation, together with its subsidiaries, owns, operates, manages, and leases real estate properties in Japan. It owns and leases 30 properties for offices, hotel buildings, and retail complexes in central Tokyo, Osaka, and Sapporo. The company also leases residence halls for students; and apartment buildings for business people on temporary assignment, as well as condominiums for families. In addition, it offers facility management services; and real estate agency services for office properties, as well as engages in construction works relating to buildings, such as repairs originating from its building maintenance operations. The company was formerly known as Osaka Tatemono Co., Ltd. and changed its name to Daibiru Corporation in January 1992. The company was founded in 1923 and is headquartered in Osaka, Japan. Daibiru Corporation is a subsidiary of Mitsui O.S.K. Lines, Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "8818.T": {"short_name": "KEIHANSHIN BUILDING CO LTD", "long_name": "Keihanshin Building Co., Ltd.", "summary": "Keihanshin Building Co., Ltd., a building management company, leases buildings in Japan. The company leases office buildings, datacenter buildings, commercial buildings, logistics warehouses, and off-course betting parlors. It is also involved in subcontracting construction work for lease facilities; and the provision of building maintenance services. The company was formerly known as Keihanshin Real Estate Co., Ltd. and changed its name to Keihanshin Building Co., Ltd. in October 2011. Keihanshin Building Co., Ltd. was founded in 1948 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "8842.T": {"short_name": "TOKYO RAKUTENCHI CO", "long_name": "Tokyo Rakutenchi Co.,Ltd.", "summary": "Tokyo Rakutenchi Co.,Ltd. manages, operates, and rents real estate properties in Japan. The company operates movie theaters, spas, futsal courts, and bowling facilities; and 8 Doutor coffee shops and 1 Excelsior shop in Sosui, as well as 9 stores. It also provides building management services, such as cleaning, facility management, and security for public facilities, offices, shops, and other environments; and handles event planning and management, and various advertising media works. Tokyo Rakutenchi Co.,Ltd. was founded in 1937 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8848.T": {"short_name": "LEOPALACE 21 CORP", "long_name": "Leopalace21 Corporation", "summary": "Leopalace21 Corporation, together with its subsidiaries, engages in the construction, leasing, and sale of apartments, condominiums, and residential housing in Japan. It operates through four segments: Leasing Business; Development Business; Elderly Care Business; and Hotels, Resort and Other Businesses. The Leasing Business segment engages in the leasing and management of apartment buildings and other properties; repair work; broadband internet service; rent obligation guarantee; and company residence agency, solar power generation, and small-amount short-term insurance and other businesses. The Development Business segment is involved in the construction subcontracting of apartments and detached houses; and development of condominiums and others. The Elderly Care Business segment operates elderly care facilities under the Azumi En brand. This segment also offers day services, short stays, elderly homes with nursing care services/residential style elderly homes, home visits, and home care support services. The Hotels, Resort and Other Businesses segment engages in the operation of hotels; operation and management of resort facilities on the island of Guam; and provision of travel agency, clerical agency, and other services. The company was formerly known as MDI Corporation and changed its name to Leopalace21 Corporation in July 2000. Leopalace21 Corporation was founded in 1973 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8869.T": {"short_name": "MEIWA ESTATE CO", "long_name": "Meiwa Estate Company Limited", "summary": "Meiwa Estate Company Limited develops, sells, and manages condominiums in Japan. It also engages in real estate leasing and brokerage activities. The company was founded in 1986 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8877.T": {"short_name": "ESLEAD CORPORATION", "long_name": "Eslead Corporation", "summary": "Eslead Corporation develops and sells family-type and urban condominiums in Japan. The company also rebuilds and sells condominiums. In addition, it is involved in building and condominium management, real estate brokerage, detached house sales, power supply, hotel, and condominium and building cleaning businesses. The company was formerly known as Nihon Eslead Corporation and changed its name to Eslead Corporation in October 2019. The company was founded in 1992 and is headquartered in Osaka, Japan. Eslead Corporation is a subsidiary of Mori Trust Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "8881.T": {"short_name": "NISSHIN GROUP HLDGS CO LTD", "long_name": "NISSHIN GROUP HOLDINGS Company, Limited", "summary": "NISSHIN GROUP HOLDINGS Company, Limited plans, develops, manages, and sells condominiums under the Palace stage and Duo stage brands. It is also involved in the property rental and real estate businesses. In addition, the company engages in the construction work, civil engineering work, etc.; rental management and remodeling activities; real estate securitization business, such as investment corporation management contracts; and purchase, resale, and renovation business of used condominiums. Further, it offers mortgage guarantee and housing funds loans to condominium buyers; and plans and sells detached houses. NISSHIN GROUP HOLDINGS Company, Limited was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8886.T": {"short_name": "WOODFRIENDS CO LTD", "long_name": "Wood Friends Co.,Ltd.", "summary": "Wood Friends Co.,Ltd. plans, develops, and sells real estate properties in Japan. The company designs, constructs, sells, and services wood houses and residential condominium; and provides real estate brokerage and house consultancy services. It is also involved in the land procurement business. The company was founded in 1982 and is based in Nagoya, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Nagoya"}, "8887.T": {"short_name": "RIBERESUTE CORP", "long_name": "Riberesute Corporation", "summary": "Riberesute Corporation engages in real estate and construction businesses in Japan. It develops condominiums and housing projects; and undertakes hot spring development projects. It is also involved in the sale of residential properties; and provision of real estate distribution, order construction, and renovation activities. In addition, the company offers real estate sales, brokerage, and management services. Riberesute Corporation was founded in 1970 and is headquartered in Soka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Soka"}, "8889.T": {"short_name": "APAMAN CO LTD", "long_name": "Apaman Co., Ltd.", "summary": "Apaman Co., Ltd. operates a real estate portal in Japan. It provides Apamanshop, a real estate portal that provides domestic and overseas rental and monthly property information, and trading and investment property information. The company was formerly known as Apamanshop Holdings Co., Ltd. and changed its name to Apaman Co., Ltd. in January 2018. Apaman Co., Ltd. was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8890.T": {"short_name": "RAYSUM CO LTD", "long_name": "Raysum Co., Ltd.", "summary": "Raysum Co., Ltd. engages in the real estate investment business in Japan. It also operates community hostels; and a specialized surgery center that offers medical care services to assist the elderly. The company was formerly known as Recrm Research Co., Ltd. and changed its name to Raysum Co., Ltd. in 2008. Raysum Co., Ltd. was founded in 1992 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8893.T": {"short_name": "SHIN-NIHON TATEMONO CO", "long_name": "Shin-Nihon Tatemono Co., Ltd.", "summary": "Shin-Nihon Tatemono Co., Ltd. operates as a real estate developer in Japan. The company develops and sells family and compact condominiums, and residential houses, as well as provides real estate solutions. It also manages and sub-leases condominiums and apartments; provides building renovation services; undertakes various construction projects, such as detached housing projects, apartments and condominiums, and commercial facilities; and offers real estate consulting services. Shin-Nihon Tatemono Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8903.T": {"short_name": "SUNWOOD CORPORATION", "long_name": "Sunwood Corporation", "summary": "Sunwood Corporation develops and sells condominiums in Japan. It is also involved in the real estate agency and brokerage, operation and management, and renovation and remodeling activities; and real estate renovation for sale. The company was founded in 1997 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8908.T": {"short_name": "MAINICHI COMNET CO.LTD.", "long_name": "Mainichi Comnet Co., Ltd.", "summary": "Mainichi Comnet Co., Ltd. primarily engages in the real estate business in Japan. The company is involved in planning, design supervision, consulting, and development of real estate properties; development and management of student apartments and dormitories; purchase of land and buildings; rental of housing and commercial facilities; and advertising agency business. It also engages in the development of sports facilities; and cohabitation, training, and travel planning, as well as conference, international exchange, and auto-car workshop activities. The company was founded in 1979 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8909.T": {"short_name": "SHINOKEN GROUP CO LTD", "long_name": "Shinoken Group Co., Ltd.", "summary": "Shinoken Group Co., Ltd. engages in the real estate, general contractor, energy, and life care businesses in Japan and internationally. It designs, constructs, purchases, rents, manages, and sells apartments and condominiums; and offers debt guarantee services, as well as short-term insurance for owners and tenants of apartments and condominiums. The company is also involved in the retail sale of LP gas and electricity to apartments; and owning and operating nursing care facilities. In addition, it operates Kids Life, an after-school daycare service for children with disabilities. The company was founded in 1990 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8912.T": {"short_name": "AREA QUEST INC", "long_name": "Area Quest Inc.", "summary": "Area Quest Inc. provides real estate solutions in Japan. It operates through Tenant Invitation, Update and Contract Management, and Building Management divisions. The company attracts tenants on behalf of building owners and managers; and provides advice and information for solving the problems related to building management, as well as meets the sales needs of building owners. It also provides building management and subleasing services. The company was founded in 2000 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8914.T": {"short_name": "AREALINK CO LTD", "long_name": "Arealink Co., Ltd.", "summary": "Arealink Co., Ltd. engages in the self-storage business in Japan. The company operates outdoor container type and indoor trunk type self-storage facilities, as well as self-storage facilities under the Hello Storage brand. It also provides rental meeting rooms under the Hello Rental Meeting Rooms brand; and small-scale rental offices under the Hello Office brand. In addition, the company offers land rights management services, including buying land rights from landowners and selling them to leaseholders. Arealink Co., Ltd. was founded in 1995 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8919.T": {"short_name": "KATITAS CO LTD", "long_name": "KATITAS CO., Ltd.", "summary": "KATITAS CO., Ltd. purchases, remodels, and sells used homes to individuals and families in Japan. It offers its services through approximately 100 branches. The company was formerly known as Yasuragi Co., Ltd. and changed its name to KATITAS CO., Ltd. in 2013. KATITAS CO., Ltd. was founded in 1978 and is headquartered in Kiryu-shi, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kiryu"}, "8923.T": {"short_name": "TOSEI CORPORATION", "long_name": "Tosei Corporation", "summary": "Tosei Corporation operates in the revitalization, development, rental, fund and consulting, and property management businesses in Japan. The company acquires properties whose asset value has declined and improves value-up activities; develops office buildings, commercial facilities, condominiums, detached houses, and hotels; and leases office buildings, condominiums, stores, car parks, and other properties. It is also involved in the provision of asset management services for real estate funds, as well as consultancy and intermediary services for corporates; acquisition and disposition of properties; and investment management, investment advisory and agency, and financial instrument businesses. In addition, the company offers property management services, including building management, security, renovation, and tenant leasing services; and building interior and exterior repair and maintenance, cleaning, security, etc. Further, it is involved in the logistics consulting business; consultancy services; real estate brokerage activities; hotel planning, operation, and management businesses; and construction of custom homes. The company was formerly known as Tosei Fudosan Co., Ltd. and changed its name to Tosei Corporation in October 2006. Tosei Corporation was founded in 1950 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8925.T": {"short_name": "ARDEPRO CO LTD", "long_name": "ARDEPRO Co., Ltd.", "summary": "ARDEPRO Co., Ltd. engages in real estate revitalization business in Japan. The company was founded in 1988 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8927.T": {"short_name": "MEIHO ENTERPRISE CO LTD", "long_name": "Meiho Enterprise Co., Ltd.", "summary": "Meiho Enterprise Co., Ltd. engages in the real estate business in Japan. It is involved in the sale, rental, lease, and intermediation of real estate properties, including apartments, condominiums, and townhouses. The company was founded in 1968 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8928.T": {"short_name": "ANABUKI KOSAN INC", "long_name": "Anabuki Kosan Inc.", "summary": "Anabuki Kosan Inc. engages in the real estate business in Japan. It is involved in the custom home contracting, apartment contracting, real estate distribution, hotel and tenant building management, public facility consignment management, and town planning businesses, as well as sale of houses. The company also provides real estate, facility management, energy saving, condominium management, insurance, senior related, employment support, travel, human resource development, outsourcing, and advertisement services. Anabuki Kosan Inc. was founded in 1964 and is headquartered in Takamatsu, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Takamatsu"}, "8931.T": {"short_name": "WADAKOHSAN CORP", "long_name": "Wadakohsan Corporation", "summary": "Wadakohsan Corporation develops and sells condominiums, detached houses, and residential land in Japan. It also rents, leases, and manages condominiums, stores, and parking lots. The company was founded in 1899 and is headquartered in Kobe, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kobe"}, "8934.T": {"short_name": "SUN FRONTIER FUDOSAN CO LTD", "long_name": "Sun Frontier Fudousan Co., Ltd.", "summary": "Sun Frontier Fudousan Co., Ltd. provides real estate revitalization and real estate services to building owners, asset holders, and wealthy individuals in Tokyo. It operates through Real Estate Revitalization Business, Real Estate Service Business, Operation Business, and Other segments. The company offers replanning, property management, commercial real estate brokerage, and office and store leasing services, as well as construction and renovation services for commercial properties, office buildings, and condominiums. It also provides building management, construction planning, delinquent rent guarantee, and asset consultancy services. In addition, the company engages in the hotel development and operation business. The company was founded in 1999 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8938.T": {"short_name": "GLOME HOLDINGS INC", "long_name": "GLOME Holdings,Inc.", "summary": "GLOME Holdings,Inc. engages in the real estate business. The company provides medical operation consolidation; visiting nursing station operation; and medical staff recruitment and medical tourism services. It also offers property management services; renovates medical facilities; and develops related facilities, as well as hospital management support services. In addition, the company is involved in the sale and leaseback of hospital real estate. The company was formerly known as LC Holdings, Inc. and changed its name to GLOME Holdings,Inc. in October 2019. GLOME Holdings,Inc. was founded in 1987 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8945.T": {"short_name": "SUNNEXTA GROUP INC", "long_name": "SUNNEXTA GROUP Inc.", "summary": "SUNNEXTA GROUP Inc. provides housing system management outsourcing business in Japan. It also engages in house rental management business; the provision of consultation for reform of housing system works; the provision of outsourcing services in personnel and general affairs; and cost reduction consultation and purchasing agency businesses. The company was founded in 1998 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8954.T": {"short_name": "ORIX JREIT INC", "long_name": "ORIX JREIT Inc.", "summary": "OJR was established on September 10, 2001, and was listed and commenced trading on the Tokyo Stock Exchange on June 12, 2002 as the fourth Real Estate Investment Trust in Japan, or Â\u0093JREIT,Â\u0094 to be listed. A JREIT is an externally managed property fund formed under the Act on Investment Trusts and Investment Corporations of Japan. ORIX Asset Management Corporation, a wholly owned subsidiary of ORIX Corporation (TSE: 8591, NYSE: IX (ADR)), is the asset manager of OJR.OJR is a diversified JREIT that invests in office buildings, retail facilities, residential properties, logistics facilities, and hotels and others, aiming to provide stable cash flow and healthy asset growth over the medium to long term.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8957.T": {"short_name": "TOKYU REIT INC", "long_name": "Tokyu REIT, Inc.", "summary": "TOKYU REIT, Inc. was incorporated to invest in real estate on June 20, 2003 under the Law Concerning Investment Trusts and Investment Corporations of Japan (Law No. 198 of 1952, as amended), or the Investment Trust Law. Such corporations are commonly referred to as Japanese Real Estate Investment Trusts, or J-REITs.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8961.T": {"short_name": "MORI TRUST SOGO REIT INC", "long_name": "MORI TRUST Sogo Reit, Inc.", "summary": "MORI TRUST Sogo Reit, Inc. manages assets by investing funds collected from investors, based on its Certificate of Incorporation, mainly in real estate and asset-backed securities that invest mainly in real estate.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8963.T": {"short_name": "INVINCIBLE INVESTMENT CORP", "long_name": "Invincible Investment Corporation", "summary": "INV was established in January 2002 in accordance with the Investment Trust and Investment Corporation Act (Act No. 198 of 1951, as amended; the Â\u0093Investment Trust ActÂ\u0094). In May 2004, INV was listed on the Osaka Securities Exchange (application for delisting was made in August 2007), and in August 2006 was listed on the Real Estate Investment and Trust Securities Section of the Tokyo Stock Exchange (Ticker Code: 8963).", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8966.T": {"short_name": "HEIWA REAL ESTATE REIT INC", "long_name": "Heiwa Real Estate REIT, Inc.", "summary": "HEIWA REAL ESTATE REIT, Inc. (\"the Investment Corporation\") raises funds from investors, investing said funds primarily in real estate, working toward growth for managed assets and stable medium- to long-term profits.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8968.T": {"short_name": "FUKUOKA REIT CORP", "long_name": "Fukuoka REIT Corporation", "summary": "Fukuoka REIT Corporation (securities code: 8968) is the first region-specific REIT in Japan. With our strength in knowing the local characteristics of real estate, which is a very regional-specific business, Fukuoka REIT manages a portfolio centering on superior design entertainment retail facilities and Class A office buildings in the entire Kyushu region centering on Fukuoka, Yamaguchi and Okinawa prefectures. Fukuoka REIT was registered in August 2004 and listed on the Tokyo Stock Exchange and Fukuoka Stock Exchange on June 21, 2005. Real estate management, acquisition arrangements of new properties, fund raising and other operations are contracted to its asset manager, Fukuoka Realty Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Fukuoka"}, "8972.T": {"short_name": "KENEDIX OFFICE INVESTMENT CORP", "long_name": "Kenedix Office Investment Corporation", "summary": "Kenedix Office Investment Corporation (Â\u0093the Investment CorporationÂ\u0094) was established on May 6, 2005, in accordance with the Act on Investment Trusts and Investment Corporations (Act No. 198 of the year 1951, including amendments thereafter) (Â\u0093Investment Trust ActÂ\u0094). On July 21, 2005, the Investment Corporation was listed on the Real Estate Investment Trust Market of the Tokyo Stock Exchange, Inc. (Â\u0093the Tokyo Stock ExchangeÂ\u0094) with a total of 75,400 investment units issued and outstanding (Securities Code: 8972). Subsequently, the Investment Corporation raised funds through eight public offerings and such. As a result, as of the end of the fiscal period under review (October 31, 2020), the number of investment units issued and outstanding totaled 428,510 units. The Investment Corporation entrusts Kenedix Real Estate Fund Management, Inc. (Â\u0093the Asset Management CompanyÂ\u0094) with its asset management and strives to maximize unitholder profits by securing stable earnings and sustainable growth of investment assets. To this end, the Investment Corporation adopts the basic policy of conducting flexible and dynamic investment that seeks to respond to the environment and market trends, endeavors to ensure a timely response to opportunities, and form a portfolio.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8975.T": {"short_name": "ICHIGO OFFICE REITINVESTMENT CO", "long_name": "Ichigo Office REIT Investment Corporation", "summary": "Ichigo Office (8975) is a specialized office REIT that focuses on mid-size offices, an asset class that offers both return stability and upside potential. Ichigo Office seeks to drive higher earnings and sustainable growth for its shareholders by increasing the value of its assets through a broad array of value-add activities, including tailored tenant services, structural building improvements, and targeted tenant leasing. Ichigo Office is managed by Ichigo Investment Advisors, the asset management subsidiary of Ichigo, a major Japanese real estate owner/operator. Ichigo Investment Advisors works to grow value on behalf of shareholders by deploying its deep experience and know-how in developing, operating, and managing Japanese real estate. The mid-size offices in which we invest produce stable cashflows, supporting stable dividends for shareholders. Also, this economically-sensitive asset class provides upside for shareholders via the possibility of higher rent income as the Japanese economy shows signs of emerging from multiple decades of deflation. Furthermore, because the market for mid-size offices in Japan is relatively inefficient and has less participation by other major real estate companies, who tend to focus on larger assets, there is a significant opportunity to add value and increase the profitability of the assets we acquire.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "8977.T": {"short_name": "HANKYU HANSHIN REIT INC", "long_name": "Hankyu Hanshin REIT, Inc.", "summary": "Hankyu Hanshin REIT, Inc. manages funds contributed by unit holders by investing them primarily in real estate and real estate-backed securities in accordance with its Articles of Incorporation.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "8995.T": {"short_name": "MAKOTO CONSTRUCTION CO.LTD", "long_name": "Makoto Construction Co,Ltd", "summary": "Makoto Construction Co,Ltd, a construction company, designs, constructs, and sells in-houses in Japan. It constructs condominiums and custom homes; and provides remodeling services. The company was founded in 1977 and is headquartered in Sakai, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Sakai"}, "9281.T": {"short_name": "TAKARA LEBEN INFRASTRUCTURE FUN", "long_name": "Takara Leben Infrastructure Fund, Inc.", "summary": "Takara Leben Infrastructure Fund, Inc. primarily invests in renewable energy generation facilities. The company is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Specialty", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "None"}, "9282.T": {"short_name": "ICHIGO GREEN", "long_name": "Ichigo Green Infrastructure Investment Corporation", "summary": "Ichigo Green Infrastructure Investment Corporation is a fund of Ichigo Investment Advisors Co., Ltd.", "currency": "JPY", "sector": "Real Estate", "industry": "REIT—Specialty", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9423.T": {"short_name": "FORVAL REALSTRAIGHT INC.", "long_name": "Forval RealStraight Inc.", "summary": "Forval RealStraight Inc. provides real estate brokerage and office relocation support services in Japan. It also sells OA communication equipment. The company was formerly known as Fread Co., Ltd. and changed its name to Forval RealStraight Inc. in July 2009. Forval RealStraight Inc. was founded in 1995 and is headquartered in Tokyo, Japan. Forval RealStraight Inc. is a subsidiary of Forval Corporation.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9635.T": {"short_name": "MUSASHINO KOGYO CO", "long_name": "Musashino Kogyo Co., Ltd.", "summary": "Musashino Kogyo Co., Ltd. engages in the film entertainment, real estate, and commercial businesses. The company is involved in the management of movie theaters. It also engages in the leasing, sale, and intermediary of land and buildings; and sale of commercial goods, etc. Musashino Kogyo Co., Ltd. was founded in 1920 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9639.T": {"short_name": "SANKYO FRONTIER CO", "long_name": "Sankyo Frontier Co.,Ltd.", "summary": "Sankyo Frontier Co.,Ltd. produces, sells, and rents modular buildings, self-storage, and multistory parking devices in Japan and internationally. Its products are used in various applications, such as construction site offices, temporary emergency housing, shops, offices, schools, medical facilities, etc. The company was founded in 1969 and is headquartered in Kashiwa, Japan. Sankyo Frontier Co.,Ltd. is a subsidiary of Wako Kosan Y.K.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Kashiwa"}, "9661.T": {"short_name": "KABUKI-ZA CO LTD", "long_name": "Kabuki-Za Co., Ltd.", "summary": "Kabuki-Za Co., Ltd. provides lease space for conducting one-day events, group plays, and annual seating. Kabuki-Za Co., Ltd. was founded in 1949 and is based in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9728.T": {"short_name": "NIPPON KANZAI CO", "long_name": "Nippon Kanzai Co., Ltd.", "summary": "Nippon Kanzai Co., Ltd. provides building management and operation, environmental facility management, and real estate fund management services in Japan. It offers building management services, including safety, equipment, and energy, and other management services; and cleaning, cash, security, liaison, and indoor operation, as well as engages in administrative and building repair works. The company also provides engineering services comprising building and seismic diagnosis, repair work, repair plan, database, and engineering report services. In addition, it is involved in the property and residential management, management consulting, temporary staffing, and other businesses. The company was founded in 1965 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "9761.T": {"short_name": "TOKAI LEASE CO LTD", "long_name": "Tokai Lease Co., Ltd.", "summary": "Tokai Lease Co., Ltd. manufactures, sells, and leases temporary buildings, and fixtures and fittings in Japan. The company leases temporary buildings for schools, offices, shops, and emergency temporary housing, as well as public facilities, such as police boxes. It also leases and sells office supplies/furniture supplies and air conditioning. Tokai Lease Co., Ltd. was founded in 1963 and is headquartered in Osaka, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Osaka"}, "9816.T": {"short_name": "STRIDERS CORPORATION", "long_name": "Striders Corporation", "summary": "Striders Corporation, together with its subsidiaries, engages in the real estate, hotel, overseas, and other businesses primarily in Japan. It develops and sells various logistic systems to support logistics operations. The company also offers turnaround consultancy; enterprise reconstruction and reorganization schemes; range of advisory services for mergers and acquisitions; and financial assistance services. In addition, it provides leasing services, such as market research and tenant recruitment, as well as sub-leasing services; collects rent; handles leasing renewal, cancellation, and evacuation contracts; and deals in facility trouble and tenant claims, as well as offers interior decoration and residential property management services. Further, the company offers building management services, including managing mansion units and front staff, cleaning work, and checking and maintaining building equipment, as well as rental and land agency, and rental guarantee services. Additionally, it manufactures and sells Chinese noodles; and owns, operates, and manages Narita Gateway and Kurashiki Royal Art hotels. The company also engages in the advertisement agency business in Indonesia; investment activities; and develops software application programs. Striders Corporation was founded in 1965 and is headquartered in Tokyo, Japan.", "currency": "JPY", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "JPX", "market": "jp_market", "country": "Japan", "city": "Tokyo"}, "CDCTF": {"short_name": "GOLDCREST CO LTD", "long_name": "GOLDCREST Co.,Ltd.", "summary": "GOLDCREST Co.,Ltd. engages in the development and sale of new condominiums in Japan. It is also involved in the property agency, broking, and consulting services. The company was incorporated in 1968 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "DIFTY": {"short_name": "DAITO TRUST CONSTRUCTION CO", "long_name": "Daito Trust Construction Co.,Ltd.", "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "DITTF": {"short_name": "DAITO TRUST CONSTRUCTION CO", "long_name": "Daito Trust Construction Co.,Ltd.", "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "DWAHF": {"short_name": "DAIWA HOUSE INDUSTRY CO", "long_name": "Daiwa House Industry Co.,Ltd.", "summary": "Daiwa House Industry Co., Ltd. engages in the construction business worldwide. It operates through Single-Family Houses; Rental Housing; Condominiums; Existing Homes; Commercial Facilities; Logistics, Business and Corporate Facilities; and Other Businesses segments. The company constructs single-family houses; rents houses; develops, manages, and sells condominiums; purchases, renovates, and resells existing homes; develops commercial facilities; develops and constructs logistics, business, and corporate facilities; and provides real estate agency services. It also manufactures steel and timber housing parts; offers ground survey and reinforcement services; and constructs retail and wholesale, medical and nursing care, office and factory, urban development and industrial park, energy, environmental greening, agriculture, parking and carsharing, and public-private partnership facilities. In addition, the company operates resort hotels and golf courses, business and city hotels, fitness clubs and aesthetic salons, and home centers; provides robotics technologies for use in hospitals, care facilities, factories, and construction sites; manages private homes for the elderly and assisted-living residential facilities for seniors; and offers parking, advertising, travel agency, information technology, and credit card and insurance agency services. Daiwa House Industry Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "DWAHY": {"short_name": "DAIWA HOUSE INDUSTRY CO", "long_name": "Daiwa House Industry Co.,Ltd.", "summary": "Daiwa House Industry Co., Ltd. engages in the construction business worldwide. It operates through Single-Family Houses; Rental Housing; Condominiums; Existing Homes; Commercial Facilities; Logistics, Business and Corporate Facilities; and Other Businesses segments. The company constructs single-family houses; rents houses; develops, manages, and sells condominiums; purchases, renovates, and resells existing homes; develops commercial facilities; develops and constructs logistics, business, and corporate facilities; and provides real estate agency services. It also manufactures steel and timber housing parts; offers ground survey and reinforcement services; and constructs retail and wholesale, medical and nursing care, office and factory, urban development and industrial park, energy, environmental greening, agriculture, parking and carsharing, and public-private partnership facilities. In addition, the company operates resort hotels and golf courses, business and city hotels, fitness clubs and aesthetic salons, and home centers; provides robotics technologies for use in hospitals, care facilities, factories, and construction sites; manages private homes for the elderly and assisted-living residential facilities for seniors; and offers parking, advertising, travel agency, information technology, and credit card and insurance agency services. Daiwa House Industry Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Osaka"}, "DWH.F": {"short_name": "DAIWA HOUSE IND.", "long_name": "Daiwa House Industry Co.,Ltd.", "summary": "Daiwa House Industry Co., Ltd. engages in the construction business worldwide. It operates through Single-Family Houses; Rental Housing; Condominiums; Existing Homes; Commercial Facilities; Logistics, Business and Corporate Facilities; and Other Businesses segments. The company constructs single-family houses; rents houses; develops, manages, and sells condominiums; purchases, renovates, and resells existing homes; develops commercial facilities; develops and constructs logistics, business, and corporate facilities; and provides real estate agency services. It also manufactures steel and timber housing parts; offers ground survey and reinforcement services; and constructs retail and wholesale, medical and nursing care, office and factory, urban development and industrial park, energy, environmental greening, agriculture, parking and carsharing, and public-private partnership facilities. In addition, the company operates resort hotels and golf courses, business and city hotels, fitness clubs and aesthetic salons, and home centers; provides robotics technologies for use in hospitals, care facilities, factories, and construction sites; manages private homes for the elderly and assisted-living residential facilities for seniors; and offers parking, advertising, travel agency, information technology, and credit card and insurance agency services. Daiwa House Industry Co., Ltd. was founded in 1947 and is headquartered in Osaka, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Development", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Osaka"}, "HZJ.F": {"short_name": "HEIWA REAL ESTATE", "long_name": "Heiwa Real Estate Co., Ltd.", "summary": "Heiwa Real Estate Co., Ltd. operates as a real estate company in Japan. The company develops, leases, administrates, and manages stock exchange buildings, office buildings, commercial facilities, and residential buildings; develops and sells residential buildings; and provides real estate agency services. It is also involved in the building facility maintenance and management, repair work contracting, civil engineering and construction contracting, property management, investment management, real estate brokerage, and insurance agency businesses. In addition, the company engages in the operation of halls and conference rooms, and parking lots; and management of restaurants. Heiwa Real Estate Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "JPRRF": {"short_name": "JAPAN PRIME REALTY INVESTMENT C", "long_name": "Japan Prime Realty Investment Corporation", "summary": "Japan Prime Realty Investment Corporation (JPR) was established on September 14, 2001 under the Act on Investment Trusts and Investment Corporations (Act No. 198 of 1951, as amended), and was listed on the Tokyo Stock Exchange Real Estate Investment Trust Section on June 14, 2002 with 289,600 outstanding investment units. With the subsequently implemented public offerings and other capital raising measures by JPR, the number of investment units issued and outstanding totals 958250 units as of the end of the 37th fiscal period (June 30, 2020). JPR has assigned the asset management of its portfolio to Tokyo Realty Investment Management, Inc. (TRIM), through which JPR aims to maximize unitholder value by efficiently managing the portfolio primarily comprising office properties and retail properties.", "currency": "USD", "sector": "Real Estate", "industry": "REIT—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "JREIF": {"short_name": "JAPAN REAL ESTATE INVESTMENT CO", "long_name": "Japan Real Estate Investment Corporation", "summary": "JRE shall invest in specified assets, primarily consisting of real estate assets and asset related securities which mainly invests in real estate assets with the goals of stable growth in value over a medium-to-long term period.", "currency": "USD", "sector": "Real Estate", "industry": "REIT—Office", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "MFU.F": {"short_name": "MITSUI FUDOSAN LTD", "long_name": "Mitsui Fudosan Co., Ltd.", "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "MITEF": {"short_name": "MITSUBISHI ESTATE CO", "long_name": "Mitsubishi Estate Co., Ltd.", "summary": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 13 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "MITEY": {"short_name": "MITSUBISHI ESTATE CO", "long_name": "Mitsubishi Estate Co., Ltd.", "summary": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 13 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "MQI.F": {"short_name": "LEOPALACE21", "long_name": "Leopalace21 Corporation", "summary": "Leopalace21 Corporation, together with its subsidiaries, engages in the construction, leasing, and sale of apartments, condominiums, and residential housing in Japan. It operates through four segments: Leasing Business; Development Business; Elderly Care Business; and Hotels, Resort and Other Businesses. The Leasing Business segment engages in the leasing and management of apartment buildings and other properties; repair work; broadband internet service; rent obligation guarantee; and company residence agency, solar power generation, and small-amount short-term insurance and other businesses. The Development Business segment is involved in the construction subcontracting of apartments and detached houses; and development of condominiums and others. The Elderly Care Business segment operates elderly care facilities under the Azumi En brand. This segment also offers day services, short stays, elderly homes with nursing care services/residential style elderly homes, home visits, and home care support services. The Hotels, Resort and Other Businesses segment engages in the operation of hotels; operation and management of resort facilities on the island of Guam; and provision of travel agency, clerical agency, and other services. The company was formerly known as MDI Corporation and changed its name to Leopalace21 Corporation in July 2000. Leopalace21 Corporation was founded in 1973 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "MTSFF": {"short_name": "MITSUI FUDOSAN", "long_name": "Mitsui Fudosan Co., Ltd.", "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "MTSFY": {"short_name": "MITSUI FUDOSAN", "long_name": "Mitsui Fudosan Co., Ltd.", "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NFU.MU": {"short_name": "NISSHIN GROUP HOLDINGS CO", "long_name": "NISSHIN GROUP HOLDINGS Company, Limited", "summary": "NISSHIN GROUP HOLDINGS Company, Limited plans, develops, manages, and sells condominiums under the Palace stage and Duo stage brands. It is also involved in the property rental and real estate businesses. In addition, the company engages in the construction work, civil engineering work, etc.; rental management and remodeling activities; real estate securitization business, such as investment corporation management contracts; and purchase, resale, and renovation business of used condominiums. Further, it offers mortgage guarantee and housing funds loans to condominium buyers; and plans and sells detached houses. NISSHIN GROUP HOLDINGS Company, Limited was founded in 1975 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "MUN", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "NMEHF": {"short_name": "NOMURA REAL ESTATE HOLDINGS INC", "long_name": "Nomura Real Estate Holdings, Inc.", "summary": "Nomura Real Estate Holdings, Inc. operates as a real estate company in Japan and internationally. The company develops, leases, and manages office buildings, commercial facilities, logistics facilities, and hotels; develops and sells condominiums and houses; operates housing with services for the elderly; develops rental properties; provides Internet advertising services for housing and living assistance services; provides asset management services for real estate securitization, including REITs and private placement funds and securities funds; and provides real estate brokerage and consulting, insurance agency, and real estate information Website management services. The company also engages in the management of properties, such as condominiums, office buildings, and educational facilities; provision of renovation and repair work for tenants; remodeling of condominiums and housing; and provision of cleaning services for condominiums and office buildings. In addition, it participates in, promotes, and supports urban development projects and reconstruction of housing complexes; and manages fitness clubs. The company was founded in 2004 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "NPONF": {"short_name": "NIPPON PROLOGIS REIT INC", "long_name": "Nippon Prologis REIT, Inc.", "summary": "NPR was established on Nov. 7, 2012, based on the Act on Investment Trust and Investment Corporation (investment trust law) and was listed on the REIT Securities Market (J-REIT Market) of the Tokyo Stock Exchange (Â\u0093TSEÂ\u0094) on Feb. 14, 2013 (securities code: 3283).", "currency": "USD", "sector": "Real Estate", "industry": "REIT—Industrial", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "T6R.F": {"short_name": "TOKYO TATEMONO", "long_name": "Tokyo Tatemono Co., Ltd.", "summary": "Tokyo Tatemono Co., Ltd. operates as a real estate company in Japan. The company operates through Commercial Properties, Residence, and Real Estate Service segments. The Commercial Properties segment leases and manages office buildings and commercial facilities. The Residence segment develops and sells condominiums and detached houses; and leases and manages condominiums. The Real Estate Service segment engages in the asset solution, brokerage, consulting, and parking lot operations. The company also engages in the leisure business, which include management and operation of hotels and resort facilities, golf courses, public baths, and spas. Further, the company provides housing and nursing care services for senior citizens. Tokyo Tatemono Co., Ltd. was founded in 1896 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "T8F.F": {"short_name": "TOKYU FUDOSAN HOLDINGS", "long_name": "Tokyu Fudosan Holdings Corporation", "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.", "currency": "EUR", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "FRA", "market": "dr_market", "country": "Japan", "city": "Tokyo"}, "TTUUF": {"short_name": "TOKYU FUDOSAN HOLDINGS CORPORAT", "long_name": "Tokyu Fudosan Holdings Corporation", "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate—Diversified", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}, "TYTMF": {"short_name": "TOKYO TATEMONO CO", "long_name": "Tokyo Tatemono Co., Ltd.", "summary": "Tokyo Tatemono Co., Ltd. operates as a real estate company in Japan. The company operates through Commercial Properties, Residence, and Real Estate Service segments. The Commercial Properties segment leases and manages office buildings and commercial facilities. The Residence segment develops and sells condominiums and detached houses; and leases and manages condominiums. The Real Estate Service segment engages in the asset solution, brokerage, consulting, and parking lot operations. The company also engages in the leisure business, which include management and operation of hotels and resort facilities, golf courses, public baths, and spas. Further, the company provides housing and nursing care services for senior citizens. Tokyo Tatemono Co., Ltd. was founded in 1896 and is headquartered in Tokyo, Japan.", "currency": "USD", "sector": "Real Estate", "industry": "Real Estate Services", "exchange": "PNK", "market": "us_market", "country": "Japan", "city": "Tokyo"}}