{
    "1878.T": {
        "short_name": "DAITO TRUST CONSTRUCTION CO",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2987.T": {
        "short_name": "TASUKI CORP",
        "long_name": "TASUKI Corporation",
        "summary": "TASUKI Corporation develops apartments and condominiums, urban hotels, resort hotels, and licensed nurseries in Japan. It also develops and operates Taski DayPay, a prepaid prepayment service; and Tuski Funds, an online complete small-scale real estate investment service. The company was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "300.F": {
        "short_name": "KENEDIX INC.",
        "long_name": "Kenedix, Inc.",
        "summary": "Kenedix, Inc. provides diversified real estate asset investment and management services in Japan. The company's portfolio of assets under management include office buildings, residential properties, hotels, and healthcare, retail, and logistics facilities, as well as other properties. It also provides due diligence, acquisition, financing, leasing, engineering, disposition, and various other services. In addition, the company manages private funds of client investors-pension funds, institutional investors, other investors, and J-REITs. The company was formerly known as Kennedy-Wilson Japan Co., Ltd. and changed its name to Kenedix, Inc. in May 2005. Kenedix, Inc. was founded in 1995 and is headquartered in Tokyo, Japan. As of January 8, 2021, Kenedix, Inc. operates as a subsidiary of SMFL Mirai Partners Co., Ltd.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3010.T": {
        "short_name": "KACHIKAIHATSU CO L",
        "long_name": "KachikaiHatsu Co., Ltd.",
        "summary": "KachikaiHatsu Co., Ltd. operates a chain of hotels in Japan. The company also develops, buys, sells, leases, invests in, and manages real estate properties. KachikaiHatsu Co., Ltd. was founded in 1912 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3244.T": {
        "short_name": "SAMTY CO.LTD.",
        "long_name": "Samty Co., Ltd.",
        "summary": "Samty Co., Ltd. engages in the real estate business in Japan. It plans, designs, develops, and manages condominiums; and leases and manages properties, such as apartments, office buildings, commercial facilities, hotels, and others. The company is also involved in the development and sale of land; and property holding, tenant recruitment, and property management businesses, as well as provision of construction and construction renovation services. In addition, it operates hotels; and offers asset management services. The company was formerly known as Samty Development Co., Ltd. and changed its name to Samty Co., Ltd. in June 2005. Samty Co., Ltd. was founded in 1982 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Osaka"
    },
    "3248.T": {
        "short_name": "EARLY AGE CO LTD",
        "long_name": "Early Age Co., Ltd.",
        "summary": "Early Age Co., Ltd. engages in the real estate business in Japan. The company develops, leases, and sells condominiums. It is also involved in the real estate brokerage, consulting, and management operation businesses; and management of parking lot. The company was incorporated in 1986 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3264.T": {
        "short_name": "ASCOT CORP",
        "long_name": "Ascot Corp.",
        "summary": "Ascot Corp. develops and sells real estate properties in Japan. Its property portfolio includes condominiums, detached and terrace houses, office buildings, hotels, and commercial and nursing facilities. The company also rents apartments, condominiums, and offices. In addition, it provides real estate consulting and other services. Ascot Corp. was founded in 1999 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3280.T": {
        "short_name": "STRUST CO LIMITED",
        "long_name": "STrust Co.,Ltd.",
        "summary": "STrust Co.,Ltd. engages in the real estate business in Japan. The company primarily sells condominiums. It is also involved in real estate agency and leasing businesses, as well as the management of condominiums. The company was founded in 1999 and is headquartered in Shimonoseki, Japan. STrust Co.,Ltd. is a subsidiary of Saibu Gas Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Shimonoseki"
    },
    "3289.T": {
        "short_name": "TOKYU FUDOSAN HOLDINGS CORPORAT",
        "long_name": "Tokyu Fudosan Holdings Corporation",
        "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3469.T": {
        "short_name": "DUALTAP CO LTD",
        "long_name": "Dualtap Co., Ltd.",
        "summary": "Dualtap Co., Ltd. plans, develops, and sells real estate properties in Japan and internationally. It also manages real estate properties; securitizes real estate; and operates as an insurance agency. In addition, it operates Hotel Promote located in Hakodate Shofu. The company was founded in 2006 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4321.T": {
        "short_name": "KENEDIX INC",
        "long_name": "Kenedix, Inc.",
        "summary": "Kenedix, Inc. provides diversified real estate asset investment and management services in Japan. The company's portfolio of assets under management include office buildings, residential properties, hotels, and healthcare, retail, and logistics facilities, as well as other properties. It also provides due diligence, acquisition, financing, leasing, engineering, disposition, and various other services. In addition, the company manages private funds of client investors-pension funds, institutional investors, other investors, and J-REITs. The company was formerly known as Kennedy-Wilson Japan Co., Ltd. and changed its name to Kenedix, Inc. in May 2005. Kenedix, Inc. was founded in 1995 and is headquartered in Tokyo, Japan. As of January 8, 2021, Kenedix, Inc. operates as a subsidiary of SMFL Mirai Partners Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "4D7.F": {
        "short_name": "DAITO TR. CONSTR.",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8801.T": {
        "short_name": "MITSUI FUDOSAN",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8803.T": {
        "short_name": "HEIWA REAL ESTATE CO",
        "long_name": "Heiwa Real Estate Co., Ltd.",
        "summary": "Heiwa Real Estate Co., Ltd. operates as a real estate company in Japan. The company develops, leases, administrates, and manages stock exchange buildings, office buildings, commercial facilities, and residential buildings; develops and sells residential buildings; and provides real estate agency services. It is also involved in the building facility maintenance and management, repair work contracting, civil engineering and construction contracting, property management, investment management, real estate brokerage, and insurance agency businesses. In addition, the company engages in the operation of halls and conference rooms, and parking lots; and management of restaurants. Heiwa Real Estate Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8923.T": {
        "short_name": "TOSEI CORPORATION",
        "long_name": "Tosei Corporation",
        "summary": "Tosei Corporation operates in the revitalization, development, rental, fund and consulting, and property management businesses in Japan. The company acquires properties whose asset value has declined and improves value-up activities; develops office buildings, commercial facilities, condominiums, detached houses, and hotels; and leases office buildings, condominiums, stores, car parks, and other properties. It is also involved in the provision of asset management services for real estate funds, as well as consultancy and intermediary services for corporates; acquisition and disposition of properties; and investment management, investment advisory and agency, and financial instrument businesses. In addition, the company offers property management services, including building management, security, renovation, and tenant leasing services; and building interior and exterior repair and maintenance, cleaning, security, etc. Further, it is involved in the logistics consulting business; consultancy services; real estate brokerage activities; hotel planning, operation, and management businesses; and construction of custom homes. The company was formerly known as Tosei Fudosan Co., Ltd. and changed its name to Tosei Corporation in October 2006. Tosei Corporation was founded in 1950 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8927.T": {
        "short_name": "MEIHO ENTERPRISE CO LTD",
        "long_name": "Meiho Enterprise Co., Ltd.",
        "summary": "Meiho Enterprise Co., Ltd. engages in the real estate business in Japan. It is involved in the sale, rental, lease, and intermediation of real estate properties, including apartments, condominiums, and townhouses. The company was founded in 1968 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8931.T": {
        "short_name": "WADAKOHSAN CORP",
        "long_name": "Wadakohsan Corporation",
        "summary": "Wadakohsan Corporation develops and sells condominiums, detached houses, and residential land in Japan. It also rents, leases, and manages condominiums, stores, and parking lots. The company was founded in 1899 and is headquartered in Kobe, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kobe"
    },
    "8995.T": {
        "short_name": "MAKOTO CONSTRUCTION CO.LTD",
        "long_name": "Makoto Construction Co,Ltd",
        "summary": "Makoto Construction Co,Ltd, a construction company, designs, constructs, and sells in-houses in Japan. It constructs condominiums and custom homes; and provides remodeling services. The company was founded in 1977 and is headquartered in Sakai, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Sakai"
    },
    "9639.T": {
        "short_name": "SANKYO FRONTIER CO",
        "long_name": "Sankyo Frontier Co.,Ltd.",
        "summary": "Sankyo Frontier Co.,Ltd. produces, sells, and rents modular buildings, self-storage, and multistory parking devices in Japan and internationally. Its products are used in various applications, such as construction site offices, temporary emergency housing, shops, offices, schools, medical facilities, etc. The company was founded in 1969 and is headquartered in Kashiwa, Japan. Sankyo Frontier Co.,Ltd. is a subsidiary of Wako Kosan Y.K.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Kashiwa"
    },
    "DIFTY": {
        "short_name": "DAITO TRUST CONSTRUCTION CO",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "DITTF": {
        "short_name": "DAITO TRUST CONSTRUCTION CO",
        "long_name": "Daito Trust Construction Co.,Ltd.",
        "summary": "Daito Trust Construction Co.,Ltd. designs and constructs apartments, condominiums, rental office buildings, factories, and warehouses in Japan. It operates through three segments: Construction, Real Estate, and Other. The company also constructs mid- to high-rise rental condominiums in metropolitan area; produces and constructs steel frames and sells exterior products; manages rental buildings and provides customer services; and offers rental building brokerage and tenant recruitment services. In addition, it offers agency guarantee and rental building real estate agency services; constructs LP gas plants and supplies LP gas to rental buildings; supplies and sells energy, such as electric power to rental buildings; and operates elderly day care centers and nurseries. Further, the company provides home care, in-home support planning, home visit nursing care, support for people with disabilities, housekeeper referrals, and nursing care personnel introduction services; operates hotels in Malaysia; and handles financing, such as construction funds. Additionally, it sells insurance to rental housing owners and tenants; offers payment services for credit card settlements and other payment methods; provides consulting services for trust businesses centered on real estate management trusts, as well as asset succession and asset management; and offers document shipping and shredding, printing, and clerical work services. The company was founded in 1974 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "HZJ.F": {
        "short_name": "HEIWA REAL ESTATE",
        "long_name": "Heiwa Real Estate Co., Ltd.",
        "summary": "Heiwa Real Estate Co., Ltd. operates as a real estate company in Japan. The company develops, leases, administrates, and manages stock exchange buildings, office buildings, commercial facilities, and residential buildings; develops and sells residential buildings; and provides real estate agency services. It is also involved in the building facility maintenance and management, repair work contracting, civil engineering and construction contracting, property management, investment management, real estate brokerage, and insurance agency businesses. In addition, the company engages in the operation of halls and conference rooms, and parking lots; and management of restaurants. Heiwa Real Estate Co., Ltd. was founded in 1947 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MFU.F": {
        "short_name": "MITSUI FUDOSAN LTD",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MITEF": {
        "short_name": "MITSUBISHI ESTATE CO",
        "long_name": "Mitsubishi Estate Co., Ltd.",
        "summary": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 13 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MITEY": {
        "short_name": "MITSUBISHI ESTATE CO",
        "long_name": "Mitsubishi Estate Co., Ltd.",
        "summary": "Mitsubishi Estate Co., Ltd. engages in the real estate activities in Japan and internationally. The company is involved in the development, leasing, property management, and sale of office buildings; planning, development, and tenant leasing of retail facilities/outlets; investment, development, operational management, and asset management of logistics facilities; operation of 13 hotels under the Royal Park Hotels brand in Japan and the Marunouchi Hotel in the Marunouchi area; and operation of Takamatsu Airport, Miyako Shimojishima Airport Terminal, Mt. Fuji Shizuoka Airport, and seven airports in Hokkaido. It also engages in the development and rebuilding, redevelopment, purchasing and sale, brokerage, and management of condominiums; and rental of apartments. In addition, the company provides real estate investment trust, as well as private placement funds management services. Further, it offers architectural design and engineering services, including construction, civil engineering, and urban and regional development planning and consulting. Additionally, the company provides real estate problem-solving solutions, such as real estate brokerage, condominium and office building leasing management support, and real estate appraisal. Mitsubishi Estate Co., Ltd. was founded in 1890 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MTSFF": {
        "short_name": "MITSUI FUDOSAN",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "MTSFY": {
        "short_name": "MITSUI FUDOSAN",
        "long_name": "Mitsui Fudosan Co., Ltd.",
        "summary": "Mitsui Fudosan Co., Ltd. operates as a real estate company in Japan. It operates through four segments: Leasing, Property Sales, Management, and Other. The Leasing segment leases office buildings and commercial facilities, and other properties. The Property Sales segment is involved in the sale of condominiums and detached housing to individuals; and rental housing and office buildings and other to investors.  The Management segment engages in the property management and brokerage and asset management businesses. The Other segment engages in the housing construction and renovation business; and housing related material sales business. The company also offers car park leasing services; and operates hotels, golf courses, and resort facilities. In addition, it engages in the renewal work for offices and retail facilities; and electricity transmission and distribution and heat supply businesses, as well as operates as a retailer of flowers and ornamental plants, seeds, and other gardening products. The company was founded in 1941 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "T8F.F": {
        "short_name": "TOKYU FUDOSAN HOLDINGS",
        "long_name": "Tokyu Fudosan Holdings Corporation",
        "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "TTUUF": {
        "short_name": "TOKYU FUDOSAN HOLDINGS CORPORAT",
        "long_name": "Tokyu Fudosan Holdings Corporation",
        "summary": "Tokyu Fudosan Holdings Corporation, together with its subsidiaries, engages in the real estate business in Japan and internationally. The company operates through seven segments: Urban Development, Residential, Property Management, Real-Estate Agents, Wellness, Tokyu Hands, and Innovation Business segments. The Urban Development segment develops, leases, and operates office buildings, renewable energy power facilities, logistics facilities, and other properties; and sells properties for investors. The Residential segment develops and sells condominiums and detached housings. The Property Management segment manages, operates, and renovates condominiums, buildings, commercial facilities, public facilities, and public housings; and constructs common areas of condominiums. The Real-Estate Agents segment provides real estate brokerage and property sales services. The Wellness segment develops and sells membership resort hotels and country houses; and owns and manages resort facilities, urban style hotels, senior housings, and membership sports clubs. The Tokyu Hands segment is involved in the retail sale of materials and products for living and D-I-Y. The Innovation Business segment develops, sells, and leases condominiums and other properties, as well as constructs residential homes and others. Tokyu Fudosan Holdings Corporation was founded in 2013 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate - Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}