{
    "1400.T": {
        "short_name": "RUDEN HOLDINGS CO.LTD.",
        "long_name": "RUDEN HOLDINGS Co.,Ltd.",
        "summary": "RUDEN HOLDINGS Co.,Ltd. provides house care services. It offers wall coating services for new houses; and flooring services, as well as remodels interiors and sells home appliances. The company also develops and sells real estate properties; provides real estate brokerage and consulting services; and manages buildings, condominiums, and public facilities, as well as provides cleaning services. Ruden Holdings Co.,Ltd. was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0031",
        "website": "http://www.ruden.jp",
        "market_cap": "Small Cap"
    },
    "2780.T": {
        "short_name": "KOMEHYO HOLDINGS CO LTD",
        "long_name": "Komehyo Holdings Co.,Ltd.",
        "summary": "Komehyo Holdings Co.,Ltd. engages in the purchase and sale of used and new products through stores in Japan. The company offers jewelry, metals, clocks, bags, cloths, cameras, musical instruments, and other stocks, as well as car tire, aluminum wheel, and auto equipment. It is also involved in the lease of real estate properties. The company was founded in 1947 and is based in Nagoya, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Nagoya",
        "zipcode": "460-0011",
        "website": "http://www.komehyo.co.jp",
        "market_cap": "Small Cap"
    },
    "2974.F": {
        "short_name": "DAIEISANGYO CO LTD",
        "long_name": "DAIEISANGYO Co.,Ltd.",
        "summary": "DAIEISANGYO Co.,Ltd. engages in the condominium and housing business in Japan. The company primarily sells newly built condominiums and single-family homes. It is also involved in the development and sale of residential land; housing construction contract; and planning and sale of used homes, as well as planning, design, construction of housing renovation projects. DAIEISANGYO Co.,Ltd. was founded in 1968 and is headquartered in Kitakyushu, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kitakyushu",
        "zipcode": "807-0075",
        "website": "http://www.daieisangyo.co.jp",
        "market_cap": "Small Cap"
    },
    "2975.T": {
        "short_name": "STAR MICA HLDGS CO",
        "long_name": "Star Mica Holdings Co., Ltd.",
        "summary": "Star Mica Holdings Co., Ltd., through its subsidiaries, acquires, renovates, manages, rents, and sells pre-owned condominiums in Japan. The company also provides brokerage services for pre-owned condominium units and other real estate properties; consulting services; and real estate planning and leasing management services. In addition, it offers private banking and investment advisory services. Star Mica Holdings Co., Ltd. was incorporated in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-6028",
        "website": "http://www.starmica-holdings.co.jp",
        "market_cap": "Small Cap"
    },
    "2978.T": {
        "short_name": "TSUKURUBA INC",
        "long_name": "tsukuruba inc.",
        "summary": "tsukuruba inc. offers technology-powered property-related services. It provides cowcamo, a real estate online brokerage platform for used and renovated properties. The company also offers Shared Workplace that provides solutions related to workplace, including Facility Design for office search, design, and relocation consulting services; HEYSHA, which offers office spaces for startups; and co-ba, a subscription-based co-working offices. The company also offers Creative Team, a community of engineers, designers, and architects comprising tsukuruba studios, a place of experiment that crosses modern design. The company was founded in 2011 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "153-0051",
        "website": "http://tsukuruba.com",
        "market_cap": "Small Cap"
    },
    "2982.T": {
        "short_name": "AD WORKS GRP CO LTD",
        "long_name": "A.D. Works Group Co., Ltd.",
        "summary": "A.D. Works Group Co., Ltd. operates in the real estate business. It engages in the real estate leasing and sale activities. The company is also involved in the provision of property management and real estate consulting services, as well as in the real estate tech business. In addition, it offers renovation and repair services. The company was founded in 1886 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.adwg.co.jp",
        "market_cap": "Small Cap"
    },
    "3003.T": {
        "short_name": "HULIC CO LTD",
        "long_name": "Hulic Co., Ltd.",
        "summary": "Hulic Co., Ltd. engages in the investment, development, rental, sale, and brokerage of real estate properties in Japan. The company operates through two segments, Real Estate and Insurance. Its property portfolio includes office buildings, commercial buildings, residential and retail properties, hotels, and others. As of December 31, 2019, the company had a portfolio of approximately 254 lease properties. It also engages in the asset management and insurance agency businesses. Hulic Co., Ltd. was founded in 1957 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.hulic.co.jp",
        "market_cap": "Mid Cap"
    },
    "3228.T": {
        "short_name": "SANEI ARCHITECTURE PLANNING CO ",
        "long_name": "Sanei Architecture Planning Co.,Ltd.",
        "summary": "Sanei Architecture Planning Co.,Ltd. engages in the real estate business in Japan and internationally. The company designs, builds, and sells single-family houses, apartments, and condominiums. It also acts as a general contractor, as well as undertakes custom-built housing contracts. In addition, the company provides real estate investment properties; develops and sells rental properties; and purchases and rents residential and office buildings, as well as designs offices. Sanei Architecture Planning Co.,Ltd. was founded in 1993 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0632",
        "website": "http://www.san-a.com",
        "market_cap": "Small Cap"
    },
    "3231.T": {
        "short_name": "NOMURA REAL ESTATE HOLDINGS INC",
        "long_name": "Nomura Real Estate Holdings, Inc.",
        "summary": "Nomura Real Estate Holdings, Inc. operates as a real estate company in Japan and internationally. The company develops, leases, and manages office buildings, commercial facilities, logistics facilities, and hotels; develops and sells condominiums and houses; operates housing with services for the elderly; develops rental properties; provides Internet advertising services for housing and living assistance services; provides asset management services for real estate securitization, including REITs and private placement funds and securities funds; and provides real estate brokerage and consulting, insurance agency, and real estate information Website management services. The company also engages in the management of properties, such as condominiums, office buildings, and educational facilities; provision of renovation and repair work for tenants; remodeling of condominiums and housing; and provision of cleaning services for condominiums and office buildings. In addition, it participates in, promotes, and supports urban development projects and reconstruction of housing complexes; and manages fitness clubs. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0566",
        "website": "http://www.nomura-re-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "3237.T": {
        "short_name": "INTRANCE CO.LTD",
        "long_name": "Intrance Co.,Ltd.",
        "summary": "Intrance Co.,Ltd. operates as a real estate company in Japan. The company engages in the investment and revitalization of real estate properties, such as commercial and office buildings, and residences; property management activities, including building management, complaint handling, cleaning, patrol, meter reading, and rent collection; and acquisition, development, sale, and operation of accommodation facilities. It also offers real estate consulting services; grows, produces, wholesales, and sells herbs that include basil and rosemary; and operates hotels and resorts, as well as a restaurant. The company was founded in 1998 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0043",
        "website": "http://www.intrance.jp",
        "market_cap": "Small Cap"
    },
    "3245.T": {
        "short_name": "DEAR LIFE CO.LTD",
        "long_name": "Dear Life Co.,Ltd.",
        "summary": "Dear Life Co.,Ltd. engages in the real estate business in Japan. It develops residential, commercial, and office buildings; provides real estate planning, design, construction supervision services, etc.; resells residential properties; and invests in real estate properties. The company also provides temporary staffing services for the real estate industry; advertising services; and outsourcing services, such as payment management and delinquency guarantee services to trunk room/rental storage space operator; and operates rental storage spaces. It sells its property through real estate agencies. Dear Life Co.,Ltd. was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0073",
        "website": "http://www.dear-life.co.jp",
        "market_cap": "Small Cap"
    },
    "3254.T": {
        "short_name": "PRESSANCE CORPORATION",
        "long_name": "Pressance Corporation",
        "summary": "Pressance Corporation engages in the real estate business in Japan. It is involved in the sale of newly-built condominiums; sale and brokerage of land; rental and management of buildings and apartments; management and operation of parking lots; and planning, consultation, and survey of other residential land and buildings. The company is also engaged in the hotel business. The company was founded in 1997 and is headquartered in Osaka, Japan. As of January 14, 2021, Pressance Corporation operates as a subsidiary of Open House Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "540-6027",
        "website": "http://www.pressance.co.jp",
        "market_cap": "Small Cap"
    },
    "3261.T": {
        "short_name": "GRANDES INC",
        "long_name": "GRANDES, Inc.",
        "summary": "GRANDES, Inc. engages in the construction and sale of real estate properties in Japan. The also company plans, develops, and provides investment condominiums, maisonette-type apartments for investment, and simple urban accommodations; and rents apartments and tenant buildings. In addition, it provides construction contracting; and construction and real estate consulting services. The company was founded in 2006 and is headquartered in Oita, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Oita",
        "zipcode": "870-0034",
        "website": "http://www.grandes.jp",
        "market_cap": "Small Cap"
    },
    "3275.T": {
        "short_name": "HOUSECOM CORPORATION",
        "long_name": "Housecom Corporation",
        "summary": "Housecom Corporation primarily engages in the real estate rental brokerage and management business in Japan. The company is also involved in the property insurance agency business. As of September 30, 2020, it operated 186 directly operated stores and 1 FC store in the Tokyo metropolitan areas of Kanto, Tokai, and Kansai. The company was formerly known as Kansai Housecom Corporation and changed its name to Housecom Corporation in December 2003. The company was founded in 1998 and is headquartered in Tokyo, Japan. Housecom Corporation is a subsidiary of Daito Trust Construction Co.,Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "108-0075",
        "website": "http://www.housecom.jp",
        "market_cap": "Small Cap"
    },
    "3277.T": {
        "short_name": "SANSEI LANDIC CO LTD",
        "long_name": "Sansei Landic Co.,Ltd",
        "summary": "Sansei Landic Company Limited engages in the real estate and construction businesses in Japan. The company plans, purchases, sells, and manages the limited property rights of the land. It also procures and sells real estate properties that involve rights adjustments relating to leasehold land, properties with existing residence, and other pieces of real estate. In addition, the company plans, designs, constructs, renovates, rehabilitates, reforms, and manages custom designed homes. It offers its products and services in Osaka, Sapporo, Sendai, Tokyo, Musashino, Yokohama, Nagoya, Kyoto, Kansai, and Fukuoka locations. The company was formerly known as Sansei Service Co., Ltd. and changed its name to Sansei Landic Company Limited in February 1997. Sansei Landic Company Limited was founded in 1976 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0005",
        "website": "http://www.sansei-l.co.jp",
        "market_cap": "Small Cap"
    },
    "3293.T": {
        "short_name": "AZUMA HOUSE CO LTD",
        "long_name": "Azuma House Co., Ltd.",
        "summary": "Azuma House Co., Ltd. engages in real estate and construction businesses in Japan. The company constructs and sells condominiums and ready-built homes; sells land; and provides order construction, renovation, and real estate brokerage services. It is also involved in real estate leasing and rental management, leasing brokerage, and care businesses; asset management proposal-rental housing construction; sale of ready-built rental housing properties; and hotel and restaurant businesses. The company was founded in 1977 and is headquartered in Wakayama, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Wakayama",
        "zipcode": "640-8341",
        "website": "http://www.azumahouse.com",
        "market_cap": "Small Cap"
    },
    "3297.T": {
        "short_name": "TOUBUJYUHAN CO LTD",
        "long_name": "Toubujyuhan Co.,Ltd.",
        "summary": "Toubujyuhan Co., Ltd. engages in the real estate business in Japan. The company is involved in the real estate trading, leasing, selling, and management businesses, as well as used homes and condominiums remodeling activities. It also sells and rents long-term care and welfare-related products; and undertakes long-term care remodeling work, as well as offers real estate insurance services. The company was founded in 1984 and is headquartered in Shimonoseki, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shimonoseki",
        "zipcode": "750-0014",
        "website": "http://www.toubu.co.jp",
        "market_cap": "Small Cap"
    },
    "3300.T": {
        "short_name": "AMBITION CORPORATION",
        "long_name": "Ambition Corporation",
        "summary": "Ambition Corporation buys, sells, and rents real estate properties in Japan and internationally. The company also provides property and rental management, private short-term lodging, insurance, IoT, housekeeping agency, and corporate member services. In addition, it is involved in Internet and corporate sale businesses. Ambition Corporation was incorporated in 2007 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.am-bition.jp",
        "market_cap": "Small Cap"
    },
    "3464.T": {
        "short_name": "PROPERTY AGENT INC",
        "long_name": "Property Agent Inc.",
        "summary": "Property Agent Inc. engages in the real estate business in Japan. It is also involved in the real estate development and sale, property and rental management, brokerage, and building management, as well as real estate crowdfunding businesses. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-1306",
        "website": "http://www.propertyagent.co.jp",
        "market_cap": "Small Cap"
    },
    "3467.T": {
        "short_name": "AGRATIO URBAN DESIGN INC",
        "long_name": "Agratio urban design Inc.",
        "summary": "Agratio urban design Inc. engages in the housing business in Japan. It designs, constructs, and distributes detached houses; and provides research and consulting services for selling houses. The company was founded in 2009 and is headquartered in Shinjuku, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shinjuku",
        "zipcode": "163-0231",
        "website": "http://www.agr-urban.co.jp",
        "market_cap": "Small Cap"
    },
    "3479.T": {
        "short_name": "TKP CORPORATION",
        "long_name": "TKP Corporation",
        "summary": "TKP Corporation provides meeting rooms rental services in Japan and internationally. It also operates hotel banquet halls, business and compact hotels, ryokans, and restaurants. In addition, the company provides outsourcing, travel, party, and catering services; and produces and sells bento. Further, it offers video, audio, and lighting and TV meeting system rental services, as well as interpretation system and MC arrangement services; and call center and BPO services. The company was founded in 2005 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0844",
        "website": "http://www.tkp.jp",
        "market_cap": "Small Cap"
    },
    "3482.T": {
        "short_name": "LOADSTAR CAPITAL K K",
        "long_name": "Loadstar Capital K.K.",
        "summary": "Loadstar Capital K.K. engages in real estate investment business in Japan. The company invests in, purchases, manages, and sells office buildings, multipurpose buildings, apartment buildings, etc., as well as provides real estate brokerage and consulting services. It also operates OwnersBook, a real estate investment crowdfunding platform; and provides asset management services. The company was founded in 2012 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://loadstarcapital.com",
        "market_cap": "Small Cap"
    },
    "3484.T": {
        "short_name": "TENPO INNOVATION CO LTD",
        "long_name": "Tenpo Innovation Co.,Ltd.",
        "summary": "Tenpo Innovation Co., Ltd. engages in leasing store properties for restaurants primarily in Tokyo, Japan. The company leases store properties rented from real estate owners to store entrants. It also sells real estate properties. The company was formerly known as Tenpo Renovation Co., Ltd. and changed its name to Tenpo Innovation Co., Ltd. in May 2013. Tenpo Innovation Co., Ltd. was founded in 2005 and is headquartered in Tokyo, Japan. Tenpo Innovation Co., Ltd. is a subsidiary of Crops Corporation.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.tenpo-r.co.jp",
        "market_cap": "Small Cap"
    },
    "3489.T": {
        "short_name": "FAITHNETWORK CO LTD",
        "long_name": "FaithNetwork Co.,Ltd",
        "summary": "FaithNetwork Co.,Ltd engages in the real estate investment and construction activities in Japan. It offers apartment buildings under the GranDuo and Grand Funding brands. The company was founded in 2001 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0051",
        "website": "http://www.faithnetwork.jp",
        "market_cap": "Small Cap"
    },
    "3490.T": {
        "short_name": "AZPLANNING CO LTD",
        "long_name": "Azplanning Co.,Ltd.",
        "summary": "Azplanning Co.,Ltd. engages in the real estate development business in Japan. It is involved in the real estate and business hotel trading activities; leasing of buildings for business, such as stores, offices, warehouses, etc., as business hotels; and provision of real estate management intermediary, architectural renovation, and real estate management incidental services. The company was founded in 1989 and is headquartered in Kawaguchi, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kawaguchi",
        "zipcode": "333-0811",
        "website": "http://www.azplan.co.jp",
        "market_cap": "Small Cap"
    },
    "3494.T": {
        "short_name": "MULLION CO LTD",
        "long_name": "Mullion Co., Ltd.",
        "summary": "Mullion Co., Ltd. provides real estate services in Japan. It owns and manages real estate properties, including residential, store, office properties, as well as offers real estate securitization services. The company also purchases and sells real estate properties. Mullion Co., Ltd. was founded in 1986 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0067",
        "website": "http://www.mullion.co.jp",
        "market_cap": "Small Cap"
    },
    "3495.T": {
        "short_name": "KORYOJYUHAN CO LTD",
        "long_name": "Koryojyuhan Co., Ltd.",
        "summary": "Koryojyuhan Co., Ltd. operates as a real estate company. It provides rental agency and monthly apartment handling services; and elderly housing and pay nursing home facilities. The company is also involved in the real estate brokerage and purchase/sale businesses; sale of residential land; and development and sale of real estate properties. In addition, it provides leasing management services, including rental management, vacant house management, and subleasing services; and revenue real estate consulting services. Further, the company operates coin parking, coin laundry, and trunk room and bike garage; and photovoltaic power generation facility. Koryojyuhan Co., Ltd. was founded in 1982 and is headquartered in Mito, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Mito",
        "zipcode": null,
        "website": "http://www.koryo-j.co.jp",
        "market_cap": "Small Cap"
    },
    "3496.T": {
        "short_name": "AZOOM CO LTD",
        "long_name": "Azoom Co.,Ltd",
        "summary": "AZoom co., Ltd. engages in buying and selling, mediation, management, and leasing of real estate. It is also involved in business development through Internet; Internet media development and operation; and management of parking lots. The company was founded in 2009 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "151-0053",
        "website": "http://azoom.jp",
        "market_cap": "Small Cap"
    },
    "3497.T": {
        "short_name": "LETECH CORPORATION",
        "long_name": "LeTech Corporation",
        "summary": "LeTech Corporation engages in the real estate business. It is involved in the housing and commercial development, and conversion and renovation; real estate consulting; facility management; and nursing care businesses. The company also offers real estate rental Services. The company was formerly known as Legal Corporation and changed its name to LeTech Corporation in February 2021. LeTech Corporation was founded in 2000 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0027",
        "website": "http://www.letech-corp.net",
        "market_cap": "Small Cap"
    },
    "3521.T": {
        "short_name": "ECONACH HOLDINGS CO LTD",
        "long_name": "Econach Holdings Co.,Ltd.",
        "summary": "Econach Holdings Co.,Ltd. operates in the spa and real estate businesses in Japan. The company also sells and rents real estate properties, as well as owns shares. In addition, it manufactures and sells lace and embroidery products. The company was formerly known as Econach Co., Ltd. and changed its name to Econach Holdings Co.,Ltd. in August 2010. Econach Holdings Co.,Ltd. was founded in 1926 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.econach.co.jp",
        "market_cap": "Small Cap"
    },
    "3750.T": {
        "short_name": "FRACTALE CORPORATION",
        "long_name": "FRACTALE Corporation",
        "summary": "FRACTALE Corporation engages in the financial and real estate businesses in Japan. The company owns and manages real estate properties; buys and sells properties; and develops and operates hotels, as well as engages in regenerative medicine research and development. The company was formerly known as Seven Seas Holdings Co.,Ltd. FRACTALE Corporation was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://frac-tale.co.jp",
        "market_cap": "Small Cap"
    },
    "4437.T": {
        "short_name": "GOODDAY HOLDINGS INC",
        "long_name": "gooddays holdings, Inc.",
        "summary": "gooddays holdings, Inc. leases housing properties in Japan. It also provides IT services. The company was founded in 2016 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "102-0085",
        "website": "http://www.gooddays.jp",
        "market_cap": "Small Cap"
    },
    "8804.T": {
        "short_name": "TOKYO TATEMONO CO",
        "long_name": "Tokyo Tatemono Co., Ltd.",
        "summary": "Tokyo Tatemono Co., Ltd. operates as a real estate company in Japan. The company operates through Commercial Properties, Residence, Asset Service, and Senior & Child Care segments. It develops, leases, and manages office buildings, commercial facilities, and condominiums; and sells condominiums and detached houses. The company also provides real estate sales, brokerage, and consulting services, as well as is involved in parking lot operations; and develops and operates residences for elderly people and child-care. In addition, it engages in resort, distribution facility development, asset management, and real estate appraisal businesses. Tokyo Tatemono Co., Ltd. was incorporated in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8285",
        "website": "http://www.tatemono.com",
        "market_cap": "Mid Cap"
    },
    "8806.T": {
        "short_name": "DAIBIRU CORP",
        "long_name": "Daibiru Corporation",
        "summary": "Daibiru Corporation, together with its subsidiaries, owns, operates, manages, and leases real estate properties in Japan. It owns and leases 30 properties for offices, hotel buildings, and retail complexes in central Tokyo, Osaka, and Sapporo. The company also leases residence halls for students; and apartment buildings for business people on temporary assignment, as well as condominiums for families. In addition, it offers facility management services; and real estate agency services for office properties, as well as engages in construction works relating to buildings, such as repairs originating from its building maintenance operations. The company was formerly known as Osaka Tatemono Co., Ltd. and changed its name to Daibiru Corporation in January 1992. The company was founded in 1923 and is headquartered in Osaka, Japan. Daibiru Corporation is a subsidiary of Mitsui O.S.K. Lines, Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0005",
        "website": "http://www.daibiru.co.jp",
        "market_cap": "Small Cap"
    },
    "8818.T": {
        "short_name": "KEIHANSHIN BUILDING CO LTD",
        "long_name": "Keihanshin Building Co., Ltd.",
        "summary": "Keihanshin Building Co., Ltd., a building management company, leases buildings in Japan. The company leases office buildings, datacenter buildings, commercial buildings, logistics warehouses, and off-course betting parlors. It is also involved in subcontracting construction work for lease facilities; and the provision of building maintenance services. The company was formerly known as Keihanshin Real Estate Co., Ltd. and changed its name to Keihanshin Building Co., Ltd. in October 2011. Keihanshin Building Co., Ltd. was founded in 1948 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "541-0048",
        "website": "http://www.keihanshin.co.jp",
        "market_cap": "Small Cap"
    },
    "8842.T": {
        "short_name": "TOKYO RAKUTENCHI CO",
        "long_name": "Tokyo Rakutenchi Co.,Ltd.",
        "summary": "Tokyo Rakutenchi Co.,Ltd. manages and operates real estate properties in Japan. The company also engages in the operation of cinemas, coffee shops, and restaurants; hot bath and futsal businesses; and provision of building management services, such as cleaning, facility management, and security. Tokyo Rakutenchi Co.,Ltd. was founded in 1937 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "130-8535",
        "website": "http://www.rakutenchi.co.jp",
        "market_cap": "Small Cap"
    },
    "8848.T": {
        "short_name": "LEOPALACE 21 CORP",
        "long_name": "Leopalace21 Corporation",
        "summary": "Leopalace21 Corporation, together with its subsidiaries, engages in the construction, leasing, and sale of apartments, condominiums, and residential housing in Japan. It operates through four segments: Leasing Business; Development Business; Elderly Care Business; and Hotels, Resort and Other Businesses. The Leasing Business segment engages in the leasing and management of apartment buildings and other properties; repair work; broadband internet service; rent obligation guarantee; and company residence agency, solar power generation, and small-amount short-term insurance and other businesses. The Development Business segment is involved in the construction subcontracting of apartments and detached houses; and development of condominiums and others. The Elderly Care Business segment operates elderly care facilities under the Azumi En brand. This segment also offers day services, short stays, elderly homes with nursing care services/residential style elderly homes, home visits, and home care support services. The Hotels, Resort and Other Businesses segment engages in the operation of hotels; operation and management of resort facilities on the island of Guam; and provision of travel agency, clerical agency, and other services. The company was formerly known as MDI Corporation and changed its name to Leopalace21 Corporation in July 2000. Leopalace21 Corporation was founded in 1973 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-8622",
        "website": "http://www.leopalace21.com",
        "market_cap": "Small Cap"
    },
    "8869.T": {
        "short_name": "MEIWA ESTATE CO",
        "long_name": "Meiwa Estate Company Limited",
        "summary": "Meiwa Estate Company Limited develops, sells, and manages condominiums in Japan. It also engages in real estate leasing and brokerage activities. The company was incorporated in 1942 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-8555",
        "website": "http://www.meiwajisyo.co.jp",
        "market_cap": "Small Cap"
    },
    "8877.T": {
        "short_name": "ESLEAD CORPORATION",
        "long_name": "Eslead Corporation",
        "summary": "Eslead Corporation develops and sells family-type and urban condominiums in Japan. The company also rebuilds and sells condominiums. In addition, it is involved in building and condominium management, real estate brokerage, detached house sales, power supply, hotel, and condominium and building cleaning businesses. The company was formerly known as Nihon Eslead Corporation and changed its name to Eslead Corporation in October 2019. The company was founded in 1992 and is headquartered in Osaka, Japan. Eslead Corporation is a subsidiary of Mori Trust Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "553-0003",
        "website": "http://www.eslead.co.jp",
        "market_cap": "Small Cap"
    },
    "8881.T": {
        "short_name": "NISSHIN GROUP HLDGS CO LTD",
        "long_name": "NISSHIN GROUP HOLDINGS Company, Limited",
        "summary": "NISSHIN GROUP HOLDINGS Company, Limited plans, develops, manages, and sells condominiums under the Palace stage and Duo stage brands. It is also involved in the property rental and real estate businesses. In addition, the company engages in the construction work, civil engineering work, etc.; rental management and remodeling activities; real estate securitization business, such as investment corporation management contracts; and purchase, resale, and renovation business of used condominiums. Further, it offers mortgage guarantee and housing funds loans to condominium buyers; and plans and sells detached houses. NISSHIN GROUP HOLDINGS Company, Limited was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-8411",
        "website": "http://www.nisshinfudosan.co.jp",
        "market_cap": "Small Cap"
    },
    "8889.T": {
        "short_name": "APAMAN CO LTD",
        "long_name": "Apaman Co., Ltd.",
        "summary": "Apaman Co., Ltd. operates a real estate portal in Japan. It provides Apamanshop, a real estate portal that provides domestic and overseas rental and monthly property information, and trading and investment property information. The company was formerly known as Apamanshop Holdings Co., Ltd. and changed its name to Apaman Co., Ltd. in January 2018. Apaman Co., Ltd. was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.apamanshop-hd.co.jp",
        "market_cap": "Small Cap"
    },
    "8890.T": {
        "short_name": "RAYSUM CO LTD",
        "long_name": "Raysum Co., Ltd.",
        "summary": "Raysum Co., Ltd. engages in the real estate investment business in Japan. It also operates community hostels; and a specialized surgery center that offers medical care services to assist the elderly. The company was formerly known as Recrm Research Co., Ltd. and changed its name to Raysum Co., Ltd. in 2008. Raysum Co., Ltd. was founded in 1992 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0013",
        "website": "http://www.raysum.co.jp",
        "market_cap": "Small Cap"
    },
    "8893.T": {
        "short_name": "SHIN-NIHON TATEMONO CO",
        "long_name": "Shin-Nihon Tatemono Co., Ltd.",
        "summary": "Shin-Nihon Tatemono Co., Ltd. operates as a real estate developer in Japan. The company develops and sells family and compact condominiums, and residential houses, as well as provides real estate solutions. It also manages and sub-leases condominiums and apartments; provides building renovation services; undertakes various construction projects, such as detached housing projects, apartments and condominiums, and commercial facilities; and offers real estate consulting services. Shin-Nihon Tatemono Co., Ltd. was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-0022",
        "website": "http://www.kksnt.co.jp",
        "market_cap": "Small Cap"
    },
    "8894.T": {
        "short_name": "REVOLUTION CO LTD",
        "long_name": "Revolution Co., Ltd.",
        "summary": "Revolution Co., Ltd. engages in real estate rental management business in Japan. It is involved in the arrangement, management, and repair of rental properties; weekly/monthly rental, real estate brokerage, and ready-built and renovation businesses; and playback sales of used equipment. The company was formerly known as Harakosan Co., Ltd. and changed its name to Revolution Co., Ltd. in November 2019. Revolution Co., Ltd. was founded in 1986 and is headquartered in Shimonoseki, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Shimonoseki",
        "zipcode": "750-0016",
        "website": "http://www.harakosan.co.jp",
        "market_cap": "Small Cap"
    },
    "8898.T": {
        "short_name": "CENTURY21 REAL ESTATE OF JAPAN",
        "long_name": "Century21 Real Estate of Japan Ltd",
        "summary": "Century21 Real Estate of Japan Ltd. operates as a franchise real estate company in Japan. It provides services to buyers and sellers of real estate. The company also offers education and training services for managers and sales people. In addition, it implements information systems; and joint advertisements, such as television commercials, as well as provides financial services for merchants and merchant customers. The company was founded in 1971 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0061",
        "website": "http://www.century21.jp",
        "market_cap": "Small Cap"
    },
    "8903.T": {
        "short_name": "SUNWOOD CORPORATION",
        "long_name": "Sunwood Corporation",
        "summary": "Sunwood Corporation develops and sells condominiums in Japan. It is also involved in the real estate agency and brokerage, operation and management, and renovation and remodeling activities; and real estate renovation for sale. The company was founded in 1997 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0001",
        "website": "http://www.sunwood.co.jp",
        "market_cap": "Small Cap"
    },
    "8908.T": {
        "short_name": "MAINICHI COMNET CO.LTD.",
        "long_name": "Mainichi Comnet Co., Ltd.",
        "summary": "Mainichi Comnet Co., Ltd. primarily engages in the real estate business in Japan. The company is involved in planning, design supervision, consulting, and development of real estate properties; development and management of student apartments and dormitories; purchase of land and buildings; rental of housing and commercial facilities; and advertising agency business. It also engages in the development of sports facilities; and cohabitation, training, and travel planning, as well as conference, international exchange, and auto-car workshop activities. The company was founded in 1979 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0004",
        "website": "http://www.maicom.co.jp",
        "market_cap": "Small Cap"
    },
    "8909.T": {
        "short_name": "SHINOKEN GROUP CO LTD",
        "long_name": "Shinoken Group Co., Ltd.",
        "summary": "Shinoken Group Co., Ltd., through its subsidiaries, engages in the real estate, general contractor, energy, and life care businesses in Japan and internationally. It designs, constructs, purchases, rents, manages, and sells apartments and condominiums; and offers debt guarantee services, as well as short-term insurance for owners and tenants of apartments and condominiums. The company is also involved in the retail sale of LP gas and electricity to apartments and condominiums; and owning and operating of care facilities. In addition, it operates Kids Life, a daycare service for children with disabilities. The company was incorporated in 1990 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0013",
        "website": "http://www.shinoken.co.jp",
        "market_cap": "Small Cap"
    },
    "8912.T": {
        "short_name": "AREA QUEST INC",
        "long_name": "Area Quest Inc.",
        "summary": "Area Quest Inc. provides real estate solutions in Japan. It operates through Tenant Invitation, Update and Contract Management, and Building Management divisions. The company attracts tenants on behalf of building owners and managers; and provides advice and information for solving the problems related to building management, as well as meets the sales needs of building owners. It also provides building management and subleasing services. The company was founded in 2000 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-1307",
        "website": "http://www.area-quest.com",
        "market_cap": "Small Cap"
    },
    "8914.T": {
        "short_name": "AREALINK CO LTD",
        "long_name": "Arealink Co., Ltd.",
        "summary": "Arealink Co., Ltd. engages in the self-storage business in Japan. The company operates outdoor container type and indoor trunk type self-storage facilities, as well as self-storage facilities under the Hello Storage brand. It also provides rental meeting rooms under the Hello Rental Meeting Rooms brand; and small-scale rental offices under the Hello Office brand. In addition, the company offers land rights management services, including buying land rights from landowners and selling them to leaseholders. Arealink Co., Ltd. was founded in 1995 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0021",
        "website": "http://www.arealink.co.jp",
        "market_cap": "Small Cap"
    },
    "8919.T": {
        "short_name": "KATITAS CO LTD",
        "long_name": "KATITAS CO., Ltd.",
        "summary": "KATITAS CO., Ltd. purchases, remodels, and sells used homes to individuals and families in Japan. It offers its services through approximately 100 branches. The company was formerly known as Yasuragi Co., Ltd. and changed its name to KATITAS CO., Ltd. in 2013. KATITAS CO., Ltd. was founded in 1978 and is headquartered in Kiryu-shi, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Kiryu",
        "zipcode": "376-0025",
        "website": "http://katitas.jp",
        "market_cap": "Mid Cap"
    },
    "8925.T": {
        "short_name": "ARDEPRO CO LTD",
        "long_name": "ARDEPRO Co., Ltd.",
        "summary": "ARDEPRO Co., Ltd. engages in real estate revitalization business in Japan. The company was founded in 1988 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.ardepro.co.jp",
        "market_cap": "Small Cap"
    },
    "8928.T": {
        "short_name": "ANABUKI KOSAN INC",
        "long_name": "Anabuki Kosan Inc.",
        "summary": "Anabuki Kosan Inc. engages in the real estate business in Japan. It is involved in the custom home contracting, apartment contracting, real estate distribution, hotel and tenant building management, public facility consignment management, and town planning businesses, as well as sale of houses. The company also provides real estate, facility management, energy saving, condominium management, insurance, senior related, employment support, travel, human resource development, outsourcing, and advertisement services. Anabuki Kosan Inc. was founded in 1964 and is headquartered in Takamatsu, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Takamatsu",
        "zipcode": "760-0028",
        "website": "http://www.anabuki.ne.jp",
        "market_cap": "Small Cap"
    },
    "8934.T": {
        "short_name": "SUN FRONTIER FUDOSAN CO LTD",
        "long_name": "Sun Frontier Fudousan Co., Ltd.",
        "summary": "Sun Frontier Fudousan Co., Ltd. provides real estate revitalization and real estate services to building owners, asset holders, and wealthy individuals in Tokyo. It operates through Real Estate Revitalization Business, Real Estate Service Business, Operation Business, and Other segments. The company offers replanning, property management, commercial real estate brokerage, and office and store leasing services, as well as construction and renovation services for commercial properties, office buildings, and condominiums. It also provides building management, construction planning, delinquent rent guarantee, and asset consultancy services. In addition, the company engages in the hotel development and operation business. The company was founded in 1999 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0006",
        "website": "http://www.sunfrt.co.jp",
        "market_cap": "Small Cap"
    },
    "8938.T": {
        "short_name": "GLOME HOLDINGS INC",
        "long_name": "GLOME Holdings,Inc.",
        "summary": "GLOME Holdings,Inc. engages in the real estate business. The company provides medical operation consolidation; visiting nursing station operation; and medical staff recruitment and medical tourism services. It also offers property management services; renovates medical facilities; and develops related facilities, as well as hospital management support services. In addition, the company is involved in the sale and leaseback of hospital real estate. The company was formerly known as LC Holdings, Inc. and changed its name to GLOME Holdings,Inc. in October 2019. GLOME Holdings,Inc. was founded in 1987 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6022",
        "website": "http://www.glome-holdings.com",
        "market_cap": "Small Cap"
    },
    "8945.T": {
        "short_name": "SUNNEXTA GROUP INC",
        "long_name": "SUNNEXTA GROUP Inc.",
        "summary": "SUNNEXTA GROUP Inc. provides housing system management outsourcing business in Japan. It also engages in house rental management business; the provision of consultation for reform of housing system works; the provision of outsourcing services in personnel and general affairs; and cost reduction consultation and purchasing agency businesses. The company was founded in 1998 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "162-0833",
        "website": "http://www.syataku.co.jp",
        "market_cap": "Small Cap"
    },
    "8996.F": {
        "short_name": "HOUSEFREEDOM CO.LTD",
        "long_name": "HouseFreedom Co.,Ltd.",
        "summary": "HouseFreedom Co.,Ltd. engages in the construction of newly detached homes in Japan. The company also leases real estate properties, as well as provides real estate brokerage services. In addition, it offers non-life insurance agency services, such as fire and earthquake insurance; and engages in the nursing care and construction contract businesses. The company was founded in 1995 and is headquartered in Matsubara, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FKA",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Matsubara",
        "zipcode": "580-0043",
        "website": "http://www.housefreedom.co.jp",
        "market_cap": "Small Cap"
    },
    "8999.T": {
        "short_name": "GRANDY HOUSE CORPORATION",
        "long_name": "Grandy House Corporation",
        "summary": "Grandy House Corporation engages in the construction and sale of houses and custom houses in Japan. The company was formerly known as Shin Nihon Grandy Corporation and changed its name to Grandy House Corporation in 2004. Grandy House Corporation was founded in 1991 and is headquartered in Utsunomiya, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Utsunomiya",
        "zipcode": "320-0811",
        "website": "http://www.grandy.co.jp",
        "market_cap": "Small Cap"
    },
    "9423.T": {
        "short_name": "FORVAL REALSTRAIGHT INC.",
        "long_name": "Forval RealStraight Inc.",
        "summary": "Forval RealStraight Inc. provides real estate brokerage and office relocation support services in Japan. It also sells OA communication equipment. The company was formerly known as Fread Co., Ltd. and changed its name to Forval RealStraight Inc. in July 2009. Forval RealStraight Inc. was founded in 1995 and is headquartered in Tokyo, Japan. Forval RealStraight Inc. is a subsidiary of Forval Corporation.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0051",
        "website": "http://www.realstraight.co.jp",
        "market_cap": "Small Cap"
    },
    "9635.T": {
        "short_name": "MUSASHINO KOGYO CO",
        "long_name": "Musashino Kogyo Co., Ltd.",
        "summary": "Musashino Kogyo Co., Ltd. engages in the movie entertainment, real estate, and commercial businesses. The company is involved in the distribution and operation of movie theater shops. It also engages in the investment, leasing, arrangement, and sale of tenant buildings; and sale of goods, etc. Musashino Kogyo Co., Ltd. was founded in 1919 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.musashino-k.co.jp",
        "market_cap": "Small Cap"
    },
    "9661.T": {
        "short_name": "KABUKI-ZA CO LTD",
        "long_name": "Kabuki-Za Co., Ltd.",
        "summary": "Kabuki-Za Co., Ltd. engages in the leasing of real estate. The company also manages cafeterias, theaters, shops, etc. Kabuki-Za Co., Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.kabuki-za.co.jp",
        "market_cap": "Small Cap"
    },
    "9728.T": {
        "short_name": "NIPPON KANZAI CO",
        "long_name": "Nippon Kanzai Co., Ltd.",
        "summary": "Nippon Kanzai Co., Ltd. provides building management and operation, environmental facility management, and real estate fund management services in Japan. It offers building management services, including safety, equipment, and energy, and other management services; and cleaning, cash, security, liaison, and indoor operation, as well as engages in administrative and building repair works. The company also provides engineering services comprising building and seismic diagnosis, repair work, repair plan, database, and engineering report services. In addition, it is involved in the property and residential management, management consulting, temporary staffing, and other businesses. The company was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.nkanzai.co.jp",
        "market_cap": "Small Cap"
    },
    "9761.T": {
        "short_name": "TOKAI LEASE CO LTD",
        "long_name": "Tokai Lease Co.,Ltd.",
        "summary": "Tokai Lease Co., Ltd. manufactures, sells, and leases temporary buildings, and fixtures and fittings in Japan. The company's solutions cover flat houses, such as convenience stores, schools, support centers, factories, post offices, fire and disaster management agencies, emergency temporary housing, government buildings, police boxes, dining rooms, offices, and toilet buildings; and unit houses comprising schools, vote counting facilities, and offices. Its solutions also cover TU suspended ceiling and partition, steel lumber, kitchen capsule, Tokai system basics, steel eaves and waist, steel steps, and air conditioner panels; and office equipment and fixtures, such as desk chairs, storage furniture, air conditioners, home appliances, outdoor and educational equipment, and others. Tokai Lease Co., Ltd. was founded in 1963 and is headquartered in Osaka, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": "530-0041",
        "website": "http://www.tokai-lease.co.jp",
        "market_cap": "Small Cap"
    },
    "9816.T": {
        "short_name": "STRIDERS CORPORATION",
        "long_name": "Striders Corporation",
        "summary": "Striders Corporation, together with its subsidiaries, engages in the real estate, hotel, overseas, and other businesses primarily in Japan. It develops and sells various logistic systems to support logistics operations. The company also offers turnaround consultancy; enterprise reconstruction and reorganization schemes; range of advisory services for mergers and acquisitions; and financial assistance services. In addition, it provides leasing services, such as market research and tenant recruitment, as well as sub-leasing services; collects rent; handles leasing renewal, cancellation, and evacuation contracts; and deals in facility trouble and tenant claims, as well as offers interior decoration and residential property management services. Further, the company offers building management services, including managing mansion units and front staff, cleaning work, and checking and maintaining building equipment, as well as rental and land agency, and rental guarantee services. Additionally, it manufactures and sells Chinese noodles; and owns, operates, and manages Narita Gateway and Kurashiki Royal Art hotels. The company also engages in the advertisement agency business in Indonesia; investment activities; and develops software application programs. Striders Corporation was founded in 1965 and is headquartered in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "105-0004",
        "website": "http://www.striders.co.jp",
        "market_cap": "Small Cap"
    },
    "MQI.F": {
        "short_name": "LEOPALACE21",
        "long_name": "Leopalace21 Corporation",
        "summary": "Leopalace21 Corporation, together with its subsidiaries, engages in the construction, leasing, and sale of apartments, condominiums, and residential housing in Japan. It operates through four segments: Leasing Business; Development Business; Elderly Care Business; and Hotels, Resort and Other Businesses. The Leasing Business segment engages in the leasing and management of apartment buildings and other properties; repair work; broadband internet service; rent obligation guarantee; and company residence agency, solar power generation, and small-amount short-term insurance and other businesses. The Development Business segment is involved in the construction subcontracting of apartments and detached houses; and development of condominiums and others. The Elderly Care Business segment operates elderly care facilities under the Azumi En brand. This segment also offers day services, short stays, elderly homes with nursing care services/residential style elderly homes, home visits, and home care support services. The Hotels, Resort and Other Businesses segment engages in the operation of hotels; operation and management of resort facilities on the island of Guam; and provision of travel agency, clerical agency, and other services. The company was formerly known as MDI Corporation and changed its name to Leopalace21 Corporation in July 2000. Leopalace21 Corporation was founded in 1973 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "164-8622",
        "website": "http://www.leopalace21.com",
        "market_cap": "Small Cap"
    },
    "N9U.F": {
        "short_name": "NOMURA REAL EST.HLDGS INC",
        "long_name": "Nomura Real Estate Holdings, Inc.",
        "summary": "Nomura Real Estate Holdings, Inc. operates as a real estate company in Japan and internationally. The company develops, leases, and manages office buildings, commercial facilities, logistics facilities, and hotels; develops and sells condominiums and houses; operates housing with services for the elderly; develops rental properties; provides Internet advertising services for housing and living assistance services; provides asset management services for real estate securitization, including REITs and private placement funds and securities funds; and provides real estate brokerage and consulting, insurance agency, and real estate information Website management services. The company also engages in the management of properties, such as condominiums, office buildings, and educational facilities; provision of renovation and repair work for tenants; remodeling of condominiums and housing; and provision of cleaning services for condominiums and office buildings. In addition, it participates in, promotes, and supports urban development projects and reconstruction of housing complexes; and manages fitness clubs. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0566",
        "website": "http://www.nomura-re-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "NFU.MU": {
        "short_name": "NISSHIN GROUP HOLDINGS CO",
        "long_name": "NISSHIN GROUP HOLDINGS Company, Limited",
        "summary": "NISSHIN GROUP HOLDINGS Company, Limited plans, develops, manages, and sells condominiums under the Palace stage and Duo stage brands. It is also involved in the property rental and real estate businesses. In addition, the company engages in the construction work, civil engineering work, etc.; rental management and remodeling activities; real estate securitization business, such as investment corporation management contracts; and purchase, resale, and renovation business of used condominiums. Further, it offers mortgage guarantee and housing funds loans to condominium buyers; and plans and sells detached houses. NISSHIN GROUP HOLDINGS Company, Limited was founded in 1975 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "160-8411",
        "website": "http://www.nisshinfudosan.co.jp",
        "market_cap": "Small Cap"
    },
    "NMEHF": {
        "short_name": "NOMURA REAL ESTATE HOLDINGS INC",
        "long_name": "Nomura Real Estate Holdings, Inc.",
        "summary": "Nomura Real Estate Holdings, Inc. operates as a real estate company in Japan and internationally. The company develops, leases, and manages office buildings, commercial facilities, logistics facilities, and hotels; develops and sells condominiums and houses; operates housing with services for the elderly; develops rental properties; provides Internet advertising services for housing and living assistance services; provides asset management services for real estate securitization, including REITs and private placement funds and securities funds; and provides real estate brokerage and consulting, insurance agency, and real estate information Website management services. The company also engages in the management of properties, such as condominiums, office buildings, and educational facilities; provision of renovation and repair work for tenants; remodeling of condominiums and housing; and provision of cleaning services for condominiums and office buildings. In addition, it participates in, promotes, and supports urban development projects and reconstruction of housing complexes; and manages fitness clubs. The company was founded in 2004 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0566",
        "website": "http://www.nomura-re-hd.co.jp",
        "market_cap": "Mid Cap"
    },
    "RL2.F": {
        "short_name": "SUMITOMO RTY DEV.",
        "long_name": "Sumitomo Realty & Development Co., Ltd.",
        "summary": "Sumitomo Realty & Development Co., Ltd. engages in the real estate business in Japan. It operates through five segments: Leasing, Sales, Construction, Brokerage, and Other. The Leasing segment leases and manages office buildings, residences, and other properties. The Sales segment sells condominiums, detached houses, and land lots. The Construction segment is involved in the construction of housing, condominiums, and buildings. The Brokerage segment offers real estate brokerage services. The Other segment is involved in the fitness and restaurant businesses. The company was formerly known as Izumi Real Estate Co., Ltd. and changed its name to Sumitomo Realty & Development Co., Ltd. in 1957. Sumitomo Realty & Development Co., Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0820",
        "website": "http://www.sumitomo-rd.co.jp/english/",
        "market_cap": "Large Cap"
    },
    "SURDF": {
        "short_name": "SUMITOMO REALTY & DEVELOPMENT C",
        "long_name": "Sumitomo Realty & Development Co., Ltd.",
        "summary": "Sumitomo Realty & Development Co., Ltd. engages in the real estate business in Japan. It operates through five segments: Leasing, Sales, Construction, Brokerage, and Other. The Leasing segment leases and manages office buildings, residences, and other properties. The Sales segment sells condominiums, detached houses, and land lots. The Construction segment is involved in the construction of housing, condominiums, and buildings. The Brokerage segment offers real estate brokerage services. The Other segment is involved in the fitness and restaurant businesses. The company was formerly known as Izumi Real Estate Co., Ltd. and changed its name to Sumitomo Realty & Development Co., Ltd. in 1957. Sumitomo Realty & Development Co., Ltd. was founded in 1949 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "163-0820",
        "website": "http://www.sumitomo-rd.co.jp/english/",
        "market_cap": "Large Cap"
    },
    "T3O.F": {
        "short_name": "TOC CO. LTD",
        "long_name": "TOC Co., Ltd.",
        "summary": "TOC Co., Ltd. primarily engages in real estate business in Japan. It leases wholesale and retail spaces, office buildings, parking lots, logistics centers, restaurants, and event hall. The company also operates sports clubs and hot bath facilities; provides linen supply and laundry, and electronic commerce/information processing services. In addition, it is involved in the manufacture and sale of health foods and cosmetics; and overhead wire hardware for distribution/communication lines, CATV/disaster prevention radio hardware, studs, etc. The company was founded in 1926 and is based in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "141-0031",
        "website": "http://www.toc.co.jp",
        "market_cap": "Small Cap"
    },
    "T6R.F": {
        "short_name": "TOKYO TATEMONO",
        "long_name": "Tokyo Tatemono Co., Ltd.",
        "summary": "Tokyo Tatemono Co., Ltd. operates as a real estate company in Japan. The company operates through Commercial Properties, Residence, Asset Service, and Senior & Child Care segments. It develops, leases, and manages office buildings, commercial facilities, and condominiums; and sells condominiums and detached houses. The company also provides real estate sales, brokerage, and consulting services, as well as is involved in parking lot operations; and develops and operates residences for elderly people and child-care. In addition, it engages in resort, distribution facility development, asset management, and real estate appraisal businesses. Tokyo Tatemono Co., Ltd. was incorporated in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8285",
        "website": "http://www.tatemono.com",
        "market_cap": "Mid Cap"
    },
    "TYTMF": {
        "short_name": "TOKYO TATEMONO CO",
        "long_name": "Tokyo Tatemono Co., Ltd.",
        "summary": "Tokyo Tatemono Co., Ltd. operates as a real estate company in Japan. The company operates through Commercial Properties, Residence, Asset Service, and Senior & Child Care segments. It develops, leases, and manages office buildings, commercial facilities, and condominiums; and sells condominiums and detached houses. The company also provides real estate sales, brokerage, and consulting services, as well as is involved in parking lot operations; and develops and operates residences for elderly people and child-care. In addition, it engages in resort, distribution facility development, asset management, and real estate appraisal businesses. Tokyo Tatemono Co., Ltd. was incorporated in 1896 and is headquartered in Tokyo, Japan.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-8285",
        "website": "http://www.tatemono.com",
        "market_cap": "Mid Cap"
    }
}