{
    "2971.T": {
        "short_name": "ESCON JAPAN REIT INVESTMENT COR",
        "long_name": "ESCON JAPAN REIT Investment Corporation",
        "summary": "Escon Japan REIT Investment Corp. is a real estate investment trust (REIT) focused on commercial facilities and was listed in 2019. It invests intensively in community-oriented commercial facilities and leasehold land located in Japan's four largest metropolitan areas. Es-Con Japan Ltd. serves as its sponsor.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "2972.T": {
        "short_name": "SANKEI REAL ESTATE INC",
        "long_name": "SANKEI REAL ESTATE Inc.",
        "summary": "SASANKEI REAL ESTATE Inc. listed on the Tokyo Stock Exchange Real Estate Investment Trust Securities Market (J-REIT market) on March 12, 2019 (TSE code: 2972; abbreviation: SANKEI REAL ESTATE). SANKEI REAL ESTATE invests mainly in major metropolitan areas (Greater Tokyo, Osaka City, and Nagoya City) by setting Â\u0093office buildings,Â\u0094 the asset type representative of Japan's real estate (securitization) market, as the primary investment target, while setting Â\u0093sub assetsÂ\u0094 as the secondary investment target in which a fixed percentage of investments are made. Â\u0093Sub assetsÂ\u0094 are asset types that possess characteristics different from Â\u0093office buildingsÂ\u0094 and which contribute to building a strong portfolio that features both revenue stability and growth capable of withstanding the cyclical real estate market. Based on the investment policy, in terms of external growth, SANKEI REAL ESTATE aims to expand the scale of its assets by establishing an Â\u0093asset recycling business modelÂ\u0094 with the sponsor group (the Sankei Building Group), which undertakes the Â\u0093Urban Development, Hotels & ResortsÂ\u0094 operations of media conglomerate Fuji Media Holdings, and thereby secure a pipeline of Â\u0093office buildingsÂ\u0094 and Â\u0093sub assetsÂ\u0094 developed and/or owned by the sponsor. In terms of internal growth, SANKEI REAL ESTATE aims to maintain and improve earnings of assets under management over the medium to long term by making maximum use of the sponsor group's platform, which covers development, operation, management and various other functions. As its basic philosophy, SANKEI REAL ESTATE aims to maximize unitholder value over the medium to long term by growing with the J-REIT market as a public entity of society that makes each and every person happy under the philosophy of Â\u0093Making people, cities & society happyÂ\u0094 through sponsorship support.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "3227.T": {
        "short_name": "MCUBS MIDCITY INVESTMENT CORP",
        "long_name": "MCUBS MidCity Investment Corporation",
        "summary": "MCUBS MidCity Investment Corporation (MidCity) is a REIT focused on office properties. It is managed by Mitsubishi Corp.-UBS Realty Inc. (MC-UBS), an asset management company established as a joint venture between the general trading company, Mitsubishi Corporation, and UBS A.G., a leading European financial institution. Featuring a portfolio balanced among Japan's three major metropolitan areas, it carries out carefully selected investment in properties with stable earnings through its unique strategy utilizing an asset information network from the sponsors.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Chiyoda"
    },
    "3295.T": {
        "short_name": "HULIC REIT INC.",
        "long_name": "Hulic Reit, Inc.",
        "summary": "The Investment Corporation was listed on the Tokyo Stock Exchange real estate investment trust market on February 7, 2014 with the support of all stakeholders, including unitholders, and gradually expanded its asset size. I've come. The Investment Corporation is investing heavily in Â\u0093Tokyo Commercial Property,Â\u0094 whose sponsor Hulic Co., Ltd. has a wealth of investment track record and know-how, and is expected to generate stable demand in the future and secure stable earnings over the long term. , By investing in Â\u0093next-generation asset plus,Â\u0094 which the Investment Corporation considers to contribute to maximizing the unitholder value in the medium to long term, secure and improve profits in the medium to long term and increase the size and value of assets under management. We aim to achieve growth. We will continue to utilize the sponsor support provided by the Hulic Group for both external and internal growth with the aim of contributing to the interests of our stakeholders, including investors, and to maximize the maximum value of unitholder value over the medium to long term. We are aiming to achieve this. We would like to ask all of you for your continued support.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8954.T": {
        "short_name": "ORIX JREIT INC",
        "long_name": "ORIX JREIT Inc.",
        "summary": "OJR was established on September 10, 2001, and was listed and commenced trading on the Tokyo Stock Exchange on June 12, 2002 as the fourth Real Estate Investment Trust in Japan, or Â\u0093JREIT,Â\u0094 to be listed. A JREIT is an externally managed property fund formed under the Act on Investment Trusts and Investment Corporations of Japan. ORIX Asset Management Corporation, a wholly owned subsidiary of ORIX Corporation (TSE: 8591, NYSE: IX (ADR)), is the asset manager of OJR.OJR is a diversified JREIT that invests in office buildings, retail facilities, residential properties, logistics facilities, and hotels and others, aiming to provide stable cash flow and healthy asset growth over the medium to long term.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8961.T": {
        "short_name": "MORI TRUST SOGO REIT INC",
        "long_name": "MORI TRUST Sogo Reit, Inc.",
        "summary": "MORI TRUST Sogo Reit, Inc. manages assets by investing funds collected from investors, based on its Certificate of Incorporation, mainly in real estate and asset-backed securities that invest mainly in real estate.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "8975.T": {
        "short_name": "ICHIGO OFFICE REITINVESTMENT CO",
        "long_name": "Ichigo Office REIT Investment Corporation",
        "summary": "Ichigo Office (8975) is a specialized office REIT that focuses on mid-size offices, an asset class that offers both return stability and upside potential. Ichigo Office seeks to drive higher earnings and sustainable growth for its shareholders by increasing the value of its assets through a broad array of value-add activities, including tailored tenant services, structural building improvements, and targeted tenant leasing. Ichigo Office is managed by Ichigo Investment Advisors, the asset management subsidiary of Ichigo, a major Japanese real estate owner/operator. Ichigo Investment Advisors works to grow value on behalf of shareholders by deploying its deep experience and know-how in developing, operating, and managing Japanese real estate. The mid-size offices in which we invest produce stable cashflows, supporting stable dividends for shareholders. Also, this economically-sensitive asset class provides upside for shareholders via the possibility of higher rent income as the Japanese economy shows signs of emerging from multiple decades of deflation. Furthermore, because the market for mid-size offices in Japan is relatively inefficient and has less participation by other major real estate companies, who tend to focus on larger assets, there is a significant opportunity to add value and increase the profitability of the assets we acquire.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "city": "Tokyo"
    },
    "JREIF": {
        "short_name": "JAPAN REAL ESTATE INVESTMENT CO",
        "long_name": "Japan Real Estate Investment Corporation",
        "summary": "JRE shall invest in specified assets, primarily consisting of real estate assets and asset related securities which mainly invests in real estate assets with the goals of stable growth in value over a medium-to-long term period.",
        "currency": "USD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Japan",
        "city": "Tokyo"
    }
}