{
    "3226.T": {
        "short_name": "NIPPON ACCOMMODATIONS FUND INC",
        "long_name": "Nippon Accommodations Fund Inc.",
        "summary": "Nippon Accommodations Fund Inc. (hereinafter Â\u0093NAFÂ\u0094) was established on October 12, 2005 as an investment corporation under the Investment Trust and Investment Corporation Act of Japan with Mitsui Fudosan Accommodations Fund Management Co., Ltd. (hereinafter Â\u0093MFAFMÂ\u0094) acting as a sponsor. Registration with the Kanto Local Finance Bureau of the Ministry of Finance was completed on November 11, 2005 and NAF started acquisition of properties on November 30, 2005. NAF is an externally managed real estate fund, formed as an investment corporation. MFAFM, as NAF's asset management company, is engaged in the acquisition, management, and renovation of accommodation assets. MFAFM is a 100% subsidiary of Mitsui Fudosan Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "103-0027",
        "website": "http://www.naf-r.jp",
        "market_cap": "Large Cap"
    },
    "3234.T": {
        "short_name": "MORI HILLS REIT INVESTMENT CORP",
        "long_name": "Mori Hills REIT Investment Corporation",
        "summary": "MHR aims to further enhance the profitability and asset value of its portfolio through growth created by making targeted investment in the Â\u0093City,Â\u0094 while paying close attention to the competitiveness of the Â\u0093CityÂ\u0094 concentrating on central Tokyo, and on the portfolio's ability to create value. Â\u0093CityÂ\u0094 in MHR's definition is not merely a geographic location with an aggregation of buildings, but a Â\u0094spaceÂ\u0094 with multiple uses, such as for work, residence, recreation, rest and study that integrates various economic and cultural activities of the people that gather there. MHR believes that the provision of all urban elements will result in people, products and information concentrating and merging to generate new business models and lifestyles. MHR recognizes its Sponsor, the Mori Building Group, (Mori Building Co., Ltd. being its core company), as being uniquely positioned to realize investments in the Â\u0093City.Â\u0094 By optimally utilizing the comprehensive strengths of the Mori Building Group, which has completed successive large-scale redevelopments in central Tokyo, MHR aims to acquire scarce, premium properties and to enhance the asset value of its portfolio.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-6011",
        "website": "http://www.mori-hills-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "3279.T": {
        "short_name": "ACTIVIA PROPERTIES INC",
        "long_name": "Activia Properties Inc.",
        "summary": "Activia Properties Inc. invests primarily in Urban Retail and Tokyo Office Properties. API seeks to increase unitholder value by building a portfolio of properties that are competitive in the medium- to long-term and operating it. To build a portfolio of properties that can expect stable and sustainable customer demand, we believe that in addition to the location, use, scale, and quality of properties, reducing our environmental footprint and contributing to the surrounding communities and environment are important.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0062",
        "website": "http://www.activia-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "3309.T": {
        "short_name": "SEKISUI HOUSE REIT INC",
        "long_name": "Sekisui House Reit, Inc.",
        "summary": "Sekisui House Reit, Inc. is a real estate investment trust externally managed by Sekisui House Asset Management, Ltd. It invests in the real estate markets of Japan. The firm primarily invests in office buildings, along with such commercial properties as retail properties and hotels. Sekisui House Reit, Inc. was formed on September 8, 2014 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "107-0052",
        "website": "http://www.sekisuihouse-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "3451.T": {
        "short_name": "TOSEI REIT INVESTMENT CORPORATI",
        "long_name": "Tosei Reit Investment Corporation",
        "summary": "Tosei Reit Investment Corp. is a real estate investment trust externally managed by Tosei Asset Advisors, Inc. The firm invests in relatively small- and medium-sized office buildings, retail facilities, residential properties and hotels. It invests in real estate markets of Japan. The firm was founded in November 27, 2014 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.tosei-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "3470.T": {
        "short_name": "MARIMO REGIONAL REVITALIZATION ",
        "long_name": "Marimo Regional Revitalization REIT, Inc.",
        "summary": "Marimo Regional Revitalization REIT, Inc. (hereinafter, Â\u0093marimo REITÂ\u0094) was listed on the Tokyo Stock Exchange Real Estate Investment Trust Market as a diversified REIT with a portfolio of residential, retail, hotel and office properties (hereinafter, Â\u0093diversified mix of income-producing real estateÂ\u0094) on July 29, 2016.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.marimo-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "3471.T": {
        "short_name": "MITSUI FUDOSAN LOGISTICS PARK I",
        "long_name": "Mitsui Fudosan Logistics Park Inc.",
        "summary": "Mitsui Fudosan Logistics Park Inc. operates as a REIT that engages in the logistics facilities business. Its logistics facilities business include know-how in leasing based on its client network base developed in its office buildings and retail facilities businesses, as well as property management/operation. The company is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "104-0061",
        "website": "http://www.mflp-r.co.jp",
        "market_cap": "Large Cap"
    },
    "3476.T": {
        "short_name": "MIRAI CORPORATION",
        "long_name": "MIRAI Corporation",
        "summary": "MIRAI Corporation operates as a real estate investment trust. Its property portfolio includes office buildings, hotels, retails properties, and others. The company has elected to be taxed as a real estate investment trust. As a result, it would not be subject to corporate income tax on that portion of its net income that is distributed to shareholders. The company was founded in 2015 and is based in Tokyo, Japan.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "101-0065",
        "website": "http://3476.jp",
        "market_cap": "Large Cap"
    },
    "3488.T": {
        "short_name": "XYMAX REIT INVESTMENT CORP",
        "long_name": "XYMAX REIT Investment Corporation",
        "summary": "XYMAX REIT Investment Corporation (hereinafter, Â\u0093XYMAX REITÂ\u0094) was listed on the Tokyo Stock Exchange Real Estate Investment Trust Securities Market on February 15, 2018. XYMAX REIT is a diversified and publicly traded Japanese real estate investment trust (J-REIT) that has the sponsor support of the XYMAX Group, a leading company in the real estate management industry.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.xymaxreit.co.jp/",
        "market_cap": "Large Cap"
    },
    "3492.T": {
        "short_name": "TAKARA LEBEN REAL ESTATE INV CO",
        "long_name": "Takara Leben Real Estate Investment Corporation",
        "summary": "Takara Leben Real Estate Investment Corporation (TLR) was listed on the Tokyo Stock Exchange Real Estate Investment Trust Securities Market on July 27, 2018. TLR is a diversified J-REIT that has companies boasting expertise and know-how backed by an extensive track record in office, residential, hotel, retail and other properties - Takara Leben Co., Ltd., PAG Investment Management Limited, Kyoritsu Maintenance Co., Ltd. and Yamada Denki Co., Ltd.- as sponsors. TLR aims to realize Â\u0093steady growthÂ\u0094 and Â\u0093stable managementÂ\u0094 by utilizing a multi-sponsor management structure that combines the expertise and know-how of each of the sponsors, which boast different strengths. In addition, TLR aims to realize Â\u0093maximization of unitholder value,Â\u0094 Â\u0093creation of a sustainable environmentÂ\u0094 and Â\u0093contribution to communities and societyÂ\u0094 in order to remain the unitholders' diversified J-REIT of choice.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://takara-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "8957.T": {
        "short_name": "TOKYU REIT INC",
        "long_name": "Tokyu REIT, Inc.",
        "summary": "TOKYU REIT, Inc. was incorporated to invest in real estate on June 20, 2003 under the Law Concerning Investment Trusts and Investment Corporations of Japan (Law No. 198 of 1952, as amended), or the Investment Trust Law. Such corporations are commonly referred to as Japanese Real Estate Investment Trusts, or J-REITs.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "150-0043",
        "website": "http://www.tokyu-reit.co.jp",
        "market_cap": "Large Cap"
    },
    "8963.T": {
        "short_name": "INVINCIBLE INVESTMENT CORP",
        "long_name": "Invincible Investment Corporation",
        "summary": "INV was established in January 2002 in accordance with the Investment Trust and Investment Corporation Act (Act No. 198 of 1951, as amended; the Â\u0093Investment Trust ActÂ\u0094). In May 2004, INV was listed on the Osaka Securities Exchange (application for delisting was made in August 2007), and in August 2006 was listed on the Real Estate Investment and Trust Securities Section of the Tokyo Stock Exchange (Ticker Code: 8963).",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.invincible-inv.co.jp",
        "market_cap": "Large Cap"
    },
    "8966.T": {
        "short_name": "HEIWA REAL ESTATE REIT INC",
        "long_name": "Heiwa Real Estate REIT, Inc.",
        "summary": "HEIWA REAL ESTATE REIT, Inc. (\"the Investment Corporation\") raises funds from investors, investing said funds primarily in real estate, working toward growth for managed assets and stable medium- to long-term profits.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": null,
        "website": "http://www.heiwa-re.co.jp",
        "market_cap": "Large Cap"
    },
    "8968.T": {
        "short_name": "FUKUOKA REIT CORP",
        "long_name": "Fukuoka REIT Corporation",
        "summary": "Fukuoka REIT Corporation (securities code: 8968) is the first region-specific REIT in Japan. With our strength in knowing the local characteristics of real estate, which is a very regional-specific business, Fukuoka REIT manages a portfolio centering on superior design entertainment retail facilities and Class A office buildings in the entire Kyushu region centering on Fukuoka, Yamaguchi and Okinawa prefectures. Fukuoka REIT was registered in August 2004 and listed on the Tokyo Stock Exchange and Fukuoka Stock Exchange on June 21, 2005. Real estate management, acquisition arrangements of new properties, fund raising and other operations are contracted to its asset manager, Fukuoka Realty Co., Ltd.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Fukuoka",
        "zipcode": "812-0018",
        "website": "http://www.fukuoka-reit.jp",
        "market_cap": "Large Cap"
    },
    "8972.T": {
        "short_name": "KENEDIX OFFICE INVESTMENT CORP",
        "long_name": "Kenedix Office Investment Corporation",
        "summary": "Kenedix Office Investment Corporation (Â\u0093the Investment CorporationÂ\u0094) was established on May 6, 2005, in accordance with the Act on Investment Trusts and Investment Corporations (Act No. 198 of the year 1951, including amendments thereafter) (Â\u0093Investment Trust ActÂ\u0094). On July 21, 2005, the Investment Corporation was listed on the Real Estate Investment Trust Market of the Tokyo Stock Exchange, Inc. (Â\u0093the Tokyo Stock ExchangeÂ\u0094) with a total of 75,400 investment units issued and outstanding (Securities Code: 8972). Subsequently, the Investment Corporation raised funds through eight public offerings and such. As a result, as of the end of the fiscal period under review (October 31, 2020), the number of investment units issued and outstanding totaled 428,510 units. The Investment Corporation entrusts Kenedix Real Estate Fund Management, Inc. (Â\u0093the Asset Management CompanyÂ\u0094) with its asset management and strives to maximize unitholder profits by securing stable earnings and sustainable growth of investment assets. To this end, the Investment Corporation adopts the basic policy of conducting flexible and dynamic investment that seeks to respond to the environment and market trends, endeavors to ensure a timely response to opportunities, and form a portfolio.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Tokyo",
        "zipcode": "100-0011",
        "website": "http://www.kdo-reit.com",
        "market_cap": "Large Cap"
    },
    "8977.T": {
        "short_name": "HANKYU HANSHIN REIT INC",
        "long_name": "Hankyu Hanshin REIT, Inc.",
        "summary": "Hankyu Hanshin REIT, Inc. shall manage funds contributed by unitholders by investing them primarily in real estate and real estate-backed securities in accordance with its Articles of Incorporation.",
        "currency": "JPY",
        "sector": "Real Estate",
        "industry": "REIT - Diversified",
        "exchange": "JPX",
        "market": "jp_market",
        "country": "Japan",
        "state": null,
        "city": "Osaka",
        "zipcode": null,
        "website": "http://www.hankyuhanshinreit.co.jp",
        "market_cap": "Large Cap"
    }
}