{
    "1JU.F": {
        "short_name": "FATFISH GROUP LTD.",
        "long_name": "Fatfish Group Limited",
        "summary": "Fatfish Group Limited is an incubator and venture capital firm specializing in incubation, start-ups and growth stage investments. It invests in the Internet sector with a focus on cryptocurrency, blockchain technologies, technology, internet, and consumer Internet venture. It prefers to take majority controlling stake. Fatfish Group Limited was founded in 2011 and is based in Melbourne, Australia with additional offices in Singapore; Jakarta, Indonesia; and Kuala Lumpur, Malaysia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.fatfish.co",
        "market_cap": "Small Cap"
    },
    "5HK.F": {
        "short_name": "RAIZ INVEST LTD.",
        "long_name": "Raiz Invest Limited",
        "summary": "Raiz Invest Limited provides financial services and products through its mobile micro-investing platform in Australia, Indonesia, and Malaysia. It operates in two segments, Raiz Invest Micro-Investing Platform and Other Financial segments. The company's platform offers customers a way to invest money using the Raiz mobile application or through the Raiz Website. Raiz Invest Limited was incorporated in 2016 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.raizinvest.com.au",
        "market_cap": "Small Cap"
    },
    "AFA.AX": {
        "short_name": "ASF GROUP FPO",
        "long_name": "ASF Group Limited",
        "summary": "ASF Group Limited, an investment and trading house, operates in the oil and gas, resources, property, infrastructure, travel, and financial services sectors in Australia, China, the United Kingdom, and the rest of Europe. It holds interests in copper-gold and gold mineralization projects in Queensland; a potash project in Western Australia; oil and gas projects in the Canning Basin, Western Australia; conventional and unconventional oil and gas projects in the North Perth and Canning Basin, Western Australia; and coal tenements in Queensland. The company also develops tourism, mixed-use, and urban regeneration projects. In addition, it offers property marketing services, as well as fund management and advisory services on public listing, visa migration, and funds management. ASF Group Limited was incorporated in 1980 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.asfgroupltd.com",
        "market_cap": "Small Cap"
    },
    "ASW.AX": {
        "short_name": "ADVANSHARE FPO",
        "long_name": "Advanced Share Registry Limited",
        "summary": "Advanced Share Registry Limited provides share registry and other corporate services in Australia. It operates through two segments, Share Registry Services and Property Investment. The company offers a suite of registry services, including registry maintenance, capital raisings, corporate actions, company meetings, employee share plans, shareholder communications, and in-house printing services. It also engages in the property investment business. The company was founded in 1996 and is based in Nedlands, Australia. Advanced Share Registry Limited is a subsidiary of KMC Automation Pty Ltd.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Nedlands",
        "zipcode": "6009",
        "website": "http://www.advancedshare.com.au",
        "market_cap": "Small Cap"
    },
    "BFG.AX": {
        "short_name": "BELL FN GP FPO",
        "long_name": "Bell Financial Group Limited",
        "summary": "Bell Financial Group Limited provides stock broking, investment, and financial advisory services to private, institutional, and corporate clients. It operates through Technology & Platforms, Products & Services, Retail Broking Division, and Institutional Broking Division segments. The company provides retail broking, institutional broking, intermediary broking, online broking, equity capital markets, research, futures and foreign exchange, cash management, margin lending, and portfolio administration services. The company operates a network of 14 offices in Australia, as well as offices in New York, London, Hong Kong, and Kuala Lumpur. Bell Financial Group Limited was founded in 1970 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.bellfg.com.au",
        "market_cap": "Small Cap"
    },
    "COG.AX": {
        "short_name": "CONOPERGRP FPO",
        "long_name": "COG Financial Services Limited",
        "summary": "COG Financial Services Limited provides equipment finance broking, finance aggregation, and commercial equipment financing activities for business assets in Australia. It also offers management IT services. The company was formerly known as Consolidated Operations Group Limited and changed its name to COG Financial Services Limited in November 2020. COG Financial Services Limited is based in Chatswood, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Chatswood",
        "zipcode": "2067",
        "website": "http://www.coglimited.com.au",
        "market_cap": "Small Cap"
    },
    "FFG.AX": {
        "short_name": "FATFISH FPO",
        "long_name": "Fatfish Group Limited",
        "summary": "Fatfish Group Limited is an incubator and venture capital firm specializing in incubation, start-ups and growth stage investments. It invests in the Internet sector with a focus on cryptocurrency, blockchain technologies, technology, internet, and consumer Internet venture. It prefers to take majority controlling stake. Fatfish Group Limited was founded in 2011 and is based in Melbourne, Australia with additional offices in Singapore; Jakarta, Indonesia; and Kuala Lumpur, Malaysia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.fatfish.co",
        "market_cap": "Small Cap"
    },
    "FFTTF": {
        "short_name": "FATFISH GROUP LTD",
        "long_name": "Fatfish Group Limited",
        "summary": "Fatfish Group Limited is an incubator and venture capital firm specializing in incubation, start-ups and growth stage investments. It invests in the Internet sector with a focus on cryptocurrency, blockchain technologies, technology, internet, and consumer Internet venture. It prefers to take majority controlling stake. Fatfish Group Limited was founded in 2011 and is based in Melbourne, Australia with additional offices in Singapore; Jakarta, Indonesia; and Kuala Lumpur, Malaysia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.fatfish.co",
        "market_cap": "Small Cap"
    },
    "FNX.AX": {
        "short_name": "FINEXIA FPO",
        "long_name": "Finexia Financial Group Limited",
        "summary": "Finexia Financial Group Limited provides trading, advisory, and lending services in Australia. It operates through two segments Mejority Capital, and Smart Money Company. It offers share trading facility; loan facilitation; and project finance value added services for property developers, such as pre-sale underwriting, pre-sale shortfall bond, joint venture, and builder selection services. The company also provides cavet loans; bridging loans; first and second mortgage, development financing, mezzanine funding, and property financing services, as well as licensing and fund management services. The company was formerly known as Mejority Capital Limited and changed its name to Finexia Financial Group Limited in September 2020. Finexia Financial Group Limited was incorporated in 2003 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.finexia.com.au",
        "market_cap": "Small Cap"
    },
    "HUB.AX": {
        "short_name": "HUB24LTD FPO",
        "long_name": "HUB24 Limited",
        "summary": "HUB24 Limited, together with its subsidiaries, provides wealth management solutions for the financial services industry in Australia. It operates through Platform, Licensee, and IT Services segments. The company develops and operates HUB24, an investment and superannuation platform, which is a portfolio administration services for financial advisers, stockbrokers, accountants and their clients, and direct consumers. It also provides compliance, software, education, and business support to advisers; and application and technology products for the financial services sector. In addition, the company offers software license and IT consulting services, as well as business, managed portfolio, and retirement solutions. The company was formerly known as Investorfirst Ltd. and changed its name to HUB24 Limited in August 2013. HUB24 Limited was founded in 2007 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.hub24.com.au",
        "market_cap": "Small Cap"
    },
    "IQ3.AX": {
        "short_name": "IQ3CORP FPO",
        "long_name": "iQ3Corp Ltd",
        "summary": "iQ3Corp Ltd provides capital raising and corporate advisory services to listed and unlisted companies in the life science industry in Australia. The company operates through Consulting Services, and Shared Services segments. It offers advisory services on initial public offerings, listings, private equity, mergers and acquisitions, structured finance, strategic matters, restructuring and capital structure, capital raising, and corporate finance, as well as structured finance services. The company also provides sell-side, buy-side, and NSX nominated advisory services. It serves corporations, partnerships, institutions, governments, and individuals. The company was founded in 2012 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://iq3corp.com",
        "market_cap": "Small Cap"
    },
    "MCQEF": {
        "short_name": "MACQUARIE GROUP LIMITED",
        "long_name": "Macquarie Group Limited",
        "summary": "Macquarie Group Limited provides diversified financial services in Australia, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through four segments: Macquarie Asset Management (MAM), Banking and Financial Services (BFS), Commodities and Global Markets (CGM), and Macquarie Capital. The MAM segment provides investment solutions to clients across various capabilities, including infrastructure and renewables, real estate, agriculture, transportation finance, private credit, equities, fixed income, and multi-asset solutions. The BFS segment offers personal banking products comprising home loans, credit cards, transaction and savings accounts, and vehicle finance; and wrap platform and cash management, financial advisory, private banking, and stockbroking services, as well as investment and superannuation products. It also provides deposit, lending, and payment solutions and services to business clients, such as sole practitioners to corporate professional firms. The CGM segment offers products in the areas of equities, fixed income, foreign exchange, commodities and technology, media, and telecoms; risk and capital solutions; and specialized asset finance solutions. The Macquarie Capital segment provides advisory and capital raising services. It is also involved in facilitation, and principal lending and investments; and trading of fixed income, equities, foreign exchange and commodities, as well as provides broking services, corporate and structured finance, leasing services, capital raising and advisory services, and underwriting services;; Further, the company engages in the distribution and management of funds and wealth management products. The company was founded in 1969 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.macquarie.com",
        "market_cap": "Large Cap"
    },
    "MQBKY": {
        "short_name": "MACQUARIE GROUP LIMITED",
        "long_name": "Macquarie Group Limited",
        "summary": "Macquarie Group Limited provides diversified financial services in Australia, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through four segments: Macquarie Asset Management (MAM), Banking and Financial Services (BFS), Commodities and Global Markets (CMG), and Macquarie Capital segments. The MAM segment is involved in the asset management business, which specializes in the infrastructure and renewables, real estate, agriculture, transportation finance, private credit, equities, fixed income, and multi-asset solutions. The BFS segment offers personal banking products comprising home loans, credit cards, transaction and savings accounts, and vehicle finance; and wrap platform and cash management, financial advisory, and private banking and stockbroking services, as well as investment and superannuation products. It also provides deposit, lending, and payment solutions, as well as services to business clients, such as sole practitioners to corporate professional firms. The CGM segment offers products in the areas of equities, fixed income, foreign exchange, commodities and technology, media, and telecoms. The Macquarie Capital segment provides advisory and capital raising services. The company was founded in 1969 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.macquarie.com",
        "market_cap": "Large Cap"
    },
    "MQG.AX": {
        "short_name": "MACQ GROUP FPO",
        "long_name": "Macquarie Group Limited",
        "summary": "Macquarie Group Limited provides diversified financial services in Australia, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through four segments: Macquarie Asset Management (MAM), Banking and Financial Services (BFS), Commodities and Global Markets (CGM), and Macquarie Capital. The MAM segment provides investment solutions to clients across various capabilities, including infrastructure and renewables, real estate, agriculture, transportation finance, private credit, equities, fixed income, and multi-asset solutions. The BFS segment offers personal banking products comprising home loans, credit cards, transaction and savings accounts, and vehicle finance; and wrap platform and cash management, financial advisory, private banking, and stockbroking services, as well as investment and superannuation products. It also provides deposit, lending, and payment solutions and services to business clients, such as sole practitioners to corporate professional firms. The CGM segment offers products in the areas of equities, fixed income, foreign exchange, commodities and technology, media, and telecoms; risk and capital solutions; and specialized asset finance solutions. The Macquarie Capital segment provides advisory and capital raising services. It is also involved in facilitation, and principal lending and investments; and trading of fixed income, equities, foreign exchange and commodities, as well as provides broking services, corporate and structured finance, leasing services, capital raising and advisory services, and underwriting services;; Further, the company engages in the distribution and management of funds and wealth management products. The company was founded in 1969 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.macquarie.com",
        "market_cap": "Large Cap"
    },
    "MQGPC.AX": {
        "short_name": "MACQ GROUP NYR3QUT",
        "long_name": "Macquarie Group Limited",
        "summary": "Macquarie Group Limited provides diversified financial services in Australia, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through four segments: Macquarie Asset Management (MAM), Banking and Financial Services (BFS), Commodities and Global Markets (CGM), and Macquarie Capital. The MAM segment provides investment solutions to clients across various capabilities, including infrastructure and renewables, real estate, agriculture, transportation finance, private credit, equities, fixed income, and multi-asset solutions. The BFS segment offers personal banking products comprising home loans, credit cards, transaction and savings accounts, and vehicle finance; and wrap platform and cash management, financial advisory, private banking, and stockbroking services, as well as investment and superannuation products. It also provides deposit, lending, and payment solutions and services to business clients, such as sole practitioners to corporate professional firms. The CGM segment offers products in the areas of equities, fixed income, foreign exchange, commodities and technology, media, and telecoms; risk and capital solutions; and specialized asset finance solutions. The Macquarie Capital segment provides advisory and capital raising services. It is also involved in facilitation, and principal lending and investments; and trading of fixed income, equities, foreign exchange and commodities, as well as provides broking services, corporate and structured finance, leasing services, capital raising and advisory services, and underwriting services;; Further, the company engages in the distribution and management of funds and wealth management products. The company was founded in 1969 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.macquarie.com",
        "market_cap": "Large Cap"
    },
    "MQGPE.AX": {
        "short_name": "MACQ GROUP NYR3QUT",
        "long_name": "Macquarie Group Limited",
        "summary": "Macquarie Group Limited provides diversified financial services in Australia, the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company operates through four segments: Macquarie Asset Management (MAM), Banking and Financial Services (BFS), Commodities and Global Markets (CGM), and Macquarie Capital. The MAM segment provides investment solutions to clients across various capabilities, including infrastructure and renewables, real estate, agriculture, transportation finance, private credit, equities, fixed income, and multi-asset solutions. The BFS segment offers personal banking products comprising home loans, credit cards, transaction and savings accounts, and vehicle finance; and wrap platform and cash management, financial advisory, private banking, and stockbroking services, as well as investment and superannuation products. It also provides deposit, lending, and payment solutions and services to business clients, such as sole practitioners to corporate professional firms. The CGM segment offers products in the areas of equities, fixed income, foreign exchange, commodities and technology, media, and telecoms; risk and capital solutions; and specialized asset finance solutions. The Macquarie Capital segment provides advisory and capital raising services. It is also involved in facilitation, and principal lending and investments; and trading of fixed income, equities, foreign exchange and commodities, as well as provides broking services, corporate and structured finance, leasing services, capital raising and advisory services, and underwriting services;; Further, the company engages in the distribution and management of funds and wealth management products. The company was founded in 1969 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.macquarie.com",
        "market_cap": null
    },
    "NF3.F": {
        "short_name": "FINEXIA FINANCIAL GROUP",
        "long_name": "Finexia Financial Group Limited",
        "summary": "Finexia Financial Group Limited provides trading, advisory, and lending services in Australia. It operates through two segments Mejority Capital, and Smart Money Company. It offers share trading facility; loan facilitation; and project finance value added services for property developers, such as pre-sale underwriting, pre-sale shortfall bond, joint venture, and builder selection services. The company also provides cavet loans; bridging loans; first and second mortgage, development financing, mezzanine funding, and property financing services, as well as licensing and fund management services. The company was formerly known as Mejority Capital Limited and changed its name to Finexia Financial Group Limited in September 2020. Finexia Financial Group Limited was incorporated in 2003 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.finexia.com.au",
        "market_cap": "Small Cap"
    },
    "NWL.AX": {
        "short_name": "NETWEALTH FPO",
        "long_name": "Netwealth Group Limited",
        "summary": "Netwealth Group Limited, a financial services company, engages in the wealth management business in Australia. The company offers superannuation products, including accumulation and retirement income products; managed accounts; and managed funds, as well as investor directed portfolio services. It also provides investment wrap products for self-managed super fund (SMSF) or high net-worth clients; investment options, such as listed securities, managed account models, managed funds, term deposits, premium services, and others; insurance products; forms and documents; and resources and tools, as well as advisory, licensee, and private wealth solutions. In addition, the company offers a superannuation master fund, separately managed accounts, and self-managed superannuation administration services; and portfolio management tools, performance tools, investment research tools, and mobile access tools. The company offers its financial services to investors and non-institutional intermediaries, including financial advisers, private clients, and high net worth firms. Netwealth Group Limited was founded in 1999 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.netwealth.com.au",
        "market_cap": "Mid Cap"
    },
    "OFX.AX": {
        "short_name": "OZFOREX FPO",
        "long_name": "OFX Group Limited",
        "summary": "OFX Group Limited provides online international payments and foreign exchange services for consumer and business clients in Australia, New Zealand, Europe, North America, Asia, and internationally. It operates through two segments, International Payment Services and International Payment Solutions. The International Payment Services segment offers bank to bank currency transfer services to businesses and consumers. The International Payment Solutions segment provides OFX IT platform; client service; compliance sophistication; banking relationships; and payments services. The company was formerly known as OzForex Group Limited and changed its name to OFX Group Limited in September 2016. OFX Group Limited was founded in 1998 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.ofx.com",
        "market_cap": "Small Cap"
    },
    "OFZ.F": {
        "short_name": "OFX GROUP LTD.",
        "long_name": "OFX Group Limited",
        "summary": "OFX Group Limited provides online international payments and foreign exchange services for consumer and business clients in Australia, New Zealand, Europe, North America, Asia, and internationally. It operates through two segments, International Payment Services and International Payment Solutions. The International Payment Services segment offers bank to bank currency transfer services to businesses and consumers. The International Payment Solutions segment provides OFX IT platform; client service; compliance sophistication; banking relationships; and payments services. The company was formerly known as OzForex Group Limited and changed its name to OFX Group Limited in September 2016. OFX Group Limited was founded in 1998 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.ofx.com",
        "market_cap": "Small Cap"
    },
    "OZFRY": {
        "short_name": "OFX GROUP LTD",
        "long_name": "OFX Group Limited",
        "summary": "OFX Group Limited provides online international payments and foreign exchange services for consumer and business clients in Australia, New Zealand, Europe, North America, Asia, and internationally. It operates through two segments, International Payment Services and International Payment Solutions. The International Payment Services segment offers bank to bank currency transfer services to businesses and consumers. The International Payment Solutions segment provides OFX IT platform; client service; compliance sophistication; banking relationships; and payments services. The company was formerly known as OzForex Group Limited and changed its name to OFX Group Limited in September 2016. OFX Group Limited was founded in 1998 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.ofx.com",
        "market_cap": "Small Cap"
    },
    "PPS.AX": {
        "short_name": "PRAEMIUM FPO",
        "long_name": "Praemium Limited",
        "summary": "Praemium Limited, together with its subsidiaries, provides managed accounts platform, investment management, portfolio administration, and reporting and financial planning software in Australia and internationally. It offers managed accounts platform that provides separately managed accounts, individually managed accounts, virtual managed accounts, managed discretionary accounts, investor directed portfolio services, and unified managed accounts services; and solutions for retirement planning. The company also provides advice solutions comprising practice management, report building and plan generation, remuneration, lead generation, client engagement, wealthcraft services, and related services through the platform; and investments related products. It serves financial advisers, brokers, and accountants. Praemium Limited was founded in 2001 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.praemium.com.au",
        "market_cap": "Small Cap"
    },
    "RZI.AX": {
        "short_name": "RAIZINVEST FPO",
        "long_name": "Raiz Invest Limited",
        "summary": "Raiz Invest Limited provides financial services and products through its mobile micro-investing platform in Australia, Indonesia, and Malaysia. It operates in two segments, Raiz Invest Micro-Investing Platform and Other Financial segments. The company's platform offers customers a way to invest money using the Raiz mobile application or through the Raiz Website. Raiz Invest Limited was incorporated in 2016 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.raizinvest.com.au",
        "market_cap": "Small Cap"
    },
    "SWF.AX": {
        "short_name": "SELFWEALTH FPO",
        "long_name": "SelfWealth Limited",
        "summary": "SelfWealth Limited offers an online share trading services in Australia. It also provides online investor community portal services. The company was incorporated in 2011 and is based in Surrey Hills, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Surrey Hills",
        "zipcode": "3127",
        "website": "http://www.selfwealth.com.au",
        "market_cap": "Small Cap"
    },
    "WHF.AX": {
        "short_name": "WHITEFIELD FPO",
        "long_name": "Whitefield Limited",
        "summary": "Whitefield Limited operates in the securities industry primarily in Australia. The company invests in shares and securities. The company was founded in 1923 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whitefield.com.au",
        "market_cap": "Small Cap"
    },
    "WHFPB.AX": {
        "short_name": "WHITEFIELD CPVM6QU",
        "long_name": "Whitefield Limited",
        "summary": "Whitefield Limited operates in the securities industry primarily in Australia. The company invests in shares and securities. The company was founded in 1923 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Capital Markets",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.whitefield.com.au",
        "market_cap": "Small Cap"
    }
}