{
    "1S6.F": {
        "short_name": "STEADFAST GROUP LTD",
        "long_name": "Steadfast Group Limited",
        "summary": "Steadfast Group Limited provides general insurance brokerage services Australasia, Asia, and Europe. It also provides insurance underwriting services and related services. The company operates a network of 458 general insurance brokers and 25 underwriting agencies. Steadfast Group Limited was founded in 1996 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.steadfast.com.au",
        "full_time_employees": null
    },
    "AUB.AX": {
        "short_name": "AUB GROUP FPO",
        "long_name": "AUB Group Limited",
        "summary": "AUB Group Limited provides operates as an equity-based insurance broker in Australia and New Zealand. The company operates insurance broking networks represented by approximately 77 businesses, as well as distributes ancillary products; and underwrites, distributes, and manages insurance products and portfolios on behalf of licensed insurance companies. It also provides risk services, such as loss adjustment, investigations, claims management, claims legal support, and rehabilitation services. The company was formerly known as Austbrokers Holdings Limited and changed its name to AUB Group Limited in November 2015. AUB Group Limited was incorporated in 1885 and is based in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2000",
        "website": "http://www.aubgroup.com.au",
        "full_time_employees": null
    },
    "ENA.AX": {
        "short_name": "ENSURANCE FPO",
        "long_name": "Ensurance Limited",
        "summary": "Ensurance Limited engages in the underwriting and sale of insurance products in Australia and the United Kingdom. The company provides contractors-all risk, contractors-plant and equipment, home build, combined liability, contractors assist, engineering inspection and insurance, construction, cyber, and terrorism and sabotage insurance products. It also offers underwriting services, including licensed builder annual construction, plant, and liability insurance; and licensed builder project specific construction insurance, trades liability, owner builder, and latent defect products. In addition, the company trades insurance products through online platform. Ensurance Limited is based in Bondi Junction, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Bondi Junction",
        "zipcode": "2022",
        "website": "http://www.ensurance.com.au",
        "full_time_employees": null
    },
    "PSI.AX": {
        "short_name": "PSC INSUR FPO",
        "long_name": "PSC Insurance Group Limited",
        "summary": "PSC Insurance Group Limited provides insurance services in Australia, the United Kingdom, and New Zealand. The company operates through four segments: Distribution, Agency, United Kingdom, and Group. The company is involved in insurance broking, reinsurance, and underwriting agency operations. It also engages in life insurance broking, online travel and medical indemnity, and wholesale and retail insurance broking activities. The company provides workers compensation consulting services. PSC Insurance Group Limited was incorporated in 2010 and is based in East Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "East Melbourne",
        "zipcode": "3002",
        "website": "http://www.pscinsurancegroup.com.au",
        "full_time_employees": null
    },
    "SDF.AX": {
        "short_name": "STEADFAST FPO",
        "long_name": "Steadfast Group Limited",
        "summary": "Steadfast Group Limited provides general insurance brokerage services Australasia, Asia, and Europe. It also provides insurance underwriting services and related services. The company operates a network of 458 general insurance brokers and 25 underwriting agencies. Steadfast Group Limited was founded in 1996 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Insurance Brokers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.steadfast.com.au",
        "full_time_employees": null
    }
}