{
    "AFG.AX": {
        "short_name": "AUSTRA FIN FPO",
        "long_name": "Australian Finance Group Limited",
        "summary": "Australian Finance Group Limited, together with its subsidiaries, provides mortgage broking services in Australia. The company operates in two segments, AFG Wholesale Mortgage Broking and AFG Home Loans. It offers residential mortgages; home loans; business loans, such as commercial real estate, equipment and vehicle, inventory, working capital, and start-up finance, as well as franchisee loans and invoice finance/accounts receivable; and insurance products. The company was formerly known as Australian Finance Group Pty Ltd. Australian Finance Group Limited was founded in 1994 and is headquartered in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.afgonline.com.au",
        "full_time_employees": 204
    },
    "MOC.AX": {
        "short_name": "MORTCHOICE FPO",
        "long_name": "Mortgage Choice Limited",
        "summary": "Mortgage Choice Limited provides mortgage broking services in Australia. It operates through two segments, Mortgage Choice Franchised Mortgage Broking and Mortgage Choice's Financial Planning Arm. The company offers assistance in determining the borrowing capacities of residential mortgage borrowers; and assessment of a range of home loans products, as well as submits loan applications on behalf of borrowers. It also provides assistance with car loans, equipment finance, general insurance, and personal loans to support personal and home pursuits and/or consolidate debts; and financial planning services. In addition, the company offers life, mortgage and income protection, car, home building and contents, lenders mortgage, and landlord insurance products. It provides loan origination services through its franchise network. The company was founded in 1992 and is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.mortgagechoice.com.au",
        "full_time_employees": null
    },
    "N1H.AX": {
        "short_name": "N1HOLDINGS FPO",
        "long_name": "N1 Holdings Limited",
        "summary": "N1 Holdings Limited provides mortgage broking services to customers in Australia. The company offers home loans, including purchase and refinance; short term business loans for SME's; commercial lending products and services; and commercial property loans, as well as off-market lending services. It also provides car loan and equipment finance services; trustee services, such as information memorandum production, offer documents production, custody services, and fund administration and accounting services; and corporate advisory services. In addition, the company offers residential sales and property management services under the N1 Realty name; migration and education consultation services under the N1 Migration name; and fund management services under the N1 Venture name. Further, it provides peripheral services that include local and international recruitment, funding and financing, cross-border investment, and business operations setup services for business operations under the N1 Business Services name. Additionally, the company operates N1 Center, a financial and property services shop; and chengdai.com.au, an Australian mortgage products comparison site. It offers its home loans, business financing, commercial property loans, development site funding, and financial planning services under the N1 Loans name. The company was founded in 2011 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.n1holdings.com.au",
        "full_time_employees": null
    },
    "RMC.AX": {
        "short_name": "RESIMAC FPO",
        "long_name": "Resimac Group Limited",
        "summary": "Resimac Group Limited, a non-bank financial institution, provides residential mortgage solutions in Australia and New Zealand. The company operates through Australian Lending Business and New Zealand Lending Business segments. It offers prime and specialist lending products; and home loans. The company also provides mortgage originator, trustee, lender, manager, and broker services; and LMI captive insurer and record lending services. In addition, it act as a trust manager and servicer, and special purpose vehicle; and acts as an issuer of residential mortgage backed securities (RMBS). Further, the company offers warehouse mortgages; and financial management services. Resimac Group Ltd provides its products and services through brokers and white-label partners, as well as direct-to-customer consumer channel primarily under the Resimac and State Custodians brands. The company was formerly known as Homeloans Limited and changed its name to Resimac Group Resimac Group Limited in December 2018. Resimac Group Limited was founded in 1985 and is based in Sydney, Australia. Resimac Group Limited operates as a subsidiary of Somers Limited.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Mortgage Finance",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.resimac.com.au",
        "full_time_employees": null
    }
}