{"0NY.F": {"short_name": "CODEMASTERS GROUP  LS-,01", "long_name": "Codemasters Group Holdings plc", "summary": "Codemasters Group Holdings plc, together with its subsidiaries, develops and sells racing games in the United Kingdom, rest of Europe, the United States, Australia, and internationally. The company's game portfolio comprise F1 series, GRID, DiRT Rally 2.0, and ONRUSH. It also offers interactive entertainment software. The company was incorporated in 2007 and is headquartered in Southam, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Southam"}, "2G5.F": {"short_name": "GOCO GROUP PLC  LS-,0002", "long_name": "GoCo Group plc", "summary": "GoCo Group plc operates Internet-based price comparison Websites for financial and non-financial products in the United Kingdom. The company's Gocompare.com Website enables people to compare the costs and features of various insurance policies, financial products, and energy tariffs. It also provides weflip, an automated savings service; Look After My Bills, an automated energy savings service; MyVoucherCodes, a discount voucher website; and Energylinx, a domestic and business energy comparison and switching service. The company was formerly known as GoCompare.com Group plc and changed its name to GoCo Group plc in May 2019. GoCo Group plc was founded in 2006 and is headquartered in Newport, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Newport"}, "3JDA.F": {"short_name": "RIGHTMOVE PLC  LS -,001", "long_name": "Rightmove plc", "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Milton Keynes"}, "6GC.F": {"short_name": "GAMMA COMMUNICATION.LS-01", "long_name": "Gamma Communications plc", "summary": "Gamma Communications plc provides communications and software services for business in the United Kingdom and internationally. It offers strategic services, such as collaboration, cloud PBX, SIP trunking, inbound call control, and network services; enabling services, including ethernet, broadband, and mobile; and traditional call and line services. The company offers its services through a network of channel partners, as well as directly to end users. It serves small, medium, and large sized business customers. Gamma Communications plc was founded in 2001 and is headquartered in Newbury, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Newbury"}, "8LS.F": {"short_name": "NEXT FIFTEEN  LS-,025", "long_name": "Next Fifteen Communications Group plc", "summary": "Next Fifteen Communications Group plc provides communications services in the United Kingdom, Europe, the Middle East, Africa, the United States, and the Asia Pacific. It offers strategy and insight, online marketing, corporate and internal communications, media training, brand and message consultancy, market research, digital, marketing communications, and creative and content, as well as public, media, analyst, and investor relations services; and digital and technology products and services. The company provides its services under the agent3, Encore Digital Media, Publitek, Beyond, Savanta, M Booth, Archetype, Twogether, ODD, The Blueshirt Group, The OutCast Agency, Velocity, Elvis, Brandwidth, Activate, Planning-inc, Palladium, and Mighty Social brands. Next Fifteen Communications Group plc was founded in 1981 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "9AA.F": {"short_name": "AIRTEL AFRICA PLC DL -,50", "long_name": "Airtel Africa Plc", "summary": "Airtel Africa Plc provides telecommunication and mobile money services to customers in Nigeria, East Africa, and Francophone Africa. The company provides prepaid and postpaid wireless voice, international roaming, and fixed line telephone services; data communication services; and mobile money services, such as payments systems, microloans, savings, and international money transfers. As of March 2020, it served approximately 110.6 million customers. The company was incorporated in 2018 and is based in London, the United Kingdom. Airtel Africa Plc is a subsidiary of Airtel Africa Mauritius Limited.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "AAF.L": {"short_name": "AIRTEL AFRICA PLC ORD USD0.50", "long_name": "Airtel Africa Plc", "summary": "Airtel Africa Plc provides telecommunication and mobile money services to customers in Nigeria, East Africa, and Francophone Africa. The company provides prepaid and postpaid wireless voice, international roaming, and fixed line telephone services; data communication services; and mobile money services, such as payments systems, microloans, savings, and international money transfers. As of March 2020, it served approximately 110.6 million customers. The company was incorporated in 2018 and is based in London, the United Kingdom. Airtel Africa Plc is a subsidiary of Airtel Africa Mauritius Limited.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ADT.L": {"short_name": "ADEPT TECHNOLOGY GROUP PLC ORD ", "long_name": "AdEPT Technology Group plc", "summary": "AdEPT Technology Group plc provides unified communication and IT services in the United Kingdom and internationally. It operates through two segments, Fixed Line Services and Managed Services. The company offers call and line rental, data connectivity, IP telephony, support, and maintenance services, as well as voice and cloud services. It also provides IT, equipment installation, managed, Wi-Fi, and IT and communications hardware products, as well as cyber security, business continuity, and professional products and services. In addition, the company designs, creates, and supports ICT solutions to schools and others in the education sector. The company was formerly known as Adept Telecom Plc and changed its name to AdEPT Technology Group plc in September 2019. AdEPT Technology Group plc was founded in 2003 and is headquartered in Tunbridge Wells, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Tunbridge Wells"}, "AEO.L": {"short_name": "AEOREMA COMMUNICATIONS PLC ORD ", "long_name": "Aeorema Communications plc", "summary": "Aeorema Communications plc, a live events agency, engages in devising and delivering corporate communication solutions in the United Kingdom, Europe, and internationally. The company was formerly known as Cheerful Scout plc and changed its name to Aeorema Communications plc in December 2011. Aeorema Communications plc was incorporated in 2001 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ARE.L": {"short_name": "ARENA EVENTS GROUP PLC ORD 1P", "long_name": "Arena Events Group plc", "summary": "Arena Events Group plc provides turnkey event solutions in Europe, the United States, the Middle East, and Asia. It offers temporary event structures, seating, furniture, catering and kitchen equipment, fencing and barriers, interior design, and ice rinks. The company also provides exhibition services, scaffolding, mass participant event solutions, graphics, signage and flooring, as well as cold room, bar rental services. It serves events, television and films, retail, medical and education sectors, conferences, architecture and construction, exhibitions, and music concerts. The company was founded in 1761 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ASCL.L": {"short_name": "ASCENTIAL PLC ORD 1P", "long_name": "Ascential plc", "summary": "Ascential plc provides business-to-business information services in the United Kingdom, rest of Europe, the United States, Canada, the Asia-Pacific, the Middle East, Africa, and Latin America. The company operates through four segments: Product Design, Marketing, Sales, and Built Environment and Policy. It offers industry-specific business intelligence, insights, and forecasting through data and digital subscription tools. The company was formerly known as Trident Floatco PLC and changed its name to Ascential plc in January 2016. Ascential plc was incorporated in 2016 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ATDRY": {"short_name": "AUTO TRADER GROUP PLC", "long_name": "Auto Trader Group plc", "summary": "Auto Trader Group plc operates in the digital automotive marketplace in the United Kingdom and Ireland. It offers its products to retailers, home traders, and logistics firms; vehicle advertisement on its websites for private sellers, as well as insurance and loan financing products to consumers; and display advertising on its websites for manufacturers and their advertising agencies. The company was founded in 1977 and is headquartered in Manchester, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Manchester"}, "AYIMA-B.ST": {"short_name": "Ayima Group AB ser. B", "long_name": "Ayima Group AB (publ)", "summary": "Ayima Group AB (publ) operates as a digital marketing agency worldwide. The company offers software tools, which include Ayima Intelligence, search engine optimization reporting tool, Pulse, Appotate, Redirect Path, Page Insights, Updatable, and Query. It also provides search engine optimization, social media advertising, paid search management, digital analytics, content marketing, data science, conversion rate optimization, e-commerce strategies, programmatic ads, and creative solutions. Ayima Group AB (publ) was founded in 2007 and is based in London, the United Kingdom.", "currency": "SEK", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "STO", "market": "se_market", "country": "United Kingdom", "city": "London"}, "BBB.L": {"short_name": "BIGBLU BROADBAND PLC ORD 15P", "long_name": "Bigblu Broadband plc", "summary": "Bigblu Broadband plc provides satellite, and wireless broadband telecommunications and related products and services in the United Kingdom, Europe, Australia, and internationally. It offers fixed wireless broadband services; and customer ongoing services, including hardware support, pre and post-sale support, installation, billing, and portal support services. The company provides its services under the Bigblu, Breiband, Europasat, SkyMesh, Quickline, Open Sky, satinternet.com, and Bordernet brand names. It serves domestic homes, multi-national corporations, the military, and governments. The company is headquartered in Oxon, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Oxfordshire"}, "BBSN.L": {"short_name": "BRAVE BISON GROUP PLC ORD 0.1P", "long_name": "Brave Bison Group plc", "summary": "Brave Bison Group plc, a social video company, engages in the creation, distribution, and monetization of online video content in Europe, the Asia-Pacific, and internationally. The company provides an online video distribution and marketing network. It helps content owners, operators, brands, publishers, and advertisers to build and engage online audiences; and enables its clients to commercialize their content to audiences on various online video platforms, such as YouTube, Facebook, and Snapchat. The company was formerly known as Rightster Group Plc and changed its name to Brave Bison Group Plc in May 2016. Brave Bison Group plc was founded in 2011 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BIDS.L": {"short_name": "BIDSTACK GROUP PLC ORD 0.5P", "long_name": "Bidstack Group Plc", "summary": "Bidstack Group Plc, together with its subsidiaries, operates as an advertising technology company in the United Kingdom. It provides dynamic, targeted, and automated native in-game advertising for the global video games industry across multiple platforms, including mobile, PC, and console. The company also offers content security and assurance services to cross platform advertisers. It serves game publishers, owners, developers, advertising agencies, brands, and programmatic advertising platforms. The company is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BMY.L": {"short_name": "BLOOMSBURY PUBLISHING PLC ORD 1", "long_name": "Bloomsbury Publishing plc", "summary": "Bloomsbury Publishing plc publishes books and other media for general readers, children, students, researchers, and professionals worldwide. The company offers books and digital resources to international research community and higher education students; online law, accounting, and tax services for the United Kingdom and Eire professionals; and consultancy and publishing services for corporations and institutions. It also provides support content for continuing professional development and teaching for teachers and trainee teachers, as well as serves communities of shared interest with sports and sports science, nautical, military history, natural history, and popular science; and study material for students of humanities, social sciences, and applied visual arts in backlist, print, and e-book formats. In addition, the company publishes cookery, fiction, non-fiction, biography, food and drink, history, memoir, popular science, and popular psychology titles for adults; and activity, fiction, non-fiction, picture, and preschool books in print, audio, and e-format for children. Bloomsbury Publishing plc was founded in 1986 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BONH.L": {"short_name": "BONHILL GROUP PLC ORD 1P", "long_name": "Bonhill Group Plc", "summary": "Bonhill Group Plc, a B2B media company, provides business insight, events, and data and analytics propositions to technology, financial services, and diversity business communities in the United Kingdom, North America, and the Asia Pacific. The company operates information-age.com, an online portal that offers news, analysis, guidance, and research for its CTO community; and organizes a range of live events programs. It also provides InvestmentNews, a source for news, analysis, and information for the US financial advisory and wealth management advisory community; Last Word Media, which addresses the sales and marketing needs of the global asset management industry and the information requirements of wealth managers; What Investment that offers private investors with advice on funds, shares, and finance ideas; Growth Company Investor, which provides advice on investing in AIM and other junior stock markets; Tax Guide that offers advice on a range of personal and business tax matters; Smallbusiness.co.uk, which provides insight and guidance to UK entrepreneurs and small business owners; and Growthbusiness.co.uk that offers advice for business owners and managers. In addition, the company operates investor facing brands, which provides seven news and information websites, and two print magazine titles; and asset managers with event services, content marketing solutions, and research data products, as well as hosts 86 live events. Further, it operates DiversityQ.com, an online portal that offers board members, HR professionals, and D&I practitioners with the news, analysis, and case studies from industry practitioners, practice guidance, and research on the D&I sector; and provides live events programs comprising a range of events to facilitate networking, create forums, and provide opportunities to celebrate achievements. Bonhill Group Plc was founded in 1991 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BT-A.L": {"short_name": "BT GROUP PLC ORD 5P", "long_name": "BT Group plc", "summary": "BT Group plc provides communications products and services in the United Kingdom, Europe, the Middle East, Africa, the Americas, the Asia Pacific, and internationally. It operates through Consumer, Enterprise, Global, and Openreach segments. The Consumer segment offers mobile, broadband, home phone, and TV services under the BT, EE and Plusnet brands. The Enterprise segment sells communications and IT services to businesses and public sector organizations; and provides network products and services to communications providers. Its services include fixed voice, mobile, fixed connectivity, and IT services. The Global segment offers connectivity, communications, and IT services to multinational corporations. Its services include voice and data network, managed, security and network, and IT infrastructure services The Openreach segment builds and sells access to the network that connects the homes and businesses. It provides wholesale Â\u0091last mile' fixed access from homes and businesses to exchanges; and installs and maintains fiber and copper communications networks. The company was formerly known as Newgate Telecommunications Limited and changed its name to BT Group plc in September 2001. BT Group plc was incorporated in 2001 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "BTGOF": {"short_name": "BT GROUP", "long_name": "BT Group plc", "summary": "BT Group plc provides communications products and services in the United Kingdom, Europe, the Middle East, Africa, the Americas, the Asia Pacific, and internationally. It operates through Consumer, Enterprise, Global, and Openreach segments. The Consumer segment offers mobile, broadband, home phone, and TV services under the BT, EE and Plusnet brands. The Enterprise segment sells communications and IT services to businesses and public sector organizations; and provides network products and services to communications providers. Its services include fixed voice, mobile, fixed connectivity, and IT services. The Global segment offers connectivity, communications, and IT services to multinational corporations. Its services include voice and data network, managed, security and network, and IT infrastructure services The Openreach segment builds and sells access to the network that connects the homes and businesses. It provides wholesale Â\u0091last mile' fixed access from homes and businesses to exchanges; and installs and maintains fiber and copper communications networks. The company was formerly known as Newgate Telecommunications Limited and changed its name to BT Group plc in September 2001. BT Group plc was incorporated in 2001 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "BTQ.DE": {"short_name": "BT GROUP PLC  LS 0.05", "long_name": "BT Group plc", "summary": "BT Group plc provides communications products and services in the United Kingdom, Europe, the Middle East, Africa, the Americas, the Asia Pacific, and internationally. It operates through Consumer, Enterprise, Global, and Openreach segments. The Consumer segment offers mobile, broadband, home phone, and TV services under the BT, EE and Plusnet brands. The Enterprise segment sells communications and IT services to businesses and public sector organizations; and provides network products and services to communications providers. Its services include fixed voice, mobile, fixed connectivity, and IT services. The Global segment offers connectivity, communications, and IT services to multinational corporations. Its services include voice and data network, managed, security and network, and IT infrastructure services The Openreach segment builds and sells access to the network that connects the homes and businesses. It provides wholesale Â\u0091last mile' fixed access from homes and businesses to exchanges; and installs and maintains fiber and copper communications networks. The company was formerly known as Newgate Telecommunications Limited and changed its name to BT Group plc in September 2001. BT Group plc was incorporated in 2001 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "GER", "market": "de_market", "country": "United Kingdom", "city": "London"}, "BTQ.F": {"short_name": "BT GROUP PLC  LS 0.05", "long_name": "BT Group plc", "summary": "BT Group plc provides communications products and services in the United Kingdom, Europe, the Middle East, Africa, the Americas, the Asia Pacific, and internationally. It operates through Consumer, Enterprise, Global, and Openreach segments. The Consumer segment offers mobile, broadband, home phone, and TV services under the BT, EE and Plusnet brands. The Enterprise segment sells communications and IT services to businesses and public sector organizations; and provides network products and services to communications providers. Its services include fixed voice, mobile, fixed connectivity, and IT services. The Global segment offers connectivity, communications, and IT services to multinational corporations. Its services include voice and data network, managed, security and network, and IT infrastructure services The Openreach segment builds and sells access to the network that connects the homes and businesses. It provides wholesale Â\u0091last mile' fixed access from homes and businesses to exchanges; and installs and maintains fiber and copper communications networks. The company was formerly known as Newgate Telecommunications Limited and changed its name to BT Group plc in September 2001. BT Group plc was incorporated in 2001 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "CDM.L": {"short_name": "CODEMASTERS GROUP HOLDINGS PLC ", "long_name": "Codemasters Group Holdings plc", "summary": "Codemasters Group Holdings plc, together with its subsidiaries, develops and sells racing games in the United Kingdom, rest of Europe, the United States, Australia, and internationally. The company's game portfolio comprise F1 series, GRID, DiRT Rally 2.0, and ONRUSH. It also offers interactive entertainment software. The company was incorporated in 2007 and is headquartered in Southam, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Southam"}, "CINE.L": {"short_name": "CINEWORLD GROUP PLC ORD 1P", "long_name": "Cineworld Group plc", "summary": "Cineworld Group plc engages in the cinema business. It is also involved in financing, retail, cinema property leasing, property, software development and provision, ticket booking, film distribution, advertising, general partner, and gift promotion activities. The company operates its cinema sites under the Regal, United Artists, Edwards theatres, Cineworld, Picturehouse, Cinema City, Yes Planet, and Rav-Chen brands. As of December 31, 2019, it operated 9,500 screens in 787 sites in the United States, the United Kingdom, Ireland, Poland, Israel, Hungary, Romania, the Czech Republic, Bulgaria, and Slovakia. The company was founded in 1995 and is headquartered in Brentford, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Brentford"}, "CNIC.L": {"short_name": "CENTRALNIC GROUP PLC ORD 0.1P", "long_name": "CentralNic Group Plc", "summary": "CentralNic Group plc, a domain name service provider, operates as an owner and registrant of a portfolio of domain names worldwide. It operates through Reseller, Small Business, and Corporate segments. The Reseller segment distributes domain names and provides consultancy services to retailers. The Small Business provides domain names and ancillary services to end users. The Corporate segment offers technical and consultancy services to corporate clients; licenses its registry management platform; and provides domain names and monitoring services to protect brands online. The company was founded in 1996 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "CNNWF": {"short_name": "CINEWORLD GROUP", "long_name": "Cineworld Group plc", "summary": "Cineworld Group plc engages in the cinema business. It is also involved in financing, retail, cinema property leasing, property, software development and provision, ticket booking, film distribution, advertising, general partner, and gift promotion activities. The company operates its cinema sites under the Regal, United Artists, Edwards theatres, Cineworld, Picturehouse, Cinema City, Yes Planet, and Rav-Chen brands. As of December 31, 2019, it operated 9,500 screens in 787 sites in the United States, the United Kingdom, Ireland, Poland, Israel, Hungary, Romania, the Czech Republic, Bulgaria, and Slovakia. The company was founded in 1995 and is headquartered in Brentford, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Entertainment", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Brentford"}, "DBOX.L": {"short_name": "DIGITALBOX PLC ORD 1P", "long_name": "Digitalbox plc", "summary": "Digitalbox Publishing Ltd creates digital marketing campaigns. The company also publishes Entertainment Daily, an entertainment news web portal. Digitalbox Publishing Ltd was founded in 2015 and is headquartered in Bath, United Kingdom. Digitalbox Publishing Ltd operates as a subsidiary of Digitalbox Publishing (Holdings) Limited.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Bath"}, "DCD.L": {"short_name": "DCD MEDIA PLC ORD GBP1.00", "long_name": "DCD Media Plc", "summary": "DCD Media Plc, together with its subsidiaries, operates as an independent television production and distribution company in the United Kingdom, rest of Europe, North and South America, and internationally. It operates in two segments, Rights and Licensing, and Production. The Rights and Licensing segment is involved in the sale of distribution rights, DVDs, and music, as well as publishing deals through DCD rights. The Production segment produces television content. The company was incorporated in 1997 and is headquartered in London, the United Kingdom. DCD Media Plc is a subsidiary of Timeweave Ltd.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "DGW2.F": {"short_name": "DAILY MAIL GENL A LS-,125", "long_name": "Daily Mail and General Trust plc", "summary": "Daily Mail and General Trust plc manage a portfolio of companies that provides information, analysis, insight, events, news, and entertainment services to businesses and consumers in the United Kingdom, North America, and internationally. It operates in five divisions: Insurance Risk, Property Information, EdTech, Events and Exhibitions, and Consumer Media. The Insurance Risk division offers risk modelling services; and invests in software, data, data analytics and applications. The Property Information division provides services that uses technology, data, and workflow to streamline and reduce the risk associated with commercial and residential property transactions. The EdTech division offers college, career, and life readiness tools to middle and high schools; student match and fit solutions for college admissions offices; and a student success platform for colleges and universities to guide students from enrolment to degree completion through Naviance, Intersect, and Starfish platforms. The Events and Exhibitions division organizes B2B exhibitions and conferences with events in the energy, construction, interiors, hotel, hospitality, and leisure sectors. The Consumer Media division publishes newspapers under the Daily Mail, The Mail on Sunday, and Metro brands; operates MailOnline, an English language newspaper website; and i, a newspaper and website. The company was founded in 1896 and is headquartered in London, the United Kingdom. Daily Mail and General Trust plc is a subsidiary of Rothermere Continuation Limited.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "DGW2.SG": {"short_name": "Daily Mail & General Trust PLCR", "long_name": "Daily Mail and General Trust plc", "summary": "Daily Mail and General Trust plc manage a portfolio of companies that provides information, analysis, insight, events, news, and entertainment services to businesses and consumers in the United Kingdom, North America, and internationally. It operates in five divisions: Insurance Risk, Property Information, EdTech, Events and Exhibitions, and Consumer Media. The Insurance Risk division offers risk modelling services; and invests in software, data, data analytics and applications. The Property Information division provides services that uses technology, data, and workflow to streamline and reduce the risk associated with commercial and residential property transactions. The EdTech division offers college, career, and life readiness tools to middle and high schools; student match and fit solutions for college admissions offices; and a student success platform for colleges and universities to guide students from enrolment to degree completion through Naviance, Intersect, and Starfish platforms. The Events and Exhibitions division organizes B2B exhibitions and conferences with events in the energy, construction, interiors, hotel, hospitality, and leisure sectors. The Consumer Media division publishes newspapers under the Daily Mail, The Mail on Sunday, and Metro brands; operates MailOnline, an English language newspaper website; and i, a newspaper and website. The company was founded in 1896 and is headquartered in London, the United Kingdom. Daily Mail and General Trust plc is a subsidiary of Rothermere Continuation Limited.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "STU", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "DMGT.L": {"short_name": "DAILY MAIL & GENERAL TRUST PLC ", "long_name": "Daily Mail and General Trust plc", "summary": "Daily Mail and General Trust plc manage a portfolio of companies that provides information, analysis, insight, events, news, and entertainment services to businesses and consumers in the United Kingdom, North America, and internationally. It operates in five divisions: Insurance Risk, Property Information, EdTech, Events and Exhibitions, and Consumer Media. The Insurance Risk division offers risk modelling services; and invests in software, data, data analytics and applications. The Property Information division provides services that uses technology, data, and workflow to streamline and reduce the risk associated with commercial and residential property transactions. The EdTech division offers college, career, and life readiness tools to middle and high schools; student match and fit solutions for college admissions offices; and a student success platform for colleges and universities to guide students from enrolment to degree completion through Naviance, Intersect, and Starfish platforms. The Events and Exhibitions division organizes B2B exhibitions and conferences with events in the energy, construction, interiors, hotel, hospitality, and leisure sectors. The Consumer Media division publishes newspapers under the Daily Mail, The Mail on Sunday, and Metro brands; operates MailOnline, an English language newspaper website; and i, a newspaper and website. The company was founded in 1896 and is headquartered in London, the United Kingdom. Daily Mail and General Trust plc is a subsidiary of Rothermere Continuation Limited.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "DODS.L": {"short_name": "DODS GROUP PLC ORD 1P", "long_name": "Dods Group plc", "summary": "Dods Group plc operates as a business intelligence, events, media, and training company in the United Kingdom and internationally. The company offers an online service that provides access to political representatives and public affairs professionals; tailored intelligence to understand and react to political and policy issues; polling services to engage with civil service, NHS, and local government audiences; and MP polling service to ask politicians the questions. It also provides learning and development training courses on governance, policy making, and communication skills; magazines, Websites, and reference books in politics and public office; and daily, weekly, and monthly newsletters, as well as organizes events to connect with the people to reach and prepare for changes to the political and business landscape. The company was incorporated in 2001 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "DQ6.F": {"short_name": "CINEWORLD GRP PLC LS -,01", "long_name": "Cineworld Group plc", "summary": "Cineworld Group plc engages in the cinema business. It is also involved in financing, retail, cinema property leasing, property, software development and provision, ticket booking, film distribution, advertising, general partner, and gift promotion activities. The company operates its cinema sites under the Regal, United Artists, Edwards theatres, Cineworld, Picturehouse, Cinema City, Yes Planet, and Rav-Chen brands. As of December 31, 2019, it operated 9,500 screens in 787 sites in the United States, the United Kingdom, Ireland, Poland, Israel, Hungary, Romania, the Czech Republic, Bulgaria, and Slovakia. The company was founded in 1995 and is headquartered in Brentford, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Brentford"}, "EBQ.L": {"short_name": "EBIQUITY PLC ORD 25P", "long_name": "Ebiquity plc", "summary": "Ebiquity plc, together with its subsidiaries, provides independent media and marketing consultancy worldwide. The company operates in two segments, Media and Analytics & Tech. The Media segment helps advertisers to monitor and evaluate their agencies media buying performance; advises clients on management and selection of media agencies, setting media buying objectives, and the organization of media functions; and supports advertisers to ensure that agencies deliver services as contractually agreed. The Analytics & Tech segment helps advertisers to plan and optimize their investments in media and marketing; supports brand owners to address the specific challenges of managing digital media and programmatic media trading; and assists brands to improve the effectiveness of their digital presence, as well as provides a range of consulting, analytics, and optimization services. It also offers EbiquityConnect, which streamlines data ingestion from agencies; EbiquitySelect that supports its agency selection work; and EbiquitySync, a standardized tool for benchmarking paid digital media spend. The company was formerly known as Thomson Intermedia Plc. Ebiquity plc was founded in 1997 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "EMAN.L": {"short_name": "EVERYMAN MEDIA GROUP PLC ORD 10", "long_name": "Everyman Media Group plc", "summary": "Everyman Media Group PLC, together with its subsidiaries, owns and manages cinemas in the United Kingdom. As of April 6, 2020, it operated 33 venues with 110 screens under the Everyman brand. The company was formerly known as Finlaw Two Plc and changed its name to Everyman Media Group Plc in October 2013. Everyman Media Group PLC was founded in 1933 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "EVY.F": {"short_name": "EVERYMAN MEDIA GR. LS-,10", "long_name": "Everyman Media Group plc", "summary": "Everyman Media Group PLC, together with its subsidiaries, owns and manages cinemas in the United Kingdom. As of April 6, 2020, it operated 33 venues with 110 screens under the Everyman brand. The company was formerly known as Finlaw Two Plc and changed its name to Everyman Media Group Plc in October 2013. Everyman Media Group PLC was founded in 1933 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "FDEV.L": {"short_name": "FRONTIER DEVELOPMENTS PLC ORD 0", "long_name": "Frontier Developments plc", "summary": "Frontier Developments plc develops and publishes video games for personal computers and videogame consoles in the United Kingdom. It develops games across various platforms using its cross platform technology. The company was founded in 1994 and is headquartered in Cambridge, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Cambridge"}, "FLEXM.ST": {"short_name": "Flexion Mobile Plc", "long_name": "Flexion Mobile Plc", "summary": "Flexion Mobile Plc operates a distribution platform for third party free-to-play games on the Android market worldwide. It offers global distribution, automated enabling, and full services. The company's global distribution offers platform for android games developers; full service provides enabling, testing, updates, billing, channel management, distribution, compliance customer, and settlement reporting; and automated enabling comprise enabling and enhancement. It also provides distribution channels account management, developer's revenue reconciliation and settlement, and game files enhancement services. The company was founded in 2001 and is headquartered in London, the United Kingdom.", "currency": "SEK", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "STO", "market": "se_market", "country": "United Kingdom", "city": "London"}, "FNWA.F": {"short_name": "FUTURE PLC  LS-,15", "long_name": "Future plc", "summary": "Future plc, together with its subsidiaries, publishes content for technology, games, TV and entertainment, women's lifestyle, real life, music, creative and photography, sports, home interest, and B2B sectors primarily in the United States and the United Kingdom. It operates through Media and Magazine segments. The Media segment provides e-commerce, digital advertising, events, lead generation, newsletters and CRM, and digital licensing services. The Magazine segment creates specialist magazines and bookazines in print and digital formats; and offers print licensing services. The company also provides endorsement licensing, comparison shopping, and video content production services, as well as various sales and distribution services to third party publishers. Future plc was founded in 1985 and is based in Bath, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Bath"}, "FOUR.L": {"short_name": "4IMPRINT GROUP PLC ORD 38 6/13P", "long_name": "4imprint Group plc", "summary": "4imprint Group plc operates as a direct marketer of promotional products in North America, the United Kingdom, and Ireland. It offers apparel, bags, drinkware, and stationery, as well as writing, technology, outdoor and leisure, tradeshows and signage, auto, home and tools, and wellness and safety products. The company markets its products to individuals in businesses and organizations. 4imprint Group plc was incorporated in 1921 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "FRFR": {"short_name": "FRITZY TECH INC", "long_name": "Fritzy Tech Inc.", "summary": "Fritzy Tech Inc. does not have significant operations. It intends to launch Zshoppers.com and homekout.com brands. The company was formerly known as First Priority Tax Solutions Inc. and changed its name to Fritzy Tech Inc. in December 2019. The company was founded in 2014 and is based in London, the United Kingdom. Fritzy Tech Inc. is a subsidiary of Silverlight International Limited.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "FUTR.L": {"short_name": "FUTURE PLC ORD 15P", "long_name": "Future plc", "summary": "Future plc, together with its subsidiaries, publishes content for technology, games, TV and entertainment, women's lifestyle, real life, music, creative and photography, sports, home interest, and B2B sectors primarily in the United States and the United Kingdom. It operates through Media and Magazine segments. The Media segment provides e-commerce, digital advertising, events, lead generation, newsletters and CRM, and digital licensing services. The Magazine segment creates specialist magazines and bookazines in print and digital formats; and offers print licensing services. The company also provides endorsement licensing, comparison shopping, and video content production services, as well as various sales and distribution services to third party publishers. Future plc was founded in 1985 and is based in Bath, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Bath"}, "GAMA.L": {"short_name": "GAMMA COMMUNICATIONS PLC ORD 0.", "long_name": "Gamma Communications plc", "summary": "Gamma Communications plc provides communications and software services for business in the United Kingdom and internationally. It offers strategic services, such as collaboration, cloud PBX, SIP trunking, inbound call control, and network services; enabling services, including ethernet, broadband, and mobile; and traditional call and line services. The company offers its services through a network of channel partners, as well as directly to end users. It serves small, medium, and large sized business customers. Gamma Communications plc was founded in 2001 and is headquartered in Newbury, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Newbury"}, "GILD.L": {"short_name": "GUILD ESPORTS PLC ORD GBP0.001", "long_name": "Guild Esports Plc", "summary": "Guild Esports Plc does not have significant operations. It focuses to own and operate an esports team. The company was formerly known as The Lords Esports plc and changed its name to Guild Esports Plc in April 2020. Guild Esports Plc was incorporated in 2019 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "GOCO.L": {"short_name": "GOCO GROUP PLC ORD GBP0.0002", "long_name": "GoCo Group plc", "summary": "GoCo Group plc operates Internet-based price comparison Websites for financial and non-financial products in the United Kingdom. The company's Gocompare.com Website enables people to compare the costs and features of various insurance policies, financial products, and energy tariffs. It also provides weflip, an automated savings service; Look After My Bills, an automated energy savings service; MyVoucherCodes, a discount voucher website; and Energylinx, a domestic and business energy comparison and switching service. The company was formerly known as GoCompare.com Group plc and changed its name to GoCo Group plc in May 2019. GoCo Group plc was founded in 2006 and is headquartered in Newport, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Newport"}, "GU0.F": {"short_name": "GUILD ESPORTS PLC LS-,001", "long_name": "Guild Esports Plc", "summary": "Guild Esports Plc does not have significant operations. It focuses to own and operate an esports team. The company was formerly known as The Lords Esports plc and changed its name to Guild Esports Plc in April 2020. Guild Esports Plc was incorporated in 2019 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "GULDF": {"short_name": "GUILD ESPORTS PLC", "long_name": "Guild Esports Plc", "summary": "Guild Esports Plc does not have significant operations. It focuses to own and operate an esports team. The company was formerly known as The Lords Esports plc and changed its name to Guild Esports Plc in April 2020. Guild Esports Plc was incorporated in 2019 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Entertainment", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "HHRN.F": {"short_name": "BIDSTACK GROUP  LS -,005", "long_name": "Bidstack Group Plc", "summary": "Bidstack Group Plc, together with its subsidiaries, operates as an advertising technology company in the United Kingdom. It provides dynamic, targeted, and automated native in-game advertising for the global video games industry across multiple platforms, including mobile, PC, and console. The company also offers content security and assurance services to cross platform advertisers. It serves game publishers, owners, developers, advertising agencies, brands, and programmatic advertising platforms. The company is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "HTWS.L": {"short_name": "HELIOS TOWERS PLC ORD 1P", "long_name": "Helios Towers plc", "summary": "Helios Towers plc, an independent tower company, builds, acquires, and operates telecommunications towers and related passive infrastructure. It provides site space to mobile network operators and other telecommunications providers that in turn provide wireless voice and data services to consumers and businesses. The company also offers comprehensive tower-related operational services, including site selection, site preparation, construction, maintenance, security, and power management. It has a network of 6,974 sites and 14,591 tenancies in Tanzania, the Democratic Republic of Congo, Congo Brazzaville, Ghana, and South Africa. The company was founded in 2009 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ICON.L": {"short_name": "ICONIC LABS PLC ORD 0.001P", "long_name": "Iconic Labs Plc", "summary": "Iconic Labs Plc engages in media and technology business, focuses providing online marketing, and content and technology driven products. It also engages in digital and social media publishing activities. The company offers advisory services to clients on their businesses; and delivers campaigns, as well as provides creative services to its clients. Its activities include monthly insights, content creation and distribution, post campaign analysis, and combining with online media brands. The company was formerly known as WideCells Group PLC and changed its name to Iconic Labs Plc in July 2019. Iconic Labs Plc was founded in 2012 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "IFJPY": {"short_name": "INFORMA PLC", "long_name": "Informa plc", "summary": "Informa plc operates as a business-to-business events, academic publishing, and information services company worldwide. It operates through five divisions: Informa Connect, Informa Intelligence, Informa Markets, Informa Tech, and Taylor & Francis. The Informa Connect division provides content-driven events and digital platforms that allow professionals to meet, connect, learn, and share knowledge. This division operates events in finance, biotech, and pharma, as well as in other specialist markets. The Informa Intelligence division offers digital intelligence and data-based products, consultancy, and research services in the areas of pharma, financial, maritime, and asset intelligence, as well as Barbour ABI, a provider of construction market intelligence and building project leads for built environment specialists. The Informa Markets division creates platforms for international markets, which provide brands, exhibitions, specialist digital content, and data solutions to customers operating in specialist markets to meet and trade. The Informa Tech division offers research, media, training, and events that inform, educate, and connect businesses and professionals working in technology. The Taylor & Francis division publishes books for upper level university students, researchers, and academic institutions in a range of specialist subjects; and journals under imprints such as Routledge, Taylor & Francis, and Cogent OA. This segment has a portfolio of approximately 145,000 book titles and 2,700 journals. The company was formerly known as T&F Informa plc and changed its name to Informa plc in August 2005. Informa plc was founded in 1998 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Publishing", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "IJ7.F": {"short_name": "ITV PLC  LS -,10", "long_name": "ITV plc", "summary": "ITV plc, an integrated producer broadcaster, creates, owns, and distributes content on various platforms worldwide. It operates through Broadcast & Online, and ITV Studios segments. The Broadcast & Online segment broadcasts various contents on its family of free-to-air channels, including ITV, ITV2, ITV3, ITV4, ITVBe, ITV Encore, CITV, ITV Breakfast, CITV Breakfast, and various related +1 and HD equivalents; and offers television advertising services. It also delivers content through linear television broadcasting; ITV Hub, an over-the-top service on 28 platforms, including itv.com Website; and pay providers, such as Virgin and Sky, as well as through direct content deals with services comprising Amazon, Apple, and Netflix. In addition, this segment offers online advertising, HD digital channel on pay platform, and ITV Choice subscription services, as well as licenses DTT Multiplex A. The ITV Studios segment creates and produces programs and formats that include drama, entertainment, and factual entertainment for its own channels and other broadcasters, such as the BBC, Channel 4, Channel 5, and Sky. It also operates as an unscripted independent producer of content in the United States; and produces content for local broadcasters in Australia, Germany, France, Italy, the Netherlands, Sweden, Norway, Finland, and Denmark. In addition, this segment's distribution business licenses finished programs and formats, and third-party content internationally, as well as finances productions. The company also engages in the development of platform, broadband, transactional, and mobile services; operation of Freeview Multiplex A; rights ownership and distribution of television programs and films; and scheduling and commissioning of television programs. ITV plc was founded in 1955 is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "IME.L": {"short_name": "IMMEDIA GROUP PLC ORD 10P", "long_name": "Immedia Group Plc", "summary": "Immedia Group Plc, together with its subsidiaries, engages in the marketing and communication service business through the provision of interactive digital channels products and services using music, radio, and screen-based media primarily in the United Kingdom. It operates through two segments, Production and Operations. The company's Production segment creates content that include audio based live and recorded radio, music, advertising, and branding; and video based video, music advertising and branding, digital Web and application designs, and digital solutions for audio visual, 3D, virtual reality, and augmented reality content. Its Operations segment engages in the supply, installation, and sale/hire of equipment that delivers content to customers that include broadband and satellite technologies, as well as maintenance of equipment. The company was formerly known as Immedia Broadcasting Plc and changed its name to Immedia Group Plc in September 2008. Immedia Group Plc was founded in 2000 and is based in Newbury, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Newbury"}, "IMMO.L": {"short_name": "IMMOTION GROUP PLC ORD GBP0.000", "long_name": "Immotion Group Plc", "summary": "Immotion Group Plc engages in the production of virtual reality (VR) content, experiences, equipment, and software design in the United Kingdom and internationally. It offers VR motion platforms in leisure destinations and rental spaces in retail and family entertainment destinations. Immotion Group Plc was founded in 1996 and is headquartered in Manchester, United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Manchester"}, "IMW.F": {"short_name": "4IMPRINT GRP  LS-,3846", "long_name": "4imprint Group plc", "summary": "4imprint Group plc operates as a direct marketer of promotional products in North America, the United Kingdom, and Ireland. It offers apparel, bags, drinkware, and stationery, as well as writing, technology, outdoor and leisure, tradeshows and signage, auto, home and tools, and wellness and safety products. The company markets its products to individuals in businesses and organizations. 4imprint Group plc was incorporated in 1921 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "ITV.L": {"short_name": "ITV PLC ORD 10P", "long_name": "ITV plc", "summary": "ITV plc, an integrated producer broadcaster, creates, owns, and distributes content on various platforms worldwide. It operates through Broadcast & Online, and ITV Studios segments. The Broadcast & Online segment broadcasts various contents on its family of free-to-air channels, including ITV, ITV2, ITV3, ITV4, ITVBe, ITV Encore, CITV, ITV Breakfast, CITV Breakfast, and various related +1 and HD equivalents; and offers television advertising services. It also delivers content through linear television broadcasting; ITV Hub, an over-the-top service on 28 platforms, including itv.com Website; and pay providers, such as Virgin and Sky, as well as through direct content deals with services comprising Amazon, Apple, and Netflix. In addition, this segment offers online advertising, HD digital channel on pay platform, and ITV Choice subscription services, as well as licenses DTT Multiplex A. The ITV Studios segment creates and produces programs and formats that include drama, entertainment, and factual entertainment for its own channels and other broadcasters, such as the BBC, Channel 4, Channel 5, and Sky. It also operates as an unscripted independent producer of content in the United States; and produces content for local broadcasters in Australia, Germany, France, Italy, the Netherlands, Sweden, Norway, Finland, and Denmark. In addition, this segment's distribution business licenses finished programs and formats, and third-party content internationally, as well as finances productions. The company also engages in the development of platform, broadband, transactional, and mobile services; operation of Freeview Multiplex A; rights ownership and distribution of television programs and films; and scheduling and commissioning of television programs. ITV plc was founded in 1955 is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "ITVPF": {"short_name": "ITV", "long_name": "ITV plc", "summary": "ITV plc, an integrated producer broadcaster, creates, owns, and distributes content on various platforms worldwide. It operates through Broadcast & Online, and ITV Studios segments. The Broadcast & Online segment broadcasts various contents on its family of free-to-air channels, including ITV, ITV2, ITV3, ITV4, ITVBe, ITV Encore, CITV, ITV Breakfast, CITV Breakfast, and various related +1 and HD equivalents; and offers television advertising services. It also delivers content through linear television broadcasting; ITV Hub, an over-the-top service on 28 platforms, including itv.com Website; and pay providers, such as Virgin and Sky, as well as through direct content deals with services comprising Amazon, Apple, and Netflix. In addition, this segment offers online advertising, HD digital channel on pay platform, and ITV Choice subscription services, as well as licenses DTT Multiplex A. The ITV Studios segment creates and produces programs and formats that include drama, entertainment, and factual entertainment for its own channels and other broadcasters, such as the BBC, Channel 4, Channel 5, and Sky. It also operates as an unscripted independent producer of content in the United States; and produces content for local broadcasters in Australia, Germany, France, Italy, the Netherlands, Sweden, Norway, Finland, and Denmark. In addition, this segment's distribution business licenses finished programs and formats, and third-party content internationally, as well as finances productions. The company also engages in the development of platform, broadband, transactional, and mobile services; operation of Freeview Multiplex A; rights ownership and distribution of television programs and films; and scheduling and commissioning of television programs. ITV plc was founded in 1955 is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "ITVPY": {"short_name": "ITV", "long_name": "ITV plc", "summary": "ITV plc, an integrated producer broadcaster, creates, owns, and distributes content on various platforms worldwide. It operates through Broadcast & Online, and ITV Studios segments. The Broadcast & Online segment broadcasts various contents on its family of free-to-air channels, including ITV, ITV2, ITV3, ITV4, ITVBe, ITV Encore, CITV, ITV Breakfast, CITV Breakfast, and various related +1 and HD equivalents; and offers television advertising services. It also delivers content through linear television broadcasting; ITV Hub, an over-the-top service on 28 platforms, including itv.com Website; and pay providers, such as Virgin and Sky, as well as through direct content deals with services comprising Amazon, Apple, and Netflix. In addition, this segment offers online advertising, HD digital channel on pay platform, and ITV Choice subscription services, as well as licenses DTT Multiplex A. The ITV Studios segment creates and produces programs and formats that include drama, entertainment, and factual entertainment for its own channels and other broadcasters, such as the BBC, Channel 4, Channel 5, and Sky. It also operates as an unscripted independent producer of content in the United States; and produces content for local broadcasters in Australia, Germany, France, Italy, the Netherlands, Sweden, Norway, Finland, and Denmark. In addition, this segment's distribution business licenses finished programs and formats, and third-party content internationally, as well as finances productions. The company also engages in the development of platform, broadband, transactional, and mobile services; operation of Freeview Multiplex A; rights ownership and distribution of television programs and films; and scheduling and commissioning of television programs. ITV plc was founded in 1955 is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "IVME": {"short_name": "IN VERITAS MEDICAL DIAGNOSTICS ", "long_name": "In Veritas Medical Diagnostics, Inc.", "summary": "In Veritas Medical Diagnostics, Inc., a development stage company, engages in the research and development of medical devices with `near-patient' testing applications. Its primary product includes prothrombin monitor, which is used for the measurement of coagulation of blood in patients at risk of heart disease and stroke. The company's other products under development include predictor of labor onset, a consumer device for maternity planning; biomarker monitor for the measurement of a number of biomarkers, including heart attack, HIV, cholesterol, and cancer; blood glucose monitor, a noninvasive glucose concentration continuous bulk measuring device measurement; digital scanning machine, a noninvasive alternative to 2D X-ray scanning; osteoporosis detection and monitoring device, an instant display of bonemineral density for osteoporosis patients; and hand held digital strip reader for immunoassay applications. It was formerly known as In Vivo Medical Diagnostics, Inc. and changed its name to In Veritas Medical Diagnostics, Inc. in 2005. The company is based in Inverness, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Inverness"}, "JWNG.L": {"short_name": "JAYWING PLC ORD 5P", "long_name": "Jaywing plc", "summary": "Jaywing plc, together with its subsidiaries, provides digital marketing services in the United Kingdom and Australia. The company operates through three segments: Brand Performance, Online Performance, and Data, Analysis & Technology. It offers marketing agency and consultancy services. The company also provides data services and consultancy; search engine optimization; Website designing and building; online marketing and media; and product development services. It serves retail, FMCG, financial services, education, not-for-profit, travel and leisure, technology, utilities, oil and gas, and hospitality sectors. The company was formerly known as Weare 2020 plc and changed its name to Jaywing plc in April 2013. Jaywing plc was founded in 1999 and is based in Sheffield, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Sheffield"}, "KOO.L": {"short_name": "KOOTH PLC ORD 5P", "long_name": "Kooth plc", "summary": "Kooth plc provides digital mental health services for children and young people in the United Kingdom. It operates an online platform that offers various therapeutic tools and interventions, including self-helping tools and content; and a community for peer-to-peer support, as well as provides professional counselling services. The company was founded in 2001 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "LBTA.VI": {"short_name": "LIBERTY GLOBAL PLC-A", "long_name": "Liberty Global plc", "summary": "Liberty Global plc, together with its subsidiaries, provides video, broadband Internet, fixed-line telephony, mobile, and other communications services to residential customers and businesses in Europe. It offers Wi-Fi and Internet services, such as email, address book, and parental controls; security; online storage solutions and Web spaces; and Connect Box, a connectivity device that delivers in-home Wi-Fi coverage. The company also provides community Wi-Fi via routers in home, which provides access to the Internet; public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. In addition, its cable operations comprise various tiers of digital video programming and audio services, as well as offers digital video recorders, multimedia home gateway systems, and various mobile applications. The company's channel offerings include general entertainment, sports, movies, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. Further, it provides mobile services, such as voice, short message service, and Internet access; and circuit-switched telephony services. Additionally, the company offers voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "VIE", "market": "at_market", "country": "United Kingdom", "city": "London"}, "LBTC.VI": {"short_name": "LIBERTY GLOBAL PLC- C", "long_name": "Liberty Global plc", "summary": "Liberty Global plc, together with its subsidiaries, provides video, broadband Internet, fixed-line telephony, mobile, and other communications services to residential customers and businesses in Europe. It offers Wi-Fi and Internet services, such as email, address book, and parental controls; security; online storage solutions and Web spaces; and Connect Box, a connectivity device that delivers in-home Wi-Fi coverage. The company also provides community Wi-Fi via routers in home, which provides access to the Internet; public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. In addition, its cable operations comprise various tiers of digital video programming and audio services, as well as offers digital video recorders, multimedia home gateway systems, and various mobile applications. The company's channel offerings include general entertainment, sports, movies, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. Further, it provides mobile services, such as voice, short message service, and Internet access; and circuit-switched telephony services. Additionally, the company offers voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Entertainment", "exchange": "VIE", "market": "at_market", "country": "United Kingdom", "city": "London"}, "LBTYA": {"short_name": "Liberty Global plc", "long_name": "Liberty Global plc", "summary": "Liberty Global plc, together with its subsidiaries, provides video, broadband Internet, fixed-line telephony, mobile, and other communications services to residential customers and businesses in Europe. It offers Wi-Fi and Internet services, such as email, address book, and parental controls; security; online storage solutions and Web spaces; and Connect Box, a connectivity device that delivers in-home Wi-Fi coverage. The company also provides community Wi-Fi via routers in home, which provides access to the Internet; public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. In addition, its cable operations comprise various tiers of digital video programming and audio services, as well as offers digital video recorders, multimedia home gateway systems, and various mobile applications. The company's channel offerings include general entertainment, sports, movies, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. Further, it provides mobile services, such as voice, short message service, and Internet access; and circuit-switched telephony services. Additionally, the company offers voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Entertainment", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "LBTYAN.MX": {"short_name": "LIBERTY GLOBAL PLC", "long_name": "Liberty Global plc", "summary": "Liberty Global plc, together with its subsidiaries, provides video, broadband Internet, fixed-line telephony, mobile, and other communications services to residential customers and businesses in Europe. It offers Wi-Fi and Internet services, such as email, address book, and parental controls; security; online storage solutions and Web spaces; and Connect Box, a connectivity device that delivers in-home Wi-Fi coverage. The company also provides community Wi-Fi via routers in home, which provides access to the Internet; public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. In addition, its cable operations comprise various tiers of digital video programming and audio services, as well as offers digital video recorders, multimedia home gateway systems, and various mobile applications. The company's channel offerings include general entertainment, sports, movies, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. Further, it provides mobile services, such as voice, short message service, and Internet access; and circuit-switched telephony services. Additionally, the company offers voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.", "currency": "MXN", "sector": "Communication Services", "industry": "Entertainment", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "London"}, "LBTYB": {"short_name": "Liberty Global plc", "long_name": "Liberty Global plc", "summary": "Liberty Global plc, together with its subsidiaries, provides video, broadband Internet, fixed-line telephony, mobile, and other communications services to residential customers and businesses in Europe. It offers Wi-Fi and Internet services, such as email, address book, and parental controls; security; online storage solutions and Web spaces; and Connect Box, a connectivity device that delivers in-home Wi-Fi coverage. The company also provides community Wi-Fi via routers in home, which provides access to the Internet; public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. In addition, its cable operations comprise various tiers of digital video programming and audio services, as well as offers digital video recorders, multimedia home gateway systems, and various mobile applications. The company's channel offerings include general entertainment, sports, movies, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. Further, it provides mobile services, such as voice, short message service, and Internet access; and circuit-switched telephony services. Additionally, the company offers voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Entertainment", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "LBTYK": {"short_name": "Liberty Global plc", "long_name": "Liberty Global plc", "summary": "Liberty Global plc, together with its subsidiaries, provides video, broadband Internet, fixed-line telephony, mobile, and other communications services to residential customers and businesses in Europe. It offers Wi-Fi and Internet services, such as email, address book, and parental controls; security; online storage solutions and Web spaces; and Connect Box, a connectivity device that delivers in-home Wi-Fi coverage. The company also provides community Wi-Fi via routers in home, which provides access to the Internet; public Wi-Fi access points in train stations, hotels, bars, restaurants, and other public places. In addition, its cable operations comprise various tiers of digital video programming and audio services, as well as offers digital video recorders, multimedia home gateway systems, and various mobile applications. The company's channel offerings include general entertainment, sports, movies, documentaries, lifestyles, news, adult, children, and ethnic and foreign channels. Further, it provides mobile services, such as voice, short message service, and Internet access; and circuit-switched telephony services. Additionally, the company offers voice, advanced data, video, wireless, cloud-based services, and mobile and converged fixed-mobile services to small or home offices, small businesses, and medium and large enterprises, as well as on a wholesale basis to other operators. Liberty Global plc was founded in 2004 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Entertainment", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "London"}, "LVCG.L": {"short_name": "LIVE COMPANY GROUP PLC ORD 1P", "long_name": "Live Company Group Plc", "summary": "Live Company Group Plc operates in live events and entertainment industry in the United Kingdom, Europe, the United States, South America, Asia, and the Middle East. It operates in two segments, Tours, Events, Shows, Licences and Content Rental Fees; and Product and Content Sales. The company provides content for BRICKLIVE shows and events. It also licenses partners to manage and stage BRICKLIVE shows. The company was founded in 2017 and is headquartered in West Byfleet, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "West Byfleet"}, "MBLV": {"short_name": "MOBIVENTURES INC", "long_name": "MobiVentures, Inc.", "summary": "MobiVentures, Inc., a development stage company, provides multi-media mobile content, applications, and services in the United Kingdom. It builds Internet-based communities that are accessible over the Internet by computer or mobile phone and makes the groups of communities available to third party brands to place advertising on the Web pages generated. The company also offers consulting, management, financial, commercial, and other support to selected start-up and early stage ventures in the wireless and mobile space. It markets its services through a variety of channels, including the Internet, in-house sales, informal and formal networks, and agents. The company was formerly known as MobileMail (US) Inc. and changed its name to MobiVentures, Inc. in August 2007. MobiVentures, Inc. was founded in 2003 and is based in Swindon, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Entertainment", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Swindon"}, "MBT.L": {"short_name": "MOBILE TORNADO GROUP PLC ORD 2P", "long_name": "Mobile Tornado Group plc", "summary": "Mobile Tornado Group plc provides instant communication mobile applications worldwide. The company offers Push-to-Talk solution (PTT) that provides instant voice communication with individuals, as well as groups of participants in one call; Push-To-Message solution, which offers real-time text and image messaging with any member or certain group types in the contact list of the user; Push-To-Alert solution that allows enterprise users at risk to send a notification from their devices to control rooms and dispatchers by pressing an SOS button; and Push-To-Locate solution, which tracks individuals, crew members, dispatched relief workers, officers, and other assets using GPS-enabled devices. It also provides Dispatch Console solution that manages a remote workforce's mission-critical and day-to-day operations relies on communication lines that are always open and available; PTT Security solution used for secure communications, which eliminates the risk of interception; Recording solution, which enables to record, retrieve, and playback of PTT audio communications; and Software Development Kit for Android customers wishing to introduce PTT solutions into their existing applications. The company is headquartered in Harrogate, the United Kingdom. Mobile Tornado Group plc is a subsidiary of Intechnology plc.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Harrogate"}, "MDZ.L": {"short_name": "MEDIAZEST PLC ORD 0.01P", "long_name": "MediaZest plc", "summary": "MediaZest Plc, through its subsidiaries, provides audio, visual, satellite delivery, content management, and consumer interaction platform worldwide. The company's products include projection products, such as window projections, interactive projections onto walls and floors, building and projection mapping; virtual mannequin products; and hologram products. It also provides digital signage networks, video walls, and LED solutions; and audio solutions comprising whispering windows, in-store music, and directional speakers. In addition, the company offers system design, product sourcing, build and test, data tracking and reporting, maintenance and content management, installation, and content creation services, as well as customer data software and audience measurement solutions. It offers its products to retailers and brand owners for communicating with customers to enhance sales and brand awareness. The company has operations in the United Kingdom, the Channel Islands, the Netherlands, Switzerland, Italy, Germany, North America, and internationally. MediaZest Plc was incorporated in 2004 and is based in Woking, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Woking"}, "MIRA.L": {"short_name": "MIRADA PLC ORD 100P", "long_name": "Mirada Plc", "summary": "Mirada Plc provides products and services for digital TV and broadcast market in Mexico, Europe, Asia, and other Americas. Its products include Iris ecosystem that provides a platform for front and back end application; UX Evolver, a back-end tool; Iris OTT, a platform that delivers content to viewers; Iris Inspire user interface; and Iris SDP, a back-end platform that manages TV programming, cross-device functionalities, subscriptions, purchases, and others. It also provides Iris CMS, a web-based, intuitive, and scalable tool to acquire, manage, edit, and commercialize content; Log IQ, a data intelligence platform that empowers to take better and data-driven decisions; and Mirada Kids, an app for kids. The company was formerly known as YooMedia Plc and changed its name to Mirada Plc in February 2008. Mirada Plc was incorporated in 1998 and is headquartered in Sutton, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Sutton"}, "MIRI.L": {"short_name": "MIRRIAD ADVERTISING PLC ORD GBP", "long_name": "Mirriad Advertising plc", "summary": "Mirriad Advertising plc, a video technology company, provides in-video advertising services to broadcasters, advertisers, brand owners, and their agencies. It inserts product, signage, or video into existing content. It serves customers in the United Kingdom, the United States, China, Singapore, and India. Mirriad Advertising plc was incorporated in 2015 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "MMDDF": {"short_name": "MIRRIAD ADVERTISING PLC", "long_name": "Mirriad Advertising plc", "summary": "Mirriad Advertising plc, a video technology company, provides in-video advertising services to broadcasters, advertisers, brand owners, and their agencies. It inserts product, signage, or video into existing content. It serves customers in the United Kingdom, the United States, China, Singapore, and India. Mirriad Advertising plc was incorporated in 2015 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "MONY.L": {"short_name": "MONEYSUPERMARKET.COM GROUP PLC ", "long_name": "Moneysupermarket.com Group PLC", "summary": "Moneysupermarket.com Group PLC, together with its subsidiaries, provides price comparison and editorial-based websites in the United Kingdom. The company operates through Insurance, Money, Home Services, and Other segments. It offers online and app-based tools to save money on their household bills under the MoneySuperMarket brand; and price comparison for package holidays, car rental, flights, hotels, and various travel costs, including travel insurance, transfers, and airport parking under the TravelSupermarket brand, as well as operates a consumer finance website under the MoneySavingExpert brand, and price comparison platform under the Decision Tech brand. The company also provides financial intermediary services. Moneysupermarket.com Group PLC was founded in 1993 and is headquartered in Chester, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Chester"}, "NAH.L": {"short_name": "NAHL GROUP PLC ORD GBP0.0025", "long_name": "NAHL Group plc", "summary": "NAHL Group plc, together with its subsidiaries, engages in the marketing and services business focusing on the consumer legal services market in the United Kingdom. The company operates through Personal Injury, Critical Care, and Residential Property divisions. The Personal Injury division offers outsourced marketing services and products to law firms; and claims processing services to individuals. The Critical Care division provides specialist services in the catastrophic and serious injury market to claimants and defendants. Its services include expert witness quantum reports and nursing liability reports; immediate needs assessments; case management services for short or long term needs; vocational rehabilitation services; and behavior assessment and management services for children and young people. The Residential Property division offers marketing services to law firms and conveyancers, as well as surveys process services. NAHL Group plc was founded in 1993 and is based in Kettering, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Kettering"}, "NFC.L": {"short_name": "NEXT FIFTEEN COMMUNICATIONS GRO", "long_name": "Next Fifteen Communications Group plc", "summary": "Next Fifteen Communications Group plc provides communications services in the United Kingdom, Europe, the Middle East, Africa, the United States, and the Asia Pacific. It offers strategy and insight, online marketing, corporate and internal communications, media training, brand and message consultancy, market research, digital, marketing communications, and creative and content, as well as public, media, analyst, and investor relations services; and digital and technology products and services. The company provides its services under the agent3, Encore Digital Media, Publitek, Beyond, Savanta, M Booth, Archetype, Twogether, ODD, The Blueshirt Group, The OutCast Agency, Velocity, Elvis, Brandwidth, Activate, Planning-inc, Palladium, and Mighty Social brands. Next Fifteen Communications Group plc was founded in 1981 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "NHLPF": {"short_name": "NAHL GROUP PLC", "long_name": "NAHL Group plc", "summary": "NAHL Group plc, together with its subsidiaries, engages in the marketing and services business focusing on the consumer legal services market in the United Kingdom. The company operates through Personal Injury, Critical Care, and Residential Property divisions. The Personal Injury division offers outsourced marketing services and products to law firms; and claims processing services to individuals. The Critical Care division provides specialist services in the catastrophic and serious injury market to claimants and defendants. Its services include expert witness quantum reports and nursing liability reports; immediate needs assessments; case management services for short or long term needs; vocational rehabilitation services; and behavior assessment and management services for children and young people. The Residential Property division offers marketing services to law firms and conveyancers, as well as surveys process services. NAHL Group plc was founded in 1993 and is based in Kettering, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Kettering"}, "OMIP.L": {"short_name": "ONE MEDIA IP GROUP PLC ORD 0.5P", "long_name": "One Media iP Group Plc", "summary": "One Media iP Group Plc engages in the acquisition and exploitation of mixed media intellectual property rights for distribution through the digital medium and traditional media outlets in the United Kingdom, North America, Europe, and internationally. Its mixed media products include music, video, spoken word, and digital books. The company also licenses music content for use in TV and films, advertising, video games, and corporate websites. In addition, it provides sync library, which enable music supervisors and production makers to access, search, and review the library to find the music for the most exacting brief; and technical copyright analysis tool, a software as a service platform for automating the time-consuming task of monitoring digital music releases. Further, the company manages audio and video content across a range of YouTube channels. It operates through 600 online digital stores. The company was formerly known as One Media Publishing Group Plc and changed its name to One Media iP Group Plc in October 2012. One Media iP Group Plc was founded in 2005 and is based in Iver Heath, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Iver Heath"}, "OTMP.L": {"short_name": "ONTHEMARKET PLC ORD 0.2P", "long_name": "OnTheMarket plc", "summary": "OnTheMarket plc provides property search services for buyers, sellers, landlords, and tenants in the United Kingdom. It owns and operates online residential property portal on OnTheMarket.com that offers property for sale and rent, and finds agents. The company was founded in 2015 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "PEBB.L": {"short_name": "THE PEBBLE GROUP PLC ORD 1P", "long_name": "The Pebble Group Plc", "summary": "The Pebble Group Plc provides products, services, and technology to the promotional products industry in the United Kingdom, Continental Europe, the United States, and internationally. It operates through two segments, Brand Addition and Facilisgroup. The company is involved in the design, sourcing, and delivery of promotional merchandise and branded products for various brands operating in the health and beauty, fast moving consumer goods, transport, technology, banking and finance, and charity sectors. It also offers @ease software that provides an end-to-end SaaS business platform to support the operations of SME promotional product distributors. The company was incorporated 2019 and is headquartered in Manchester, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Manchester"}, "PES.F": {"short_name": "PEARSON PLC  LS-,25", "long_name": "Pearson plc", "summary": "Pearson plc provides educational products and services to governments, educational institutions, corporations, and professional bodies worldwide. The company operates through North America, Core, and Growth segments. It offers courseware services, including curriculum materials provided in book form and/or through access to digital content; and assessments, such as test development, processing, and scoring services. The company also operates schools, colleges, and universities; and provides online learning services in partnership with universities and other academic institutions. In addition, it delivers and installs off-the-shelf software; and offers services to academic institutions, such as program development, student acquisition, education technology, and student support services, as well as undertakes contracts to process qualifying tests for individual professions and government departments under multi-year contractual arrangements. The company was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "PESA.F": {"short_name": "PEARSON PLC ADR/1 LS-,25", "long_name": "Pearson plc", "summary": "Pearson plc provides educational products and services to governments, educational institutions, corporations, and professional bodies worldwide. The company operates through North America, Core, and Growth segments. It offers courseware services, including curriculum materials provided in book form and/or through access to digital content; and assessments, such as test development, processing, and scoring services. The company also operates schools, colleges, and universities; and provides online learning services in partnership with universities and other academic institutions. In addition, it delivers and installs off-the-shelf software; and offers services to academic institutions, such as program development, student acquisition, education technology, and student support services, as well as undertakes contracts to process qualifying tests for individual professions and government departments under multi-year contractual arrangements. The company was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "PSO": {"short_name": "Pearson, Plc", "long_name": "Pearson plc", "summary": "Pearson plc provides educational products and services to governments, educational institutions, corporations, and professional bodies worldwide. The company operates through North America, Core, and Growth segments. It offers courseware services, including curriculum materials provided in book form and/or through access to digital content; and assessments, such as test development, processing, and scoring services. The company also operates schools, colleges, and universities; and provides online learning services in partnership with universities and other academic institutions. In addition, it delivers and installs off-the-shelf software; and offers services to academic institutions, such as program development, student acquisition, education technology, and student support services, as well as undertakes contracts to process qualifying tests for individual professions and government departments under multi-year contractual arrangements. The company was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Publishing", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "London"}, "PSON.L": {"short_name": "PEARSON PLC ORD 25P", "long_name": "Pearson plc", "summary": "Pearson plc provides educational products and services to governments, educational institutions, corporations, and professional bodies worldwide. The company operates through North America, Core, and Growth segments. It offers courseware services, including curriculum materials provided in book form and/or through access to digital content; and assessments, such as test development, processing, and scoring services. The company also operates schools, colleges, and universities; and provides online learning services in partnership with universities and other academic institutions. In addition, it delivers and installs off-the-shelf software; and offers services to academic institutions, such as program development, student acquisition, education technology, and student support services, as well as undertakes contracts to process qualifying tests for individual professions and government departments under multi-year contractual arrangements. The company was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "PSORF": {"short_name": "PEARSON", "long_name": "Pearson plc", "summary": "Pearson plc provides educational products and services to governments, educational institutions, corporations, and professional bodies worldwide. The company operates through North America, Core, and Growth segments. It offers courseware services, including curriculum materials provided in book form and/or through access to digital content; and assessments, such as test development, processing, and scoring services. The company also operates schools, colleges, and universities; and provides online learning services in partnership with universities and other academic institutions. In addition, it delivers and installs off-the-shelf software; and offers services to academic institutions, such as program development, student acquisition, education technology, and student support services, as well as undertakes contracts to process qualifying tests for individual professions and government departments under multi-year contractual arrangements. The company was founded in 1844 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Publishing", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "QRT.L": {"short_name": "QUARTO GROUP INCORPORATED COM S", "long_name": "The Quarto Group, Inc.", "summary": "The Quarto Group, Inc. publishes illustrated books and other related products for adults, children, and families in the United States, the United Kingdom, Europe, and internationally. The company operates through two divisions: US Publishing and UK Publishing. It creates and publishes books in various categories, such as baby foods, beverages, cooking methods, courses and dishes, entertaining, essays, healthy cooking, history, references, regional and ethnic cooking, seasonal, vegan cooking, and vegetarian cooking; art, crafts and hobbies, fashion and graphic design, graphic novels, music, performing arts, photography, and other arts; marque/model, automotive, biographies, car culture, hot rods and customs, motorcycle, muscle cars, racing, planes, trains, tractors, and other; and biography, business and economics, computers, fiction, history, mathematics, nature, philosophy, political science, reference, religion, science, social science, space, technology and engineering, travel, and true crime. The company also offers art and craft kits, calendars, card decks, coloring books, journals, placemats, poetry, puzzles, and stationery cards; agriculture, antiques and collections, architecture, gardening, home improvement, and pets books; activity and non-fiction books; and body, mind and spirit, family relationships, family relationships, fitness, health, medical, psychology, self-improvement, and sex and intimacy books. It sells its products through various sales channels, partnerships, and routes to market, as well as through website. The company was founded in 1976 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "RCH.L": {"short_name": "REACH PLC ORD 10P", "long_name": "Reach plc", "summary": "Reach plc produces and distributes content through newspapers, magazines, and digital platforms in the United Kingdom, the Republic of Ireland, Continental Europe, and internationally. The company produces and distributes content through paid-for and free national and regional newspapers and magazines, as well as through multi-platform digital sites; holds events and exhibitions related to publishing activities; and provides contract publishing for football clubs and other sport-related organizations. Its portfolio includes brands, such as the Daily Mirror, Sunday Mirror, Sunday People, Daily Express, Sunday Express, Daily Star, Daily Star Sunday, Daily Record, and Sunday Mail; and paid for celebrity magazines, such as OK! and New. The company also offers newspaper contract printing services to third parties. In addition, it is involved in the digital classified recruitment business. The company was formerly known as Trinity Mirror plc and changed its name to Reach plc in May 2018. Reach plc was founded in 1904 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "RDEB.F": {"short_name": "RELX PLC  LS -,144397", "long_name": "RELX PLC", "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk & Business Analytics; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk & Business Analytics segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. RELX PLC was incorporated in 1903 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "RDED.F": {"short_name": "RELX ADR/1/4  LS-,144397", "long_name": "RELX PLC", "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk & Business Analytics; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk & Business Analytics segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. RELX PLC was incorporated in 1903 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "REL.L": {"short_name": "RELX PLC ORD 14 51/116P", "long_name": "RELX PLC", "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk & Business Analytics; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk & Business Analytics segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. RELX PLC was incorporated in 1903 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "RELX": {"short_name": "RELX PLC PLC", "long_name": "RELX PLC", "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk & Business Analytics; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk & Business Analytics segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. RELX PLC was incorporated in 1903 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Publishing", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "London"}, "REN.AS": {"short_name": "RELX", "long_name": "RELX PLC", "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk & Business Analytics; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk & Business Analytics segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. RELX PLC was incorporated in 1903 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Publishing", "exchange": "AMS", "market": "nl_market", "country": "United Kingdom", "city": "London"}, "RLXB.F": {"short_name": "DIGITALBOX PLC  LS-,01", "long_name": "Digitalbox plc", "summary": "Digitalbox Publishing Ltd creates digital marketing campaigns. The company also publishes Entertainment Daily, an entertainment news web portal. Digitalbox Publishing Ltd was founded in 2015 and is headquartered in Bath, United Kingdom. Digitalbox Publishing Ltd operates as a subsidiary of Digitalbox Publishing (Holdings) Limited.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Bath"}, "RLXXF": {"short_name": "RELX PLC", "long_name": "RELX PLC", "summary": "RELX PLC provides information-based analytics and decision tools for professional and business customers in North America, Europe, and internationally. It operates through four segments: Scientific, Technical & Medical; Risk & Business Analytics; Legal; and Exhibitions. The Scientific, Technical & Medical segment provides information and analytics that help institutions and professionals to progress in science and advance healthcare. The Risk & Business Analytics segment offers information-based analytics and decision tools that combine public and industry specific content with technology and algorithms to assist clients in evaluating and predicting risk. The Legal segment provides legal, regulatory, and business information and analytics that help customers in decision-making, as well as enhance the productivity. The Exhibitions segment is involved in the events business. The company was formerly known as Reed Elsevier PLC and changed its name to RELX PLC in July 2015. RELX PLC was incorporated in 1903 and is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Publishing", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "RMV.L": {"short_name": "RIGHTMOVE PLC ORD 0.1P", "long_name": "Rightmove plc", "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Milton Keynes"}, "RTMVF": {"short_name": "RIGHTMOVE", "long_name": "Rightmove plc", "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Milton Keynes"}, "RTMVY": {"short_name": "RIGHTMOVE", "long_name": "Rightmove plc", "summary": "Rightmove plc operates property portal in the United Kingdom. The company operates through Agency, New Homes, and Other segments. The Agency segment offers resale and lettings property advertising services on its platforms. The New Homes segment provides property advertising services to new home developers and housing associations on its platforms. The Other segment offers overseas and commercial property advertising services; and non-property advertising services that include third party advertising and data services. The company serves estate agents, lettings agents, and new homes developers. Rightmove plc was founded in 2000 and is based in Milton Keynes, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Milton Keynes"}, "SAA.L": {"short_name": "M&C SAATCHI PLC ORD 1P", "long_name": "M&C Saatchi plc", "summary": "M&C Saatchi plc provides advertising and marketing services in Europe, the Middle East, Africa, Asia, Australia, and the Americas. The company offers its services in the areas of media buying, direct marketing, talent management, mobile marketing, research agency, Website construction, branding and digital marketing, design, marketing strategy, finished art and production management, marketing consultant, and sport sponsorship and entertainment PR agency. The company was founded in 1995 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "SCPPF": {"short_name": "S4 CAPITAL PLC", "long_name": "S4 Capital plc", "summary": "S4 Capital plc, together with its subsidiaries, operates as a digital advertising and marketing services company in the Americas, Europe and the Middle East, and the Asia Pacific. It operates through First-Party Data Practice, Content, and Programmatic segments. The company offers contents, campaigns, and assets for paid, social, and earned media, such as digital platforms and apps, as well as brand activations. It provides campaign management analytics, creative production and ad serving, platform and systems integration and transition, and training and education services. The company is headquartered in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "SFOR.L": {"short_name": "S4 CAPITAL PLC ORD 25P", "long_name": "S4 Capital plc", "summary": "S4 Capital plc, together with its subsidiaries, operates as a digital advertising and marketing services company in the Americas, Europe and the Middle East, and the Asia Pacific. It operates through First-Party Data Practice, Content, and Programmatic segments. The company offers contents, campaigns, and assets for paid, social, and earned media, such as digital platforms and apps, as well as brand activations. It provides campaign management analytics, creative production and ad serving, platform and systems integration and transition, and training and education services. The company is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "SNWS.L": {"short_name": "SMITHS NEWS PLC ORD 5P", "long_name": "Smiths News plc", "summary": "Smiths News plc, together with its subsidiaries, engages in the wholesaling of newspapers and magazines in the United Kingdom, Spain, France, Germany, the Netherlands, and internationally. It also supplies inflight entertainment to airlines and travel points; and offers field marketing, supply chain auditing, and compliance checking services to retailers and suppliers. The company was formerly known as Connect Group PLC and changed its name to Smiths News plc in November 2020. Smiths News plc was incorporated in 2004 and is based in Swindon, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Publishing", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Swindon"}, "STVG.L": {"short_name": "STV GROUP PLC ORD 50P", "long_name": "STV Group plc", "summary": "STV Group plc, together with its subsidiaries, produces and broadcasts television programs in the United Kingdom. The company operates in Broadcast, Digital, Production, and Other segments. It provides news, sports, entertainment, weather, competitions, video on demand, and STV programs. The company delivers its content on air through STV channels; through Website, stv.tv; and online video on demand through STV Player. It also offers internet services and lottery management services, as well as sells advertising airtime and space in its media. The company and is based in Glasgow, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Broadcasting", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Glasgow"}, "SUMGF": {"short_name": "SUMO GROUP PLC", "long_name": "Sumo Group Plc", "summary": "Sumo Group Plc, together with its subsidiaries, designs, develops, and provides video games in the United Kingdom, India, and Canada. The company develops games across a range of console platforms, PC, handheld, and mobile devices. It also offers creative and development services to entertainment industry, including games, TV, films, and visual effects. The company was founded in 2003 and is headquartered in Sheffield, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Sheffield"}, "SUMO.L": {"short_name": "SUMO GROUP PLC ORD GBP0.01", "long_name": "Sumo Group Plc", "summary": "Sumo Group Plc, together with its subsidiaries, designs, develops, and provides video games in the United Kingdom, India, and Canada. The company develops games across a range of console platforms, PC, handheld, and mobile devices. It also offers creative and development services to entertainment industry, including games, TV, films, and visual effects. The company was founded in 2003 and is headquartered in Sheffield, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Sheffield"}, "TALK.L": {"short_name": "TALKTALK TELECOM GROUP PLC ORD ", "long_name": "TalkTalk Telecom Group PLC", "summary": "TalkTalk Telecom Group PLC provides telecommunications services to consumers and business to business customers in the United Kingdom. It offers fiber, broadband, landline, TV, and mobile services under the TalkTalk and TalkTalk Business brands. Its products include HomeSafe, a home filtering service for residential customers; WorkSafe that provides protection for internet devices to business customers; SuperSafe, which offers protection from viruses and malwares; CallSafe, a security feature that screens inbound calls; and TalkSafe, a way of identifying a customer when they call using their voice. TalkTalk Telecom Group PLC was founded in 2002 and is based in Salford, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Salford"}, "TK6.F": {"short_name": "TALK TALK TELECOM LS-,001", "long_name": "TalkTalk Telecom Group PLC", "summary": "TalkTalk Telecom Group PLC provides telecommunications services to consumers and business to business customers in the United Kingdom. It offers fiber, broadband, landline, TV, and mobile services under the TalkTalk and TalkTalk Business brands. Its products include HomeSafe, a home filtering service for residential customers; WorkSafe that provides protection for internet devices to business customers; SuperSafe, which offers protection from viruses and malwares; CallSafe, a security feature that screens inbound calls; and TalkSafe, a way of identifying a customer when they call using their voice. TalkTalk Telecom Group PLC was founded in 2002 and is based in Salford, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Salford"}, "TLKTF": {"short_name": "TALK TALK TELECOM GROUP PLC", "long_name": "TalkTalk Telecom Group PLC", "summary": "TalkTalk Telecom Group PLC provides telecommunications services to consumers and business to business customers in the United Kingdom. It offers fiber, broadband, landline, TV, and mobile services under the TalkTalk and TalkTalk Business brands. Its products include HomeSafe, a home filtering service for residential customers; WorkSafe that provides protection for internet devices to business customers; SuperSafe, which offers protection from viruses and malwares; CallSafe, a security feature that screens inbound calls; and TalkSafe, a way of identifying a customer when they call using their voice. TalkTalk Telecom Group PLC was founded in 2002 and is based in Salford, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Salford"}, "TM17.L": {"short_name": "TEAM17 GROUP PLC ORD GBP0.01", "long_name": "Team17 Group PLC", "summary": "Team17 Group PLC, together with its subsidiaries, develops video games label for independent developers worldwide. The company develops and publishes video games for the digital and physical market. Its portfolio comprises approximately 100 games, including the Worms franchise, Overcooked, and The Escapists. Team17 Group PLC was founded in 1990 and is based in Wakefield, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Electronic Gaming & Multimedia", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Wakefield"}, "TMG.L": {"short_name": "THE MISSION GROUP PLC ORD 10P", "long_name": "The Mission Group plc", "summary": "The Mission Group plc provides marketing and advertising related services in the United Kingdom, rest of Europe, Asia, and the United States. The company offers marketing communications services for the technology, medical, and automotive sector; public relations services in the areas of science, engineering, and technology; and advertising, media buying, digital marketing, events, and training services. It also provides sales promotion services; sports, fitness, and entertainment marketing services; pricing and market access services for the healthcare sector; brand development and creative direct communication services; and operates as a property-marketing agency providing advertising, media, brochures, signage, exhibitions, CGI, animation, intranet, and photography services. The company was formerly known as The Mission Marketing Group plc and changed its name to The Mission Group plc in September 2019. The Mission Group plc was incorporated in 2006 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "TMO.L": {"short_name": "TIME OUT GROUP PLC ORD GBP0.001", "long_name": "Time Out Group plc", "summary": "Time Out Group plc engages in media and entertainment business. It operates through two segments, Time Out Market and Time Out Media. The Time Out Market segment operates bars; and engages in retail and events business activities. The Time Out Media engages in the sale of digital and print advertising; local marketing solutions, live events tickets, e-commerce transactions, and franchise activities. It operates in 328 cities in 58 countries. The company was founded in 1968 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Entertainment", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "TOOP.L": {"short_name": "TOOPLE PLC ORD 0.0667P", "long_name": "Toople Plc", "summary": "Toople Plc, through its subsidiaries, provides broadband and telephony solutions to small and medium enterprises (SMEs) in the United Kingdom. The company offers cloud based telephony services or Voice over Internet Protocol telephony; broadband over copper, EFM, and Ethernet data and mobile services. It also provides white label services on behalf of other telecommunication companies; and billing services. In addition, the company offers Merlin platform for wholesalers, which connect with carriers and to provide billing services to their own customers; and digital marketing services. The company was incorporated in 2016 and is based in Letchworth Garden City, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Letchworth Garden City"}, "ULS.L": {"short_name": "ULS TECHNOLOGY PLC ORD 0.4P", "long_name": "ULS Technology plc", "summary": "ULS Technology plc, through its subsidiaries, engages in the development and hosting of internet based software applications for legal and property services businesses in the United Kingdom. It provides software solutions that support online legal comparison services; and risk management and compliance consultancy services to solicitors and licensed conveyancers. The company's solutions also cover mortgage lenders, builders and developers, intermediaries, and estate agents. It primarily provides its services through white-labels to mortgage brokers, banks, building societies, and price comparison websites. ULS Technology plc was founded in 2003 and is based in Thame, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Thame"}, "UZJ1.F": {"short_name": "7DIGITAL GRP PLC LS-,0001", "long_name": "7digital Group plc", "summary": "7digital Group plc operates as a digital music technology company worldwide. The company operates through three divisions: Licensing, Content, and Creative. The company's Licensing division engages in the creation of software solutions for managing and delivering digital content; and the provision of an API based platform for third parties to create digital music, as well as provides client side software applications. Its Content division is involved in the sale of digital music through its 7digital.com licensed digital music store. Its Creative division creates audio and video programming for broadcasters. The company also provides radio production and music curation services; music streaming and download services; and HR services, as well as consultation services on business strategy or product planning for on-demand streaming, radio style streaming, premium downloads and others. It serves a range of customers, including consumer brands, mobile carriers, broadcasters, automotive systems, record labels, and retailers. 7digital Group plc was founded in 2004 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Internet Content & Information", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "VOD": {"short_name": "Vodafone Group Plc", "long_name": "Vodafone Group Plc", "summary": "Vodafone Group Plc engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides mobile, fixed, and a suite of converged communication services, such as Internet of Things (IoT) comprising managed IoT connectivity, automotive, and insurance services, as well as smart metering and health solutions; cloud and security portfolio comprising public and private cloud services, as well as cloud-based applications and products for securing networks and devices; and international voice, IP transit, and messaging services to support business customers that include small home offices and large multi-national companies. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements, as well as rents capacity to mobile virtual network operators to provide mobile services. Vodafone Group Plc has strategic partnerships with Open Fiber; and Mobile TeleSystems PJSC. As of March 31, 2019, it had approximately 650 million mobile customers, 19 million fixed broadband customers, and 14 million TV customers. The company was founded in 1984 and is headquartered in Newbury, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "NMS", "market": "us_market", "country": "United Kingdom", "city": "Newbury"}, "VOD.L": {"short_name": "VODAFONE GROUP PLC ORD USD0.20 ", "long_name": "Vodafone Group Plc", "summary": "Vodafone Group Plc engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides mobile, fixed, and a suite of converged communication services, such as Internet of Things (IoT) comprising managed IoT connectivity, automotive, and insurance services, as well as smart metering and health solutions; cloud and security portfolio comprising public and private cloud services, as well as cloud-based applications and products for securing networks and devices; and international voice, IP transit, and messaging services to support business customers that include small home offices and large multi-national companies. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements, as well as rents capacity to mobile virtual network operators to provide mobile services. Vodafone Group Plc has strategic partnerships with Open Fiber; and Mobile TeleSystems PJSC. As of March 31, 2019, it had approximately 650 million mobile customers, 19 million fixed broadband customers, and 14 million TV customers. The company was founded in 1984 and is headquartered in Newbury, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "Newbury"}, "VODI.F": {"short_name": "VODAFONE GROUP PLC", "long_name": "Vodafone Group Plc", "summary": "Vodafone Group Plc engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides mobile, fixed, and a suite of converged communication services, such as Internet of Things (IoT) comprising managed IoT connectivity, automotive, and insurance services, as well as smart metering and health solutions; cloud and security portfolio comprising public and private cloud services, as well as cloud-based applications and products for securing networks and devices; and international voice, IP transit, and messaging services to support business customers that include small home offices and large multi-national companies. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements, as well as rents capacity to mobile virtual network operators to provide mobile services. Vodafone Group Plc has strategic partnerships with Open Fiber; and Mobile TeleSystems PJSC. As of March 31, 2019, it had approximately 650 million mobile customers, 19 million fixed broadband customers, and 14 million TV customers. The company was founded in 1984 and is headquartered in Newbury, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Newbury"}, "VODJ.F": {"short_name": "VODAFONE GRP ADR NEW/10", "long_name": "Vodafone Group Plc", "summary": "Vodafone Group Plc engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides mobile, fixed, and a suite of converged communication services, such as Internet of Things (IoT) comprising managed IoT connectivity, automotive, and insurance services, as well as smart metering and health solutions; cloud and security portfolio comprising public and private cloud services, as well as cloud-based applications and products for securing networks and devices; and international voice, IP transit, and messaging services to support business customers that include small home offices and large multi-national companies. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements, as well as rents capacity to mobile virtual network operators to provide mobile services. Vodafone Group Plc has strategic partnerships with Open Fiber; and Mobile TeleSystems PJSC. As of March 31, 2019, it had approximately 650 million mobile customers, 19 million fixed broadband customers, and 14 million TV customers. The company was founded in 1984 and is headquartered in Newbury, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "Newbury"}, "VODN.MX": {"short_name": "VODAFONE GROUP", "long_name": "Vodafone Group Plc", "summary": "Vodafone Group Plc engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides mobile, fixed, and a suite of converged communication services, such as Internet of Things (IoT) comprising managed IoT connectivity, automotive, and insurance services, as well as smart metering and health solutions; cloud and security portfolio comprising public and private cloud services, as well as cloud-based applications and products for securing networks and devices; and international voice, IP transit, and messaging services to support business customers that include small home offices and large multi-national companies. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements, as well as rents capacity to mobile virtual network operators to provide mobile services. Vodafone Group Plc has strategic partnerships with Open Fiber; and Mobile TeleSystems PJSC. As of March 31, 2019, it had approximately 650 million mobile customers, 19 million fixed broadband customers, and 14 million TV customers. The company was founded in 1984 and is headquartered in Newbury, the United Kingdom.", "currency": "MXN", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "MEX", "market": "mx_market", "country": "United Kingdom", "city": "Newbury"}, "VODPF": {"short_name": "VODAFONE GROUP", "long_name": "Vodafone Group Plc", "summary": "Vodafone Group Plc engages in telecommunication services in Europe and internationally. The company offers mobile services that enable customers to call, text, and access data; fixed line services, including broadband, television (TV) offerings, and voice; and convergence services under the GigaKombi and Vodafone One names to customers. It also provides mobile, fixed, and a suite of converged communication services, such as Internet of Things (IoT) comprising managed IoT connectivity, automotive, and insurance services, as well as smart metering and health solutions; cloud and security portfolio comprising public and private cloud services, as well as cloud-based applications and products for securing networks and devices; and international voice, IP transit, and messaging services to support business customers that include small home offices and large multi-national companies. In addition, the company offers M-Pesa, an African payment platform, which provides money transfer, financial, and business and merchant payment services; and various services to operators through its partner market agreements, as well as rents capacity to mobile virtual network operators to provide mobile services. Vodafone Group Plc has strategic partnerships with Open Fiber; and Mobile TeleSystems PJSC. As of March 31, 2019, it had approximately 650 million mobile customers, 19 million fixed broadband customers, and 14 million TV customers. The company was founded in 1984 and is headquartered in Newbury, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Newbury"}, "VSRV": {"short_name": "VOICESERVE INC", "long_name": "VoiceServe, Inc.", "summary": "Voiceserve, Inc., through its subsidiaries, engages in developing, manufacturing, licensing, and supporting a range of voice over Internet protocol (VoIP) software products and services for various types of communication devices in Europe, North America, Asia, and internationally. It provides VoipSwitch, an Internet protocol telephony system offering services, such as device to phone technology, personal computer (PC) to phone/Web to phone features, calling cards, SMS/ANI/PIN/DID/WEB callback, DIDs' mapping, and call shops; Videoswitch, a video on demand platform for delivering online content to various screens ranging from smartphones and PCs to high definition home theatres; and Call-to-PBX, which offers voice, video, and mobile IP communications solutions for small-to-medium size businesses and residential customers. The company markets its products and services to VoIP wholesalers termination carriers, retail VoIP providers, Internet providers, including WiFi and WiMax operators, cable TV networks, GSM providers, telecom resellers, prepaid serve companies, and small-to-medium size companies. Voiceserve, Inc. was founded in 2002 and is based in Edgware, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Telecom Services", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "Edgware"}, "WPP": {"short_name": "WPP plc", "long_name": "WPP plc", "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services including strategy and business development, media investment, and data, technology and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "NYQ", "market": "us_market", "country": "United Kingdom", "city": "London"}, "WPP.L": {"short_name": "WPP PLC ORD 10P", "long_name": "WPP plc", "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services including strategy and business development, media investment, and data, technology and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}, "WPPGF": {"short_name": "WPP PLC", "long_name": "WPP plc", "summary": "WPP plc, a creative transformation company, provides communications, experience, commerce, and technology services in North America, the United Kingdom, Western Continental Europe, Asia Pacific, Latin America, Africa, Middle East, and Central and Eastern Europe. The company operates through three segments: Global Integrated Agencies, Public Relations, and Specialist Agencies. It engages in the business of planning and creation of marketing and branding campaigns; designs advertisements across all media; and provides media buying services including strategy and business development, media investment, and data, technology and content. The company provides advises to clients who are seeking to communicate with a range of stakeholders from consumers to governments and the business and financial communities. WPP plc was founded in 1985 and is based in London, the United Kingdom.", "currency": "USD", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "PNK", "market": "us_market", "country": "United Kingdom", "city": "London"}, "Y1G.F": {"short_name": "YOUGOV PLC  LS -,002", "long_name": "YouGov plc", "summary": "YouGov plc provides online market research services in the United Kingdom, the United States, Germany, the Nordic countries, the Middle East, Mainland Europe, and the Asia Pacific. It operates through three divisions: Data Products, Data Services, and Custom Research. The Data Products division offers syndicated data products, which are available to clients on a subscription basis. The Data Services division provides clients with fast-turnaround services. The Custom Research division offers a range of quantitative and qualitative research services. The company is also involved in the software development and media production businesses, as well as provision of operations services. YouGov plc was founded in 2000 and is headquartered in London, the United Kingdom.", "currency": "EUR", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "FRA", "market": "dr_market", "country": "United Kingdom", "city": "London"}, "YOU.L": {"short_name": "YOUGOV PLC ORD 0.2P", "long_name": "YouGov plc", "summary": "YouGov plc provides online market research services in the United Kingdom, the United States, Germany, the Nordic countries, the Middle East, Mainland Europe, and the Asia Pacific. It operates through three divisions: Data Products, Data Services, and Custom Research. The Data Products division offers syndicated data products, which are available to clients on a subscription basis. The Data Services division provides clients with fast-turnaround services. The Custom Research division offers a range of quantitative and qualitative research services. The company is also involved in the software development and media production businesses, as well as provision of operations services. YouGov plc was founded in 2000 and is headquartered in London, the United Kingdom.", "currency": "GBp", "sector": "Communication Services", "industry": "Advertising Agencies", "exchange": "LSE", "market": "gb_market", "country": "United Kingdom", "city": "London"}}