{
    "000927.SZ": {
        "short_name": "CHINA RAILWAY MATE",
        "long_name": "Tianjin Faw Xiali Automobile Co.,Ltd.",
        "summary": null,
        "currency": "CNY",
        "sector": "Consumer Goods",
        "industry": "Auto Manufacturers - Major",
        "exchange": "SHZ",
        "market": "cn_market",
        "country": "China",
        "city": null
    },
    "K8A.DE": {
        "short_name": "KANDI TECHNOL.GRP DL-,001",
        "long_name": "Kandi Technologies Group, Inc.",
        "summary": "Kandi Technologies Group, Inc., through its subsidiaries, designs, develops, manufactures, and commercializes electric vehicle (EV) products and parts and off-road vehicles in the People's Republic of China and internationally. It offers off-road vehicles, including go-karts, all-terrain vehicles, utility vehicles, and other vehicles for sale to distributors or consumers; and EV parts comprising battery packs, EV drive motors, EV controllers, air conditioners, and other electric products, as well as electric scooters and electric self-balancing scooters. Kandi Technologies Group, Inc. has a strategic cooperation agreement with Jiangsu Jinpeng Group Ltd. to jointly develop the EV market in China. The company was formerly known as Kandi Technologies, Corp. and changed its name to Kandi Technologies Group, Inc. in December 2012. Kandi Technologies Group, Inc. was founded in 2002 and is headquartered in Jinhua, the People's Republic of China.",
        "currency": "EUR",
        "sector": "Consumer Goods",
        "industry": "Auto Manufacturers - Major",
        "exchange": "GER",
        "market": "de_market",
        "country": "China",
        "city": "Jinhua"
    },
    "YUII": {
        "short_name": "YUHE INTERNATIONAL INC",
        "long_name": "Yuhe International, Inc.",
        "summary": "Yuhe International, Inc., through its subsidiaries, engages in supplying day-old chickens raised for meat production or broilers in the People's Republic of China. It purchases baby parent breeding stocks from primary breeder farms, raises them for hatching eggs, and sells live day-old broilers. The company also supplies chicken feed stock. The company has 43 breeder farms with 28 in operation and 3 hatcheries with a total annual capacity of 3.15 million sets of breeders and 160 hatchers. It serves integrated chicken companies, broiler raising companies, and individual broiler raisers through third party distributors. The company was founded in 1996 and is headquartered in Weifang, the People's Republic of China.",
        "currency": "USD",
        "sector": "Consumer Goods",
        "industry": "Food - Major Diversified",
        "exchange": "PNK",
        "market": "us_market",
        "country": "China",
        "city": "Weifang"
    }
}