{
  "AOR": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Core Growth Allocation ETF",
    "market": "us_market",
    "short_name": "iShares Core Growth Allocation ",
    "summary": "The investment seeks to track the investment results of the S&P Target Risk Growth Index composed of a portfolio of underlying equity and fixed income funds intended to represent a growth allocation target risk strategy.\n The fund is a fund of funds and seeks its investment objective by investing primarily in underlying funds that themselves seek investment results corresponding to their own respective underlying indexes. It generally will invest at least 90% of its assets in the component securities of the underlying index. The index measures the performance of the S&P Dow Jones Indices LLC proprietary allocation model.",
    "total_assets": 1715857536
  },
  "FLYT": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Direxion Funds",
    "long_name": "Direxion Flight to Safety Strategy ETF",
    "market": "us_market",
    "short_name": "Direxion Flight to Safety Strat",
    "summary": "The investment seeks to provide total returns that exceed the total return of the Solactive Flight to Safety Index over a complete market cycle.\n The fund, under normal circumstances, will generally seek to maintain a portfolio of instruments similar to those included in the index and may also utilize investments in other investment companies or exchange-traded products, or swap contracts to obtain exposure to certain securities or commodities included in the index. It is non-diversified.",
    "total_assets": 17635738
  },
  "GAL": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR SSgA Global Allocation ETF",
    "market": "us_market",
    "short_name": "SPDR SSgA Global Allocation ETF",
    "summary": "The investment seeks to provide capital appreciation.\n The Adviser primarily invests the assets of the fund among exchange traded products (\"ETPs\") that provide balanced exposure to domestic and international debt and equity securities. The fund typically allocates approximately 60% of its assets to equity securities, though this percentage can vary based on the Adviser&#39;s tactical decisions.",
    "total_assets": 265889184
  },
  "MDIV": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "NMS",
    "family": "First Trust",
    "long_name": "First Trust Multi-Asset Diversified Income Index Fund",
    "market": "us_market",
    "short_name": "Multi-Asset Diversified Income ",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the NASDAQ US Multi-Asset Diversified Income IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and/or depositary receipts, REITs, preferred securities, MLPs and ETF that comprise the index. The index is designed to provide exposure to five asset segments, each selected to result in a consistent and high yield for the index. These five asset segments are: equity securities, REITs, preferred securities, MLPs and high yield corporate bonds.",
    "total_assets": 486118496
  },
  "OCIO": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "ClearShares",
    "long_name": "ClearShares OCIO ETF",
    "market": "us_market",
    "short_name": "ETF Series Solutions Trust ETF",
    "summary": "The investment seeks to outperform a traditional 60/40 mix of global equity and fixed-income investments.\n The fund is expected to typically invest approximately 40% to 70% of its total assets in underlying funds that principally invest in equity securities of any market capitalization. It is expected to typically invest approximately 20% to 50% of its total assets in underlying funds that principally invest in debt obligations.",
    "total_assets": 119834528
  },
  "PSMB": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Invesco",
    "long_name": "Invesco Balanced Multi-Asset Allocation ETF",
    "market": "us_market",
    "short_name": "Invesco Balanced Multi-Asset Al",
    "summary": "The investment seeks to provide current income and capital appreciation.\n The fund seeks to achieve its investment objective by allocating its assets using a balanced investment style that seeks to maximize the benefits of diversification, which focuses on investing portions of fund assets both in underlying ETFs that invest in fixed-income securities (\"Fixed Income ETFs\") as well as in underlying ETFs that invest primarily in equity securities (\"Equity ETFs\"). Specifically, the fund&#39;s target allocation is to invest approximately 45%-75% of its total assets in Equity ETFs and approximately 25%-55% of its total assets in Fixed Income ETFs. It is non-diversified.",
    "total_assets": 11423756
  },
  "PWS": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Pacer",
    "long_name": "Pacer WealthShield ETF",
    "market": "us_market",
    "short_name": "Pacer WealthShield ETF",
    "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer WealthShield Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in (i) the component securities of the index or (ii) ETFs that seek to track the performance of some or all of the component securities of the index in the same approximate weight as such component securities. The index utilizes a systematic risk management strategy that directs the index&#39;s exposure to U.S. equity securities, U.S. Treasury securities, or a mix of each. The fund is non-diversified.",
    "total_assets": 52855192
  },
  "QPT": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "AdvisorShares",
    "long_name": "AdvisorShares Q Portfolio Blended Allocation ETF",
    "market": "us_market",
    "short_name": "AdvisorShares Q Portfolio Blend",
    "summary": "The investment seeks to maximize total return over the long-term.\n The fund invests in ETFs representing all asset classes, including, but not limited to, treasury bonds, municipal bonds, investment grade corporate bonds, high-yield U.S. corporate bonds (sometimes referred to as \"junk bonds\"), municipal bonds, U.S. and foreign equities, and commodities. These underlying investments may be of any market capitalization, duration, maturity, and quality.",
    "total_assets": 10411685
  },
  "RISN": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Inspire",
    "long_name": "Inspire Tactical Balanced ESG ETF",
    "market": "us_market",
    "short_name": "Inspire Tactical Balanced ESG E",
    "summary": "The investment seeks to provide capital appreciation with lower volatility than the U.S. large cap stock market over the long term.\n The fund, an actively managed ETF, uses a proprietary system of technical analysis to tactically allocate assets into U.S. large cap stocks when the strategy identifies an uptrend in the U.S. large cap stock market, and shifts into U.S. Treasury bonds via third-party ETFs, investment grade and high-yield corporate bonds, government agency bonds, and listed gold exchange-traded products and exchange-traded notes such as SPDR Gold Shares (GLD) when the strategy identifies a downtrend in the U.S. large cap stock market.",
    "total_assets": 77813896
  },
  "TEGS": {
    "category": "Allocation--50% to 70% Equity",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Tuttle",
    "long_name": "Trend Aggregation ESG ETF",
    "market": "us_market",
    "short_name": "Trend Aggregation ESG ETF",
    "summary": "The investment seeks capital appreciation.\n The fund will under normal conditions invest at least 80% of its net assets (plus borrowings for investment purposes) directly, or indirectly through mutual funds or exchange traded funds, in equity or fixed income securities of well-known environmental, social, and governance (\"ESG\") indices such as MSCI and Russell. It may also invest up to 20% of its net assets in cash and cash equivalents including U.S. government securities.",
    "total_assets": 16950420
  }
}
