{
  "AOA": {
    "category": "Allocation--70% to 85% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Core Aggressive Allocation ETF",
    "market": "us_market",
    "short_name": "iShares Core Aggressive Allocat",
    "summary": "The investment seeks to track the investment results of the S&P Target Risk Aggressive Index composed of a portfolio of underlying equity and fixed income funds intended to represent an aggressive target risk allocation strategy.\n The fund is a fund of funds and seeks its investment objective by investing primarily in underlying funds that themselves seek investment results corresponding to their own respective underlying indexes. It generally will invest at least 90% of its assets in the component securities of the underlying index. The index measures the performance of the S&P Dow Jones Indices LLC proprietary allocation model.",
    "total_assets": 1297452800
  },
  "CVY": {
    "category": "Allocation--70% to 85% Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco Zacks Multi-Asset Income ETF",
    "market": "us_market",
    "short_name": "Invesco Zacks Multi-Asset Incom",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Zacks Multi-Asset Income Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as American depositary receipts (\"ADRs\") that represent securities in the underlying index. The underlying index is composed of securities that Zacks selects from a universe of domestic and international companies listed on major U.S. exchanges.",
    "total_assets": 130434664
  },
  "PSMG": {
    "category": "Allocation--70% to 85% Equity",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Invesco",
    "long_name": "Invesco Growth Multi-Asset Allocation ETF",
    "market": "us_market",
    "short_name": "Invesco Growth Multi-Asset Allo",
    "summary": "The investment seeks to provide long-term capital appreciation.\n The fund seeks to achieve its investment objective by allocating its assets using a growth investment style that seeks to maximize the benefits of diversification, which focuses on investing a greater portion of fund&#39;s assets in Equity ETFs, but also provides some exposure to Fixed Income ETFs. Specifically, the fund&#39;s target allocation is to invest approximately 65%-95% of its total assets in Equity ETFs and approximately 5%-35% of its total assets in Fixed Income ETFs. It is non-diversified.",
    "total_assets": 10384241
  }
}
