{
    "AFTY": {
        "short_name": "Pacer CSOP FTSE China A50 ETF",
        "long_name": "Pacer CSOP FTSE China A50 ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, track the performance of the FTSE China A50 Net Total Return Index.\n The fund employs a â\u0080\u009cpassive managementâ\u0080\u009d investment approach designed to track the total return performance, before fees and expenses, of the index. The index is comprised of A-Shares issued by the 50 largest companies in the China A-Shares market. It will typically invest at least 80% of its total assets in the securities included in the index. The fund may invest the remainder of its assets in investments that are not included in the index, but which the Sub-Adviser believes will help it track the index.",
        "category": "China Region",
        "family": "Pacer",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 10183780
    },
    "ASHR": {
        "short_name": "Xtrackers Harvest CSI 300 China",
        "long_name": "Xtrackers Harvest CSI 300 China A-Shares ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the CSI 300 Index.\n The fund will normally invest at least 80% of its total assets in securities of issuers that comprise the underlying index. The underlying index is designed to reflect the price fluctuation and performance of the China A-Share market and is composed of the 300 largest and most liquid stocks in the China A-Share market. The underlying index includes small-cap, mid-cap, and large-cap stocks.",
        "category": "China Region",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2728094464
    },
    "ASHS": {
        "short_name": "Xtrackers Harvest CSI 500 China",
        "long_name": "Xtrackers Harvest CSI 500 China-A Shares Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the CSI 500 Index.\n The index is designed to reflect the price fluctuation and performance of small-cap companies in the China A-Share market and is composed of the 500 smallest and most liquid stocks in the China A-Share market. Under normal circumstances, the fund invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in A-Shares of Chinese small-cap issuers or in derivative instruments and other securities that provide investment exposure to A-Shares of Chinese small-cap issuers.",
        "category": "China Region",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 37395632
    },
    "CHB": {
        "short_name": "Global X China Biotech Innovati",
        "long_name": "Global X China Biotech Innovation ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive China Biotech Innovation Index (\"underlying index\").\n The fund invests at least 80% of its total assets, plus borrowings for investments purposes (if any), in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to provide exposure to exchange-listed companies that are directly involved in Chinaâ\u0080\u0099s biotechnology industry. It is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 5643992
    },
    "CHIE": {
        "short_name": "Global X MSCI China Energy ETF",
        "long_name": "Global X MSCI China Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI China Energy IMI Plus 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Investable Market Index (the \"parent index\") that are classified in the energy sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2233063
    },
    "CHIH": {
        "short_name": "Global X Funds Global X MSCI Ch",
        "long_name": "Global X MSCI China Health Care ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI China Health Care 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Index (the \"parent index\") that are classified in the health care sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24119768
    },
    "CHII": {
        "short_name": "Global X MSCI China Industrials",
        "long_name": "Global X MSCI China Industrials ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI China Industrials 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Index (the \"parent index\") that are classified in the industrials sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2409662
    },
    "CHIM": {
        "short_name": "Global X MSCI China Materials E",
        "long_name": "Global X MSCI China Materials ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI China Materials 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Index (the \"parent index\") that are classified in the materials sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5126344
    },
    "CHIQ": {
        "short_name": "Global X MSCI China Consumer Di",
        "long_name": "Global X MSCI China Consumer Disc ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance of the MSCI China Consumer Discretionary 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Index (the \"parent index\") that are classified in the consumer discretionary sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 774728576
    },
    "CHIS": {
        "short_name": "Global X Funds Global X MSCI Ch",
        "long_name": "Global X MSCI China Consumer Staples ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI China Consumer Staples 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Index (the \"parent index\") that are classified in the consumer staples sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23414332
    },
    "CHIX": {
        "short_name": "Global X MSCI China Financials ",
        "long_name": "Global X MSCI China Financials ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI China Financials 10/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index tracks the performance of companies in the MSCI China Index (the \"parent index\") that are classified in the financials sector, as defined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 55384020
    },
    "CN": {
        "short_name": "Xtrackers MSCI All China Equity",
        "long_name": "Xtrackers MSCI All China Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond to the performance, before fees and expenses, of the MSCI China All Shares Index.\n The fund will normally invest at least 80% of its total assets in securities of issuers that comprise either directly or indirectly the underlying index or securities with economic characteristics similar to those included in the underlying index. The underlying index is designed to capture large- and mid-capitalization representation across all China securities listed in Hong Kong, Shanghai and Shenzhen. It is non-diversified.",
        "category": "China Region",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 33209976
    },
    "CNXT": {
        "short_name": "VanEck Vectors ChinaAMC SME-ChN",
        "long_name": "VanEck Vectors ChinaAMC SME-ChiNext ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the SME-ChiNext 100 Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is a modified, free-float adjusted index intended to track the performance of the 100 largest and most liquid stocks listed and trading on the Small and Medium Enterprise (\"SME\") Board and the ChiNext Board of the Shenzhen Stock Exchange. The SME-ChiNext Index is comprised of China A-shares.",
        "category": "China Region",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 49084964
    },
    "CQQQ": {
        "short_name": "Invesco China Technology ETF",
        "long_name": "Invesco China Technology ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the FTSE China Incl A 25% Technology Capped Index.\n The fund generally will invest at least 90% of its total assets in the securities (including ADRs and GDRs) that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains, and calculates the underlying index. The underlying index may include China A-shares, B-shares, H-shares, N-shares, Red Chips, P-chips and S-chips. The fund is non-diversified.",
        "category": "China Region",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1580575104
    },
    "CXSE": {
        "short_name": "WisdomTree China ex-State-Owned",
        "long_name": "WisdomTree China ex-State-Owned Enterprises Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree China ex-State-Owned Enterprises Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a modified float-adjusted market cap weighted index that consists of common stocks in China, excluding common stocks of \"state-owned enterprises.\" The fund is non-diversified.",
        "category": "China Region",
        "family": "WisdomTree",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 903432192
    },
    "ECNS": {
        "short_name": "iShares MSCI China Small-Cap ET",
        "long_name": "iShares MSCI China Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI China Small Cap Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the performance of the small capitalization segment of Chinese equity securities markets, as represented by the H-shares and B-shares markets.",
        "category": "China Region",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 73156000
    },
    "FCA": {
        "short_name": "First Trust China AlphaDEX Fund",
        "long_name": "First Trust China AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEXÂ® China Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ China Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "China Region",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 15184132
    },
    "GLCN": {
        "short_name": "VanEck Vectors China Growth Lea",
        "long_name": "VanEck Vectors China Growth Leaders ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MarketGrader China All-Cap Growth Leaders Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index and/or in investments that have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise its benchmark index. The index is comprised of Chinese equity securities which are generally considered by the index provider to exhibit favorable fundamental characteristics according to its proprietary scoring methodology.",
        "category": "China Region",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 35854936
    },
    "GXC": {
        "short_name": "SPDR S&P China ETF",
        "long_name": "SPDR S&P China ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P China BMI Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in China available to foreign investors.",
        "category": "China Region",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1896111360
    },
    "KALL": {
        "short_name": "KraneShares MSCI All China Inde",
        "long_name": "KraneShares MSCI All China Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond to the price and yield performance of the MSCI China All Shares Index (the \"underlying index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index, in depositary receipts, representing such components, and investment companies that seek to track the performance of a subset of the underlying index or of an index highly correlated to a portion of the underlying index. The underlying index is a free float adjusted market capitalization weighted index designed to track the performance of Chinese exchange-listed equity securities.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23877076
    },
    "KBA": {
        "short_name": "KraneShares Bosera MSCI China A",
        "long_name": "KraneShares Bosera MSCI China A ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond to the price and yield performance of the MSCI China A Index (USD) (the \"underlying index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in securities of the underlying index and depositary receipts representing such securities. The underlying index reflects the large- and mid-cap Chinese renminbi-denominated equity securities listed on the Shenzhen or Shanghai Stock Exchanges (\"A Shares\") that are accessible through the Shanghai-Hong Kong Stock Connect or Shenzhen-Hong Kong Stock Connect programs.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 897558592
    },
    "KBUY": {
        "short_name": "KraneShares CICC China Consumer",
        "long_name": "KraneShares MSCI All China Consumer Discretionary Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, track the price and yield performance of a specific foreign equity securities index. The fund&#39;s current index is the MSCI China All Shares Consumer Discretionary Index.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index, depositary receipts. The underlying index is a free float adjusted market capitalization weighted index designed to track the equity market performance of Chinese companies engaged in the consumer discretionary sector. The fund is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 50191264
    },
    "KFVG": {
        "short_name": "KraneShares Trust KraneShares C",
        "long_name": "KraneShares CICC China 5G & Semiconductor Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of a specific equity securities index, the CICC China 5G and Semiconductor Leaders Index.\n The fund will invest at least 80% of its total assets in components of the index, depositary receipts, including ADRs, representing such components and securities underlying depositary receipts in the index. The index includes the stocks and depositary receipts of the top 30 companies by free-float market capitalization of Chinese companies engaged in 5G and Semiconductor-Related Industries. The fund is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 118880128
    },
    "KFYP": {
        "short_name": "KraneShares CICC China Leaders ",
        "long_name": "KraneShares CICC China Leaders 100 Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of CSI CICC Select 100 Index.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index and depositary receipts, including ADRs, representing such components. The underlying index includes the China A-Shares of 100 Chinese companies with high historical returns on equity, dividend yields and growth in net profits that have listed China A-Shares, as determined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 13210160
    },
    "KGRN": {
        "short_name": "KraneShares MSCI China Clean Te",
        "long_name": "KraneShares MSCI China Clean Technology ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond to the price and yield performance of MSCI China IMI Environment 10/40 Index.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index, depositary receipts. The underlying index is a modified, free float adjusted market capitalization weighted index designed to track the equity market performance of Chinese companies that derive at least a majority of their revenues from environmentally beneficial products and services, as determined by MSCI Inc. It is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 190410336
    },
    "KSTR": {
        "short_name": "KraneShares SSE STAR Market 50 ",
        "long_name": "KraneShares SSE STAR Market 50 Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the SSE Science and Technology Innovation Board 50 Indexã\u0080\u0082.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index and depositary receipts, including American depositary receipts, representing such components. The underlying index includes the stocks and depositary receipts of the top 50 companies by free-float market capitalizations that are listed on the SSE Science and Technology Innovation Board. It is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 82688112
    },
    "KURE": {
        "short_name": "KraneShares MSCI All China Heal",
        "long_name": "KraneShares MSCI All China Health Care Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, track the price and yield performance of the MSCI China All Shares Health Care 10/40 Index (the \"underlying index\").\n The fund will invest at least 80% of its total assets in components of the underlying index, depositary receipts, including American depositary receipts, representing such components and securities underlying depositary receipts in the underlying index. The underlying index is a free float adjusted market capitalization weighted index designed to track the equity market performance of Chinese companies engaged in the healthcare sector. The fund is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 238185008
    },
    "KWEB": {
        "short_name": "KraneShares Trust KraneShares C",
        "long_name": "KraneShares CSI China Internet ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the CSI Overseas China Internet Index.\n The fund invests at least 80% of its total assets in equity securities of the index and in depositary receipts representing such securities. The index is designed to measure the equity market performance of the investable universe of publicly traded China-based companies whose primary business or businesses are in the Internet and Internet-related sectors, and are listed outside of Mainland China, as determined by the index provider. The fund is non-diversified.",
        "category": "China Region",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4392584192
    },
    "MCHI": {
        "short_name": "iShares MSCI China ETF",
        "long_name": "iShares MSCI China ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI China Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the performance of equity securities in the top 85% in market capitalization of the Chinese equity securities markets, as represented by the H-shares and B-shares markets. The fund is non-diversified.",
        "category": "China Region",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 7006983680
    },
    "PGJ": {
        "short_name": "Invesco Golden Dragon China ETF",
        "long_name": "Invesco Golden Dragon China ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ Golden Dragon China Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of securities of U.S. exchange-listed companies that are headquartered or incorporated in the People&#39;s Republic of China. The fund is non-diversified.",
        "category": "China Region",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 274263200
    },
    "ZHOK": {
        "short_name": "SPDR Solactive Hong Kong ETF",
        "long_name": "SPDR Solactive Hong Kong ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Solactive GBS Hong Kong Large & Mid Cap USD Index NTR based upon the equity market of Hong Kong.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts (including ADRs or GDRs) based on securities comprising the index. The index is a free float-adjusted market capitalization index that is designed to measure the equity market performance of large- and mid-cap companies in Hong Kong. The fund is non-diversified.",
        "category": "China Region",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 12467007
    }
}