{
    "BCD": {
        "short_name": "Aberdeen Standard Bloomberg All",
        "long_name": "Aberdeen Standard Bloomberg All Commodity Longer Dated Strategy K-1 Free ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return through actively managed exposure to the Bloomberg Commodity Index 3 Month Forward Total ReturnSM (the \"index\").\n The fund is an actively managed exchange-traded fund (\"ETF\") that is not required to track the index or invest in all of the index&#39;s components. However, it will generally seek to hold similar interests to those included in the index and will seek exposure to many of the commodities included in the index under the same futures rolling schedule as the index. It is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Aberdeen Standard Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BCI": {
        "short_name": "Aberdeen Standard Bloomberg All",
        "long_name": "Aberdeen Standard Bloomberg All Commodity Strategy K-1 Free ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return through actively managed exposure to the Bloomberg Commodity Index Total ReturnSM (the \"index\").\n The fund is an actively managed exchange-traded fund (\"ETF\") that is not required to track the index or invest in all of the index&#39;s components. However, it will generally seek to hold similar interests to those included in the index and will seek exposure to many of the commodities included in the index under the same futures rolling schedule as the index. It is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Aberdeen Standard Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BCM": {
        "short_name": "iPath Pure Beta Broad Commodity",
        "long_name": "iPath Pure Beta Broad Commodity ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with exposure to the Barclays Commodity Index Pure Beta Total Return.\n The Barclays Commodity Index Pure Beta Total Return (the \"index\") is comprised of a basket of exchange traded futures contracts and reflects the returns that are potentially available through an unleveraged investment in the futures contracts on certain physical commodities. For each commodity, the index may roll into one of a number of futures contracts with varying expiration dates, as selected using the Barclays Pure Beta Series 2 Methodology.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "COM": {
        "short_name": "Direxion Auspice Broad Commodit",
        "long_name": "Direxion Auspice Broad Commodity Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return that exceeds that of the Auspice Broad Commodity Index over a complete market cycle.\n The fund is an actively managed ETF that seeks to provide total return that exceeds that of the index. It will generally seek to maintain a portfolio of instruments similar to those included in the index by utilizing exchange-traded commodity futures contracts and swap contracts, thereby obtaining exposure to the commodities markets. The index is a rules-based index that attempts to capture trends in the commodity markets. The fund is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DBC": {
        "short_name": "Invesco DB Commodity Index Trac",
        "long_name": "Invesco DB Commodity Index Tracking Fund",
        "currency": "USD",
        "summary": "The investment seeks to track changes, whether positive or negative, in the level of the DBIQ Optimum Yield Diversified Commodity Index Excess Returnâ\u0084¢.\n The fund pursues its investment objective by investing in a portfolio of exchange-traded futures on Light Sweet Crude Oil (WTI), Heating Oil, RBOB Gasoline, Natural Gas, Brent Crude, Gold, Silver, Aluminum, Zinc, Copper Grade A, Corn, Wheat, Soybeans, and Sugar. The index is composed of notional amounts of each of these commodities.",
        "category": "Commodities Broad Basket",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DJCI": {
        "short_name": "E-TRACS Linked to the Bloomberg",
        "long_name": "UBS ETRACS Bloomberg Commodity Index Total Return ETN",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the DJ-UBS Commodity Index Total Return Index.\n The index measures the collateralized returns from a basket of 19 commodity futures contracts representing the energy, precious metals, industrial metals, grains, softs and livestock sectors. In addition, the index is rebalanced once a year to ensure that no commodity sector may constitute more than 33% of the index as of the date of such rebalancing.",
        "category": "Commodities Broad Basket",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DJP": {
        "short_name": "iPath Bloomberg Commodity Index",
        "long_name": "iPath Bloomberg Commodity Index Total Return(SM) ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with exposure to the Dow Jones-UBS Commodity Index Total ReturnService Mark.\n The Dow Jones-UBS Commodity Index Total ReturnService Mark (the \"index\") reflects the returns that are potentially available through an unleveraged investment in the futures contracts on physical commodities comprising the index plus the rate of interest that could be earned on cash collateral invested in specified Treasury Bills. The index is a rolling index rebalancing annually.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FTGC": {
        "short_name": "First Trust Global Tactical Com",
        "long_name": "First Trust Global Tactical Commodity Strategy Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide total return by providing investors with commodity exposure while seeking a relatively stable risk profile.\n The fund is an actively managed exchange-traded fund (\"ETF\") that seeks to achieve attractive risk adjusted return by investing in commodity futures contracts and exchange-traded commodity linked instruments (collectively, \"Commodities Instruments\") through a wholly-owned subsidiary of the fund organized under the laws of the Cayman Islands (the \"Subsidiary\"). The advisor expects to gain exposure to these investments exclusively by investing in the Subsidiary.",
        "category": "Commodities Broad Basket",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "GCC": {
        "short_name": "WisdomTree EnhancedContinuous C",
        "long_name": "WisdomTree Continuous Commodity Index Fund",
        "currency": "USD",
        "summary": "The investment seeks to reflect the performance of the index, over time, less the expenses of the fund and the master fundâ\u0080\u0099s overall operations.\n The master fund invests in a portfolio of index commodities, as well as holding cash and United States Treasury securities and other high credit quality short-term fixed income securities for deposit with the master fundâ\u0080\u0099s Commodity Broker as margin. The Continuous Commodity Total Return Index is a broad based commodity index that reflects the price movement of 17 exchange-traded futures contracts.",
        "category": "Commodities Broad Basket",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "JO": {
        "short_name": "iPathA Series B Bloomberg Coffe",
        "long_name": "iPath Series B Bloomberg Coffee Subindex Total Return ETN",
        "currency": "USD",
        "summary": "The investment seeks return linked to the performance of the Bloomberg Coffee Subindex Total ReturnSM.\n The ETN offers exposure to futures contracts and not direct exposure to the physical commodities. The index is composed of one or more futures contracts on the relevant commodity (the â\u0080\u009cindex componentsâ\u0080\u009d) and is intended to reflect the returns that are potentially available through (1) an unleveraged investment in those contracts plus (2) the rate of interest that could be earned on cash collateral invested in specified Treasury Bills.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "RJI": {
        "short_name": "AB Svensk Ekportkredit (Swedish",
        "long_name": "ELEMENTS Linked to the Rogers International Commodity Index - Total Return",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the Rogers International Commodity Index â\u0080\u0093 Total Return index.\n The index represents the value of a basket of 35 commodity futures contracts.",
        "category": "Commodities Broad Basket",
        "family": "ELEMENTS",
        "exchange": "PCX",
        "market": "us_market"
    }
}