{
    "BCD": {
        "short_name": "Aberdeen Standard Bloomberg All",
        "long_name": "Aberdeen Standard Bloomberg All Commodity Longer Dated Strategy K-1 Free ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return through actively managed exposure to the Bloomberg Commodity Index 3 Month Forward Total ReturnSM (the \"index\").\n The fund is an actively managed exchange-traded fund (\"ETF\") that is not required to track the index or invest in all of the index&#39;s components. However, it will generally seek to hold similar interests to those included in the index and will seek exposure to many of the commodities included in the index under the same futures rolling schedule as the index. It is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Aberdeen Standard Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 27513428
    },
    "BCI": {
        "short_name": "Aberdeen Standard Bloomberg All",
        "long_name": "Aberdeen Standard Bloomberg All Commodity Strategy K-1 Free ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return through actively managed exposure to the Bloomberg Commodity Index Total ReturnSM (the \"index\").\n The fund is an actively managed exchange-traded fund (\"ETF\") that is not required to track the index or invest in all of the index&#39;s components. However, it will generally seek to hold similar interests to those included in the index and will seek exposure to many of the commodities included in the index under the same futures rolling schedule as the index. It is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Aberdeen Standard Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 506125792
    },
    "BCM": {
        "short_name": "iPath Pure Beta Broad Commodity",
        "long_name": "iPath Pure Beta Broad Commodity ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with exposure to the Barclays Commodity Index Pure Beta Total Return.\n The Barclays Commodity Index Pure Beta Total Return (the \"index\") is comprised of a basket of exchange traded futures contracts and reflects the returns that are potentially available through an unleveraged investment in the futures contracts on certain physical commodities. For each commodity, the index may roll into one of a number of futures contracts with varying expiration dates, as selected using the Barclays Pure Beta Series 2 Methodology.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 35262180
    },
    "CCRV": {
        "short_name": "iShares U.S. ETF Trust iShares ",
        "long_name": "iShares Commodity Curve Carry Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE BofA Commodity Enhanced Carry Total Return Index composed of commodities with the top ten highest ranking roll yields, on a total return basis, selected from a broad commodity universe.\n The fund seeks to achieve its investment objective primarily by investing in total return swaps that provide exposure to commodity futures contracts referenced in the underlying index. It is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 34611396
    },
    "COM": {
        "short_name": "Direxion Auspice Broad Commodit",
        "long_name": "Direxion Auspice Broad Commodity Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return that exceeds that of the Auspice Broad Commodity Index over a complete market cycle.\n The fund is an actively managed ETF that seeks to provide total return that exceeds that of the index over a complete market cycle by actively managing a portfolio of Treasury bills, other government securities, money market funds, cash, other short-term bond funds, highly rated corporate or other non-government fixed-income securities, with maturities of up to 12 months. The index is a rules-based index that attempts to capture trends in the commodity markets. The fund is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 100268352
    },
    "COMB": {
        "short_name": "GraniteShares Bloomberg Commodi",
        "long_name": "GraniteShares Bloomberg Commodity Broad Strategy No K-1 ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide long-term capital appreciation, primarily through exposure to commodity futures markets.\n The fund is an actively managed ETF that seeks to provide long-term capital appreciation, primarily through exposure to commodity futures markets. While the fund generally will seek exposure to the commodity futures markets included in the COMB Benchmark, it is not an index tracking ETF and will seek to improve its performance, in part through a cash management strategy consisting of investments in investment grade fixed income securities. The fund is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "Graniteshares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 128869176
    },
    "COMT": {
        "short_name": "iShares GSCI Commodity Dynamic ",
        "long_name": "iShares GSCI Commodity Dynamic Roll Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P GSCI Dynamic Roll (USD) Total Return Index composed of a broad range of commodity exposures with enhanced roll selection, on a total return basis.\n The index measures the performance of futures contracts. In seeking to achieve its investment objective, the fund may invest in a combination of exchange-traded commodity futures contracts, exchange-traded options on commodity-related futures contracts and exchange-cleared commodity related swaps (together, â\u0080\u009cCommodity Linked Investmentsâ\u0080\u009d), thereby obtaining exposure to the commodities markets.",
        "category": "Commodities Broad Basket",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 697685440
    },
    "DBC": {
        "short_name": "Invesco DB Commodity Index Trac",
        "long_name": "Invesco DB Commodity Index Tracking Fund",
        "currency": "USD",
        "summary": "The investment seeks to track changes, whether positive or negative, in the level of the DBIQ Optimum Yield Diversified Commodity Index Excess Returnâ\u0084¢.\n The fund pursues its investment objective by investing in a portfolio of exchange-traded futures on Light Sweet Crude Oil (WTI), Heating Oil, RBOB Gasoline, Natural Gas, Brent Crude, Gold, Silver, Aluminum, Zinc, Copper Grade A, Corn, Wheat, Soybeans, and Sugar. The index is composed of notional amounts of each of these commodities.",
        "category": "Commodities Broad Basket",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1891861760
    },
    "DJP": {
        "short_name": "iPath Bloomberg Commodity Index",
        "long_name": "iPath Bloomberg Commodity Index Total Return(SM) ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with exposure to the Dow Jones-UBS Commodity Index Total ReturnService Mark.\n The Dow Jones-UBS Commodity Index Total ReturnService Mark (the \"index\") reflects the returns that are potentially available through an unleveraged investment in the futures contracts on physical commodities comprising the index plus the rate of interest that could be earned on cash collateral invested in specified Treasury Bills. The index is a rolling index rebalancing annually.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 591732736
    },
    "FTGC": {
        "short_name": "First Trust Global Tactical Com",
        "long_name": "First Trust Global Tactical Commodity Strategy Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide total return by providing investors with commodity exposure while seeking a relatively stable risk profile.\n The fund is an actively managed exchange-traded fund (\"ETF\") that seeks to achieve attractive risk adjusted return by investing in commodity futures contracts and exchange-traded commodity linked instruments (collectively, \"Commodities Instruments\") through a wholly-owned subsidiary of the fund organized under the laws of the Cayman Islands (the \"Subsidiary\"). The advisor expects to gain exposure to these investments exclusively by investing in the Subsidiary.",
        "category": "Commodities Broad Basket",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 822654528
    },
    "GCC": {
        "short_name": "WisdomTree EnhancedContinuous C",
        "long_name": "WisdomTree Continuous Commodity Index Fund",
        "currency": "USD",
        "summary": "The investment seeks to reflect the performance of the index, over time, less the expenses of the fund and the master fundâ\u0080\u0099s overall operations.\n The master fund invests in a portfolio of index commodities, as well as holding cash and United States Treasury securities and other high credit quality short-term fixed income securities for deposit with the master fundâ\u0080\u0099s Commodity Broker as margin. The Continuous Commodity Total Return Index is a broad based commodity index that reflects the price movement of 17 exchange-traded futures contracts.",
        "category": "Commodities Broad Basket",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 78958296
    },
    "GSG": {
        "short_name": "iShares GSCI Commodity-Indexed ",
        "long_name": "iShares S&P GSCI Commodity-Indexed Trust",
        "currency": "USD",
        "summary": "The investment seeks to track the results of a fully collateralized investment in futures contracts on the S&P GSCIâ\u0084¢ Total Return Index.\n The Trust holds long positions in index futures that have settlement values at expiration based on the level of the S&P GSCI-ER at that time, and earning interest on its non-cash Collateral Assets used to satisfy applicable margin requirements on those index futures positions. The index reflects the return of the S&P GSCI-ER, together with the return on specified U.S. Treasury securities that are deemed to have been held to collateralize a hypothetical long position in the futures contracts comprising the S&P GSCIâ\u0084¢.",
        "category": "Commodities Broad Basket",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1114033920
    },
    "GSP": {
        "short_name": "Barclays Bank PLC iPath Exchang",
        "long_name": "iPath S&P GSCI Total Return Index ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with exposure to the S&P GSCIÂ® Total Return Index.\n The S&P GSCIÂ® Total Return Index provides exposure to the returns potentially available through an unleveraged investment in the contracts comprising the S&P GSCIÂ® plus the Treasury Bill rate of interest that could be earned on funds committed to the trading of the underlying contracts.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 17690224
    },
    "JJS": {
        "short_name": "iPathA Series B Bloomberg Softs",
        "long_name": "iPath Series B Bloomberg Softs Subindex Total Return ETN",
        "currency": "USD",
        "summary": "The investment seeks return linked to the performance of the Bloomberg Softs Subindex Total ReturnSM.\n The ETN offers exposure to futures contracts and not direct exposure to the physical commodities. The index is composed of one or more futures contracts on the relevant commodity (the â\u0080\u009cindex componentsâ\u0080\u009d) and is intended to reflect the returns that are potentially available through (1) an unleveraged investment in those contracts plus (2) the rate of interest that could be earned on cash collateral invested in specified Treasury Bills.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4651272
    },
    "JO": {
        "short_name": "iPathA Series B Bloomberg Coffe",
        "long_name": "iPath Series B Bloomberg Coffee Subindex Total Return ETN",
        "currency": "USD",
        "summary": "The investment seeks return linked to the performance of the Bloomberg Coffee Subindex Total ReturnSM.\n The ETN offers exposure to futures contracts and not direct exposure to the physical commodities. The index is composed of one or more futures contracts on the relevant commodity (the â\u0080\u009cindex componentsâ\u0080\u009d) and is intended to reflect the returns that are potentially available through (1) an unleveraged investment in those contracts plus (2) the rate of interest that could be earned on cash collateral invested in specified Treasury Bills.",
        "category": "Commodities Broad Basket",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 100542064
    },
    "RJI": {
        "short_name": "AB Svensk Ekportkredit (Swedish",
        "long_name": "ELEMENTS Linked to the Rogers International Commodity Index - Total Return",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the Rogers International Commodity Index â\u0080\u0093 Total Return index.\n The index represents the value of a basket of 35 commodity futures contracts.",
        "category": "Commodities Broad Basket",
        "family": "ELEMENTS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 127040096
    },
    "SDCI": {
        "short_name": "USCF SummerHaven Dynamic Commod",
        "long_name": "USCF SummerHaven Dynamic Commodity Strategy No K-1 Fund",
        "currency": "USD",
        "summary": "The investment seeks long-term total return.\n The fund seeks to maintain substantial economic exposure to the performance of the commodities markets. It primarily gains exposure to the commodities markets through the investments of its wholly-owned subsidiary. The subsidiary, which has the same investment objective as the fund, is advised by the Adviser and sub-adviser. The fund seeks to provide exposure to the commodities markets that corresponds to the SummerHaven Dynamic Commodity Index Total ReturnSM. The index is a total return commodity sector index designed to broadly represent major commodities. The fund is non-diversified.",
        "category": "Commodities Broad Basket",
        "family": "USCF Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3747970
    },
    "UCIB": {
        "short_name": "ETRACS UBS Bloomberg Constant M",
        "long_name": "UBS ETRACS UBS Bloomberg Constant Maturity Commodity Index (CMCI) Total Return ETN Series B",
        "currency": "USD",
        "summary": "The investment seeks to provide exposure to potential price appreciation in the UBS Bloomberg Constant Maturity Commodity Index Total Return.\n The ETN Series B is senior unsecured debt securities issued by UBS. The index is designed to be a diversified benchmark for commodities as an asset class. It is comprised of futures contracts on 27 components, representing 24 commodities, with up to five different maturities for each individual commodity. The overall return on the index is generated by two components: uncollateralized returns on the futures contracts comprising the index and a daily fixed-income return.",
        "category": "Commodities Broad Basket",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 48366480
    }
}