{
    "EWCO": {
        "short_name": "Invesco S&P 500 Equal Weight Co",
        "long_name": "Invesco S&P 500 Equal Weight Communication Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Equal Weight Communication Services Plus Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of all of the components of the S&P 500Â® Communication Services Plus Index, an index that contains the common stocks of all companies included in the S&P 500Â® Index that are classified as members of the communication services sector, as defined according to the Global Industry Classification Standard (\"GICS\"). It is non-diversified.",
        "category": "Communications",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FCOM": {
        "short_name": "Fidelity MSCI Communication Ser",
        "long_name": "Fidelity MSCI Communication Services Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Communication Services 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Communication Services 25/50 Index, which represents the performance of the communication services sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Communication Services 25/50 Index. The fund is non-diversified.",
        "category": "Communications",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FIVG": {
        "short_name": "Defiance Next Gen Connectivity ",
        "long_name": "Defiance 5G Next Gen Connectivity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Bluestar 5G Communications Index (the index).\n The fund uses a passive management approach to track the total return performance, before fees and expenses, of the index. The index consists of a tiered, modified market capitalization-weighted portfolio of the U.S.-listed equity securities, including depositary receipts, of companies whose products or services are predominantly tied to the development of 5G networking and communication technologies. It is non-diversified.",
        "category": "Communications",
        "family": "Defiance ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IWFH": {
        "short_name": "iShares Virtual Work and Life M",
        "long_name": "iShares Virtual Work and Life Multisector ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the NYSEÂ® FactSetÂ® Global Virtual Work and Life Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is composed of equity securities issued by companies that provide products, services, or technologies that support remote work (\"Tele-Work\") or remote lifestyle (\"Tele-Life\"), as determined by the index provider. The fund is non-diversified.",
        "category": "Communications",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IXP": {
        "short_name": "iShares Global Comm Services ET",
        "long_name": "iShares Global Comm Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P Global 1200 Communication Services 4.5/22.5/45 Capped IndexTM.\n The fund invests at least 90% of its assets in securities of the index and in depositary receipts representing securities of the index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the index. The index is designed to measure the performance of global equities in the communication services sector. The fund is non-diversified.",
        "category": "Communications",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IYZ": {
        "short_name": "iShares U.S. Telecommunications",
        "long_name": "iShares U.S. Telecommunications ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Telecommunications Index.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the telecommunications sector of the U.S. equity market and may include large-, mid- or small-capitalization companies. The fund is non-diversified.",
        "category": "Communications",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "JHCS": {
        "short_name": "John Hancock Multifactor Media ",
        "long_name": "John Hancock Multifactor Media and Communications ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the John Hancock Dimensional Media and Communications Index.\n The fund normally invests at least 80% of its net assets (plus any borrowings for investment purposes) in securities that compose the fund&#39;s index. The index is designed to comprise securities in the media and communications sector within the U.S. Universe whose market capitalizations are larger than that of the 1001st largest U.S. company at the time of reconstitution. It is non-diversified.",
        "category": "Communications",
        "family": "John Hancock",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VOX": {
        "short_name": "Vanguard Communication Services",
        "long_name": "Vanguard Communication Services Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index (IMI)/Communication Services 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the communication services sector, as classified under the GICS. The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. It is non-diversified.",
        "category": "Communications",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XLC": {
        "short_name": "The Communication Services Sele",
        "long_name": "Communication Services Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks to correspond generally to the price and yield performance of publicly traded equity securities of companies in the Communication Services Select Sector Index.\n Normally, the fund generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes companies that have been identified as Communication Services companies by the GICSÂ®, including securities of companies from the following industries: diversified telecommunication services; wireless telecommunication services; media; entertainment; and interactive media & services. The fund is non-diversified.",
        "category": "Communications",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XTL": {
        "short_name": "SPDR S&P Telecom ETF",
        "long_name": "SPDR S&P Telecom ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the telecommunications segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Telecom Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the telecommunications segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Communications",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    }
}