{
    "FSTA": {
        "short_name": "Fidelity MSCI COnsumer Staples ",
        "long_name": "Fidelity MSCI Consumer Staples Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Consumer Staples 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Consumer Staples 25/50 Index, which represents the performance of the consumer staples sector in the U.S. equity market. It may or may not hold all of the securities in MSCI USA IMI Consumer Staples 25/50 Index. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FTXG": {
        "short_name": "First Trust Nasdaq Food & Bever",
        "long_name": "First Trust Nasdaq Food & Beverage ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq US Smart Food & Beverage Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depository receipts that comprise the underlying index. The index is designed to provide exposure to U.S. companies comprising the food and beverage sector that have been selected based upon their liquidity and weighted based upon their cumulative score on three investing factors: volatility, value and growth. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FXG": {
        "short_name": "First Trust Cons. Staples Alpha",
        "long_name": "First Trust Consumer Staples AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the StrataQuantÂ® Consumer Staples Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000Â® Index in the consumer staples sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IECS": {
        "short_name": "iShares Evolved U.S. Consumer S",
        "long_name": "iShares Evolved U.S. Consumer Staples ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide access to U.S. companies with consumer staples exposure, as classified using a proprietary classification system.\n The fund seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in U.S. listed common stock of large-, mid- and small-capitalization consumer staples companies. It will hold common stock of those companies that fall into the Consumer Staples Evolved Sector which have economic characteristics that have been historically correlated with companies traditionally defined as consumer staples companies. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IYK": {
        "short_name": "iShares U.S. Consumer Goods ETF",
        "long_name": "iShares U.S. Consumer Goods ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Consumer Goods Index composed of U.S. equities in the consumer goods sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the consumer goods sector of the U.S. equity market. The fund may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
        "category": "Consumer Defensive",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "KXI": {
        "short_name": "iShares Global Consumer Staples",
        "long_name": "iShares Global Consumer Staples ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the S&P Global 1200 Consumer Staples (Sector) Capped IndexTM.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index. The index measures the performance of global equities in the consumer staples sector.",
        "category": "Consumer Defensive",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PBJ": {
        "short_name": "Invesco Dynamic Food & Beverage",
        "long_name": "Invesco Dynamic Food & Beverage ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Food & Beverage IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of common stocks of U.S. food and beverage companies. These companies are engaged principally in the manufacture, sale or distribution of food and beverage products, agricultural products and products related to the development of new food technologies. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PSCC": {
        "short_name": "Invesco S&P SmallCap Consumer S",
        "long_name": "Invesco S&P SmallCap Consumer Staples ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Capped Consumer Staples Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, S&P Dow Jones Indices, LLC compiles, maintains and calculates the index, which is designed to measure the performance of securities of small-capitalization U.S. companies in the consumer staples sector, as defined by the Global Industry Classification Standard. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "PSL": {
        "short_name": "Invesco DWA Consumer Staples Mo",
        "long_name": "Invesco DWA Consumer Staples Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Consumer Staples Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of at least 30 securities of companies in the consumer staples sector that have powerful relative strength or \"momentum\" characteristics.",
        "category": "Consumer Defensive",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "RHS": {
        "short_name": "Invesco S&P 500 Equal Weight Co",
        "long_name": "Invesco S&P 500 Equal Weight Consumer Staples ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Equal Weight Consumer Staples Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of all of the components of the S&P 500Â® Consumer Staples Index, an index that contains the common stocks of all companies included in the S&P 500Â® Index that are classified as members of the consumer staples sector, as defined according to the Global Industry Classification Standard (\"GICS\").",
        "category": "Consumer Defensive",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VDC": {
        "short_name": "Vanguard Consumer Staples ETF",
        "long_name": "Vanguard Consumer Staples Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index/Consumer Staples 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the consumer staples sector, as classified under the Global Industry Classification Standard. The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XLP": {
        "short_name": "SPDR Select Sector Fund - Consu",
        "long_name": "Consumer Staples Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Consumer Staples Select Sector Index.\n In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: food and staples retailing; household products; food products; beverages; tobacco; and personal products. The fund is non-diversified.",
        "category": "Consumer Defensive",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    }
}