{
    "AWAY": {
        "short_name": "ETFMG Travel Tech ETF",
        "long_name": "ETFMG Travel Tech ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Prime Travel Technology Index NTR.\n The fund invests at least 80% of its total assets, exclusive of collateral held from securities lending, in the component securities of the index and in ADRs and GDRs based on the component securities in the index. The index tracks the performance of globally exchange-listed equity securities of companies across the globe that are engaged in \"Travel Technology Business\" which is defined as providing technology, via the internet and internet-connected devices.",
        "category": "Consumer Cyclical",
        "family": "ETFMG",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BEDZ": {
        "short_name": "AdvisorShares Hotel ETF",
        "long_name": "AdvisorShares Hotel ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n The fund is an actively ETF that seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets (plus any borrowings for investment purposes) in securities of companies that derive at least 50% of their net revenue from the hotel business. It may also invest in companies involved in other lodging and travel-related services. The fund invests primarily in U.S. exchange listed equity securities, including common and preferred stock and â\u0080\u009cADRs. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BETZ": {
        "short_name": "Roundhill Sports Betting & iGam",
        "long_name": "Roundhill Sports Betting & iGaming ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Roundhill Sports Betting & iGaming Index.\n Under normal circumstances, at least 80% of the fund&#39;s net assets (plus borrowings for investment purposes) will be invested in securities issued by Sports Betting and iGaming Companies. The index tracks the performance of the common stock (or corresponding American Depositary Receipts (\"ADRs\") or Global Depositary Receipts (\"GDRs\")) of exchange-listed companies that earn revenue from online gaming (\"iGaming\").",
        "category": "Consumer Cyclical",
        "family": "Roundhill Financial",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BJK": {
        "short_name": "VanEck Vectors Gaming ETF",
        "long_name": "VanEck Vectors Gaming ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Gaming Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. To be initially eligible for the index, companies must generate at least 50% of their revenues from gaming. Gaming includes casinos and casino hotels, sports betting (including internet gambling and racetracks) and lottery services as well as gaming services, gaming technology and gaming equipment. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "VanEck",
        "exchange": "NMS",
        "market": "us_market"
    },
    "CARZ": {
        "short_name": "First Trust NASDAQ Global Auto ",
        "long_name": "First Trust NASDAQ Global Auto Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ OMX Global Auto Index(SM).\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is designed to track the performance of the largest and most liquid companies engaged in the manufacturing of automobiles. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "EATZ": {
        "short_name": "AdvisorShares Restaurant ETF",
        "long_name": "AdvisorShares Restaurant ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n The fund is an actively managed ETF that seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets (plus any borrowings for investment purposes) in securities of companies that derive at least 50% of their net revenue from the restaurant business. It invests primarily in U.S. exchange listed equity securities, including common and preferred stock and ADRs. The fund will concentrate at least 25% of its investments in the Hotels, Restaurants & Leisure Industry within the Consumer Discretionary Sector. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FDIS": {
        "short_name": "Fidelity MSCI Consumer Discreti",
        "long_name": "Fidelity MSCI Consumer Discretionary Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Consumer Discretionary 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Consumer Discretionary 25/50 Index, which represents the performance of the consumer discretionary sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Consumer Discretionary 25/50 Index. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FTXD": {
        "short_name": "First Trust Nasdaq Retail ETF",
        "long_name": "First Trust Nasdaq Retail ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of the Nasdaq US Smart Retail Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depository receipts that comprise the index. The index is designed to provide exposure to U.S. companies comprising the retail sector that have been selected based upon their liquidity and weighted based upon their cumulative score on three investing factors: volatility, value and growth. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market"
    },
    "FXD": {
        "short_name": "First Trust Cons. Discret. Alph",
        "long_name": "First Trust Consumer Discretionary AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the StrataQuantÂ® Consumer Discretionary Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000Â® Index in the consumer discretionary sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Consumer Cyclical",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IBUY": {
        "short_name": "Amplify ETF Trust Amplify Onlin",
        "long_name": "Amplify Online Retail ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that generally correspond (before fees and expenses) to the price and yield of the EQM Online Retail Index.\n The fund will invest at least 80% of its total assets in global equity securities that comprise the index, which will primarily include common stocks and/or depositary receipts, such as ADRs and GDRs. The index seeks to measure the performance of global equity securities of publicly traded companies with significant revenue from the online retail business. The index methodology is designed to result in a portfolio that has the potential for capital appreciation.",
        "category": "Consumer Cyclical",
        "family": "Amplify ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ITB": {
        "short_name": "iShares U.S. Home Construction ",
        "long_name": "iShares U.S. Home Construction ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Home Construction Index composed of U.S. equities in the home construction sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the home construction sector of the U.S. equity market. The fund may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IYC": {
        "short_name": "iShares U.S. Consumer Services ",
        "long_name": "iShares U.S. Consumer Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Consumer Services Capped Index.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of domestic equities in the consumer services industry.",
        "category": "Consumer Cyclical",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "NERD": {
        "short_name": "Roundhill BITKRAFT Esports & Di",
        "long_name": "Roundhill BITKRAFT Esports & Digital Entertainment ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Roundhill BITKRAFT Esports Index.\n The fund uses a \"passive management\" approach to seek to track the total return performance, before fees and expenses, of the index. The index tracks the performance of the common stock (or corresponding ADRs or GDRs) of exchange-listed companies that earn revenue from electronic sports, or esports related business activities. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "Roundhill Financial",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ONLN": {
        "short_name": "ProShares Online Retail ETF",
        "long_name": "ProShares Online Retail ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the ProShares Online Retail Index (the index).\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the index. The index is designed to measure the performance of publicly traded companies that principally sell online or through other non-store sales channels, such as through mobile or app purchases, rather than through \"brick and mortar\" store locations. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PBS": {
        "short_name": "Invesco Dynamic Media ETF",
        "long_name": "Invesco Dynamic Media ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Media IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of common stocks of U.S. media companies. These companies are principally engaged in the development, production, sale and distribution of goods or services used in the media industry. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PEJ": {
        "short_name": "Invesco Dynamic Leisure and Ent",
        "long_name": "Invesco Dynamic Leisure and Entertainment ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Leisure & Entertainment IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying intellidex. The underlying intellidex was composed of common stocks of U.S. leisure and entertainment companies. These companies are engaged principally in the design, production or distribution of goods or services in the leisure and entertainment industries. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PEZ": {
        "short_name": "Invesco DWA Consumer Cyclicals ",
        "long_name": "Invesco DWA Consumer Cyclicals Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Consumer Cyclicals Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of at least 30 securities of companies in the consumer discretionary (or cyclicals) sector that have powerful relative strength or \"momentum\" characteristics.",
        "category": "Consumer Cyclical",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "PSCD": {
        "short_name": "Invesco S&P SmallCap Consumer D",
        "long_name": "Invesco S&P SmallCap Consumer Discretionary ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Capped Consumer Discretionary Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities of small-capitalization U.S. consumer discretionary companies that comprise the underlying index. These companies are principally engaged in the businesses of providing consumer goods and services that are cyclical in nature, including, but not limited to, household durables, leisure products and services, apparel and luxury goods, computers and electronics, automobiles, etc.",
        "category": "Consumer Cyclical",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "RCD": {
        "short_name": "Invesco S&P 500 Equal Weight Co",
        "long_name": "Invesco S&P 500 Equal Weight Consumer Discretionary ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Equal Weight Consumer Discretionary Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of all of the components of the S&P 500Â® Consumer Discretionary Index, an index that contains the common stocks of all companies included in the S&P 500Â® Index that are classified as members of the consumer discretionary sector, as defined according to the Global Industry Classification Standard (\"GICS\").",
        "category": "Consumer Cyclical",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "RTH": {
        "short_name": "VanEck Vectors Retail ETF",
        "long_name": "VanEck Vectors Retail ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Listed Retail 25 Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. To be initially eligible for the index, companies must generate at least 50% of their revenues from retail. Retail includes companies engaged primarily in retail distribution; wholesalers; online, direct mail and TV retailers; multi-line retailers; specialty retailers; and food and other staples retailers. The fund is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "VanEck",
        "exchange": "NMS",
        "market": "us_market"
    },
    "RXI": {
        "short_name": "iShares Global Consumer Discret",
        "long_name": "iShares Global Consumer Discretionary ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the S&P Global 1200 Consumer Discretionary (Sector) Capped IndexTM.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index is designed to measure the performance of global equities in the consumer discretionary sector. The underlying index uses a capping methodology to limit the weight of the securities of any single issuer (as determined by S&P Dow Jones Indices LLC (the \"index provider\" or \"SPDJI\")) to a maximum of 10% of the underlying index.",
        "category": "Consumer Cyclical",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VCR": {
        "short_name": "Vanguard Consumer Discretion ET",
        "long_name": "Vanguard Consumer Discretionary Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index/Consumer Discretionary 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the consumer discretionary sector, as classified under the Global Industry Classification Standard. The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XHB": {
        "short_name": "SPDR Series Trust SPDR Homebuil",
        "long_name": "SPDR S&P Homebuilders ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the homebuilding segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Homebuilders Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the homebuilders segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Consumer Cyclical",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XLY": {
        "short_name": "SPDR Select Sector Fund - Consu",
        "long_name": "Consumer Discretionary Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before expenses, correspond to the price and yield performance of publicly traded equity securities of companies in the Consumer Discretionary Select Sector Index.\n The fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: retail; hotels, restaurants and leisure; textiles, apparel and luxury goods; household durables; automobiles; auto components; distributors; leisure products; and diversified consumer services. It is non-diversified.",
        "category": "Consumer Cyclical",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XRT": {
        "short_name": "SPDR S&P Retail ETF",
        "long_name": "SPDR S&P Retail ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the retail segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Retail Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the retail segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Consumer Cyclical",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    }
}