{
    "ADRE": {
        "short_name": "Invesco BLDRS Emerging Markets ",
        "long_name": "Invesco BLDRS Emerging Markets 50 ADR Index Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results, of publicly traded Depositary Receipts representing securities of issuers in emerging markets represented by the S&P/BNY Mellon Emerging 50 ADR Index (USD).\n The index is developed by the Licensor from a universe of Depositary Receipts defined by the S&P/Bank of New York Mellon ADR Index (\"S&P/BNY Mellon ADR Composite Index\"). The fund normally holds at least 95% of its total assets in Depositary Receipts that comprise the index, and will seek to track the investment results, before fees and expenses, of the index. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 222046368
    },
    "BICK": {
        "short_name": "First Trust BICK Index Fund",
        "long_name": "First Trust BICK Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the ISE BICKTM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is designed to provide a benchmark for investors interested in tracking some of the largest and most liquid public companies that are domiciled in Brazil, India, China (including Hong Kong) and South Korea that are accessible for investment by U.S. investors.",
        "category": "Diversified Emerging Mkts",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 83870424
    },
    "BKEM": {
        "short_name": "BNY Mellon Emerging Markets Equ",
        "long_name": "BNY Mellon Emerging Markets Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Morningstar Emerging Markets Large Cap IndexSM.\n Under normal circumstances, in seeking to track the index&#39;s performance, the fund generally purchases a representative sample of the securities comprising the index. By using a sampling process, it typically will not invest in all of the securities in the index. The MorningstarÂ® Emerging Markets Large Cap IndexSM is a float-adjusted market capitalization weighted index designed to measure the performance of emerging market large-capitalization stocks. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "BNY Mellon",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 41374088
    },
    "BKF": {
        "short_name": "iShares MSCI BRIC Index Fund",
        "long_name": "iShares MSCI BRIC ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI BRIC Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization index that is designed to measure the combined equity market performance in Brazil, Russia, India and China (\"BRIC\").",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 173874368
    },
    "CEY": {
        "short_name": "VictoryShares Emerging Market H",
        "long_name": "VictoryShares Emerging Market High Div Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory Emerging Market High Dividend 100 Volatility Weighted Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory Emerging Market High Dividend 100 Volatility Weighted Index (the \"index\"). The index identifies the 100 highest dividend yielding stocks in the Nasdaq Victory Emerging Market 500 Volatility Weighted Index.",
        "category": "Diversified Emerging Mkts",
        "family": "Victory Capital",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 19027824
    },
    "DBEM": {
        "short_name": "Xtrackers MSCI Emerging Markets",
        "long_name": "Xtrackers MSCI Emerging Markets Hedged Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI EM US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, before fees and expenses, of the underlying index, which is designed to track emerging market performance while mitigating exposure to fluctuations between the value of the U.S. dollar and the currencies of the countries included in the underlying index. It will invest at least 80% of its total assets in component securities of the underlying index.",
        "category": "Diversified Emerging Mkts",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 115728216
    },
    "DGS": {
        "short_name": "WisdomTree Emerging Market Smal",
        "long_name": "WisdomTree Emerging Markets SmallCap Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Emerging Markets SmallCap Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of small cap common stocks selected from the WisdomTree Emerging Markets Dividend Index. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1935202176
    },
    "DMRE": {
        "short_name": "DeltaShares S&P EM 100 & Manage",
        "long_name": "DeltaShares S&P EM 100 & Managed Risk ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results, before fees and expenses, of the S&P EM 100 Managed Risk 2.0 Index.\n Under normal market conditions, the fund invests a substantial portion, but at least 80%, of its assets, exclusive of collateral held from securities lending, in securities comprising the underlying index. The underlying index seeks to achieve these objectives by allocating weightings among the S&P EM 100 Index, the S&P U.S. Treasury Bond Current 5-Year Index and the S&P U.S. Treasury Bill 0-3 Month Index. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "DeltaShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 53115808
    },
    "DVYE": {
        "short_name": "iShares Emerging Markets Divide",
        "long_name": "iShares Emerging Markets Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones Emerging Markets Select Dividend Index composed of relatively high dividend paying equities in emerging markets.\n The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index. The index measures the performance of 100 leading dividend-paying emerging-market companies, selected by dividend yield subject to screening and buffering criteria.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 793693440
    },
    "EAPR": {
        "short_name": "Innovator MSCI Emerging Markets",
        "long_name": "Innovator MSCI Emerging Markets Power Buffer ETF - April",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with returns that match the price return of the iShares MSCI Emerging Markets ETF.\n The fund invests at least 80% of its net assets in FLexible EXchangeÂ® Options (\"FLEX Options\") that reference the iShares MSCI Emerging Markets ETF. FLEX Options are exchange-traded options contracts with uniquely customizable terms. Although guaranteed for settlement by the Options Clearing Corporation (the \"OCC\"), FLEX Options are still subject to counterparty risk with the OCC and may be less liquid than more traditional exchange-traded options. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Innovator ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24
    },
    "ECON": {
        "short_name": "Columbia Emerging Markets Consu",
        "long_name": "Columbia Emerging Markets Consumer ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) to the price and yield performance of the Dow Jones Emerging Markets Consumer Titans TM Index.\n The fund will invest at least 80% of its net assets in securities of Emerging Markets Consumer companies which comprise the index and the advisor generally expects to be substantially invested at such times with at least 95% of its net assets invested in these securities. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Columbia Threadneedle",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 182998688
    },
    "ECOW": {
        "short_name": "Pacer Emerging Markets Cash Cow",
        "long_name": "Pacer Emerging Markets Cash Cows 100 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer Emerging Markets Cash Cows 100 Index.\n The index uses an objective, rules-based methodology to provide exposure to large and mid-capitalization companies in emerging markets with high free cash flow yields. Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Pacer",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 3674118
    },
    "EDIV": {
        "short_name": "SPDR S&P Emerging Markets Divid",
        "long_name": "SPDR S&P Emerging Markets Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Emerging Markets Dividend Opportunities Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of 100 high-yielding emerging market common stocks.",
        "category": "Diversified Emerging Mkts",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 316880608
    },
    "EDOG": {
        "short_name": "ALPS Emerging Sector Dividend D",
        "long_name": "ALPS Emerging Sector Dividend Dogs ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that replicate as closely as possible, before fees and expenses, the performance of the S-NetworkÂ® Emerging Sector Dividend Dogs Index (the \"index\").\n The index is a rules-based index intended to give investors a means of tracking the overall performance of the highest dividend paying stocks (i.e. \"Dividend Dogs\") in the S-NetworkÂ® Emerging Markets Index, a universe of mainly large capitalization stocks domiciled in emerging markets (the \"S-Network Emerging Markets\") on a sector-by-sector basis.",
        "category": "Diversified Emerging Mkts",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 22590904
    },
    "EELV": {
        "short_name": "Invesco S&P Emerging Markets Lo",
        "long_name": "Invesco S&P Emerging Markets Low Volatility ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P BMI Emerging Markets Low Volatility IndexTM (the \"underlying index\").\n The fund will invest at least 90% of its total assets in the securities that comprise the underlying index. S&P Dow Jones Indices LLC (\"S&P DJI\" or the \"index provider\") compiles, maintains and calculates the underlying index, which is designed to measure the performance of 200 of the least volatile stocks of the S&P Emerging Plus LargeMidCap Index.",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 281846848
    },
    "EEM": {
        "short_name": "iShares MSCI Emerging Index Fun",
        "long_name": "iShares MSCI Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Emerging Markets Index.\n The fund generally invests at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index is designed to measure equity market performance in the global emerging markets. The underlying index will include large- and mid-capitalization companies and may change over time.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 30559182848
    },
    "EEMD": {
        "short_name": "AAM S&P Emerging Markets High D",
        "long_name": "AAM S&P Emerging Markets High Dividend Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the S&P Emerging Markets Dividend and Free Cash Flow Yield Index.\n The index is a rules-based, equal-weighted index that is designed to provide exposure to the constituents of the S&P Emerging Plus LargeMidCap Index that exhibit both high dividend yield and sustainable dividend distribution characteristics, while maintaining diversified sector exposure. At least 80% of the fundâ\u0080\u0099s net assets will be invested in equity securities that (i) are tied economically to Emerging Markets countries and (ii) have had a positive realized annual dividend yield within the past year.",
        "category": "Diversified Emerging Mkts",
        "family": "AAM",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6714444
    },
    "EEMO": {
        "short_name": "Invesco S&P Emerging Markets Mo",
        "long_name": "Invesco S&P Emerging Markets Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P Momentum Emerging Plus LargeMidCap Index (the \"underlying index\").\n The fund will invest at least 90% of its total assets in the securities of companies that comprise the underlying index, as well as ADRs and GDRs that represent securities in the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is composed of constituents of the S&P Emerging Plus LargeMidCap that have the highest \"momentum score.\"",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8518085
    },
    "EEMS": {
        "short_name": "Ishares MSCI Emerging Markets S",
        "long_name": "iShares MSCI Emerging Markets Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Emerging Markets Small Cap Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities of small-capitalization companies in emerging market countries.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 312322304
    },
    "EEMX": {
        "short_name": "SPDR MSCI Emerging Markets Fuel",
        "long_name": "SPDR MSCI Emerging Markets Fossil Fuel Free ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the MSCI Emerging Markets ex Fossil Fuels Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of companies in the MSCI Emerging Markets Index that are \"fossil fuel reserves free,\" as determined by the screening methodology used by the index.",
        "category": "Diversified Emerging Mkts",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 173705168
    },
    "EJAN": {
        "short_name": "Innovator ETFs Trust Innovator ",
        "long_name": "Innovator MSCI Emerging Markets Power Buffer ETF January",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with returns that match the price return of the iShares MSCI Emerging Markets ETF.\n The fund invests at least 80% of its net assets in FLexible EXchangeÂ® Options (\"FLEX Options\") that reference the iShares MSCI Emerging Markets ETF (the \"Underlying ETF\"). FLEX Options are exchange-traded options contracts with uniquely customizable terms. The Underlying ETF is an exchange-traded fund which seeks to track a quarterly reviewed index, the MSCI Emerging Markets Index, designed to represent the performance of mid- and large-cap securities in emerging market countries. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Innovator ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 122571376
    },
    "EMDV": {
        "short_name": "ProShares MSCI Emerging Markets",
        "long_name": "ProShares MSCI Emerging Markets Dividend Growers ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the MSCI Emerging Markets Dividend Masters Index (the \"index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities. The index, constructed and maintained by MSCI, targets companies that are currently members of the MSCI Emerging Markets Index (\"MSCI Emerging Markets\") and have increased dividend payments each year for at least 7 years.",
        "category": "Diversified Emerging Mkts",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 21718280
    },
    "EMFM": {
        "short_name": "Global X MSCI Next Emerging & F",
        "long_name": "Global X Next Emerging & Frontier ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI Select Emerging and Frontier Markets Access Index (\"underlying index\").\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to reflect equity performance of select emerging markets and frontier markets companies while maintaining diversification across individual countries, sectors and issuers.",
        "category": "Diversified Emerging Mkts",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 16213865
    },
    "EMGF": {
        "short_name": "iShares MSCI Emerging Markets M",
        "long_name": "iShares MSCI Emerging Markets Multifactor ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Emerging Markets Diversified Multiple-Factor Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is designed to select equity securities from the MSCI Emerging Markets Index (the \"parent index\") that have high exposure to four investment style factors: value, quality, momentum and low size, while maintaining a level of risk similar to that of the parent index.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 711385984
    },
    "EMIF": {
        "short_name": "iShares S&P Emerging Markets In",
        "long_name": "iShares Emerging Markets Infrastructure ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P Emerging Markets Infrastructure IndexTM, which is designed to track the performance of 30 of the largest publicly listed companies in the infrastructure industry in emerging markets.\n The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the index. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 15472131
    },
    "EMQQ": {
        "short_name": "Emerging Markets Internet and E",
        "long_name": "EMQQ The Emerging Markets Internet & Ecommerce ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of EMQQ The Emerging Markets Internet & Ecommerce IndexTM (the \"index\").\n The fund will normally invest at least 80% of its total assets in securities of the index or in depositary receipts representing securities of the index. The index is designed to measure the performance of an investable universe of publicly-traded, emerging market internet and ecommerce companies. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "EMQQ",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1967112960
    },
    "EMSG": {
        "short_name": "Xtrackers MSCI Emerging Markets",
        "long_name": "Xtrackers MSCI Emerging Markets ESG Leaders Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI Emerging Markets ESG Leaders Index.\n The index consists of large- and medium-capitalization companies across emerging markets countries. The fund will invest at least 80% of its total assets (but typically far more) in component securities (including depositary receipts in respect of such securities) of the index. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 13617412
    },
    "EMXC": {
        "short_name": "iShares MSCI Emerging Markets e",
        "long_name": "iShares MSCI Emerging Markets ex China ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Emerging Markets ex China Index (the \"underlying index\").\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through an underlying fund) of the underlying index. The underlying index is a free float-adjusted market capitalization weighted index that captures large- and mid-capitalization stocks across 25 of the 26 Emerging Markets countries (as defined by MSCI Inc. (the \"index provider\" or \"MSCI\")), excluding China.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 441524672
    },
    "EWEB": {
        "short_name": "Global X Emerging Markets Inter",
        "long_name": "Global X Emerging Markets Internet & E-commerce ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Nasdaq CTA Emerging Markets Internet & E-commerce Net Total Return Index.\n The fund invests at least 80% of its total assets, plus borrowings for investments purposes (if any), in the securities of the index and in ADRs and GDRs based on the securities in the index. The index is designed to provide exposure to exchange-listed companies that are expected to benefit from further adoption of internet and e-commerce technologies in emerging markets countries. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Global X Funds",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 8060401
    },
    "EWX": {
        "short_name": "SPDR S&P Emerging Markets Small",
        "long_name": "SPDR S&P Emerging Markets Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Emerging Markets Under USD2 Billion Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a float-adjusted market capitalization weighted index designed to represent the small capitalization segment of emerging countries included in the S&P Global BMI.",
        "category": "Diversified Emerging Mkts",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 630473536
    },
    "EYLD": {
        "short_name": "Cambria ETF Trust Cambria Emerg",
        "long_name": "Cambria Emerging Shareholder Yield ETF",
        "currency": "USD",
        "summary": "The investment seeks income and capital appreciation.\n The fund is actively managed and seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its total assets in equity securities, including common stock and depositary receipts, issued by publicly listed companies in emerging foreign markets that provide high \"shareholder yield.\" Its investment adviser, Cambria Investment Management, L.P. (\"Cambria\" or the \"Adviser\"), defines \"shareholder yield\" as the totality of returns realized by an investor from a companyâ\u0080\u0099s cash payments for dividends, buybacks and debt paydowns.",
        "category": "Diversified Emerging Mkts",
        "family": "CAMBRIA ETF TRUST",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 55123344
    },
    "FEM": {
        "short_name": "First Trust Emerging Markets Al",
        "long_name": "First Trust Emerging Markets AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEXÂ® Emerging Markets Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Emerging Markets Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Diversified Emerging Mkts",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 523489952
    },
    "FEMS": {
        "short_name": "First Trust Emerging Markets Sm",
        "long_name": "First Trust Emerging Markets Small Cap AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield of an equity index called the NASDAQ AlphaDEXÂ® Emerging Markets Small Cap Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Emerging Markets Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Diversified Emerging Mkts",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 136177456
    },
    "FLQE": {
        "short_name": "Franklin LibertyQ Emerging Mark",
        "long_name": "Franklin LibertyQ Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the LibertyQ Emerging Markets Index.\n The fund invests at least 80% of its assets in the component securities of the index and in depositary receipts representing such securities. The index seeks to achieve a lower level of risk and higher risk-adjusted performance than the MSCI Emerging Markets Index over the long term by applying a multi-factor selection process.",
        "category": "Diversified Emerging Mkts",
        "family": "Franklin Templeton Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24070996
    },
    "FM": {
        "short_name": "iShares MSCI Frontier and Selec",
        "long_name": "iShares MSCI Frontier and Select EM ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Frontier and Emerging Markets Select Index composed primarily of frontier market equities along with select emerging market equities.\n The index aims to reflect the performance of frontier markets and the lower size spectrum of emerging markets, while putting a stronger emphasis on tradability and investability of the constituents compared to the parent index. The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 428656224
    },
    "FNDE": {
        "short_name": "Schwab Fundamental Emerging Mar",
        "long_name": "Schwab Fundamental Emerging Markets Large Company Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Russell RAFIâ\u0084¢ Emerging Markets Large Company Index.\n The fund will invest at least 80% of its net assets in stocks included in the index, including depositary receipts representing securities of the index; which may be in the form of American Depositary Receipts, Global Depositary Receipts and European Depositary Receipts. The index measures the performance of the large company size segment by fundamental overall company scores, which are created using as the universe the emerging markets companies in the FTSE Global Total Cap Index (the parent index).",
        "category": "Diversified Emerging Mkts",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4363250688
    },
    "GEM": {
        "short_name": "Goldman Sachs ActiveBeta Emergi",
        "long_name": "Goldman Sachs ActiveBeta Emerging Markets Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the Goldman Sachs ActiveBetaÂ® Emerging Markets Equity Index.\n The index is designed to deliver exposure to equity securities of emerging market issuers. The fund invests at least 80% of its assets (exclusive of collateral held from securities lending) in securities included in its underlying index, in depositary receipts representing securities included in its underlying index and in underlying stocks in respect of depositary receipts included in its underlying index.",
        "category": "Diversified Emerging Mkts",
        "family": "Goldman Sachs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1959766656
    },
    "GSEE": {
        "short_name": "Goldman Sachs MarketBeta Emergi",
        "long_name": "Goldman Sachs MarketBeta Emerging Markets Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the Solactive GBS Emerging Markets Large & Mid Cap Index.\n The fund invests at least 80% of its assets in securities included in its underlying index, in depositary receipts representing securities included in its underlying index and in underlying stocks in respect of depositary receipts included in its underlying index. The index consists of equity securities of large and mid-capitalization issuers covering approximately the largest 85% of the free-float market capitalization in emerging markets.",
        "category": "Diversified Emerging Mkts",
        "family": "Goldman Sachs",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 37199488
    },
    "IEMG": {
        "short_name": "iShares Core MSCI Emerging Mark",
        "long_name": "iShares Core MSCI Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Emerging Markets Investable Market Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure large-, mid- and small-cap equity market performance in the global emerging markets. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 77940506624
    },
    "ISEM": {
        "short_name": "Invesco RAFI Strategic Emerging",
        "long_name": "Invesco RAFI Strategic Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Invesco Strategic Emerging Markets Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index and American depositary receipts (\"ADRs\") and global depositary receipts (\"GDRs\") that are based on securities in the underlying index. The underlying index is designed to measure the performance of equity securities issued by higher quality, large-business-sized companies located in countries designated as emerging market countries. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 24467598
    },
    "JEMA": {
        "short_name": "J.P. Morgan Exchange-Traded Fun",
        "long_name": "JPMorgan Emerging Markets Equity Core ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide long-term capital appreciation.\n Under normal circumstances, the fund invests at least 80% of its assets in equity securities and equity-related instruments that are tied economically to emerging markets. The equity securities and equity-related instruments in which it may invest include, but are not limited to, common stock, participation notes or other structured notes, and other instruments that provide economic exposure to one or more equity securities. The fund may also use exchanged-traded futures for the efficient management of cash flows.",
        "category": "Diversified Emerging Mkts",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 28939872
    },
    "JHEM": {
        "short_name": "John Hancock Multifactor Emergi",
        "long_name": "John Hancock Multifactor Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the John Hancock Dimensional Emerging Markets Index (the index).\n The fund normally invests at least 80% of its net assets (plus any borrowings for investment purposes) in securities included in the index, in depositary receipts representing securities included in the index, and in underlying stocks in respect of depositary receipts included in the index. The index is designed to comprise a subset of securities associated with emerging markets, which may include frontier markets (emerging markets in an earlier stage of development).",
        "category": "Diversified Emerging Mkts",
        "family": "John Hancock",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 709465728
    },
    "JPEM": {
        "short_name": "JPMorgan Diversified Return Eme",
        "long_name": "JPMorgan Diversified Return Emerging Markets Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the JP Morgan Diversified Factor Emerging Markets Equity Index.\n The fund will invest at least 80% of its assets in securities included in the underlying index. \"Assets\" means net assets, plus the amount of borrowing for investment purposes. The underlying index is comprised of equity securities from emerging markets selected to represent a diversified set of factor characteristics.",
        "category": "Diversified Emerging Mkts",
        "family": "JPMorgan",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 249354192
    },
    "KEMQ": {
        "short_name": "KraneShares Emerging Markets Co",
        "long_name": "KraneShares FTSE Emerging Markets Consumer Technology Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the price and yield performance of Solactive Emerging Market Consumer Technology Index.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the index, depositary receipts, including ADRs, representing such components and securities underlying depositary receipts in the index. The index is composed of the equity securities of the 50 companies with the largest market capitalization that are headquartered in certain emerging market and frontier countries and engaged in the consumer or technology sectors. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 79519016
    },
    "KEMX": {
        "short_name": "KraneShares MSCI Emerging Marke",
        "long_name": "KraneShares MSCI Emerging Markets ex China Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the MSCI Emerging Markets ex China Index.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index and depositary receipts, including American depositary receipts (\"ADRs\"), representing such components. The underlying index is a free float-adjusted market capitalization weighted index designed to track the equity market performance of mid- and large-cap companies of emerging market countries, excluding China.",
        "category": "Diversified Emerging Mkts",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 30517452
    },
    "KMED": {
        "short_name": "KraneShares Trust KraneShares E",
        "long_name": "KraneShares Emerging Markets Healthcare Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, track the price and yield performance of the Solactive Emerging Markets Healthcare Index (the index).\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the index, depositary receipts, including American depositary receipts (\"ADRs\"), representing such components, and securities underlying depositary receipts in the index. The index is a free float adjusted market capitalization weighted index designed to track the equity market performance of emerging market companies engaged in the healthcare business. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6847158
    },
    "PBEE": {
        "short_name": "Invesco PureBeta FTSE Emerging ",
        "long_name": "Invesco PureBeta FTSE Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the FTSE Emerging Index.\n The fund generally will invest at least 90% of its total assets common stocks that comprise the underlying index, as well as American depositary receipts (\"ADRs\") and global depositary receipts (\"GDRs\") that represent securities in the underlying index. The index is designed to measure the performance of the large- and mid-capitalization segments of equity markets of countries around the world that are classified as emerging markets within the country classification definition of the index provider.",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 5795876
    },
    "PIE": {
        "short_name": "Invesco DWA Emerging Markets Mo",
        "long_name": "Invesco DWA Emerging Markets Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Emerging Markets Technical Leaders Index (the \"underlying index\").\n The fund will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is comprised of equity securities of large capitalization companies based in emerging market countries.",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 287719008
    },
    "PXH": {
        "short_name": "Invesco FTSE RAFI Emerging Mark",
        "long_name": "Invesco FTSE RAFI Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the FTSE RAFITM Emerging Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as ADRs and GDRs that represent securities in the underlying index. The underlying index is is comprised of securities of companies located in countries that are classified as emerging markets within the country classification definition of FTSE. The underlying index includes securities of companies selected from the constituents of the FTSE Emerging Total Cap Index.",
        "category": "Diversified Emerging Mkts",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1284200448
    },
    "QEMM": {
        "short_name": "SPDR MSCI Emerging Markets Stra",
        "long_name": "SPDR MSCI Emerging Markets StrategicFactors ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the MSCI Emerging Markets (EM) Factor Mix A-Series Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index captures large- and mid-cap representation across 26 emerging markets countries and aims to represent the performance of value, low volatility, and quality factor strategies.",
        "category": "Diversified Emerging Mkts",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 89601728
    },
    "RESE": {
        "short_name": "WisdomTree Emerging Markets ESG",
        "long_name": "WisdomTree Emerging Markets ESG Fund",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation.\n The fund is actively managed using a model-based approach. It seeks to achieve its investment objective by investing primarily in equity securities of issuers in emerging markets that exhibit certain characteristics that the fund&#39;s investment adviser believes to be indicative of positive future returns as well as incorporating favorable environmental, social, and governance (\"ESG\") characteristics based on a model developed by the adviser. The adviser employs a quantitative model to identify which securities the fund might purchase and sell and opportune times for purchases and sales. The fund is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "WisdomTree",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 33593340
    },
    "RFEM": {
        "short_name": "First Trust RiverFront Dynamic ",
        "long_name": "First Trust RiverFront Dynamic Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide capital appreciation.\n The fund invests at least 80% of its net assets (including investment borrowings) in a portfolio of equity securities of emerging market companies, including through investments in common stock, depositary receipts, and common and preferred shares of real estate investment trusts, and forward foreign currency exchange contracts and currency spot transactions used to hedge the fund&#39;s exposure to the currencies in which the equity securities of such emerging market companies are denominated. The fund may invest in small, mid and large capitalization companies.",
        "category": "Diversified Emerging Mkts",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 54732024
    },
    "RNEM": {
        "short_name": "Emerging Markets Equity Select ",
        "long_name": "First Trust Emerging Markets Equity Select ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq Riskalyze Emerging Markets Index (the \"index\").\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, preferred shares and real estate investment trusts (\"REITs\") that comprise the index. The index is designed to select low volatility securities issued by companies operating in emerging market countries.",
        "category": "Diversified Emerging Mkts",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 7473466
    },
    "ROAM": {
        "short_name": "Hartford Multifactor Emerging M",
        "long_name": "Hartford Multifactor Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond to the total return performance of the Hartford Multifactor Emerging Markets Equity Index.\n The fund generally invests at least 80% of its assets in securities of the index and in depositary receipts (such as American Depositary Receipts (\"ADRs\"), Global Depositary Receipts (\"GDRs\") and European Depositary Receipts (\"EDRs\") representing securities of the index. The index is designed to balance risks and opportunities within equity markets of emerging economies while emphasizing constituents exhibiting a favorable combination of factor characteristics.",
        "category": "Diversified Emerging Mkts",
        "family": "Hartford Mutual Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 40932788
    },
    "SCHE": {
        "short_name": "Schwab Emerging Markets Equity ",
        "long_name": "Schwab Emerging Markets Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the FTSE Emerging Index.\n The fund generally invests in stocks that are included in the FTSE Emerging Index. The index is comprised of large and mid capitalization companies in emerging market countries, as defined by the index provider. The fund will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in these stocks, including depositary receipts representing securities of the index; such depositary receipts may be in the form of ADRs, GDRs and EDRs.",
        "category": "Diversified Emerging Mkts",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 9228355584
    },
    "SPEM": {
        "short_name": "SPDR Index Shares Fund SPDR Por",
        "long_name": "SPDR Portfolio Emerging Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Emerging BMI Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in emerging markets.",
        "category": "Diversified Emerging Mkts",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6269609984
    },
    "TLTE": {
        "short_name": "FlexShares Morningstar Emerging",
        "long_name": "FlexShares Morningstar Emerging Markets Factor Tilt Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the MorningstarÂ® Emerging Markets Factor Tilt IndexSM.\n The index is designed to reflect the performance of a selection of companies that, in aggregate, possess greater exposure to size and value factors relative to the Morningstar Emerging Markets Index, a float-adjusted market-capitalization weighted index of companies incorporated in emerging-market countries. The fund will invest at least 80% of its total assets in the securities of the index and in ADRs and GDRs based on the securities in the index.",
        "category": "Diversified Emerging Mkts",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 286236160
    },
    "UEVM": {
        "short_name": "VictoryShares USAA MSCI Emergin",
        "long_name": "VictoryShares USAA MSCI Emerging Markets Value Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the MSCI Emerging Markets Select Value Momentum Blend Index.\n The fund invests at least 80% of its assets in securities in the index, depositary receipts on securities in the index and securities underlying depositary receipts in the index. The index delivers exposure to equity market performance in the global emerging markets and provides higher exposure to value and momentum factors within the MSCI Emerging Markets Index while maintaining moderate index turnover and lower realized volatility than traditional capitalization weighted indexes.",
        "category": "Diversified Emerging Mkts",
        "family": "Victory Capital",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 296678144
    },
    "VWO": {
        "short_name": "Vanguard FTSE Emerging Markets ",
        "long_name": "Vanguard FTSE Emerging Markets Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of stocks issued by companies located in emerging market countries.\n The fund employs an indexing investment approach designed to track the performance of the FTSE Emerging Markets All Cap China A Inclusion Index. It invests by sampling the index, meaning that it holds a broadly diversified collection of securities that, in the aggregate, approximates the index in terms of key characteristics.",
        "category": "Diversified Emerging Mkts",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 111504375808
    },
    "XCEM": {
        "short_name": "Columbia EM Core ex-China ETF",
        "long_name": "Columbia EM Core ex-China ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond to the price and yield performance of the Beta Thematic Emerging Markets ex-China Index.\n The fund will invest at least 80% of its net assets in the companies included in the index and the advisor generally expects to be substantially invested at such times, with at least 95% of its net assets invested in these securities. The index is designed to provide broad, core emerging markets equity exposure by measuring the stock performance of up to 700 emerging markets companies, excluding companies domiciled or exchange-listed in China or domiciled in Hong Kong. It is non-diversified.",
        "category": "Diversified Emerging Mkts",
        "family": "Columbia Threadneedle",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 30069620
    }
}