{
    "EBND": {
        "short_name": "SPDR Bloomberg Barclays Emergin",
        "long_name": "SPDR Bloomberg Barclays Emerging Markets Local Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays EM Local Currency Government Diversified Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Sub-Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the fixed-rate local currency sovereign debt of emerging market countries.",
        "category": "Emerging-Markets Local-Currency Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ELD": {
        "short_name": "WisdomTree Emerging Markets Loc",
        "long_name": "WisdomTree Emerging Markets Local Debt Fund",
        "currency": "USD",
        "summary": "The investment seeks a high level of total return consisting of both income and capital appreciation.\n The fund seeks to achieve its investment objective through investment in bonds and other debt instruments denominated in the local currencies of emerging market countries. Under normal circumstances, it will invest at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in Local Debt. The Advisor attempts to maintain an aggregate portfolio duration of between two and ten years under normal market conditions. The fund is non-diversified.",
        "category": "Emerging-Markets Local-Currency Bond",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EMLC": {
        "short_name": "VanEck Vectors J.P. Morgan EM L",
        "long_name": "VanEck Vectors J.P. Morgan EM Local Currency Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the J.P. Morgan GBI-EM Global Core Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of bonds issued by emerging market governments and denominated in the local currency of the issuer. It may concentrate its investments in a particular industry or group of industries to the extent that the index concentrates in an industry or group of industries. The fund is non-diversified.",
        "category": "Emerging-Markets Local-Currency Bond",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FEMB": {
        "short_name": "First Trust Emerging Markets Lo",
        "long_name": "First Trust Emerging Markets Local Currency Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks maximum total return and current income.\n Under normal market conditions, the fund seeks to achieve its investment objective by investing at least 80% of its net assets (including investment borrowings) in bonds, notes and bills issued or guaranteed by entities incorporated or domiciled in emerging market countries (collectively, \"Bonds\") that are denominated in the local currency of the issuer. It is non-diversified.",
        "category": "Emerging-Markets Local-Currency Bond",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "KCNY": {
        "short_name": "KraneShares E Fund China Commer",
        "long_name": "KraneShares E Fund China Commercial Paper ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond to the price and yield performance of the CSI Diversified High Grade Commercial Paper Index.\n The fund will invest at least 80% of its total assets in securities of the underlying index. The underlying index seeks to track the performance of high-grade on-shore renminbi (\"RMB\")-denominated (or \"CNY\") commercial paper that is issued by corporate issuers in the People&#39;s Republic of China&#39;s (\"China\" or the \"PRC\") and traded in the Chinese Inter-bank Bond Market (\"CIBM\"). The fund is non-diversified.",
        "category": "Emerging-Markets Local-Currency Bond",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market"
    }
}