{
    "AMJ": {
        "short_name": "JPMorgan Chase Capital XVI JP M",
        "long_name": "JPMorgan Alerian MLP Index ETN",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the Alerian MLP Index.\n The index tracks the performance of midstream energy Master Limited Partnerships.",
        "category": "Energy Limited Partnership",
        "family": "JPMorgan",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1839466240
    },
    "AMLP": {
        "short_name": "Alerian MLP ETF",
        "long_name": "Alerian MLP ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the price and yield performance of its underlying index, the Alerian MLP Infrastructure Index.\n The fund will normally invest at least 90% of its total assets in securities that comprise the underlying index. The underlying index is comprised of energy infrastructure MLPs that earn a majority of their cash flow from the transportation, storage and processing of energy commodities. It is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4565988864
    },
    "AMND": {
        "short_name": "UBS AG ETRACS Alerian Midstream",
        "long_name": "ETRACS Alerian Midstream Energy High Dividend Index ETN",
        "currency": "USD",
        "summary": "The investment seeks a return linked to the performance of the Alerian Midstream Energy Dividend Index (the â\u0080\u009cindexâ\u0080\u009d). \nThe index is a fundamentally-weighted index based on the liquid, dividend-paying portion of the North American energy infrastructure market. The securities do not have a minimum payment at maturity, upon redemption or upon call and are fully exposed to any decline in the index. The payment investors receive on the securities at maturity, early redemption or upon exercise by UBS of its call right will depend on the performance of the index, as measured by the Current Principal Amount.",
        "category": "Energy Limited Partnership",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 29428100
    },
    "AMUB": {
        "short_name": "ETRACS Alerian MLP Index ETN Se",
        "long_name": "UBS ETRACS Alerian MLP Index ETN Series B",
        "currency": "USD",
        "summary": "The investment seeks to provide exposure to potential price appreciation in the Alerian MLP Index (the â\u0080\u009cindexâ\u0080\u009d).\n The ETRACS Alerian MLP Index ETN Series B due July 18, 2042 (the â\u0080\u009cSecuritiesâ\u0080\u009d) is senior unsecured debt securities issued by UBS. The index measures the composite performance of energy master limited partnerships (â\u0080\u009cMLPsâ\u0080\u009d), and is calculated by S&P Dow Jones Indices using a float-adjusted, capitalization-weighted methodology.",
        "category": "Energy Limited Partnership",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 73493968
    },
    "AMZA": {
        "short_name": "InfraCap MLP ETF",
        "long_name": "InfraCap MLP ETF",
        "currency": "USD",
        "summary": "The investment seeks total return primarily through investments in equity securities of publicly traded master limited partnerships and limited liability companies taxed as partnerships (\"MLPs\").\n Under normal market conditions, the fund will invest not less than 80% of its net assets (plus the amount of any borrowings for investment purposes) in equity securities of MLPs in the energy infrastructure sector. It is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "Virtus",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 215555104
    },
    "ATMP": {
        "short_name": "iPath Select MLP ETN",
        "long_name": "Barclays ETN+ Select MLP ETN",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the Atlantic Trust Select MLP Index.\n The index seeks to capture returns that may be available from investing in a basket of direct or indirect interests in master limited partnerships (â\u0080\u009cMLPsâ\u0080\u009d), limited liability companies (â\u0080\u009cLLCsâ\u0080\u009d) and corporations (collectively, â\u0080\u009cMLP Interestsâ\u0080\u009d) that are selected pursuant to the Atlantic Trust Select MLP Strategy.",
        "category": "Energy Limited Partnership",
        "family": "Milleis Investissements Funds",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 164477440
    },
    "BMLP": {
        "short_name": "Dorsey Wright MLP Index ETNs du",
        "long_name": "BMO Dorsey Wright MLP Index Exchange Traded Notes",
        "currency": "USD",
        "summary": "The investment seeks to link to the performance of the DWA MLP Selectâ\u0084¢ Index (the â\u0080\u009cindexâ\u0080\u009d).\n The index includes 15 master limited partnerships (â\u0080\u009cMLPsâ\u0080\u009d) based on the proprietary Dorsey Wright Relative Strength Ranking Methodology. By comparing the price relationship between each MLP, the index seeks to determine which MLPs are currently showing outperformance relative to their peers within the Index universe.",
        "category": "Energy Limited Partnership",
        "family": "BMO Capital Markets",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 26931076
    },
    "EINC": {
        "short_name": "VanEck Vectors Energy Income ET",
        "long_name": "VanEck Vectors Energy Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® North America Energy Infrastructure Index.\n The fund will normally invest at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is a rules-based index designed to give investors a means to track the overall performance of North American companies involved in the midstream energy segment, which includes master limited partnerships (\"MLPs\") and corporations involved in oil and gas storage and transportation. The fund is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 26371804
    },
    "EMLP": {
        "short_name": "First Trust North American Ener",
        "long_name": "First Trust North American Energy Infrastructure Fund",
        "currency": "USD",
        "summary": "The investment seeks total return.\n The fund invests at least 80% of its net assets in equity securities of companies deemed by the sub-advisor to be engaged in the energy infrastructure sector. These companies principally include U.S. and Canadian natural gas and electric utilities, corporations operating energy infrastructure assets such as pipelines or renewable energy production, utilities, publicly-traded MLPs, MLP affiliates and energy infrastructure companies. It is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1858275072
    },
    "ENFR": {
        "short_name": "Alerian Energy Infrastructure E",
        "long_name": "Alerian Energy Infrastructure ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the price and yield performance of its underlying index, the Alerian Midstream Energy Select Index.\n The underlying index is a composite of North American energy infrastructure companies engaged midstream activities involving energy commodities including gathering and processing, liquefaction, pipeline transportation, rail terminaling, and storage (also known as \"midstream energy businesses\"). The fund will normally invest at least 90% of its total assets in securities that comprise the underlying index. It is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 46740392
    },
    "IMLP": {
        "short_name": "iPath S&P MLP ETN",
        "long_name": "iPath S&P MLP ETN",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the S&P MLP Index.\n The index is designed to provide exposure to leading partnerships that trade on major U.S. exchanges and are classified in the GICS Energy Sector and GICS Gas Utilities Industry according to the Global Industry Classification StandardÂ® (â\u0080\u009cGICSâ\u0080\u009d). It includes both master limited partnerships (â\u0080\u009cMLPsâ\u0080\u009d) and publicly traded limited liability companies which have a similar legal structure to MLPs and share the same tax benefits as MLPs (collectively, the â\u0080\u009cindex constituentsâ\u0080\u009d). The index is calculated, maintained and published by S&P Dow Jones Indices LLC.",
        "category": "Energy Limited Partnership",
        "family": "Milleis Investissements Funds",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 12695077
    },
    "MLPB": {
        "short_name": "ETRACS Alerian MLP Infrastructu",
        "long_name": "UBS ETRACS Alerian MLP Infrastructure Index ETN Series B",
        "currency": "USD",
        "summary": "The investment seeks to provide exposure to potential price appreciation in the Alerian MLP Infrastructure Index.\n The ETRACS Alerian MLP Infrastructure Index ETN Series B is senior unsecured debt securities issued by UBS. The index constituents earn the majority of their cash flow from gathering and processing, liquefaction, midstream services, pipeline transportation, rail terminaling and storage of energy commodities.",
        "category": "Energy Limited Partnership",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 181385264
    },
    "MLPO": {
        "short_name": "Credit Suisse Group Exchange Tr",
        "long_name": "Credit Suisse S&P MLP Index ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide exposure to the price return version of the S&P MLP Index (the â\u0080\u009cindexâ\u0080\u009d).\n The index includes both master limited partnerships and publicly traded limited liability companies. In addition, the ETNs allow investors the potential to receive quarterly coupons that generally reflect the net cash distributions made by the index constituents, reduced by the application of the fees.",
        "category": "Energy Limited Partnership",
        "family": "Credit Suisse AG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 19971542
    },
    "MLPX": {
        "short_name": "Global X MLP & Energy Infrastru",
        "long_name": "Global X MLP & Energy Infrastructure ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive MLP & Energy Infrastructure Index.\n The fund invests at least 80% of its total assets in the securities of the index. It also invests at least 80% of its total assets in securities of master limited partnerships and energy infrastructure corporations. The fund&#39;s 80% investment policies are non-fundamental and require 60 days prior written notice to shareholders before they can be changed. The index tracks the performance of midstream energy infrastructure MLPs and corporations. It is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 714830912
    },
    "PYPE": {
        "short_name": "ETRACS NYSE Pickens Core Midstr",
        "long_name": "UBS ETRACS NYSE Pickens Core Midstream Index ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide exposure to potential price appreciation in the NYSEÂ® Pickens Core Midstreamâ\u0084¢ Index (the â\u0080\u009cindexâ\u0080\u009d).\n The securities are senior unsecured medium-term notes issued by UBS with a return linked to the performance of the index. The securities may pay a quarterly coupon during their term. The index measures the performance of the common stock of corporations and units of master limited partnerships (â\u0080\u009cMLPsâ\u0080\u009d) which represent U.S. midstream energy fundamentals, agnostic of entity structure.",
        "category": "Energy Limited Partnership",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15615300
    },
    "TPYP": {
        "short_name": "Tortoise North American Pipelin",
        "long_name": "Tortoise North American Pipeline Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the price and distribution rate (total return) performance of the Tortoise North American Pipeline IndexSM (the \"underlying index\").\n The fund will normally invest at least 80% of its total assets in securities that comprise the underlying index (or depository receipts based on such securities). The underlying index is a proprietary rules-based, capitalization weighted, float adjusted index designed to track the overall performance of equity securities of North American Pipeline Companies. The fund is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "Tortoise Capital Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 425141408
    },
    "UMI": {
        "short_name": "USCF Midstream Energy Income Fu",
        "long_name": "USCF Midstream Energy Income Fund",
        "currency": "USD",
        "summary": "The investment seeks a high level of current income; as a secondary objective, the fund seeks capital appreciation.\n The fund will seek to achieve its investment objectives by investing, under normal market conditions, at least 80% of its net assets in equity securities of U.S. and Canadian companies of any market capitalization deemed by the Sub-Adviser to be engaged in the midstream energy sector. It will invest more than 25% of the value of its total assets in the energy, oil, and gas industries. The fund is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "USCF Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": null
    },
    "USAI": {
        "short_name": "Pacer American Energy Independe",
        "long_name": "Pacer American Energy Independence ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the American Energy Independence Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of any collateral held from securities lending) will be invested in the component securities of the index and depositary receipts representing foreign securities. The index uses a proprietary, rules-based methodology to measure the performance of a portfolio of U.S. and Canadian exchange-listed equity securities of companies that generate a majority of their cash flow from certain qualifying \"midstream\" energy infrastructure activities. The fund is non-diversified.",
        "category": "Energy Limited Partnership",
        "family": "Pacer",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 16088669
    }
}