{
    "GDX": {
        "short_name": "VanEck Vectors Gold Miners ETF",
        "long_name": "VanEck Vectors Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the NYSEÂ® Arca Gold Miners IndexÂ®.\n The fund normally invests at least 80% of its total assets in common stocks and depositary receipts of companies involved in the gold mining industry. The index is a modified market-capitalization weighted index primarily comprised of publicly traded companies involved in the mining for gold and silver. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "GDXJ": {
        "short_name": "VanEck Vectors Junior Gold Mine",
        "long_name": "VanEck Vectors Junior Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Junior Gold Miners Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the index. The index includes companies that generate at least 50% of their revenues from gold and/or silver mining/royalties/streaming or have mining projects with the potential to generate at least 50% of their revenues from gold and/or silver when developed. It is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "REMX": {
        "short_name": "VanEck Vectors Rare Earth Strat",
        "long_name": "VanEck Vectors Rare Earth/Strategic Metals ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Rare Earth/Strategic Metals Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes companies primarily engaged in a variety of activities that are related to the producing, refining and recycling of rare earth and strategic metals and minerals. It is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SILJ": {
        "short_name": "ETFMG Prime Junior Silver Miner",
        "long_name": "ETFMG Prime Junior Silver Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the price and yield performance of the Prime Junior Silver Miners & Explorers Index.\n The fund invests at least 80% of its total assets in the component securities of the index and in ADRs and GDRs based on the component securities in the index. The index tracks the performance of the equity securities (or corresponding American Depositary Receipts (\"ADRs\") or Global Depositary Receipts (\"GDRs\")) of small-capitalization companies actively engaged in silver refining, mining, or exploration (\"Junior Silver Companies\"). The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "ETFMG",
        "exchange": "PCX",
        "market": "us_market"
    }
}