{
    "GDX": {
        "short_name": "VanEck Vectors Gold Miners ETF",
        "long_name": "VanEck Vectors Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the NYSEÂ® Arca Gold Miners IndexÂ®.\n The fund normally invests at least 80% of its total assets in common stocks and depositary receipts of companies involved in the gold mining industry. The index is a modified market-capitalization weighted index primarily comprised of publicly traded companies involved in the mining for gold and silver. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 14358820864
    },
    "GDXJ": {
        "short_name": "VanEck Vectors Junior Gold Mine",
        "long_name": "VanEck Vectors Junior Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Junior Gold Miners Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the index. The index includes companies that generate at least 50% of their revenues from gold and/or silver mining/royalties/streaming or have mining projects with the potential to generate at least 50% of their revenues from gold and/or silver when developed. It is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5369994752
    },
    "GOAU": {
        "short_name": "US Global GO Gold and Precious ",
        "long_name": "U.S. Global GO GOLD and Precious Metal Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the U.S. Global Go Gold and Precious Metal Miners Index.\n Under normal circumstances, at least 80 percent of the fund&#39;s total assets (exclusive of any collateral held from securities lending) will be invested in the component securities of the index and depositary receipts representing component securities. The index is composed of the exchange-listed common stock (or American Depositary Receipts (\"ADRs\")) of U.S. and international (including emerging markets) companies that earn at least 50 percent of their aggregate revenue from precious metals. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "U.S. Global Investors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 89350408
    },
    "GOEX": {
        "short_name": "Global X Gold Explorers ETF",
        "long_name": "Global X Gold Explorers ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global Gold Explorers & Developers Total Return Index.\n The fund invests at least 80% of its total assets in the securities of the index and in American Depositary Receipts and Global Depositary Receipts based on the securities in the underlying index. The underlying index is a free float-adjusted, liquidity-tested and market capitalization-weighted index that is designed to measure broad-based equity market performance of global companies involved in gold exploration. It is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 53408376
    },
    "JGLD": {
        "short_name": "Amplify Pure Junior Gold Miners",
        "long_name": "Amplify Pure Junior Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that generally correspond (before fees and expenses) to the price and yield of the EQM Pure Junior Gold Miners Index.\n The fund will normally invest at least 80% of its total assets in the securities that comprise the index, which primarily include common stocks and/or depositary receipts. The index seeks to provide exposure to global companies engaged in junior and exploratory gold mining. It will not concentrate its investments in securities of issuers in any one industry or group of industries, except to the extent that the index concentrates in an industry or group of industries. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "Amplify ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1756360
    },
    "REMX": {
        "short_name": "VanEck Vectors Rare Earth Strat",
        "long_name": "VanEck Vectors Rare Earth/Strategic Metals ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Rare Earth/Strategic Metals Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes companies primarily engaged in a variety of activities that are related to the producing, refining and recycling of rare earth and strategic metals and minerals. It is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 623739904
    },
    "RING": {
        "short_name": "iShares MSCI Global Gold Miners",
        "long_name": "iShares MSCI Global Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI Select Gold Miners Investable Market Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index has been developed by MSCI Inc. (the \"index provider\" or \"MSCI\") to target a minimum of 30 companies in developed and emerging markets that are involved in the business of gold mining. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 416524704
    },
    "SGDJ": {
        "short_name": "Sprott Junior Gold Miners ETF",
        "long_name": "Sprott Junior Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) to the performance of its underlying index, the Solactive Junior Gold Miners Custom Factor Index.\n The fund will invest at least 90% of its net assets in securities that comprise the underlying index. The underlying index aims to track the performance of \"junior\" gold companies primarily located in the U.S., Canada and Australia whose common stock, American Depositary Receipts (\"ADRs\") or Global Depositary Receipts (\"GDRs\") are traded on a regulated stock exchange in the form of shares tradeable for foreign investors without any restrictions. It is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "Sprott",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 113405904
    },
    "SGDM": {
        "short_name": "Sprott Gold Miners ETF",
        "long_name": "Sprott Gold Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks results that correspond (before fees and expenses) to the performance of the Solactive Gold Miners Custom Factors Index.\n The underlying index aims to track the performance of gold companies located in the U.S. and Canada whose common stocks or American Depository Receipts (\"ADRs\") are traded on the Toronto Stock Exchange, the New York Stock Exchange and NASDAQ. The fund will normally invest at least 90% of its net assets in securities that comprise the index. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "Sprott",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 233444192
    },
    "SIL": {
        "short_name": "Global X Silver Miners ETF",
        "long_name": "Global X Silver Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global Silver Miners Total Return Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to measure broad-based equity market performance of global companies involved in the silver mining industry. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1175715328
    },
    "SILJ": {
        "short_name": "ETFMG Prime Junior Silver Miner",
        "long_name": "ETFMG Prime Junior Silver Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to thetotal return performance of the Prime Junior Silver Miners & Explorers Index.\n The index tracks the performance of the equity securities (or corresponding American Depositary Receipts (\"ADRs\") or Global Depositary Receipts (\"GDRs\")) of small-capitalization companies actively engaged in silver refining, mining, or exploration (\"Junior Silver Companies\"). The fund invests at least 80% of its total assets in the component securities of the index and in ADRs and GDRs based on the component securities in the index. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "ETFMG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 837485184
    },
    "SLVP": {
        "short_name": "iShares MSCI Global Silver Mine",
        "long_name": "iShares MSCI Global Silver and Metals Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI Select Silver Miners Investable Market Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index has been developed by MSCI Inc. (the \"index provider\" or \"MSCI\") to focus on approximately 25 companies in developed and emerging markets that are involved in silver mining or exploration. The fund is non-diversified.",
        "category": "Equity Precious Metals",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 277628320
    }
}