{
    "ACES": {
        "short_name": "ALPS Clean Energy ETF",
        "long_name": "ALPS Clean Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the performance of its underlying index, the CIBC Atlas Clean Energy Index (ticker symbol NACEX) (the \"underlying index\").\n The fund will invest at least 80% of its net assets in securities that comprise the underlying index. The underlying index utilizes a rules-based methodology developed by CIBC National Trust Company (the \"index provider\"), which is designed to provide exposure to a diverse set of U.S. and Canadian companies involved in the clean energy sector including renewables and clean technology. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "ALPS",
        "exchange": "BTS",
        "market": "us_market"
    },
    "CNRG": {
        "short_name": "SPDR S&P Kensho Clean Power ETF",
        "long_name": "SPDR Kensho Clean Power ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Kensho Clean Power Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to capture companies whose products and services are driving innovation behind clean power. The fund may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments, such as repurchase agreements and money market funds. It is non-diversified.",
        "category": "Equity Energy",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "CRAK": {
        "short_name": "VanEck Vectors Oil Refiners ETF",
        "long_name": "VanEck Vectors Oil Refiners ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Oil Refiners Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes equity securities and depositary receipts of companies that generate at least 50% of their revenues from crude oil refining. Products of these companies may include gasoline, diesel, jet fuel, fuel oil, naphtha, and other petrochemicals. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FCG": {
        "short_name": "First Trust Natural Gas ETF",
        "long_name": "First Trust Natural Gas ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the ISE-Revere Natural Gasâ\u0084¢ Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts and MLP units that comprise the index. The index is designed to track the performance of mid and large capitalization companies that derive a substantial portion of their revenues from midstream activities and/or the exploration and production of natural gas.",
        "category": "Equity Energy",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FENY": {
        "short_name": "Fidelity MSCI Energy Index ETF",
        "long_name": "Fidelity MSCI Energy Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Energy 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Energy 25/50 Index, which represents the performance of the energy sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Energy 25/50 Index. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FILL": {
        "short_name": "iShares MSCI Global Energy Prod",
        "long_name": "iShares MSCI Global Energy Producers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI Select Energy Producers Investable Market Index (IMI).\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index measures the combined performance of equity securities of companies in both developed and emerging markets that are primarily engaged in the business of energy exploration and production. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FTXN": {
        "short_name": "First Trust Nasdaq Oil & Gas ET",
        "long_name": "First Trust Nasdaq Oil & Gas ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of the Nasdaq US Smart Oil & Gas Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depository receipts that comprise the index. The index is designed to provide exposure to U.S. companies comprising the oil and gas sector that have been selected based upon their liquidity and weighted based upon their cumulative score on three investing factors: volatility, value and growth. It is non-diversified.",
        "category": "Equity Energy",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FXN": {
        "short_name": "First Trust Energy AlphaDEX Fun",
        "long_name": "First Trust Energy AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the StrataQuantÂ® Energy Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000Â® Index in the energy sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Equity Energy",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IEO": {
        "short_name": "iShares U.S. Oil & Gas Explorat",
        "long_name": "iShares U.S. Oil & Gas Exploration & Production ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Oil Exploration & Production Index composed of U.S. equities in the oil and gas exploration and production sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the oil exploration and production sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IEZ": {
        "short_name": "iShares U.S. Oil Equipment & Se",
        "long_name": "iShares U.S. Oil Equipment & Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Oil Equipment & Services Index.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying fund measures the performance of the oil equipment and services sector of the U.S. equity market and includes companies that are suppliers of equipment or services to oil fields and offshore platforms, such as drilling, exploration, seismic information services and platform construction. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IXC": {
        "short_name": "iShares Global Energy ETF",
        "long_name": "iShares Global Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the S&P Global 1200 Energy IndexTM.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index. The index measures the performance of companies that the index provider deems to be part of the energy sector of the economy and that the index provider believes are important to global markets. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IYE": {
        "short_name": "iShares U.S. Energy ETF",
        "long_name": "iShares U.S. Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Oil & Gas Index composed of U.S. equities in the energy sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the oil and gas sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "OIH": {
        "short_name": "VanEck Vectors Oil Services ETF",
        "long_name": "VanEck Vectors Oil Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Listed Oil Services 25 Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes common stocks and depositary receipts of U.S. exchange-listed companies in the oil services segment. Such companies may include small- and medium-capitalization companies and foreign companies that are listed on a U.S. exchange. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PXE": {
        "short_name": "Invesco Dynamic Energy Explorat",
        "long_name": "Invesco Dynamic Energy Exploration & Production ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Energy Exploration & Production IntellidexSM Index.\n The fund invests at least 90% of its total assets in the securities that comprise the underlying intellidex. The intellidex was composed of common stocks of U.S. companies involved in the exploration and production of natural resources used to produce energy. These companies are engaged principally in exploration, extraction and production of crude oil and natural gas from land-based or offshore wells. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PXI": {
        "short_name": "Invesco DWA Energy Momentum ETF",
        "long_name": "Invesco DWA Energy Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Energy Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of at least 30 securities of companies in the energy sector that have powerful relative strength or \"momentum\" characteristics.",
        "category": "Equity Energy",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "PXJ": {
        "short_name": "Invesco Dynamic Oil & Gas Servi",
        "long_name": "Invesco Dynamic Oil & Gas Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Oil Services IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index was composed of common stocks of U.S. companies that assist in the production, processing and distribution of oil and gas. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VDE": {
        "short_name": "Vanguard Energy ETF",
        "long_name": "Vanguard Energy Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index (IMI)/Energy 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the energy sector, as classified under the Global Industry Classification Standard (GICS). The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XES": {
        "short_name": "SPDR Series Trust SPDR S&P Oil ",
        "long_name": "SPDR S&P Oil & Gas Equipment & Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the oil and gas equipment and services segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Oil & Gas Equipment & Services Select Industry Index, the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the oil and gas equipment and services segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Equity Energy",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XLE": {
        "short_name": "SPDR Select Sector Fund - Energ",
        "long_name": "Energy Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Energy Select Sector Index.\n In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: oil, gas and consumable fuels; and energy equipment and services. The fund is non-diversified.",
        "category": "Equity Energy",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XOP": {
        "short_name": "SPDR S&P Oil & Gas Explor & Pro",
        "long_name": "SPDR S&P Oil & Gas Exploration & Production ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the oil and gas exploration and production segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Oil & Gas Exploration & Production Select Industry Index, the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the oil and gas exploration and production segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Equity Energy",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    }
}