{
    "BBEU": {
        "short_name": "JPMorgan BetaBuilders Europe ET",
        "long_name": "JPMorgan BetaBuilders Europe ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the MorningstarÂ® Developed Europe Target Market Exposure IndexSM.\n The fund will invest at least 80% of its assets in securities included in the underlying index. The underlying index is a free float adjusted market capitalization-weighted index which consists of equity securities from developed European countries or regions, including: Austria, Belgium, Denmark, Finland, France, Germany, Ireland, Italy, the Netherlands, Norway, Portugal, Spain, Sweden, Switzerland and the United Kingdom.",
        "category": "Europe Stock",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market"
    },
    "DBEU": {
        "short_name": "Xtrackers MSCI Europe Hedged Eq",
        "long_name": "Xtrackers MSCI Europe Hedged Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI Europe US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, of the underlying index, which is designed to track the performance of the developed markets in Europe, while mitigating exposure to fluctuations between the value of the U.S. dollar and the currencies of the countries included in the underlying index. It will invest at least 80% of its total assets in component securities of the underlying index.",
        "category": "Europe Stock",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DBEZ": {
        "short_name": "Xtrackers MSCI Eurozone Hedged ",
        "long_name": "Xtrackers MSCI Eurozone Hedged Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI EMU IMI US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, of the underlying index, which is designed to track the performance of equity securities based in the countries in the European Monetary Union, while seeking to mitigate exposure to fluctuations between the value of the U.S. dollar and the euro. It will invest at least 80% of its total assets in component securities of the underlying index.",
        "category": "Europe Stock",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DFE": {
        "short_name": "WisdomTree Europe SmallCap Divi",
        "long_name": "WisdomTree Europe SmallCap Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe SmallCap Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the small-capitalization segment of the European dividend-paying market. The fund is non-diversified.",
        "category": "Europe Stock",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EUDG": {
        "short_name": "WisdomTree Europe Quality Divid",
        "long_name": "WisdomTree Europe Quality Dividend Growth Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Quality Dividend Growth Index.\n At least 80% of the fund&#39;s total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks of companies with growth characteristics that are incorporated and listed on a stock exchange in one of the following countries: Germany, Switzerland, United Kingdom, etc. The fund is non-diversified.",
        "category": "Europe Stock",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EURZ": {
        "short_name": "Xtrackers Eurozone Equity ETF",
        "long_name": "Xtrackers Eurozone Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the NASDAQ Eurozone Large Mid Cap Index (the \"underlying index\").\n The fund will invest at least 80% of its total assets (but typically far more) in component securities (including depositary receipts in respect of such securities) of the underlying index. The underlying index is designed to track the performance of equity securities of large- and mid-capitalization companies based in the countries in the Economic and Monetary Union (the \"EMU\" or \"Eurozone\") of the European Union (\"EU\"). The fund is non-diversified.",
        "category": "Europe Stock",
        "family": "Xtrackers",
        "exchange": "BTS",
        "market": "us_market"
    },
    "EUSC": {
        "short_name": "WisdomTree Europe Hedged SmallC",
        "long_name": "WisdomTree Europe Hedged SmallCap Equity Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Europe Hedged SmallCap Equity Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to small cap equity securities within Europe, while at the same time neutralizing exposure to fluctuations between the value of the euro and the U.S. dollar. The fund is non-diversified.",
        "category": "Europe Stock",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EZU": {
        "short_name": "iShares MSCI Eurozone ETF",
        "long_name": "iShares MSCI Eurozone ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EMU Index composed of large- and mid-capitalization equities from developed market countries that use the euro as their official currency.\n The fund generally invests at least 95% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index consists of securities from the following 10 developed market countries: Austria, Belgium, Finland, France, Germany, Ireland, Italy, the Netherlands, Portugal and Spain.",
        "category": "Europe Stock",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FDD": {
        "short_name": "First Trust Dow Jones STOXX Sel",
        "long_name": "First Trust STOXX European Select Dividend Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the STOXXÂ® Europe Select Dividend 30 Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index consists of 30 high dividend-yielding securities selected from the STOXXÂ® Europe 600 Index. In addition, a security must be issued by a company with a non-negative five-year dividend-per-share growth rate and a dividend-to-earnings ratio of 60% or less.",
        "category": "Europe Stock",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FEP": {
        "short_name": "First Trust Europe AlphaDEX Fun",
        "long_name": "First Trust Europe AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEXÂ® Europe Index (the \"index\").\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Europe Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Europe Stock",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FEUL": {
        "short_name": "Credit Suisse FI Enhanced Europ",
        "long_name": "Credit Suisse FI Enhanced Europe 50 Exchange Traded Notes (ETNs)",
        "currency": "USD",
        "summary": "The investment seeks to provide a quarterly compounded 2x leveraged exposure to the STOXXÂ® Europe 50 USD (Gross Return) Index (the â\u0080\u009cindexâ\u0080\u009d), reduced by the applicable ETN Fees.\n The ETNs are medium-term note, the return on which is linked to the performance of the index on a leveraged basis. The index is composed of the equity securities of 50 â\u0080\u009cblue-chipâ\u0080\u009d European companies by free-float market capitalization selected from within the STOXXÂ® Europe 600 Index (the â\u0080\u009cparent indexâ\u0080\u009d).",
        "category": "Europe Stock",
        "family": "Credit Suisse AG",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FEUZ": {
        "short_name": "First Trust Eurozone AlphaDEX E",
        "long_name": "First Trust Eurozone AlphaDEX ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield of an index called the NASDAQÂ® AlphaDEXÂ® Eurozone Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Eurozone Index that may generate positive alpha, or risk-adjusted returns, relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Europe Stock",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FEZ": {
        "short_name": "SPDR DJ Euro STOXX 50 Etf",
        "long_name": "SPDR EURO STOXX 50 ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the EURO STOXX 50Â® Index.\n The fund employs a sampling strategy, which means that the fund is not required to purchase all of the securities represented in the index. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to represent the performance of some of the largest companies across components of the 19 EURO STOXX Supersector Indexes. The EURO STOXX Supersector Indexes are subsets of the EURO STOXX Index.",
        "category": "Europe Stock",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FFEU": {
        "short_name": "Barclays ETN  FI Enhanced Europ",
        "long_name": "Barclays ETN+ FI Enhanced Europe 50 ETN Series C",
        "currency": "USD",
        "summary": "The investment seeks return linked to a quarterly rebalanced leveraged participation in the performance of the STOXX Europe 50Â® USD (Gross Return) Index (the â\u0080\u009cindexâ\u0080\u009d).\n At inception the ETN is designed to target two times the performance of the index. A quarterly rebalancing event or a loss rebalancing event will aim to reset the leveraged exposure to the index to approximately two. The index is composed of 50 European blue-chip companies selected from within the STOXX Europe 600 Index.",
        "category": "Europe Stock",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FIEE": {
        "short_name": "UBS AG FI Enhanced Europe 50 ET",
        "long_name": "UBS AG FI Enhanced Europe 50 ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide a two times leveraged long exposure to the performance of the index compounded on a quarterly basis, reduced by the Accrued Fees.\n The UBS AG FI Enhanced Europe 50 ETN are a series of FI Enhanced ETNs linked to the STOXX Europe 50Â® USD (Gross Return) Index. The Securities are senior unsecured debt securities issued by UBS AG (UBS). The index is derived from the STOXX Europe 600 Index (the â\u0080\u009cparent indexâ\u0080\u009d), which is further subdivided into 19 STOXX Regional Total Market Index (TMI) Supersector Indices (the â\u0080\u009cSupersector Indicesâ\u0080\u009d). The index is composed of 50 European blue-chip companies from within the parent index.",
        "category": "Europe Stock",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FPXE": {
        "short_name": "First Trust IPOX Europe Equity ",
        "long_name": "First Trust IPOX Europe Equity Opportunities ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the IPOXÂ® 100 Europe Index (the \"index\").\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index seeks to measure the performance of the equity securities of the 100 largest and typically most liquid initial public offerings (\"IPOs\") (including spin-offs and equity carve-outs) of companies that are economically tied to Europe. The fund is non-diversified.",
        "category": "Europe Stock",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "OEUR": {
        "short_name": "OShares Europe Quality Dividend",
        "long_name": "O’Shares Europe Quality Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance (before fees and expenses) of the O&#39;Shares Europe Quality Dividend Index (the \"target index\").\n The target index is designed to measure the performance of publicly listed large-capitalization and mid-capitalization dividend-paying issuers in Europe that meet certain market capitalization, liquidity, high quality, low volatility and dividend yield thresholds, as determined by O&#39;Shares Investment Advisers, LLC (the \"index provider\"). Under normal market conditions, the fund will invest at least 80% of its total assets in the components of the target index.",
        "category": "Europe Stock",
        "family": "O&#39;Shares Investments",
        "exchange": "BTS",
        "market": "us_market"
    },
    "SPEU": {
        "short_name": "SPDR Portfolio Europe ETF",
        "long_name": "SPDR Portfolio Europe ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the STOXXÂ® Europe Total Market Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. It employs a sampling strategy, which means that the fund is not required to purchase all of the securities represented in the index. The index is a free-float market capitalization weighted index designed to provide a broad representation of publicly traded Western European companies.",
        "category": "Europe Stock",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VGK": {
        "short_name": "Vanguard FTSEEuropean ETF",
        "long_name": "Vanguard FTSE Europe Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of stocks issued by companies located in the major markets of Europe.\n The fund employs an indexing investment approach by investing all, or substantially all, of its assets in the common stocks included in the FTSE Developed Europe All Cap Index. The index is a market-capitalization-weighted index.",
        "category": "Europe Stock",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    }
}