{
    "BDCZ": {
        "short_name": "ETRACS Wells Fargo Business Dev",
        "long_name": "UBS ETRACS Wells Fargo Business Development Company Index ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide exposure to the performance of the Wells FargoÂ® Business Development Company Index.\n The ETRACS Wells FargoÂ® Business Development Company Index ETN Series B due April 26, 2041 are senior unsecured debt securities issued by UBS AG. The index is intended to measure the performance of all business development companies listed on the NYSE or NASDAQ that satisfy specified market capitalization and other eligibility requirements. It refers to the business development companies included in the Wells FargoÂ® Business Development Company Index as the â\u0080\u009cindex constituents.â\u0080\u009d The index is a proprietary index of Wells Fargo Securities, LLC.",
        "category": "Financial",
        "family": "UBS Group AG",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BIZD": {
        "short_name": "VanEck Vectors BDC Income ETF",
        "long_name": "VanEck Vectors BDC Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Business Development Companies Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of BDCs. BDCs are vehicles whose principal business is to invest in, lend capital to or provide services to privately-held companies or thinly traded U.S. public companies.",
        "category": "Financial",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DFNL": {
        "short_name": "Davis Select Financial ETF",
        "long_name": "Davis Select Financial ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term growth of capital.\n The fund&#39;s investment adviser, uses the Davis Investment Discipline to invest, under normal market conditions, at least 80% of its net assets plus any borrowings for investment purposes in securities issued by companies principally engaged in the financial services sector. The fund&#39;s portfolio generally contains between 15 and 35 companies. It invests, principally, in common stocks. The fund may invest in large, medium or small companies without regard to market capitalization and may invest in issuers in foreign countries, including countries with developed or emerging markets. It is non-diversified.",
        "category": "Financial",
        "family": "Davis ETFs",
        "exchange": "NMS",
        "market": "us_market"
    },
    "EUFN": {
        "short_name": "iShares MSCI Europe Financials ",
        "long_name": "iShares MSCI Europe Financials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Europe Financials Index composed of developed market European equities in the financials sector.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the combined equity market performance of the financials sector of developed market countries in Europe.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "FNCL": {
        "short_name": "Fidelity MSCI Financials Index ",
        "long_name": "Fidelity MSCI Financials Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Financials 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Financials 25/50 Index, which represents the performance of the financial sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Financials 25/50 Index. The fund is non-diversified.",
        "category": "Financial",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FTXO": {
        "short_name": "First Trust Nasdaq Bank ETF",
        "long_name": "First Trust Nasdaq Bank ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq US Smart Banks Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depository receipts that comprise the underlying index. The index is designed to provide exposure to U.S. companies comprising the banking sector that have been selected based upon their liquidity and weighted based upon their cumulative score on three investing factors: volatility, value and growth. The fund is non-diversified.",
        "category": "Financial",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FXO": {
        "short_name": "First Trust Financials AlphaDEX",
        "long_name": "First Trust Financials AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the StrataQuantÂ® Financials Index.\n The fund will invest at least 90% of its net assets (including investment borrowings) in the common stocks and real estate investment trusts that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000Â® Index in the financial services sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Financial",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IAI": {
        "short_name": "iShares U.S. Broker-Dealers & S",
        "long_name": "iShares U.S. Broker-Dealers & Securities Exchanges ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Investment Services Index composed of U.S. equities in the investment services sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the investment services sector of the U.S. equity market. The fund may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IAK": {
        "short_name": "iShares U.S. Insurance ETF",
        "long_name": "iShares U.S. Insurance ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Insurance Index composed of U.S. equities in the insurance sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the insurance sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IAT": {
        "short_name": "iShares U.S. Regional Banks ETF",
        "long_name": "iShares U.S. Regional Banks ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Regional Banks Index.\n The fund generally invests at least 90% of its assets in securities of the index and in depositary receipts representing securities of the index. The underlying index measures the performance of the regional bank sector of the U.S. equity market and is a subset of the Dow Jones U.S. Bank Index. The fund is non-diversified.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IXG": {
        "short_name": "iShares Global Financial ETF",
        "long_name": "iShares Global Financials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P Global 1200 Financials IndexTM.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index. The index measures the performance of companies that the index provider deems to be part of the financial sector of the economy and that the index provider believes are important to global markets.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IYF": {
        "short_name": "iShares U.S. Financial ETF",
        "long_name": "iShares U.S. Financials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Financials Capped Index composed of U.S. equities in the financial sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of U.S. companies in the financial sector.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IYG": {
        "short_name": "iShares U.S. Financial Services",
        "long_name": "iShares U.S. Financial Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Financial Services Index composed of U.S. equities in the financial services sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the financial services sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Financial",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "KBE": {
        "short_name": "SPDR S&P Bank ETF",
        "long_name": "SPDR S&P Bank ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Banks Select Industry Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index tracks the performance of publicly traded national money centers and leading regional banks. It may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments, such as repurchase agreements and money market funds.",
        "category": "Financial",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "KBWB": {
        "short_name": "Invesco KBW Bank ETF",
        "long_name": "Invesco KBW Bank ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the KBW Nasdaq Bank Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is a modified-market capitalization-weighted index of companies primarily engaged in U.S. banking activities, as determined by the index provider. The underlying index is designed to track the performance of large national U.S. money centers, regional banks, and thrift institutions that are publicly traded in the U.S. The fund is non-diversified.",
        "category": "Financial",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "KBWD": {
        "short_name": "Invesco KBW High Dividend Yield",
        "long_name": "Invesco KBW High Dividend Yield Financial ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the KBW Nasdaq Financial Sector Dividend Yield Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is a modified-dividend yield-weighted index of companies principally engaged in the business of providing financial services and products, as determined by the index provider. The underlying index is designed to track the performance of financial companies with competitive dividend yields that are publicly-traded in the U.S.",
        "category": "Financial",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "KCE": {
        "short_name": "SPDR S&P Capital Markets ETF",
        "long_name": "SPDR S&P Capital Markets ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Capital Markets Select Industry Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the capital markets segment of the S&P Total Market Index (\"S&P TMI\") and tracks the performance of publicly traded companies that do business as broker-dealers, asset managers, trust and custody banks or exchanges.",
        "category": "Financial",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "KRE": {
        "short_name": "SPDR S&P Regional Banking ETF",
        "long_name": "SPDR S&P Regional Banking ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the regional banking segment of the U.S. banking industry.\n In seeking to track the performance of the S&P Regional Banks Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the regional banks segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Financial",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PFI": {
        "short_name": "Invesco DWA Financial Momentum ",
        "long_name": "Invesco DWA Financial Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Financials Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of at least 30 securities of companies in the financials sector that have powerful relative strength or \"momentum\" characteristics.",
        "category": "Financial",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "QABA": {
        "short_name": "First Trust NASDAQ ABA Communit",
        "long_name": "First Trust NASDAQ ABA Community Bank Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ OMXÂ® ABA Community Bank IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to track the performance of small, mid and large capitalization companies that comprise the community banking industry.",
        "category": "Financial",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market"
    },
    "VFH": {
        "short_name": "Vanguard Financials ETF",
        "long_name": "Vanguard Financials Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index (IMI)/Financials 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the financials sector, as classified under the Global Industry Classification Standard (GICS). The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
        "category": "Financial",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "XLF": {
        "short_name": "SPDR Select Sector Fund - Finan",
        "long_name": "Financial Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Financial Select Sector Index.\n The fund generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: diversified financial services; insurance; banks; capital markets; mortgage real estate investment trusts (\"REITs\"); consumer finance; and thrifts and mortgage finance. The fund is non-diversified.",
        "category": "Financial",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    }
}