{
    "DNL": {
        "short_name": "WisdomTree Global ex-US Quality",
        "long_name": "WisdomTree Global ex-U.S. Quality Dividend Growth Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Global ex-U.S. Quality Dividend Growth Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that consists of dividend-paying global ex-U.S. common stocks with growth characteristics. The fund is non-diversified.",
        "category": "Foreign Large Growth",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EFAD": {
        "short_name": "ProShares Trust ProShares MSCI ",
        "long_name": "ProShares MSCI EAFE Dividend Growers ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the MSCI EAFE Dividend Masters Index (the \"index\").\n The index, constructed and maintained by MSCI, targets companies that are currently members of the MSCI EAFE Index (\"MSCI EAFE\") and have increased dividend payments each year for at least 10 years. The index contains a minimum of 40 stocks, which are equally weighted. Under normal circumstances, the fund will invest at least 80% of its total assets in component securities.",
        "category": "Foreign Large Growth",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "EFG": {
        "short_name": "iShares MSCI EAFE Growth ETF",
        "long_name": "iShares MSCI EAFE Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE Growth Index composed of developed market equities, excluding the U.S. and Canada, that exhibit growth characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The index is a subset of the MSCI EAFE Index. Constituents of the underlying index include securities of companies located in Europe, Australasia and the Far East.",
        "category": "Foreign Large Growth",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FDNI": {
        "short_name": "First Trust Dow Jones Internati",
        "long_name": "First Trust Dow Jones International Internet ETF",
        "currency": "USD",
        "summary": "The investment seeks the results that correspond generally to the price and yield (before the fundâ\u0080\u0099s fees and expenses) of an equity index called the Dow Jones International Internet Index (the â\u0080\u009cindexâ\u0080\u009d).\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is developed, maintained and sponsored by S&P Dow Jones Indices LLC and is designed to measure the performance of securities of non-U.S. issuers whose primary business focus is Internet-related. The fund is non-diversified.",
        "category": "Foreign Large Growth",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market"
    },
    "FPXI": {
        "short_name": "First Trust International Equit",
        "long_name": "First Trust International Equity Opportunities ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the IPOX International Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is a market-cap weighted portfolio measuring the performance of the top 50 companies domiciled outside the United States ranked quarterly by market capitalization in the IPOX Global Composite Index and represents, on average, 25% of the total market capitalization of the base index. The fund is non-diversified.",
        "category": "Foreign Large Growth",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "IDHQ": {
        "short_name": "Invesco S&P International Devel",
        "long_name": "Invesco S&P International Developed Quality ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P Quality Developed ex-U.S. LargeMidCap Index (the \"underlying index\").\n The fund will invest at least 90% of its total assets in securities that comprise the underlying index. The index provider compiles, maintains and calculates the underlying index, which is constructed from constituents of the S&P Developed ex-U.S. LargeMidCap Index that the index provider identifies as being of the highest quality-that is, stocks of companies that seek to generate higher revenue and cash flow than their counterparts through prudent use of assets and finances.",
        "category": "Foreign Large Growth",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IDMO": {
        "short_name": "Invesco S&P International Devel",
        "long_name": "Invesco S&P International Developed Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P Momentum Developed ex-U.S. & South Korea LargeMidCap (the \"underlying index\").\n The fund will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is composed of constituents of the S&P Developed ex-U.S. & South Korea LargeMidCap Index that have the highest \"momentum score.\"",
        "category": "Foreign Large Growth",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IHDG": {
        "short_name": "WisdomTree International Hedged",
        "long_name": "WisdomTree International Hedged Quality Dividend Growth Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance of the WisdomTree International Hedged Quality Dividend Growth Index.\n The fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks with growth characteristics of companies in the industrialized world, excluding Canada and the U.S., while at the same time neutralizing exposure to fluctuations of the value of foreign currencies relative to the USD. It is non-diversified.",
        "category": "Foreign Large Growth",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IMOM": {
        "short_name": "Alpha Architect International Q",
        "long_name": "Alpha Architect International Quantitative Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Alpha Architect International Quantitative Momentum Index.\n The fund will normally invest at least 80% of its total assets in the component securities of the Alpha Architect International Quantitative Momentum Index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index uses a 5-step, quantitative, rules-based methodology to identify a portfolio of approximately 40-50 non-U.S. equity securities or their depositary receipts with positive momentum.",
        "category": "Foreign Large Growth",
        "family": "Alpha Architect",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IQDG": {
        "short_name": "WisdomTree International Qualit",
        "long_name": "WisdomTree International Quality Dividend Growth Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International Quality Dividend Growth Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index consists of dividend-paying common stocks with growth characteristics of companies in the industrialized world, excluding Canada and the United States. The fund is non-diversified.",
        "category": "Foreign Large Growth",
        "family": "WisdomTree",
        "exchange": "BTS",
        "market": "us_market"
    },
    "PIZ": {
        "short_name": "Invesco DWA Developed Markets M",
        "long_name": "Invesco DWA Developed Markets Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Developed Markets Technical Leaders Index (the \"underlying index\").\n The fund will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is comprised of equity securities of large capitalization companies based in countries with developed economies, excluding the United States.",
        "category": "Foreign Large Growth",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "TTAI": {
        "short_name": "TrimTabs International Free Cas",
        "long_name": "TrimTabs International Free Cash Flow Quality ETF",
        "currency": "USD",
        "summary": "The investment seeks to generate long-term returns in excess of the total return of the S&P Developed ex-U.S. BMIÂ® Index, with similar volatility to that index.\n Under normal market circumstances, approximately 150 of the highest ranked securities are selected by the Systematic Models and reweighted to create a modified market capitalization, log weighted portfolio, which allows for increased exposure to companies with the strongest proprietary free cash flow rankings while enhancing issuer diversification, as compared to a market capitalization weighted portfolio.",
        "category": "Foreign Large Growth",
        "family": "TrimTabs",
        "exchange": "BTS",
        "market": "us_market"
    },
    "VIGI": {
        "short_name": "Vanguard International Dividend",
        "long_name": "Vanguard International Dividend Appreciation Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of Nasdaq International Dividend Achievers Select Index that measures the investment return of non-U.S. companies that have a history of increasing dividends.\n The index focuses on high-quality companies located in developed and emerging markets, excluding the U.S., that have both the ability and the commitment to grow their dividends over time. The manager attempts to replicate the target index by investing all, or substantially all, of its assets in the broadly diversified collection of securities that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Foreign Large Growth",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market"
    }
}