{"AADR": {"short_name": "AdvisorShares Dorsey Wright", "long_name": "AdvisorShares Dorsey Wright ADR ETF", "currency": "USD", "summary": "The investment seeks long-term capital appreciation above international benchmarks such as the MSCI EAFE Index.\n The fund seeks to achieve the fund&#39;s investment objective by selecting primarily a portfolio of U.S.-traded securities of non-U.S. organizations, most often American Depositary Receipts (\"ADRs\"). It will invest at least 80% of its total assets in ADRs and in securities that have economic characteristics similar to ADRs.", "category": "Foreign Large Growth", "family": "AdvisorShares", "exchange": "PCX", "market": "us_market"}, "DNL": {"short_name": "WisdomTree Global ex-US Quality", "long_name": "WisdomTree Global ex-U.S. Quality Dividend Growth Fund", "currency": "USD", "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Global ex-U.S. Quality Dividend Growth Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that consists of dividend-paying global ex-U.S. common stocks with growth characteristics. The fund is non-diversified.", "category": "Foreign Large Growth", "family": "WisdomTree", "exchange": "PCX", "market": "us_market"}, "EFAD": {"short_name": "ProShares Trust ProShares MSCI ", "long_name": "ProShares MSCI EAFE Dividend Growers ETF", "currency": "USD", "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the MSCI EAFE Dividend Masters Index (the \"index\").\n The index, constructed and maintained by MSCI, targets companies that are currently members of the MSCI EAFE Index (\"MSCI EAFE\") and have increased dividend payments each year for at least 10 years. The index contains a minimum of 40 stocks, which are equally weighted. Under normal circumstances, the fund will invest at least 80% of its total assets in component securities.", "category": "Foreign Large Growth", "family": "ProShares", "exchange": "BTS", "market": "us_market"}, "EFG": {"short_name": "iShares MSCI EAFE Growth ETF", "long_name": "iShares MSCI EAFE Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the MSCI EAFE Growth Index composed of developed market equities, excluding the U.S. and Canada, that exhibit growth characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The index is a subset of the MSCI EAFE Index. Constituents of the underlying index include securities of companies located in Europe, Australasia and the Far East.", "category": "Foreign Large Growth", "family": "iShares", "exchange": "BTS", "market": "us_market"}, "FDNI": {"short_name": "First Trust Dow Jones Internati", "long_name": "First Trust Dow Jones International Internet ETF", "currency": "USD", "summary": "The investment seeks the results that correspond generally to the price and yield (before the fundâ\u0080\u0099s fees and expenses) of an equity index called the Dow Jones International Internet Index (the â\u0080\u009cindexâ\u0080\u009d).\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is developed, maintained and sponsored by S&P Dow Jones Indices LLC and is designed to measure the performance of securities of non-U.S. issuers whose primary business focus is Internet-related. The fund is non-diversified.", "category": "Foreign Large Growth", "family": "First Trust", "exchange": "NGM", "market": "us_market"}, "FPXI": {"short_name": "First Trust International Equit", "long_name": "First Trust International Equity Opportunities ETF", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the IPOX International Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is a market-cap weighted portfolio measuring the performance of the top 50 companies domiciled outside the United States ranked quarterly by market capitalization in the IPOX Global Composite Index and represents, on average, 25% of the total market capitalization of the base index. The fund is non-diversified.", "category": "Foreign Large Growth", "family": "First Trust", "exchange": "NGM", "market": "us_market"}}