{
    "CID": {
        "short_name": "VictoryShares International Hig",
        "long_name": "VictoryShares International High Div Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory International High Dividend 100 Volatility Weighted Index.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory International High Dividend 100 Volatility Weighted Index, an unmanaged, volatility weighted index maintained exclusively by the index provider. The index identifies the 100 highest dividend yielding stocks in the Nasdaq Victory International 500 Volatility Weighted Index.",
        "category": "Foreign Large Value",
        "family": "Victory Capital",
        "exchange": "NMS",
        "market": "us_market"
    },
    "DDWM": {
        "short_name": "WisdomTree Dynamic Currency Hed",
        "long_name": "WisdomTree Dynamic Currency Hedged International Equity Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the WisdomTree Dynamic Currency Hedged International Equity Index.\n The fund will invest at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to equity securities in the industrialized world, excluding Canada and the United States, while at the same time dynamically hedging currency exposure to fluctuations between the value of the applicable foreign currencies and the USD. The fund is non-diversified.",
        "category": "Foreign Large Value",
        "family": "WisdomTree",
        "exchange": "BTS",
        "market": "us_market"
    },
    "DMDV": {
        "short_name": "AAM S&P Developed Markets High ",
        "long_name": "AAM S&P Developed Markets High Dividend Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the S&P Developed Ex-U.S. Dividend and Free Cash Flow Yield Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of any collateral held from securities lending) will be invested in the component securities of the index and depositary receipts representing index components. The index is designed to provide exposure to the constituents of the S&P Developed BMI Ex-U.S. & Korea LargeMidcap Index that exhibit both high dividend yield and sustainable dividend distribution characteristics, while maintaining diversified sector exposure.",
        "category": "Foreign Large Value",
        "family": "AAM",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DOL": {
        "short_name": "WisdomTree International LargeC",
        "long_name": "WisdomTree International LargeCap Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International LargeCap Dividend Index.\n The fund normally invests at least 95% of its total assets (exclusive of collateral held from securities lending) in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the large-capitalization segment of the dividend-paying market in the industrialized world outside the U.S. and Canada. The fund is non-diversified.",
        "category": "Foreign Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DOO": {
        "short_name": "WisdomTree International Divide",
        "long_name": "WisdomTree International Dividend ex-Financials Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International Dividend ex-Financials Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of high dividend-yielding international common stocks outside the financial sector. The fund is non-diversified.",
        "category": "Foreign Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DTH": {
        "short_name": "WisdomTree International High D",
        "long_name": "WisdomTree International High Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International High Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of companies with high dividend yields selected from the WisdomTree International Equity Index. The fund is non-diversified.",
        "category": "Foreign Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DWM": {
        "short_name": "WisdomTree International Equity",
        "long_name": "WisdomTree International Equity Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree International Equity Index.\n At least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of companies in the industrialized world, excluding Canada and the United States, that pay regular cash dividends. It is non-diversified.",
        "category": "Foreign Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DWX": {
        "short_name": "SPDR S&P International Dividend",
        "long_name": "SPDR S&P International Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P International Dividend OpportunitiesÂ® Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of 100 high-yielding international common stocks.",
        "category": "Foreign Large Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EFAS": {
        "short_name": "Global X MSCI SuperDividend EAF",
        "long_name": "Global X MSCI SuperDividend EAFE ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI EAFE Top 50 Dividend Index (\"underlying index\").\n The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index tracks the performance of 50 equally-weighted companies that rank among the highest dividend yielding equity securities in Europe, Australasia and the Far East, as defined by MSCI, the provider of the underlying index (\"index provider\").",
        "category": "Foreign Large Value",
        "family": "Global X Funds",
        "exchange": "NMS",
        "market": "us_market"
    },
    "EFV": {
        "short_name": "iShares MSCI EAFE Value ETF",
        "long_name": "iShares MSCI EAFE Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE Value Index composed of developed market equities, excluding the U.S. and Canada, that exhibit value characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index is a subset of the MSCI EAFE Index. Constituents of the underlying index include securities from Europe, Australasia and the Far East.",
        "category": "Foreign Large Value",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FGD": {
        "short_name": "First Trust DJ Global Select Di",
        "long_name": "First Trust Dow Jones Global Select Dividend Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Dow Jones Global Select Dividend IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is an indicated annual dividend yield weighted index of 100 stocks selected from the developed-market portion of the Dow Jones World IndexSM.",
        "category": "Foreign Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FID": {
        "short_name": "First Trust S&P International D",
        "long_name": "First Trust S&P International Dividend Aristocrats ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the S&P International Dividend Aristocrats Index.\n Under normal conditions, the fund will invest at least 90% of its net assets (including investment borrowings) in the equity securities that comprise the index. The index measures the performance of high dividend yielding companies that have followed a managed-dividends policy of increasing or maintaining dividends for at least ten consecutive years.",
        "category": "Foreign Large Value",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FIDI": {
        "short_name": "Fidelity International High Div",
        "long_name": "Fidelity International High Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the Fidelity Â® International High Dividend Index.\n The fund normally invests at least 80% of assets in securities included in the Fidelity Â® International High Dividend Index and in depository receipts representing securities included in the index. The index is designed to reflect the performance of stocks of large- and mid-capitalization developed international high dividend-paying companies that are expected to continue to pay and grow their dividends.",
        "category": "Foreign Large Value",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FIVA": {
        "short_name": "Fidelity International Value Fa",
        "long_name": "Fidelity International Value Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the Fidelity Â® International Value Factor Index.\n The fund normally invests at least 80% of assets in securities included in the Fidelity Â® International Value Factor Index and in depository receipts representing securities included in the index. The index is designed to reflect the performance of stocks of large- and mid-capitalization developed international companies that have attractive valuations.",
        "category": "Foreign Large Value",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FNDF": {
        "short_name": "Schwab Fundamental Internationa",
        "long_name": "Schwab Fundamental International Large Company Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Russell RAFIâ\u0084¢ Developed ex US Large Company Index.\n The fund will invest at least 90% of its net assets in stocks included in the index, including depositary receipts representing securities of the index; which may be in the form of American Depositary Receipts, Global Depositary Receipts and European Depositary Receipts. The index measures the performance of the large company size segment by fundamental overall company scores, which are created using as the universe the developed ex U.S. companies in the FTSE Global Total Cap Index (the parent index).",
        "category": "Foreign Large Value",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ICOW": {
        "short_name": "Pacer Developed Markets Interna",
        "long_name": "Pacer Developed Markets International Cash Cows 100 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer Developed Markets International Cash Cows 100 Index.\n The fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index uses an objective, rules-based methodology to provide exposure to large and mid-capitalization non-U.S. companies in developed markets with high free cash flow yields.",
        "category": "Foreign Large Value",
        "family": "Pacer",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IDOG": {
        "short_name": "ALPS International Sector Divid",
        "long_name": "ALPS International Sector Dividend Dogs ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that replicate as closely as possible, before fees and expenses, the performance of the S-NetworkÂ® International Sector Dividend Dogs Index.\n The fund seeks investment results that replicate as closely as possible, before fees and expenses, the performance of the underlying index. The underlying index is a rules-based index intended to give investors a means of tracking the overall performance of the highest dividend paying stocks (i.e. \"Dividend Dogs\") in the S-Network Developed Markets (ex NA) Index.",
        "category": "Foreign Large Value",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IDV": {
        "short_name": "iShares International Select Di",
        "long_name": "iShares International Select Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones EPAC Select Dividend Index composed of relatively high dividend paying equities in non-U.S. developed markets.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index measures the performance of high dividend-paying companies in the EPAC (Europe, the Pacific, Asia and Canada) region.",
        "category": "Foreign Large Value",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IVLU": {
        "short_name": "iShares MSCI Intl Value Factor ",
        "long_name": "iShares Edge MSCI Intl Value Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI World ex USA Enhanced Value Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents as well as in securities not included in the underlying index. The index is based on a traditional market capitalization-weighted parent index, the MSCI World ex USA Index.",
        "category": "Foreign Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "LVHI": {
        "short_name": "Legg Mason International Low Vo",
        "long_name": "Legg Mason International Low Volatility High Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the QS International Low Volatility High Dividend Hedged Index.\n The fund will invest at least 80% of its net assets, plus borrowings for investment purposes, if any, in securities that compose its underlying index. The underlying index seeks to provide more stable income through investments in stocks of profitable companies in developed markets outside of the United States with relatively high dividend yields or anticipated dividend yields and lower price and earnings volatility, while mitigating exposure to exchange-rate fluctuations between the USD and other international currencies.",
        "category": "Foreign Large Value",
        "family": "Franklin Templeton Investments",
        "exchange": "BTS",
        "market": "us_market"
    },
    "PID": {
        "short_name": "Invesco International Dividend ",
        "long_name": "Invesco International Dividend Achievers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ International Dividend AchieversTM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of Global Depositary Receipts (â\u0080\u009cGDRsâ\u0080\u009d) that are listed on the London Stock Exchange (â\u0080\u009cLSEâ\u0080\u009d) or the London International Exchange, and American Depositary Receipts (â\u0080\u009cADRsâ\u0080\u009d) and non-U.S. common or ordinary stocks, limited partnership interests and shares of limited liability companies that are listed on the NYSE.",
        "category": "Foreign Large Value",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "UIVM": {
        "short_name": "VictoryShares USAA MSCI Interna",
        "long_name": "VictoryShares USAA MSCI International Value Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the MSCI World ex USA Select Value Momentum Blend Index.\n The fund invests at least 80% of its assets in securities in the index, depositary receipts on securities in the index and securities underlying depositary receipts in the index. The index delivers exposure to equity market performance in non-U.S. developed markets and provides higher exposure to value and momentum factors within the MSCI World ex USA Index while also maintaining moderate index turnover and lower realized volatility than traditional capitalization weighted indexes.",
        "category": "Foreign Large Value",
        "family": "Victory Capital",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VYMI": {
        "short_name": "Vanguard International High Div",
        "long_name": "Vanguard International High Dividend Yield Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of FTSE All-World ex US High Dividend Yield Index that measures the investment return of non-U.S. companies that are characterized by high dividend yield.\n The fund invests by sampling the index, meaning that it holds a broadly diversified collection of securities that, in the aggregate, approximates the full index in terms of key characteristics. The index focuses on companies located in developed and emerging markets, excluding the United States, that are forecasted to have above-average dividend yields.",
        "category": "Foreign Large Value",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market"
    }
}