{
    "ERSX": {
        "short_name": "ERShares NextGen Entrepreneurs ",
        "long_name": "ERShares NextGen Entrepreneurs ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n Under normal market conditions, the fund invests primarily in companies domiciled or headquartered outside of the U.S., or whose primary business activities or principal trading markets are located outside of the U.S. It invests primarily in equity securities of small- and mid-capitalization companies traded on major global exchanges. Equity securities include common stocks, preferred stocks, convertible preferred stocks, American Depositary Receipts (ADRs) and Global Depositary Receipts (GDRs). The fund is non-diversified.",
        "category": "Foreign Small/Mid Blend",
        "family": "EntrepreneurShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FNDC": {
        "short_name": "Schwab Fundamental Internationa",
        "long_name": "Schwab Fundamental International Small Company Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Russell RAFIâ\u0084¢ Developed ex US Small Company Index.\n The fund will invest at least 90% of its net assets in stocks included in the index. The index measures the performance of the small company size segment by fundamental overall company scores, which are created using as the universe the developed ex U.S. companies in the FTSE Global Total Cap Index (the parent index).",
        "category": "Foreign Small/Mid Blend",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "GWX": {
        "short_name": "SPDR S&P International SmallCap",
        "long_name": "SPDR S&P International Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Developed Ex-U.S. under USD2 Billion Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded small-cap companies, as defined by the index, domiciled in developed countries outside the United States.",
        "category": "Foreign Small/Mid Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HSCZ": {
        "short_name": "iShares Currency Hedged MSCI EA",
        "long_name": "iShares Currency Hedged MSCI EAFE Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE Small Cap 100% Hedged to USD Index composed of small capitalization developed market equities, excluding the U.S. and Canada, while mitigating exposure to fluctuations between the value of the component currencies and the U.S. dollar.\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index.",
        "category": "Foreign Small/Mid Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ISCF": {
        "short_name": "iShares MSCI Intl Small-Cap Mul",
        "long_name": "iShares MSCI Intl Small-Cap Multifactor ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI World ex USA Small Cap Diversified Multiple-Factor Index.\n The fund generally will invest at least 80% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is designed to select equity securities from the MSCI World ex USA Small Cap Index that have high exposure to four investment style factors: value, quality, momentum and low size, while maintaining a level of risk similar to that of the parent index.",
        "category": "Foreign Small/Mid Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SCHC": {
        "short_name": "Schwab International Small-Cap ",
        "long_name": "Schwab International Small-Cap Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the FTSE Developed Small Cap ex US Liquid Index.\n The index is comprised of small capitalization companies in developed countries outside the United States. The fund will invest at least 90% of its net assets in stocks, including depositary receipts representing securities of the index; such depositary receipts may be in the form of American Depositary Receipts, Global Depositary Receipts and European Depositary Receipts.",
        "category": "Foreign Small/Mid Blend",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SCZ": {
        "short_name": "iShares MSCI EAFE Small-Cap ETF",
        "long_name": "iShares MSCI EAFE Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE Small Cap Index composed of small-capitalization developed market equities, excluding the U.S. and Canada.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index represents the small-capitalization segment of the MSCI EAFE IMI Index.",
        "category": "Foreign Small/Mid Blend",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "VSS": {
        "short_name": "Vanguard FTSE All-Wld ex-US SmC",
        "long_name": "Vanguard FTSE All-World ex-US Small-Cap Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of stocks of international small-cap companies.\n The fund employs an indexing investment approach designed to track the performance of the FTSE Global Small Cap ex US Index. The advisor attempts to sample the target index by investing all, or substantially all, of its assets in common stocks in the index and by holding a representative sample of securities that resembles the full index in terms of key risk factors and other characteristics.",
        "category": "Foreign Small/Mid Blend",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    }
}