{
    "ACSG": {
        "short_name": "Xtrackers MSCI ACWI ex USA ESG ",
        "long_name": "Xtrackers MSCI ACWI ex USA ESG Leaders Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI ACWI ex USA ESG Leaders Index.\n The index is constructed using regional indexes that provide exposure to large- and medium-capitalization companies from developed and emerging markets countries (excluding the United States). The fund will normally invest at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in equity securities from countries other than the United States. The fund is non-diversified.",
        "category": "Foreign Large Blend",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ACWX": {
        "short_name": "iShares MSCI ACWI ex US Index F",
        "long_name": "iShares MSCI ACWI ex U.S. ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI ex USA Index composed of large- and mid-capitalization non-U.S. equities.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the combined equity market performance of developed and emerging markets countries, excluding the United States.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "BBIN": {
        "short_name": "JPMorgan BetaBuilders Internati",
        "long_name": "JPMorgan BetaBuilders International Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the MorningstarÂ® Developed Markets ex-North America Target Market Exposure IndexSM.\n The fund will invest at least 80% of its assets in securities included in the underlying index.\" The underlying index is a free float adjusted market capitalization weighted index which consists of equity securities from developed countries or regions.",
        "category": "Foreign Large Blend",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market"
    },
    "CIL": {
        "short_name": "VictoryShares International Vol",
        "long_name": "VictoryShares International Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory International 500 Volatility Weighted Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory International 500 Volatility Weighted Index, an unmanaged, volatility weighted index maintained exclusively by the index provider. The index identifies the 500 largest foreign companies by market capitalization measured at the time the index&#39;s constituent securities are determined.",
        "category": "Foreign Large Blend",
        "family": "Victory Capital",
        "exchange": "NMS",
        "market": "us_market"
    },
    "CIZ": {
        "short_name": "VictoryShares Developed Enhance",
        "long_name": "VictoryShares Developed Enhanced Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Nasdaq Victory International 500 Long/Cash Volatility Weighted Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory International 500 Long/Cash Volatility Weighted Index, an unmanaged, volatility weighted index maintained exclusively by the index provider. The index identifies the 500 largest foreign companies by market capitalization measured at the time the index&#39;s constituent securities are determined.",
        "category": "Foreign Large Blend",
        "family": "Victory Capital",
        "exchange": "NMS",
        "market": "us_market"
    },
    "CWI": {
        "short_name": "SPDR MSCI ACWI ex-US ETF",
        "long_name": "SPDR MSCI ACWI ex-US ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the MSCI All Country World Index ex USA Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a free float-adjusted market capitalization index that is designed to measure the combined equity market performance of large- and mid-cap securities in developed and emerging market countries excluding the United States.",
        "category": "Foreign Large Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DBAW": {
        "short_name": "Xtrackers MSCI All World ex US ",
        "long_name": "Xtrackers MSCI All World ex U.S. Hedged Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, of the MSCI ACWI ex USA US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, of the underlying index, which is designed to track the performance of equity securities in developed and emerging stock markets while mitigating exposure to fluctuations between the value of the USD and the currencies of the countries included in the underlying index. It will invest at least 80% of its total assets in component securities of the underlying index.",
        "category": "Foreign Large Blend",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DBEF": {
        "short_name": "Xtrackers MSCI EAFE Hedged Equi",
        "long_name": "Xtrackers MSCI EAFE Hedged Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI EAFE US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, before fees and expenses, of the underlying index, which is designed to track developed market performance while mitigating exposure to fluctuations between the value of the U.S. dollar and the currencies of the countries included in the underlying index. It will invest at least 80% of its total assets in component securities of the underlying index.",
        "category": "Foreign Large Blend",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DFAI": {
        "short_name": "Dimensional International Core ",
        "long_name": "Dimensional International Core Equity Market ETF",
        "currency": "USD",
        "summary": "The investment seeks to achieve long-term capital appreciation.\n The fund will invest in companies of all sizes, with increased exposure to smaller capitalization, lower relative price, and higher profitability companies as compared to their representation in the International Universe. As a non-fundamental policy, under normal circumstances, it will invest at least 80% of its net assets in equity securities. The Advisor may also increase or reduce the fund&#39;s exposure to an eligible company, or exclude a company, based on shorter-term considerations, such as a company&#39;s price momentum and investment characteristics.",
        "category": "Foreign Large Blend",
        "family": "Dimensional Fund Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DINT": {
        "short_name": "Davis Select International ETF",
        "long_name": "Davis Select International ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term growth of capital.\n The fund&#39;s investment adviser uses the Davis Investment Discipline to invest the fund&#39;s portfolio principally in common stocks (including indirect holdings of common stock through depositary receipts) issued by foreign companies, including countries with developed or emerging markets. The fund may invest in large, medium or small companies without regard to market capitalization.",
        "category": "Foreign Large Blend",
        "family": "Davis ETFs",
        "exchange": "NMS",
        "market": "us_market"
    },
    "DMRI": {
        "short_name": "DeltaShares S&P International M",
        "long_name": "DeltaShares S&P International Managed Risk ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results, before fees and expenses, of the S&P EPAC Ex. Korea LargeMidCap Managed Risk 2.0 Index.\n Under normal market conditions, the fund invests a substantial portion, but at least 80%, of its assets, exclusive of collateral held from securities lending, in securities comprising the underlying index. The underlying index seeks to achieve these objectives by allocating weightings among the S&P EPAC Ex. Korea LargeMidCap Index, the S&P U.S. Treasury Bond Current 5-Year Index and the S&P U.S. Treasury Bill 0-3 Month Index. The fund is non-diversified.",
        "category": "Foreign Large Blend",
        "family": "DeltaShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "DMXF": {
        "short_name": "iShares ESG Advanced MSCI EAFE ",
        "long_name": "iShares ESG Advanced MSCI EAFE Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE Choice ESG Screened Index.\n The index is a free float-adjusted market capitalization-weighted index designed to reflect the equity performance of large- and mid-capitalization developed market companies, excluding the U.S. and Canada, with favorable ESG ratings while applying extensive screens, including removing fossil fuel exposure. The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index. It is non-diversified.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "DWCR": {
        "short_name": "Arrow DWA Tactical: Internation",
        "long_name": "Arrow DWA Country Rotation ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation by tracking the investment results of the Dorsey Wright Country and Stock Momentum Index.\n Under normal circumstances, substantially all of the fund&#39;s total assets is invested in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index selection methodology consists of long positions in the equity markets of foreign countries exhibiting relatively strong momentum characteristics among the foreign universe.",
        "category": "Foreign Large Blend",
        "family": "ArrowShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "EASG": {
        "short_name": "Xtrackers MSCI EAFE ESG Leaders",
        "long_name": "Xtrackers MSCI EAFE ESG Leaders Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI EAFE ESG Leaders Index.\n The index consists of large- and medium-capitalization companies across developed markets countries, excluding Canada and the United States. The fund will invest at least 80% of its total assets (but typically far more) in component securities (including depositary receipts in respect of such securities) of the index. The fund is non-diversified.",
        "category": "Foreign Large Blend",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EFA": {
        "short_name": "iShares MSCI EAFE ETF",
        "long_name": "iShares MSCI EAFE ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE Index composed of large- and mid-capitalization developed market equities, excluding the U.S. and Canada.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The index measures the equity market performance of developed markets outside of the U.S. and Canada. The underlying index may include large- or mid-capitalization companies.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EFAV": {
        "short_name": "iShares MSCI EAFE Min Vol Facto",
        "long_name": "iShares MSCI EAFE Min Vol Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks the investment results of the MSCI EAFE Minimum Volatility (USD) Index composed of developed market equities that, in the aggregate, have lower volatility characteristics relative to the broader developed equity markets, excluding the U.S. and Canada.\n The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index. The index measures the performance of international equity securities that in the aggregate have lower volatility relative to the MSCI EAFE Index.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "EFAX": {
        "short_name": "SPDR MSCI EAFE Fossil Fuel Rese",
        "long_name": "SPDR MSCI EAFE Fossil Fuel Free ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the MSCI EAFE ex Fossil Fuels Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is designed to measure the performance of companies in the MSCI EAFE Index that are \"fossil fuel reserves free,\" as determined by the screening methodology used by the index.",
        "category": "Foreign Large Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FDT": {
        "short_name": "First Trust Developed Markets E",
        "long_name": "First Trust Developed Markets Ex-US AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEXÂ® Developed Markets Ex-US Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Developed Markets Ex-US Index that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Foreign Large Blend",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FICS": {
        "short_name": "First Trust International Devel",
        "long_name": "First Trust International Developed Cap Strength ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield of an index called The International Developed Capital Strength IndexSM.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 90% of its net assets in the common stocks and REITs that comprise the index. The index seeks to provide exposure to well-capitalized companies in the developed markets outside of the U.S. with strong market positions that have the potential to provide their stockholders with a greater degree of stability and performance over time. The fund is non-diversified.",
        "category": "Foreign Large Blend",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FLQH": {
        "short_name": "Franklin LibertyQ International",
        "long_name": "Franklin LibertyQ International Equity Hedged ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the LibertyQ International Equity Hedged Index.\n The fund invests at least 80% of its assets in the component securities of the index and in depositary receipts representing such securities. The index is designed to have higher returns than an equivalent unhedged index when the component currencies are weakening relative to the U.S. dollar.",
        "category": "Foreign Large Blend",
        "family": "Franklin Templeton Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "GSID": {
        "short_name": "Goldman Sachs MarketBeta Intern",
        "long_name": "Goldman Sachs MarketBeta International Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, to the performance of the Solactive GBS Developed Markets ex North America Large & Mid Cap Index.\n The fund invests at least 80% of its assets in securities included in its underlying index, in depositary receipts representing securities included in its underlying index and in underlying stocks in respect of depositary receipts included in its underlying index. The index consists of equity securities of large and mid-capitalization issuers covering approximately the largest 85% of the free-float market capitalization in developed markets excluding North America.",
        "category": "Foreign Large Blend",
        "family": "Goldman Sachs",
        "exchange": "BTS",
        "market": "us_market"
    },
    "HAWX": {
        "short_name": "iShares Currency Hedged MSCI AC",
        "long_name": "iShares Currency Hedged MSCI ACWI ex U.S. ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI ex USA 100% Hedged to USD Index composed of large- and mid-capitalization developed and emerging equities, excluding the U.S., while mitigating exposure to fluctuations between the value of the component currencies and the U.S. dollar.\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IEFA": {
        "short_name": "iShares Core MSCI EAFE ETF",
        "long_name": "iShares Core MSCI EAFE ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI EAFE IMI Index composed of large-, mid- and small-capitalization developed market equities, excluding the U.S. and Canada.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure large-, mid- and small-capitalization equity market performance and includes stocks from Europe, Australasia and the Far East.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "INTF": {
        "short_name": "iShares MSCI Intl Multifactor E",
        "long_name": "iShares Edge MSCI Multifactor Intl ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI World ex USA Diversified Multiple-Factor Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to select equity securities from the MSCI World ex USA Index (the \"parent index\") that have high exposure to four investment style factors: value, quality, momentum and low size, while maintaining a level of risk similar to that of the parent index.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IQLT": {
        "short_name": "iShares MSCI Intl Quality Facto",
        "long_name": "iShares MSCI Intl Quality Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI World ex USA Sector Neutral Quality Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index measures the performance of international developed large- and mid-capitalization stocks exhibiting relatively higher quality characteristics as identified through three fundamental variables: return on equity, earnings variability and debt-to-equity.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IXUS": {
        "short_name": "iShares Core MSCI Total Interna",
        "long_name": "iShares Core MSCI Total International Stock ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI ex USA IMI composed of large-, mid- and small-capitalization non-U.S. equities.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization index designed to measure the combined equity market performance of developed and emerging markets countries, excluding the United States.",
        "category": "Foreign Large Blend",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "JHMD": {
        "short_name": "John Hancock Exchange-Traded Fu",
        "long_name": "John Hancock Multifactor Developed International ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the John Hancock Dimensional Developed International Index.\n The fund normally invests at least 80% of its net assets (plus any borrowings for investment purposes) in securities included in the fund&#39;s index, in depositary receipts representing securities included in the fund&#39;s index and in underlying stocks in respect of depositary receipts included in the fund&#39;s index. The index is designed to comprise a subset of securities associated with developed markets outside the U.S. and Canada.",
        "category": "Foreign Large Blend",
        "family": "John Hancock",
        "exchange": "PCX",
        "market": "us_market"
    },
    "QEFA": {
        "short_name": "SPDR MSCI EAFE StrategicFactors",
        "long_name": "SPDR MSCI EAFE StrategicFactors ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the MSCI EAFE Factor Mix A-Series Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index captures large- and mid-cap representation across 21 developed market Europe, Australasia, and Far East countries and aims to represent the performance of value, low volatility, and quality factor strategies.",
        "category": "Foreign Large Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "QINT": {
        "short_name": "American Century Quality Divers",
        "long_name": "American Century Quality Diversified International ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the Alpha Vee American Century Diversified International Equity Index (the \"index\").\n Under normal market conditions, the fund invests at least 80% of its assets, exclusive of collateral held from securities lending, in the component securities of the underlying index. The index is designed to select securities with attractive growth, valuation, and quality fundamentals. The universe of the index is comprised of large- and mid-capitalization equity securities of global issuers in developed and emerging markets, excluding the United States.",
        "category": "Foreign Large Blend",
        "family": "American Century Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SCHF": {
        "short_name": "Schwab International Equity ETF",
        "long_name": "Schwab International Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the FTSE Developed ex US Index.\n The index is comprised of large and mid capitalization companies in developed countries outside the United States, as defined by the index provider. The index defines the large and mid capitalization universe as approximately the top 90% of the eligible universe. The fund will invest at least 90% of its net assets in stocks, including depositary receipts representing securities of the index; such depositary receipts may be in the form of American Depositary Receipts, Global Depositary Receipts and European Depositary Receipts.",
        "category": "Foreign Large Blend",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SPDW": {
        "short_name": "SPDR Portfolio Developed World ",
        "long_name": "SPDR Portfolio Developed World ex-US ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Developed Ex-U.S. BMI Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a market capitalization weighted index designed to define and measure the investable universe of publicly traded companies domiciled in developed countries outside the United States.",
        "category": "Foreign Large Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VEA": {
        "short_name": "Vanguard FTSE Developed Markets",
        "long_name": "Vanguard FTSE Developed Markets Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the FTSE Developed All Cap ex US Index.\n The fund employs an indexing investment approach designed to track the performance of the FTSE Developed All Cap ex US Index, a market-capitalization-weighted index that is made up of approximately 3873 common stocks of large-, mid-, and small-cap companies located in Canada and the major markets of Europe and the Pacific region. The adviser attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Foreign Large Blend",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VEU": {
        "short_name": "Vanguard FTSE All World Ex US E",
        "long_name": "Vanguard FTSE All-World ex-US Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of stocks of companies located in developed and emerging markets outside of the United States.\n The fund employs an indexing investment approach designed to track the performance of the FTSE All-World ex US Index. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Foreign Large Blend",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VXUS": {
        "short_name": "Vanguard Total International St",
        "long_name": "Vanguard Total International Stock Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of stocks issued by companies located in developed and emerging markets, excluding the United States.\n The fund employs an indexing investment approach designed to track the performance of the FTSE Global All Cap ex US Index, a float-adjusted market-capitalization-weighted index designed to measure equity market performance of companies located in developed and emerging markets, excluding the United States. It invests all, or substantially all, of its assets in the common stocks included in its target index.",
        "category": "Foreign Large Blend",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market"
    }
}