{
    "AGNG": {
        "short_name": "Global X Aging Population ETF",
        "long_name": "Global X Aging Population ETF",
        "currency": "USD",
        "summary": "The investment seeks results that correspond generally to the price and yield performance, before fees and expenses, of the Indxx Global Longevity Thematic Index.\n The fund invests more than 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to exchange-listed companies in developed markets that facilitate the demographic trend of longer average life spans and the aging of the global population, including but not limited to companies involved in biotechnology, medical devices, pharmaceuticals, senior living facilities and specialized health care services.",
        "category": "Health",
        "family": "Global X Funds",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 40118864
    },
    "ARKG": {
        "short_name": "ARK Genomic Revolution ETF",
        "long_name": "ARK Genomic Revolution ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term growth of capital.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that will invest under normal circumstances primarily (at least 80% of its assets) in domestic and foreign equity securities of companies across multiple sectors, including healthcare, information technology, materials, energy and consumer discretionary, that are relevant to the fund&#39;s investment theme of the genomics revolution (\"Genomics Revolution Companies\"). It is non-diversified.",
        "category": "Health",
        "family": "ARK ETF Trust",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 9439142912
    },
    "BBC": {
        "short_name": "Virtus LifeSci Biotech Clinical",
        "long_name": "Virtus LifeSci Biotech Clinical Trials ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond, before fees and expenses, to the price and yield performance of the LifeSci Biotechnology Clinical Trials Index.\n Under normal market conditions, the fund will invest not less than 80% of its assets in component securities of the index. The index seeks to track the performance of the common stock of U.S. exchange-listed biotechnology companies with a primary product offering (\"lead drug\") that is typically in a Phase 1, Phase 2 or Phase 3 clinical trial stage of development, but prior to receiving marketing approval.",
        "category": "Health",
        "family": "Virtus",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 51677992
    },
    "BBH": {
        "short_name": "VanEck Vectors Biotech ETF",
        "long_name": "VanEck Vectors Biotech ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Listed Biotech 25 Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The Biotech Index includes common stocks and depositary receipts of U.S. exchange-listed companies in the biotechnology industry. Such companies may include medium-capitalization companies and foreign companies that are listed on a U.S. exchange. It is non-diversified.",
        "category": "Health",
        "family": "VanEck",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 494324384
    },
    "BBP": {
        "short_name": "Virtus LifeSci Biotech Products",
        "long_name": "Virtus LifeSci Biotech Products ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond, before fees and expenses, to the price and yield performance of the LifeSci Biotechnology Products Index.\n Under normal market conditions, the fund will invest not less than 80% of its assets in component securities of the index. The index seeks to track the performance of the common stock of U.S. exchange-listed biotechnology companies with at least one drug therapy approved by the U.S. Food and Drug Administration (\"FDA\") for marketing.",
        "category": "Health",
        "family": "Virtus",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 30143870
    },
    "BMED": {
        "short_name": "BlackRock Future Health ETF",
        "long_name": "BlackRock Future Health ETF",
        "currency": "USD",
        "summary": "The investment seeks to maximize total return.\n Under normal market conditions, the fund will invest at least 80% of its net assets plus any borrowings for investment purposes in equity securities of companies principally engaged in the health sciences group of industries. While the fund will invest primarily in companies providing products and services for human health, it may also invest in companies whose products or services relate to the growth or survival of animals and plants. The fund is non-diversified.",
        "category": "Health",
        "family": "BlackRock",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 7132001
    },
    "BTEC": {
        "short_name": "Principal Healthcare Innovators",
        "long_name": "Principal Healthcare Innovators Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before expenses, to the performance of the Nasdaq Healthcare Innovators Index (the \"index\").\n Under normal circumstances, the fund invests at least 80% of its net assets, plus any borrowings for investment purposes, in equity securities of companies that compose the index at the time of purchase. The index uses a quantitative model designed to identify equity securities in the Nasdaq US Benchmark Index that are small and medium capitalization U.S. healthcare companies.",
        "category": "Health",
        "family": "Principal Funds",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 164796192
    },
    "CNCR": {
        "short_name": "Loncar Cancer Immunotherapy ETF",
        "long_name": "Loncar Cancer Immunotherapy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Loncar Cancer Immunotherapy Index.\n The index is composed of the common stock of approximately 30 pharmaceutical or biotechnology companies identified by the fund&#39;s index provider, as having a high strategic focus on the development of drugs that harness the body&#39;s own immune system to fight cancer. The adviser attempts to invest all, or substantially all, of its assets in the component securities and ADRs that make up the index. Normally it will invest at least 80% of its total assets in the component securities of the index. The fund is non-diversified.",
        "category": "Health",
        "family": "Loncar Investments",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 47379028
    },
    "EDOC": {
        "short_name": "Global X Telemedicine & Digital",
        "long_name": "Global X Telemedicine & Digital Health ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Telemedicine & Digital Health Index.\n The index is designed to provide exposure to exchange-listed companies that are positioned to benefit from further advances in the field of telemedicine and digital health, as well as applications thereof (collectively, \"Telemedicine & Digital Health Companies\"), as defined by Solactive AG, the provider of the index. The Adviser uses a \"passive\" or indexing approach to try to achieve the fund&#39;s investment objective. The fund is non-diversified.",
        "category": "Health",
        "family": "Global X Funds",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 804916672
    },
    "FBT": {
        "short_name": "First Trust Amex Biotech Index ",
        "long_name": "First Trust NYSE Arca Biotechnology Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NYSE Arca Biotechnology IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is an equal-dollar weighted index designed to measure the performance of a cross section of small, mid and large capitalization companies in the biotechnology industry that are primarily involved in the use of biological processes to develop products or provide services.",
        "category": "Health",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1912551296
    },
    "FHLC": {
        "short_name": "Fidelity MSCI Health Care Index",
        "long_name": "Fidelity MSCI Health Care Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Health Care 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Health Care 25/50 Index, which represents the performance of the health care sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Health Care 25/50 Index. The fund is non-diversified.",
        "category": "Health",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2516730880
    },
    "FTXH": {
        "short_name": "First Trust Nasdaq Pharmaceutic",
        "long_name": "First Trust Nasdaq Pharmaceuticals ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of the Nasdaq US Smart Pharmaceuticals Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depository receipts that comprise the index. The index is designed to provide exposure to U.S. companies comprising the pharmaceutical sector that have been selected based upon their liquidity and weighted based upon their cumulative score on three investing factors: volatility, value and growth. It is non-diversified.",
        "category": "Health",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 21994916
    },
    "FXH": {
        "short_name": "First Trust Health Care AlphaDE",
        "long_name": "First Trust Health Care AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the StrataQuantÂ® Health Care Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000Â® Index in the health care sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Health",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1455420288
    },
    "HART": {
        "short_name": "IQ Healthy Hearts ETF",
        "long_name": "IQ Healthy Hearts ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the price and yield performance of its underlying index, the IQ Candriam Healthy Hearts Index.\n The fund employs a \"passive management\" - or indexing - investment approach designed to track the performance of the index, which was developed by IndexIQ LLC with Candriam Belgium S.A. acting as index consultant to IndexIQ. The index includes securities of large-, mid- and small-capitalization companies that trade in the U.S. and foreign markets, including emerging markets other than China, Egypt, India, Kuwait, Pakistan, Qatar, Saudi Arabia and United Arab Emirates.",
        "category": "Health",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6178911
    },
    "HLGE": {
        "short_name": "Hartford Longevity Economy ETF",
        "long_name": "Hartford Longevity Economy ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond to the total return performance of the Hartford Longevity Economy Index (LHLGEX), which is designed to generate attractive risk-adjusted returns by investing in companies that comprise industries that reflect certain themes that are expected to benefit from the growth of the aging population and the substantial buying power it represents.\n The fund generally invests at least 80% of its assets in securities included in the index and in depositary receipts representing securities included in the index.",
        "category": "Health",
        "family": "Hartford Mutual Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": null
    },
    "HTEC": {
        "short_name": "Robo Global Healthcare Technolo",
        "long_name": "Robo Global Healthcare Technology and Innovation ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the ROBO GlobalÂ® Healthcare Technology and Innovation Index.\n The fund will normally invest at least 80% of its total assets in securities of the index or in depositary receipts representing securities of the index. The index is designed to measure the performance of companies that have a portion of their business and revenue derived from the field of healthcare technology, and the potential to grow within this space through innovation and market adoption of such companiesâ\u0080\u0099 products and services. It is non-diversified.",
        "category": "Health",
        "family": "Robo Global",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 209525440
    },
    "IBB": {
        "short_name": "iShares Nasdaq Biotechnology In",
        "long_name": "iShares Nasdaq Biotechnology ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the NASDAQ Biotechnology Index, which contains securities of companies listed on NASDAQ that are classified according to the Industry Classification Benchmark as either biotechnology or pharmaceuticals and that also meet other eligibility criteria determined by Nasdaq, Inc.\n The fund generally invests at least 90% of its assets in securities of the index and in depositary receipts representing securities of the index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 10292637696
    },
    "IBBJ": {
        "short_name": "Defiance Nasdaq Junior Biotechn",
        "long_name": "Defiance Nasdaq Junior Biotechnology ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the NASDAQ Junior Biotechnology Index.\n The index is a rules-based index that consists of a portfolio of the stock of U.S.-listed small capitalization (\"junior\") biotechnology companies (collectively, \"Junior Biotech Companies\"). The fund will generally use a \"replication\" strategy to achieve its investment objective, meaning it will generally invest in all of the component securities of the index in the same approximate proportions as in the index. The fund is non-diversified.",
        "category": "Health",
        "family": "Defiance ETFs",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 8997275
    },
    "IBBQ": {
        "short_name": "Invesco Nasdaq Biotechnology ET",
        "long_name": "Invesco Nasdaq Biotechnology ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq Biotechnology Index Â®.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the index. Strictly in accordance with its guidelines and mandated procedures, Nasdaq compiles the underlying index, which is a modified market capitalization weighted index that is designed to measure the performance of securities listed on the Nasdaq Stock Market that are classified as either biotechnology or pharmaceutical companies. The index may include securities of large-, mid- and small-capitalization companies. The fund is non-diversified.",
        "category": "Health",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": null
    },
    "IEHS": {
        "short_name": "iShares Evolved U.S. Healthcare",
        "long_name": "iShares Evolved U.S. Healthcare Staples ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide access to U.S. companies with healthcare staples exposure, as classified using a proprietary classification system.\n The fund invests, under normal circumstances, at least 80% of its net assets in U.S. listed common stock of large-, mid- and small-capitalization healthcare equipment and services companies. It will hold common stock of those companies that fall into the Healthcare Staples Evolved Sector which have economic characteristics that have been historically correlated with companies traditionally defined as healthcare equipment and services companies. The fund is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 30625282
    },
    "IEIH": {
        "short_name": "iShares Evolved U.S. Innovative",
        "long_name": "iShares Evolved U.S. Innovative Healthcare ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide access to U.S. companies with innovative healthcare exposure, as classified using a proprietary classification system.\n The fund invests, under normal circumstances, at least 80% of its net assets in U.S. listed common stock of large-, mid- and small-capitalization pharmaceutical and biotechnology companies. It will hold common stock of those companies that fall into the Innovative Healthcare Evolved Sector which have economic characteristics that have been historically correlated with companies traditionally defined as pharmaceutical and biotechnology companies. The fund is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 36323088
    },
    "IHE": {
        "short_name": "iShares U.S. Pharmaceutical ETF",
        "long_name": "iShares U.S. Pharmaceuticals ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Pharmaceuticals Index.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the pharmaceuticals sector of the U.S. equity market. The underlying index includes pharmaceutical companies such as manufacturers of prescription or over-the-counter drugs or vaccines, but excludes producers of vitamins. The fund is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 357196640
    },
    "IHF": {
        "short_name": "iShares U.S. Health Care Provid",
        "long_name": "iShares U.S. Healthcare Providers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Health Care Providers Index composed of U.S. equities in the healthcare providers sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the healthcare providers sector of the U.S. equity market. The fund may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1079427200
    },
    "IHI": {
        "short_name": "iShares U.S. Medical Devices ET",
        "long_name": "iShares U.S. Medical Devices ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Medical Equipment Index composed of U.S. equities in the medical devices sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index includes medical equipment companies, including manufacturers and distributors of medical devices such as magnetic resonance imaging (MRI) scanners, prosthetics, pacemakers, X-ray machines, and other non-disposable medical devices. The fund is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8660841472
    },
    "IXJ": {
        "short_name": "iShares Global Healthcare ETF",
        "long_name": "iShares Global Healthcare ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the S&P Global 1200 Health Care IndexTM.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index. The index measures the performance of companies that the index provider deems to be a part of the healthcare sector of the economy and that the index provider believes are important to global markets.",
        "category": "Health",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2635773184
    },
    "IYH": {
        "short_name": "iShares U.S. Healthcare ETF",
        "long_name": "iShares U.S. Healthcare ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Health Care Index composed of U.S. equities in the healthcare sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the healthcare sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Health",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2500136192
    },
    "PBE": {
        "short_name": "Invesco Dynamic Biotech & Genom",
        "long_name": "Invesco Dynamic Biotechnology & Genome ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Biotech & Genome IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying intellidex. The underlying intellidex was composed of common stocks of U.S. biotechnology and genome companies. These companies are engaged principally in the research, development, manufacture and marketing and distribution of various biotechnological products, services and processes, etc. It is non-diversified.",
        "category": "Health",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 287824512
    },
    "PJP": {
        "short_name": "Invesco Dynamic Pharmaceuticals",
        "long_name": "Invesco Dynamic Pharmaceuticals ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Pharmaceutical IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of common stocks of U.S. pharmaceutical companies. These companies are engaged principally in the research, development, manufacture, sale or distribution of pharmaceuticals and drugs of all types. The fund is non-diversified.",
        "category": "Health",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 360923168
    },
    "PPH": {
        "short_name": "VanEck Vectors Pharmaceutical E",
        "long_name": "VanEck Vectors Pharmaceutical ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Listed Pharmaceutical 25 Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes common stocks and depositary receipts of U.S. exchange-listed companies in the pharmaceutical industry. Such companies may include medium-capitalization companies and foreign companies that are listed on a U.S. exchange. It is non-diversified.",
        "category": "Health",
        "family": "VanEck",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 233600000
    },
    "PSCH": {
        "short_name": "Invesco S&P SmallCap Health Car",
        "long_name": "Invesco S&P SmallCap Health Care ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Capped Health Care Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the index. Strictly in accordance with its guidelines and mandated procedures, S&P Dow Jones Indices, LLC compiles, maintains and calculates the index, which is designed to measure the performance of securities of small-capitalization U.S. companies in the health care sector, as defined by the Global Industry Classification Standard.",
        "category": "Health",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 511071872
    },
    "PTH": {
        "short_name": "Invesco DWA Healthcare Momentum",
        "long_name": "Invesco DWA Healthcare Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Healthcare Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of at least 30 securities of companies in the healthcare sector that have powerful relative strength or \"momentum\" characteristics.",
        "category": "Health",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 558217856
    },
    "RYH": {
        "short_name": "Invesco S&P 500 Equal Weight He",
        "long_name": "Invesco S&P 500 Equal Weight Health Care ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Equal Weight Health Care Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of all of the components of the S&P 500Â® Health Care Index, an index that contains the common stocks of all companies included in the S&P 500Â® Index that are classified as members of the health care sector, as defined according to the Global Industry Classification Standard (\"GICS\").",
        "category": "Health",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 776983360
    },
    "SBIO": {
        "short_name": "ALPS Medical Breakthroughs ETF",
        "long_name": "ALPS Medical Breakthroughs ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the performance of its underlying index, the S-NetworkÂ® Medical Breakthroughs Index.\n The fund employs a \"passive management\" - or indexing - investment approach designed to track the performance of the underlying index. It will normally invest at least 80% of its net assets in securities that comprise the underlying index. The underlying index is comprised of small- and mid-cap stocks of biotechnology companies that have one or more drugs in either Phase II or Phase III of the U.S. Food and Drug Administration clinical trials.",
        "category": "Health",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 287282272
    },
    "VHT": {
        "short_name": "Vanguard Health Care ETF",
        "long_name": "Vanguard Health Care Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index (IMI)/Health Care 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the health care sector, as classified under the Global Industry Classification Standard (GICS). The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
        "category": "Health",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 16237583360
    },
    "XBI": {
        "short_name": "SPDR Series Trust  SPDR S&P Bio",
        "long_name": "SPDR S&P Biotech ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Biotechnology Select Industry Index derived from the biotechnology segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Biotechnology Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the biotechnology segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Health",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 7845924352
    },
    "XHE": {
        "short_name": "SPDR S&P Health Care Equipment",
        "long_name": "SPDR S&P Health Care Equipment ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the health care equipment and supplies segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Health Care Equipment Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the health care equipment segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Health",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 802281728
    },
    "XHS": {
        "short_name": "SPDR S&P Health Care Services E",
        "long_name": "SPDR S&P Health Care Services ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the health care providers and services segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Health Care Services Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the health care services segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Health",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 147249296
    },
    "XLV": {
        "short_name": "SPDR Select Sector Fund - Healt",
        "long_name": "Health Care Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Health Care Select Sector Index.\n In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes companies from the following industries: pharmaceuticals; health care equipment & supplies; health care providers & services; biotechnology; life sciences tools & services; and health care technology. The fund is non-diversified.",
        "category": "Health",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 25615130624
    },
    "XPH": {
        "short_name": "SPDR S&P Pharmaceuticals ETF",
        "long_name": "SPDR S&P Pharmaceuticals ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the pharmaceuticals segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Pharmaceuticals Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the pharmaceuticals segment of the S&P Total Market Index (\"S&P TMI\").",
        "category": "Health",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 248675504
    }
}