{
    "ANGL": {
        "short_name": "VanEck Vectors Fallen Angel Hig",
        "long_name": "VanEck Vectors Fallen Angel High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of ICE US Fallen Angel High Yield 10% Constrained Index (the \"Fallen Angel Index\").\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of below investment grade corporate bonds denominated in U.S. dollars that were rated investment grade at the time of issuance.",
        "category": "High Yield Bond",
        "family": "VanEck",
        "exchange": "NMS",
        "market": "us_market"
    },
    "BKHY": {
        "short_name": "BNY Mellon High Yield Beta ETF",
        "long_name": "BNY Mellon High Yield Beta ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Bloomberg Barclays US Corporate High Yield Total Return Index.\n The fund uses a rules-based, systematic investment strategy that seeks to track an index designed to measure the performance of the high yield bond market. To pursue its goal, the fund normally invests substantially all, but at least 80%, of its assets in bonds comprising the Bloomberg Barclays US Corporate High Yield Total Return Index. The Bloomberg Barclays US Corporate High Yield Total Return Index is designed to measure the U.S. dollar-denominated, high yield (junk), fixed-rate, taxable corporate bond market. It is non-diversified.",
        "category": "High Yield Bond",
        "family": "BNY Mellon",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BSJL": {
        "short_name": "Invesco BulletShares 2021 High ",
        "long_name": "Invesco BulletShares 2021 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2021 Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2021 (collectively, \"2021 Bonds\"). The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "BSJM": {
        "short_name": "Invesco BulletShares 2022 High ",
        "long_name": "Invesco BulletShares 2022 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2022 Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2022 (collectively, \"2022 Bonds\").",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "BSJN": {
        "short_name": "Invesco BulletShares 2023 High ",
        "long_name": "Invesco BulletShares 2023 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2023 Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2023 (collectively, \"2023 Bonds\").",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "BSJP": {
        "short_name": "Invesco BulletShares 2025 High ",
        "long_name": "Invesco BulletShares 2025 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2025 Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2025 (collectively, \"2025 Bonds\").",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "BSJQ": {
        "short_name": "Invesco BulletShares 2026 High ",
        "long_name": "Invesco BulletShares 2026 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2026 Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2026 (collectively, \"2026 Bonds\"). The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "BSJR": {
        "short_name": "Invesco BulletShares 2027 High ",
        "long_name": "Invesco BulletShares 2027 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2027 Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2027 (collectively, \"2027 Bonds\"). The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market"
    },
    "BSJS": {
        "short_name": "Invesco BulletShares 2028 High ",
        "long_name": "Invesco BulletShares 2028 High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq BulletSharesÂ® USD High Yield Corporate Bond 2028 Index.\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The index seeks to measure the performance of a portfolio of U.S. dollar-denominated high yield corporate bonds (commonly known as \"junk bonds\") with maturities or, in some cases, \"effective maturities\" in the year 2028. It does not purchase all of the securities in the index; instead, the fund utilizes a \"sampling\" methodology to seek to achieve its investment objective. It is non-diversified.",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "DFHY": {
        "short_name": "TrimTabs Donoghue Forlines Tact",
        "long_name": "TrimTabs Donoghue Forlines Tactical High Yield ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the TrimTabs Donoghue Forlines Tactical High Yield Index.\n To pursue its investment objective, the fund invests, under normal market circumstances, at least 80% of its net assets (plus any borrowings for investment purposes) in component securities of the index. The index is designed to track the performance of a strategy that seeks to provide risk-managed exposure to exchange-traded funds (\"ETFs\") that investment primarily in high yield debt instruments.",
        "category": "High Yield Bond",
        "family": "TrimTabs",
        "exchange": "BTS",
        "market": "us_market"
    },
    "ESHY": {
        "short_name": "Xtrackers J.P. Morgan ESG USD H",
        "long_name": "Xtrackers J.P. Morgan ESG USD High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the J.P. Morgan ESG DM Corporate High Yield USD Index.\n The fund will invest at least 80% of its total assets, but typically far more, in instruments that comprise the underlying index. The index generally aims to keep the broad characteristics of its parent index, the J.P. Morgan DM High Yield USD Index (a USD denominated high yield corporate bond index of developed market issuers), resulting in a broad high yield fixed income market exposure with ESG aspects. It is non-diversified.",
        "category": "High Yield Bond",
        "family": "Xtrackers",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FALN": {
        "short_name": "iShares Fallen Angels USD Bond ",
        "long_name": "iShares Fallen Angels USD Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays US High Yield Fallen Angel 3% Capped Index composed of U.S. dollar-denominated, high yield corporate bonds that were previously rated investment grade.\n The fund generally will invest at least 90% of its assets in the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to reflect the performance of U.S. dollar denominated, high yield corporate bonds that were previously rated investment grade.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "FDHY": {
        "short_name": "Fidelity High Yield Factor ETF",
        "long_name": "Fidelity High Yield Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks a high level of income.\n The fund normally invests at least 80% of its assets in debt securities rated below investment grade (also referred to as high yield debt securities or junk bonds). It uses the ICEÂ® BofAÂ® BB-B US High Yield Constrained Index as a guide in structuring the fund and selecting its investments as it relates to credit quality distribution and risk characteristics. The fund normally invests primarily in securities rated BB or B by S&P, Ba or B by Moody&#39;s, comparably rated by at least one nationally recognized credit rating agency, or, if unrated, considered by FMRC to be of comparable quality.",
        "category": "High Yield Bond",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FLHY": {
        "short_name": "Franklin Liberty High Yield Cor",
        "long_name": "Franklin Liberty High Yield Corporate ETF",
        "currency": "USD",
        "summary": "The investment seeks to earn a high level of current income; its secondary goal is to seek capital appreciation to the extent it is possible and consistent with the fund&#39;s principal goal.\n Under normal market conditions, the fund invests at least 80% of its net assets in high yield corporate debt securities and investments that provide exposure to high yield corporate debt securities. It may invest up to 100% of its total assets in high yield debt securities. The fund may invest in debt securities of U.S. and foreign issuers, including those in developing or emerging markets. These securities may be U.S. dollar or non-U.S. dollar denominated.",
        "category": "High Yield Bond",
        "family": "Franklin Templeton Investments",
        "exchange": "BTS",
        "market": "us_market"
    },
    "GHYB": {
        "short_name": "Goldman Sachs Access High Yield",
        "long_name": "Goldman Sachs Access High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the FTSE Goldman Sachs High Yield Corporate Bond Index (the \"index\").\n The fund seeks to achieve its investment objective by investing at least 80% of its assets (exclusive of collateral held from securities lending) in securities included in its underlying index. The index is a rules-based index that is designed to measure the performance of high yield corporate bonds denominated in U.S. dollars (\"USD\") that meet certain liquidity and fundamental screening criteria.",
        "category": "High Yield Bond",
        "family": "Goldman Sachs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "GHYG": {
        "short_name": "iShares US & Intl High Yield Co",
        "long_name": "iShares US & Intl High Yield Corp Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Markit iBoxx Global Developed Markets High Yield Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates. The index is a rules-based index consisting of high yield corporate bonds denominated in U.S. dollars, euros, British pounds sterling and Canadian dollars.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "HYBB": {
        "short_name": "iShares BB Rated Corporate Bond",
        "long_name": "iShares BB Rated Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE BofA BB US High Yield Constrained Index composed of BB, or equivalently rated, fixed rate U.S. dollar-denominated bonds issued by U.S. and non-U.S. corporations.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates (\"BlackRock Cash Funds\"), as well as in securities not included in the index, but which BFA believes will help it track the index.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYDB": {
        "short_name": "iShares High Yield Bond Factor ",
        "long_name": "iShares Edge High Yield Defensive Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the BlackRock High Yield Defensive Bond Index.\n The fund will invest at least 80% of its assets in the component securities of the underlying index and may invest up to 20% of its assets in certain index futures, options, options on index futures, swap contracts or other derivatives. The index consists of U.S. dollar-denominated, high yield corporate bonds. Component securities include publicly-issued debt of U.S. corporations and U.S. dollar-denominated, publicly issued debt of non-U.S. corporations or similar entities.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "HYDW": {
        "short_name": "Xtrackers Low Beta High Yield B",
        "long_name": "Xtrackers Low Beta High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market Low Beta Index (the \"underlying index\").\n The fund will invest at least 80% of its total assets, (but typically far more) in component securities of the underlying index. The underlying index is designed to track the performance of the segment of the U.S. dollar denominated high yield corporate bond market that exhibits lower overall beta to the broader high yield corporate fixed income market.",
        "category": "High Yield Bond",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYG": {
        "short_name": "iShares iBoxx $ High Yield Corp",
        "long_name": "iShares iBoxx $ High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Markit iBoxxÂ® USD Liquid High Yield Index (the \"underlying index\").\n The underlying index is a rules-based index consisting of U.S. dollar-denominated, high yield corporate bonds for sale in the U.S. The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYGH": {
        "short_name": "iShares Interest Rate Hedged Hi",
        "long_name": "iShares Interest Rate Hedged High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to mitigate the interest rate risk of a portfolio composed of U.S. dollar-denominated, high yield corporate bonds.\n The fund seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in U.S. dollar-denominated high yield bonds, in one or more underlying funds that principally invest in high yield bonds and in U.S. Treasury securities. It may also invest in other interest rate futures contracts, including but not limited to, Eurodollar and Federal Funds futures.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYGV": {
        "short_name": "FlexShares High Yield Value-Sco",
        "long_name": "FlexShares High Yield Value-Scored Bond Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the Northern Trust High Yield Value-Scored US Corporate Bond IndexSM.\n The index reflects the performance of a broad universe of U.S.-dollar denominated high yield corporate bonds that seeks a higher total return than the overall high yield corporate bond market, as represented by the Northern Trust High Yield US Corporate Bond IndexSM. The fund generally will invest under normal circumstances at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of its index.",
        "category": "High Yield Bond",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYLB": {
        "short_name": "Xtrackers USD High Yield Corpor",
        "long_name": "Xtrackers USD High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market Index (the \"underlying index\").\n The fund will normally invest at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in high yield corporate bonds. The index comprised of U.S. dollar-denominated high yield corporate bonds. It will concentrate its investments (i.e., hold 25% or more of its total assets) in a particular industry or group of industries to the extent that its underlying index is concentrated. The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYLS": {
        "short_name": "First Trust Tactical High Yield",
        "long_name": "First Trust Tactical High Yield ETF",
        "currency": "USD",
        "summary": "The investment seeks current income; capital appreciation is the secondary objective.\n Under normal market conditions, the fund invests at least 80% of its net assets (including investment borrowings) in high yield debt securities that are rated below investment grade at the time of purchase or unrated securities deemed by the fund&#39;s advisor to be of comparable quality.",
        "category": "High Yield Bond",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market"
    },
    "HYLV": {
        "short_name": "IndexIQ ETF Trust IQ S&P High Y",
        "long_name": "IQ S&P High Yield Low Volatility Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that track (before fees and expenses) the price and yield performance of its underlying index, the S&P U.S. High Yield Low Volatility Corporate Bond Index.\n The fund uses a \"Representative Sampling\" strategy in seeking to track the performance of the underlying index. The underlying index is comprised of U.S. dollar denominated high yield corporate bonds that have been selected in accordance with a rules-based methodology that seeks to identify securities that, in the aggregate, are expected to have lower volatility relative to the broad U.S. dollar denominated high yield corporate bond market.",
        "category": "High Yield Bond",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYS": {
        "short_name": "PIMCO 0-5 Year High Yield Corpo",
        "long_name": "PIMCO 0-5 Year High Yield Corporate Bond Index Exchange-Traded Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide total return that closely corresponds, before fees and expenses, to the total return of the ICE BofA 0-5 Year US High Yield Constrained Index.\n The fund invests under normal circumstances at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the ICE BofA 0-5 Year US High Yield Constrained Index. The underlying index is an unmanaged index comprised of U.S. dollar denominated below investment grade corporate debt securities publicly issued in the U.S. domestic market with remaining maturities of less than 5 years.",
        "category": "High Yield Bond",
        "family": "PIMCO",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYUP": {
        "short_name": "Xtrackers High Beta High Yield ",
        "long_name": "Xtrackers High Beta High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market High Beta Index (the \"underlying index\").\n The fund will invest at least 80% of its total assets, (but typically far more) in component securities of the underlying index. The underlying index is designed to track the performance of the segment of the U.S. dollar denominated high yield corporate bond market that exhibits higher overall beta to the broader high yield corporate fixed income market.",
        "category": "High Yield Bond",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HYXF": {
        "short_name": "iShares ESG Advanced High Yield",
        "long_name": "iShares ESG Advanced High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investments results of the Bloomberg Barclays MSCI US High Yield Choice ESG Screened Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to reflect the performance of U.S. dollar-denominated high yield corporate bonds of issuers with favorable ESG ratings, as identified by the index Provider, while applying additional screens.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "HYXU": {
        "short_name": "iShares International High Yiel",
        "long_name": "iShares International High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Markit iBoxx Global Developed Markets ex-US High Yield Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates. The index is a rules-based index consisting of high yield corporate bonds denominated in euros, British pounds sterling and Canadian dollars.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IBHA": {
        "short_name": "iShares iBonds 2021 Term High Y",
        "long_name": "iShares iBonds 2021 Term High Yield and Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays 2021 Term High Yield and Income Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index, and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is composed of U.S. dollar-denominated, taxable, fixed-rate, high yield and BBB or equivalently rated corporate bonds scheduled to mature between January 1, 2021 and December 15, 2021, inclusive. The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IBHB": {
        "short_name": "iShares iBonds 2022 Term High Y",
        "long_name": "iShares iBonds 2022 Term High Yield and Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays 2022 Term High Yield and Income Index.\n The fund generally will invest at least 90% of its assets in the component securities of the index, and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is composed of U.S. dollar-denominated, high yield and other income generating corporate bonds maturing in 2022. The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IBHC": {
        "short_name": "iShares iBonds 2023 Term High Y",
        "long_name": "iShares iBonds 2023 Term High Yield and Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays 2023 Term High Yield and Income Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index, and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is composed of U.S. dollar-denominated, taxable, fixed-rate, high yield and BBB or equivalently rated corporate bonds scheduled to mature between January 1, 2023 and December 15, 2023, inclusive. The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IBHD": {
        "short_name": "iShares iBonds 2024 Term High Y",
        "long_name": "iShares iBonds 2024 Term High Yield and Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays 2024 Term High Yield and Income Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index, and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is composed of U.S. dollar-denominated, taxable, fixed-rate, high yield and BBB or equivalently rated corporate bonds scheduled to mature between January 1, 2024 and December 15, 2024, inclusive. The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IBHE": {
        "short_name": "iShares iBonds 2025 Term High Y",
        "long_name": "iShares iBonds 2025 Term High Yield and Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays 2025 Term High Yield and Income Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index, and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is composed of U.S. dollar-denominated, taxable, fixed-rate, high yield and BBB or equivalently rated corporate bonds scheduled to mature between January 1, 2025 and December 15, 2025, inclusive. The fund is non-diversified.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IHY": {
        "short_name": "VanEck Vectors International Hi",
        "long_name": "VanEck Vectors International High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the ICE BofAML Global ex-US Issuers High Yield Constrained Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of below investment grade bonds issued by corporations located throughout the world (which may include emerging market countries) excluding the United States denominated in Euros, U.S. dollars, Canadian dollars or pound sterling and issued in the major domestic or Eurobond markets.",
        "category": "High Yield Bond",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "IHYF": {
        "short_name": "Invesco High Yield Bond Factor ",
        "long_name": "Invesco High Yield Bond Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks total return.\n The fund is an actively managed ETF that seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its net assets (plus the amount of any borrowings for investment purposes) in high-yield, below-investment grade, fixed-income securities, and in derivatives and other instruments that have economic characteristics similar to such securities. It may invest up to 20% of its net assets in U.S. Treasury and agency securities. The fund may also invest up to 10% of its net assets in certain collateralized debt obligations.",
        "category": "High Yield Bond",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market"
    },
    "JNK": {
        "short_name": "SPDR Bloomberg Barclays High Yi",
        "long_name": "SPDR Bloomberg Barclays High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays High Yield Very Liquid Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of publicly issued U.S. dollar denominated high yield corporate bonds with above-average liquidity.",
        "category": "High Yield Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "JPHY": {
        "short_name": "JPMorgan Research Enhanced High",
        "long_name": "JPMorgan High Yield Research Enhanced ETF",
        "currency": "USD",
        "summary": "The investment seeks a high level of income; capital appreciation is a secondary objective.\n The fund invests primarily in high yield, high risk debt securities. Under normal circumstances, it invests at least 80% of its assets in high yield securities. For purposes of this policy, \"assets\" means net assets plus the amount of borrowings for investment purposes. The fund may invest up to 100% of its total assets in below investment grade or unrated securities.",
        "category": "High Yield Bond",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market"
    },
    "NUHY": {
        "short_name": "Nuveen ESG High Yield Corporate",
        "long_name": "Nuveen ESG High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results, before fees and expenses, of the Bloomberg Barclays MSCI U.S. High Yield Very Liquid ESG Select Index.\n The index utilizes certain environmental, social, and governance (â\u0080\u009c ESGâ\u0080\u009d) criteria to select from the securities included in the Bloomberg Barclays U.S. High Yield Very Liquid Index (the â\u0080\u009c Base Indexâ\u0080\u009d), which is designed to broadly capture the U.S. dollar-denominated, high yield, fixed-rate corporate bond market. Under normal market conditions, it invests at least 80% of the sum of its net assets and the amount of any borrowings for investment purposes in component securities of the index.",
        "category": "High Yield Bond",
        "family": "Nuveen",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PHYL": {
        "short_name": "PGIM Active High Yield Bond ETF",
        "long_name": "PGIM Active High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks total return, through a combination of current income and capital appreciation.\n Under normal market conditions, the fund invests at least 80% of its investable assets in a diversified portfolio of high yield bonds that are below investment grade and other investments (including derivatives) with similar economic characteristics. It may invest in securities which are the subject of bankruptcy proceedings or otherwise in default as to the repayment of principal and/or interest at the time of acquisition by the fund or are rated in the lower rating categories or, if unrated, are in the judgment of the Subadviser of equivalent quality.",
        "category": "High Yield Bond",
        "family": "PGIM Funds (Prudential)",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SHYG": {
        "short_name": "iShares 0-5 Year High Yield Cor",
        "long_name": "iShares 0-5 Year High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Markit iBoxxÂ® USD Liquid High Yield 0-5 Index composed of U.S. dollar-denominated, high yield corporate bonds with remaining maturities of less than five years.\n The fund generally invests at least 90% of its assets in the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to reflect the performance of U.S. dollar-denominated high yield corporate debt.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SHYL": {
        "short_name": "Xtrackers Short Duration High Y",
        "long_name": "Xtrackers Short Duration High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the Solactive USD High Yield Corporates Total Market 0-5 Year Index (the \"underlying index\").\n The fund will invest at least 80% of its total assets (but typically far more) in component securities of the underlying index. The underlying index is designed to track the performance of short-term publicly issued U.S. dollar-denominated below investment grade corporate debt.",
        "category": "High Yield Bond",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SJNK": {
        "short_name": "SPDR Bloomberg Barclays Short T",
        "long_name": "SPDR Bloomberg Barclays Short Term High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays US High Yield 350mn Cash Pay 0-5 Yr 2% Capped Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of short-term publicly issued U.S. dollar-denominated high yield corporate bonds.",
        "category": "High Yield Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SPHY": {
        "short_name": "SPDR Portfolio High Yield Bond ",
        "long_name": "SPDR Portfolio High Yield Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of ICE BofA US High Yield Index.\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of U.S. dollar denominated below investment grade corporate debt publicly issued in the U.S. domestic market.",
        "category": "High Yield Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "THY": {
        "short_name": "Toews Agility Shares Dynamic Ta",
        "long_name": "Toews Agility Shares Dynamic Tactical Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide income; a secondary objective of the fund is to limit risk during unfavorable market conditions.\n The adviser seeks to achieve the fund&#39;s investment objectives by investing primarily in exchange traded funds (\"ETFs\"); options on ETFs, equities and indices; futures and options that invest in or are otherwise exposed to domestic and foreign high-yield debt instruments (also known as \"junk bonds\"), and U.S. or foreign cash equivalents. It may hedge long positions using futures and/or ETFs.",
        "category": "High Yield Bond",
        "family": "Toews Corporation",
        "exchange": "BTS",
        "market": "us_market"
    },
    "USHY": {
        "short_name": "iShares Broad USD High Yield Co",
        "long_name": "iShares Broad USD High Yield Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE BofA US High Yield Constrained Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates, as well as in securities not included in the underlying index. The underlying index is designed to provide a broad representation of the U.S. dollar-denominated high yield corporate bond market.",
        "category": "High Yield Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    }
}