{
  "EPI": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "WisdomTree",
    "long_name": "WisdomTree India Earnings Fund",
    "market": "us_market",
    "short_name": "WisdomTree India Earnings Fund",
    "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree India Earnings Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is comprised of companies incorporated and traded in India that are profitable and that are eligible to be purchased by foreign investors as of the annual index screening date. It is non-diversified.",
    "total_assets": 789224960
  },
  "GLIN": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "VanEck",
    "long_name": "VanEck Vectors India Growth Leaders ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors India Growth Lea",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MarketGrader India All-Cap Growth Leaders Index.\n The fund invests substantially all of its assets in the Subsidiary, a wholly-owned subsidiary located in the Republic of Mauritius. The index is comprised of equity securities which are generally considered by the index provider to exhibit favorable fundamental characteristics according to the index provider’s proprietary scoring methodology.",
    "total_assets": 70884200
  },
  "INCO": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Columbia Threadneedle",
    "long_name": "Columbia India Consumer ETF",
    "market": "us_market",
    "short_name": "Columbia India Consumer ETF",
    "summary": "The investment seeks investment results that correspond to the price and yield performance of the Indxx India Consumer Index.\n The fund will invest at least 80% of its net assets in Indian consumer companies included in the index and the advisor generally expects to be substantially invested at such times, with at least 95% of its net assets invested in these securities. The index is a maximum 30-stock free-float adjusted market capitalization-weighted index designed to measure the market performance of companies in the consumer industry in India, as defined by Indxx&#39;s proprietary methodology. It is non-diversified.",
    "total_assets": 91532184
  },
  "INDA": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI India ETF",
    "market": "us_market",
    "short_name": "Ishares MSCI India ETF",
    "summary": "The investment seeks to track the investment results of the MSCI India Index composed of Indian equities.\n The fund generally will collectively invest at least 90% of the fund&#39;s assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index measures the performance of equity securities of companies whose market capitalization, as calculated by the index provider, represents the large and mid-capitalization segments of the Indian securities market. The fund is non-diversified.",
    "total_assets": 5241081344
  },
  "INDY": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "NGM",
    "family": "iShares",
    "long_name": "iShares India 50 ETF",
    "market": "us_market",
    "short_name": "iShares S&P India Nifty 50 Inde",
    "summary": "The investment seeks to track the investment results of the Nifty 50 IndexTM composed of 50 of the largest Indian equities.\n The Subsidiary and the fund will collectively invest at least 90% of the fund&#39;s assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index measures the equity performance of the top 50 companies by free float market capitalization whose equity securities trade in the Indian securities markets. The fund is non-diversified.",
    "total_assets": 678544320
  },
  "IXSE": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "WisdomTree",
    "long_name": "WisdomTree India ex-State-Owned Enterprises Fund",
    "market": "us_market",
    "short_name": "WisdomTree India Ex-State-Owned",
    "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree India ex-State-Owned Enterprises Index.\n Normally, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a modified float-adjusted market cap weighted index that consists of companies incorporated and traded in India, excluding common stocks of \"state-owned enterprises.\" The fund is non-diversified.",
    "total_assets": 4549453
  },
  "NFTY": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "NMS",
    "family": "First Trust",
    "long_name": "First Trust India NIFTY 50 Equal Weight ETF",
    "market": "us_market",
    "short_name": "First Trust India Nifty 50 Equa",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NIFTY 50 Equal Weight Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to track the performance of the 50 largest and most liquid Indian securities listed on the National Stock Exchange of India (\"NSE\") by investing in all of the components of the NIFTY 50.",
    "total_assets": 71771472
  },
  "PIN": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco India ETF",
    "market": "us_market",
    "short_name": "Invesco India ETF",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the FTSE India Quality and Yield Select Index (the \"underlying index\").\n The fund seeks to achieve its investment objective by investing at least 90% of its total assets in the securities that comprise the underlying index, as well as ADRs and GDRs that represent securities in the underlying index. The underlying index is a modified-market capitalization-weighted index of equity securities that are traded on the National Stock Exchange of India. The fund is non-diversified.",
    "total_assets": 126502208
  },
  "SMIN": {
    "category": "India Equity",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI India Small-Cap ETF",
    "market": "us_market",
    "short_name": "Ishares MSCI India Small Cap ET",
    "summary": "The investment seeks to track the investment results of the MSCI India Small Cap Index.\n The fund generally will collectively invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities of small-capitalization companies in the Indian securities market.",
    "total_assets": 259536880
  }
}
