{
    "GTIP": {
        "short_name": "Goldman Sachs Access Inflation ",
        "long_name": "Goldman Sachs Access Inflation Protected USD Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the FTSE Goldman Sachs Treasury Inflation Protected USD Bond Index (the \"index\").\n The fund seeks to achieve its investment objective by investing at least 80% of its assets (exclusive of collateral held from securities lending) in securities included in its underlying index. The index is designed to track the performance of inflation-protected, fixed rate U.S. Treasury Securities denominated in U.S. dollars (\"USD\") that meet certain screening criteria.",
        "category": "Inflation-Protected Bond",
        "family": "Goldman Sachs",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 72941328
    },
    "LTPZ": {
        "short_name": "Pimco 15  Year U.S. TIPS Index ",
        "long_name": "PIMCO 15+ Year U.S. TIPS Index Exchange-Traded Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide total return that closely corresponds, before fees and expenses, to the total return of the ICE BofA 15+ Year US Inflation-Linked Treasury Index.\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the ICE BofA 15+ Year US Inflation-Linked Treasury Index (the \"underlying index\"). The underlying index is an unmanaged index comprised of Treasury Inflation-Protected Securities (\"TIPS\") with a maturity of at least 15 years.",
        "category": "Inflation-Protected Bond",
        "family": "PIMCO",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 546239232
    },
    "PBTP": {
        "short_name": "Invesco PureBeta 0-5 Yr US TIPS",
        "long_name": "Invesco PureBeta 0-5 Yr US TIPS ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the ICE BofA 0-5 Year US Inflation-Linked Treasury IndexSM (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in the securities that comprise the underlying index. The index is designed to measure the performance of the shorter maturity subset of the U.S. Treasury Inflation-Protected Securities (\"TIPS\") market, represented by TIPS with a remaining maturity of at least one month and less than five years.",
        "category": "Inflation-Protected Bond",
        "family": "Invesco",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 19364280
    },
    "SCHP": {
        "short_name": "Schwab U.S. TIPs ETF",
        "long_name": "Schwab U.S. TIPS ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Bloomberg Barclays US Treasury Inflation-Linked Bond Index (Series-L)SM.\n The fund will invest at least 90% of its net assets in securities included in the index. The index includes all publicly-issued U.S. Treasury Inflation-Protected Securities (TIPS) that have at least one year remaining to maturity, are rated investment grade and have $500 million or more of outstanding face value. The TIPS in the index must be denominated in U.S. dollars and must be fixed-rate and non-convertible.",
        "category": "Inflation-Protected Bond",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 16553399296
    },
    "STIP": {
        "short_name": "iShares 0-5 Year TIPS Bond ETF",
        "long_name": "iShares 0-5 Year TIPS Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. Treasury Inflation-Protected Securities (TIPS) 0-5 Years Index (Series-L).\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of the inflation-protected public obligations of the U.S. Treasury, commonly known as \"TIPS,\" that have a remaining maturity of less than five years.",
        "category": "Inflation-Protected Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3679664384
    },
    "STPZ": {
        "short_name": "PIMCO 1-5 Year U.S. TIPS Index ",
        "long_name": "PIMCO 1-5 Year U.S. TIPS Index Exchange-Traded Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide total return that closely corresponds, before fees and expenses, to the total return of the ICE BofA 1-5 Year US Inflation-Linked Treasury Index.\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the ICE BofA 1-5 Year US Inflation-Linked Treasury Index (the \"underlying index\"). The underlying index is an unmanaged index comprised of Treasury Inflation-Protected Securities (\"TIPS\") with a maturity of at least 1 year and less than 5 years.",
        "category": "Inflation-Protected Bond",
        "family": "PIMCO",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 828784320
    },
    "TDTF": {
        "short_name": "FlexShares iBoxx 5 Year Target ",
        "long_name": "FlexShares iBoxx 5-Year Target Duration TIPS Index Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the iBoxx 5-Year Target Duration TIPS Index.\n The underlying index reflects the performance of a selection of inflation protected public obligations of the U.S. treasury, commonly known as \"TIPS,\" with a targeted average modified adjusted duration, as defined by the index provider, of approximately five years. Under normal circumstances, the fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the underlying index. The fund is non-diversified.",
        "category": "Inflation-Protected Bond",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 584545280
    },
    "TDTT": {
        "short_name": "FlexShares iBoxx 3 Year Target ",
        "long_name": "FlexShares iBoxx 3-Year Target Duration TIPS Index Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the iBoxx 3-Year Target Duration TIPS Index.\n The underlying index reflects the performance of a selection of inflation protected public obligations of the U.S. treasury, commonly known as \"TIPS,\" with a targeted average modified adjusted duration, as defined by the index provider, of approximately three years. Under normal circumstances, the fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the underlying index. The fund is non-diversified.",
        "category": "Inflation-Protected Bond",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1395662848
    },
    "TIP": {
        "short_name": "iShares TIPS Bond ETF",
        "long_name": "iShares TIPS Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of Bloomberg Barclays U.S. Treasury Inflation Protected Securities (TIPS) Index (Series-L) which composed of inflation-protected U.S. Treasury bonds.\n The fund generally invests at least 90% of its assets in the bonds of the underlying index and at least 95% of its assets in U.S. government bonds. It may invest up to 10% of its assets in U.S. government bonds not included in the underlying index, but which BFA believes will help the fund track the underlying index. It also may invest up to 5% of its assets in repurchase agreements collateralized by U.S. government obligations and in cash and cash equivalents.",
        "category": "Inflation-Protected Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 26081570816
    },
    "TIPZ": {
        "short_name": "PIMCO Broad U.S. TIPS Index Exc",
        "long_name": "PIMCO Broad U.S. TIPS Index Exchange-Traded Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide total return that closely corresponds, before fees and expenses, to the total return of the ICE BofA US Inflation-Linked Treasury Index.\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the ICE BofA US Inflation-Linked Treasury Index (the \"underlying index\"). The underlying index is an unmanaged index comprised of Treasury Inflation-Protected Securities (\"TIPS\").",
        "category": "Inflation-Protected Bond",
        "family": "PIMCO",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 152842240
    },
    "VTIP": {
        "short_name": "Vanguard Short-Term Inflation-P",
        "long_name": "Vanguard Short-Term Inflation-Protected Securities Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Bloomberg Barclays U.S. Treasury Inflation-Protected Securities (TIPS) 0-5 Year Index.\n The index is a market-capitalization-weighted index that includes all inflation-protected public obligations issued by the U.S. Treasury with remaining maturities of less than 5 years. The manager attempts to replicate the target index by investing all, or substantially all, of its assets in the securities that make up the index, holding each security in approximately the same proportion as its weighting in the index.",
        "category": "Inflation-Protected Bond",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 45473460224
    }
}