{"FLGV": {"short_name": "Franklin Liberty U.S. Treasury ", "long_name": "Franklin Liberty U.S. Treasury Bond ETF", "currency": "USD", "summary": "The investment seeks income.\n Under normal market conditions, the fund invests at least 80% of its net assets in direct obligations of the U.S. Treasury, including Treasury bonds, bills and notes, and investments that provide exposure to direct obligations of the U.S. Treasury. It may invest in U.S. Treasury securities of any maturity and intends to primarily focus on U.S. Treasury securities with a remaining maturity of between 1-30 years.", "category": "Intermediate Government", "family": "Franklin Templeton Investments", "exchange": "PCX", "market": "us_market"}, "IEI": {"short_name": "iShares 3-7 Year Treasury Bond ", "long_name": "iShares 3-7 Year Treasury Bond ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the ICE U.S. Treasury 3-7 Year Bond Index (the \"underlying index\").\n The fund generally invests at least 90% of its assets in the bonds of the underlying index and at least 95% of its assets in U.S. government bonds. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity of greater than or equal to three years and less than seven years.", "category": "Intermediate Government", "family": "iShares", "exchange": "NGM", "market": "us_market"}, "MBB": {"short_name": "iShares MBS ETF", "long_name": "iShares MBS ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. MBS Index.\n The fund seeks to track the performance of the underlying index by investing at least 90% of its assets in the securities of the underlying index and in investments that provide substantially similar exposure to securities in the underlying index. The index measures the performance of investment-grade mortgage-backed pass-through securities (\"MBS\") issued or guaranteed by U.S. government agencies.", "category": "Intermediate Government", "family": "iShares", "exchange": "NGM", "market": "us_market"}, "SCHR": {"short_name": "Schwab Intermediate-Term U.S. T", "long_name": "Schwab Intermediate-Term U.S. Treasury ETF", "currency": "USD", "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Bloomberg Barclays US Treasury 3-10 Year Index.\n The fund will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in securities included in the index. The index includes all publicly-issued U.S. Treasury securities that have a remaining maturity of greater than or equal to three years and less than ten years, are rated investment grade, and have $300 million or more of outstanding face value. The securities in the index must be denominated in U.S. dollars and must be fixed-rate and non-convertible.", "category": "Intermediate Government", "family": "Schwab ETFs", "exchange": "PCX", "market": "us_market"}, "VMBS": {"short_name": "Vanguard Mortgage-Backed Securi", "long_name": "Vanguard Mortgage-Backed Securities Index Fund ETF Shares", "currency": "USD", "summary": "The investment seeks to track the performance of a market-weighted mortgage-backed securities index.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. MBS Float Adjusted Index. This index covers U.S. agency mortgage-backed pass-through securities. To be included in the index, pool aggregates must have at least $250 million currently outstanding and a weighted average maturity of at least 1 year. All of the fund&#39;s investments will be selected through the sampling process, and under normal circumstances, at least 80% of the fund&#39;s assets will be invested in bonds included in the index.", "category": "Intermediate Government", "family": "Vanguard", "exchange": "NGM", "market": "us_market"}}