{
    "FLGV": {
        "short_name": "Franklin Liberty U.S. Treasury ",
        "long_name": "Franklin Liberty U.S. Treasury Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks income.\n Under normal market conditions, the fund invests at least 80% of its net assets in direct obligations of the U.S. Treasury, including Treasury bonds, bills and notes, and investments that provide exposure to direct obligations of the U.S. Treasury. It may invest in U.S. Treasury securities of any maturity and intends to primarily focus on U.S. Treasury securities with a remaining maturity of between 1-30 years.",
        "category": "Intermediate Government",
        "family": "Franklin Templeton Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 421896288
    },
    "GNMA": {
        "short_name": "iShares GNMA Bond ETF",
        "long_name": "iShares GNMA Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. GNMA Bond Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index includes fixed-rate MBS issued by GNMA that have 30- or 15-year maturities. The index measures the performance of mortgage-backed pass-through securities issued by GNMA.",
        "category": "Intermediate Government",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 527608192
    },
    "GOVT": {
        "short_name": "iShares U.S. Treasury Bond ETF",
        "long_name": "iShares U.S. Treasury Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE U.S. Treasury Core Bond Index (the \"underlying index\").\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the index. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity greater than one year and less than or equal to thirty years.",
        "category": "Intermediate Government",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 14607398912
    },
    "IEI": {
        "short_name": "iShares 3-7 Year Treasury Bond ",
        "long_name": "iShares 3-7 Year Treasury Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE U.S. Treasury 3-7 Year Bond Index (the \"underlying index\").\n The fund generally invests at least 90% of its assets in the bonds of the underlying index and at least 95% of its assets in U.S. government bonds. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity of greater than or equal to three years and less than seven years.",
        "category": "Intermediate Government",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 11348513792
    },
    "JMBS": {
        "short_name": "Janus Henderson Mortgage-Backed",
        "long_name": "Janus Henderson Mortgage-Backed Securities ETF",
        "currency": "USD",
        "summary": "The investment seeks a high level of total return consisting of income and capital appreciation.\n The fund seeks to achieve its investment objective by investing mainly in mortgage-related instruments. Under normal circumstances, it will invest at least 80%, and often times substantially all, of its net assets (plus any borrowings for investment purposes) in a portfolio of mortgage-related fixed income instruments of varying maturities. Additionally, the fund may invest in derivatives.",
        "category": "Intermediate Government",
        "family": "Janus Henderson",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 690949440
    },
    "MBB": {
        "short_name": "iShares MBS ETF",
        "long_name": "iShares MBS ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. MBS Index.\n The fund seeks to track the performance of the underlying index by investing at least 90% of its assets in the securities of the underlying index and in investments that provide substantially similar exposure to securities in the underlying index. The index measures the performance of investment-grade mortgage-backed pass-through securities (\"MBS\") issued or guaranteed by U.S. government agencies.",
        "category": "Intermediate Government",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 26462533632
    },
    "MBSD": {
        "short_name": "FlexShares Trust FlexShares Dis",
        "long_name": "FlexShares Disciplined Duration MBS Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the ICE BofA Merrill LynchÂ® Constrained Duration US Mortgage Backed Securities IndexSM.\n The underlying index reflects the performance of a selection of investment-grade U.S. agency residential mortgage backed pass-through securities. The fund generally will invest under normal circumstances at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the underlying index and in \"TBA Transactions\" that represent securities in the underlying index.",
        "category": "Intermediate Government",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 104719688
    },
    "MTGP": {
        "short_name": "WisdomTree Mortgage Plus Bond F",
        "long_name": "WisdomTree Mortgage Plus Bond Fund",
        "currency": "USD",
        "summary": "The investment seeks income and capital appreciation.\n The fund, an actively managed ETF, utilizes an investment process combining both macro and fundamental research by investing, under normal circumstances, at least 80% of its net assets, plus the amount of any borrowings, in mortgage-related debt and other securitized debt. It may invest up to 20% of its net assets, plus the amount of any borrowings, in other securitized credit securities such as non-agency or privately issued residential and commercial mortgage-backed securities, asset-backed securities, collateralized loan obligations and credit risk transfer securities. It is non-diversified.",
        "category": "Intermediate Government",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 35702224
    },
    "SCHR": {
        "short_name": "Schwab Intermediate-Term U.S. T",
        "long_name": "Schwab Intermediate-Term U.S. Treasury ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Bloomberg Barclays US Treasury 3-10 Year Index.\n The fund will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in securities included in the index. The index includes all publicly-issued U.S. Treasury securities that have a remaining maturity of greater than or equal to three years and less than ten years, are rated investment grade, and have $300 million or more of outstanding face value. The securities in the index must be denominated in U.S. dollars and must be fixed-rate and non-convertible.",
        "category": "Intermediate Government",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3993682944
    },
    "SPTI": {
        "short_name": "SPDR Portfolio Intermediate Ter",
        "long_name": "SPDR Portfolio Intermediate Term Treasury ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance of the Bloomberg Barclays 3-10 Year U.S. Treasury Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of intermediate term (3-10 years) public obligations of the U.S. Treasury.",
        "category": "Intermediate Government",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2999842304
    },
    "VGIT": {
        "short_name": "Vanguard Intermediate-Term Trea",
        "long_name": "Vanguard Intermediate-Term Treasury Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a market-weighted Treasury index with an intermediate-term dollar-weighted average maturity.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. Treasury 3-10 Year Bond Index. This index includes fixed income securities issued by the U.S. Treasury (not including inflation-protected bonds), with maturities between 3 and 10 years. At least 80% of the fund&#39;s assets will be invested in bonds included in the index.",
        "category": "Intermediate Government",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 11782454272
    },
    "VMBS": {
        "short_name": "Vanguard Mortgage-Backed Securi",
        "long_name": "Vanguard Mortgage-Backed Securities Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a market-weighted mortgage-backed securities index.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. MBS Float Adjusted Index. This index covers U.S. agency mortgage-backed pass-through securities. To be included in the index, pool aggregates must have at least $250 million currently outstanding and a weighted average maturity of at least 1 year. All of the fund&#39;s investments will be selected through the sampling process, and under normal circumstances, at least 80% of the fund&#39;s assets will be invested in bonds included in the index.",
        "category": "Intermediate Government",
        "family": "Vanguard",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 16237455360
    }
}