{
    "BBJP": {
        "short_name": "JPMorgan BetaBuilders Japan ETF",
        "long_name": "JPMorgan BetaBuilders Japan ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the MorningstarÂ® Japan Target Market Exposure IndexSM.\n The fund will invest at least 80% of its assets in securities included in the underlying index. The underlying index is a free float adjusted market capitalization weighted index which consists of stocks traded primarily on the Tokyo Stock Exchange or the Nagoya Stock Exchange. The fund may invest up to 20% of its assets in exchange-traded futures and forward foreign currency contracts to seek performance that corresponds to the underlying index.",
        "category": "Japan Stock",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market"
    },
    "DBJP": {
        "short_name": "Xtrackers MSCI Japan Hedged Equ",
        "long_name": "Xtrackers MSCI Japan Hedged Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, of the MSCI Japan US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, of the underlying index, which is designed to track the performance of the Japanese equity market while mitigating exposure to fluctuations between the value of the U.S. dollar and the Japanese yen. It will invest at least 80% of its total assets in component securities (including depositary receipts in respect of such securities) of the underlying index.",
        "category": "Japan Stock",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EWJ": {
        "short_name": "iShares MSCI Japan Index Fund",
        "long_name": "iShares MSCI Japan ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Japan Index.\n The fund will at all times invest at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index primarily consists of stocks traded on the Tokyo Stock Exchange. It will include large- and mid-capitalization companies and may change over time.",
        "category": "Japan Stock",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "EWJE": {
        "short_name": "iShares MSCI Japan Equal Weight",
        "long_name": "iShares MSCI Japan Equal Weighted ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Japan Equal Weighted Index (USD) composed of equal weighted Japanese equities.\n The index is designed to represent an alternative weighting methodology to its market capitalization-weighted parent index, the MSCI Japan Index (the \"parent index\"). The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. It is non-diversified.",
        "category": "Japan Stock",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "EWJV": {
        "short_name": "iShares MSCI Japan Value ETF",
        "long_name": "iShares MSCI Japan Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Japan Value Index (USD).\n The index is a free float weighted index consisting of large- and mid- capitalization Japanese securities exhibiting overall value style characteristics. The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
        "category": "Japan Stock",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "GSJY": {
        "short_name": "Goldman Sachs ActiveBeta Japan ",
        "long_name": "Goldman Sachs ActiveBeta Japan Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the Goldman Sachs ActiveBetaÂ® Japan Equity Index (the \"index\").\n The index is designed to deliver exposure to equity securities of Japanese issuers. The fund seeks to achieve its investment objective by investing at least 80% of its assets (exclusive of collateral held from securities lending) in securities included in its underlying index, in depositary receipts representing securities included in its underlying index and in underlying stocks in respect of depositary receipts included in its underlying index.",
        "category": "Japan Stock",
        "family": "Goldman Sachs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HJPX": {
        "short_name": "iShares Currency Hedged JPX-Nik",
        "long_name": "iShares Currency Hedged JPX-Nikkei 400 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the JPX-Nikkei 400 Net Total Return USD Hedged Index.\n The fund generally will invest at least 80% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is composed of broad-based Japanese equities while mitigating exposure to fluctuations between the value of the Japanese yen and the U.S. dollar.",
        "category": "Japan Stock",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "JPN": {
        "short_name": "Xtrackers Japan JPX-Nikkei 400 ",
        "long_name": "Xtrackers Japan JPX-Nikkei 400 Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the JPX-Nikkei 400 Index.\n The index is designed to track the performance of equity securities of issuers who are primarily listed on the following sections of Tokyo Stock Exchange (\"TSE\"): the 1st section, the 2nd section, Mothers or JASDAQ. The fund will invest at least 80% of its total assets in component securities of the underlying index.",
        "category": "Japan Stock",
        "family": "Xtrackers",
        "exchange": "PCX",
        "market": "us_market"
    },
    "JPXN": {
        "short_name": "iShares JPX-Nikkei 400 ETF",
        "long_name": "iShares JPX-Nikkei 400 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the JPX-Nikkei Index 400 composed of Japanese equities.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index may include large-, mid- or small-capitalization companies. The currency of the component securities of the underlying index is the Japanese yen (\"JPY\").",
        "category": "Japan Stock",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SCJ": {
        "short_name": "iShares MSCI Japan Sm Cap",
        "long_name": "iShares MSCI Japan Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI Japan Small Cap Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities of small-capitalization companies in Japan.",
        "category": "Japan Stock",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ZJPN": {
        "short_name": "SPDR Solactive Japan ETF",
        "long_name": "SPDR Solactive Japan ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Solactive GBS Japan Large & Mid Cap Index USD Index NTR.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a free float-adjusted market capitalization index that is designed to measure the equity market performance of large- and mid-cap companies in Japan.",
        "category": "Japan Stock",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    }
}