{
    "ABEQ": {
        "short_name": "Absolute Core Strategy ETF",
        "long_name": "Absolute Core Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks positive absolute returns.\n The fund&#39;s investment sub-adviser (the \"Subadviser\"), seeks to achieve it&#39;s objective by investing primarily in equity securities of U.S. companies that the Subadviser believes are priced at a substantial discount to the Subadviser&#39;s estimate of fair value. The fund may invest in companies of any market capitalization and in any economic sector, including equity securities of foreign companies that trade on U.S. exchanges, either directly or through American Depositary Receipts (\"ADRs\"). It is non-diversified.",
        "category": "Large Value",
        "family": "Absolute Investment Advisers",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 47938568
    },
    "AFLG": {
        "short_name": "First Trust Active Factor Large",
        "long_name": "First Trust Active Factor Large Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide capital appreciation.\n Under normal market conditions, the fund will invest at least 80% of its net assets (including investment borrowings) in U.S.-listed equity securities issued by large capitalization companies. The manager defines large capitalization companies as those that, at the time of investment, have a minimum market capitalization equal to or greater than the minimum market capitalization of a widely recognized index of large capitalization companies based upon the composition of the index at the time of investment. It is non-diversified.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 7463054
    },
    "BUFF": {
        "short_name": "Innovator Laddered Fund of S&P ",
        "long_name": "Innovator Laddered Fund of S&P 500 Power Buffer ETFs",
        "currency": "USD",
        "summary": "The investment seeks investment results that generally correspond (before fees and expenses) to the performance of the Refinitiv Laddered Power Buffer Strategy Index.\n The fund will invest at least 80% of its net assets (including investment borrowing) in the exchange-traded funds (\"ETFs\") that comprise the index. The index is composed of the shares of twelve Innovator S&P 500 Power Buffer ETFs. The fund, in accordance with the index, will be continuously invested in each of the underlying ETFs and will rebalance semi-annually by purchasing and selling the underlying ETFs to equally weight the underlying ETFs. It is non-diversified.",
        "category": "Large Value",
        "family": "Innovator ETFs",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 45085856
    },
    "CAPE": {
        "short_name": "iPath Shiller CAPE ETN",
        "long_name": "Barclays ETN+ Shiller Capet ETN",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, the Shiller Barclays CAPETM US Core Sector Index.\n The index seeks to provide a notional long exposure to the top four relatively undervalued U.S. equity sectors that also exhibit relatively strong price momentum. It incorporates the CAPE (Cyclically Adjusted Price Earnings) ratio to assess equity market valuations of nine sectors on a monthly basis and to identify the relatively undervalued sectors represented in the S&P 500Â®.",
        "category": "Large Value",
        "family": "Milleis Investissements Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 341154112
    },
    "CDL": {
        "short_name": "VictoryShares US Large Cap High",
        "long_name": "VictoryShares US Large Cap High Div Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory US Large Cap High Dividend 100 Volatility Weighted Index.\n The fund seeks to achieve its investment objective by investing at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory US Large Cap High Dividend 100 Volatility Weighted Index. The index universe begins with the stocks included in the Nasdaq Victory US Large Cap 500 Volatility Weighted Index, a volatility weighted index comprised of the 500 largest U.S. companies by market capitalization with positive earnings in each of the four most recent quarters.",
        "category": "Large Value",
        "family": "Victory Capital",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 210381040
    },
    "CFCV": {
        "short_name": "ClearBridge Focus Value ETF",
        "long_name": "Clearbridge Focus Value ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n Under normal circumstances, the fund will invest at least 80% of its net assets in equity securities, or other exchange-traded investments with similar economic characteristics in which it is permitted to invest, of companies with large market capitalizations. It will only invest in instruments that trade on a U.S. exchange contemporaneously with the fund&#39;s shares and, for temporary or defensive purposes, in cash and cash equivalents.",
        "category": "Large Value",
        "family": "Franklin Templeton Investments",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 3418909
    },
    "CLRG": {
        "short_name": "IQ Chaikin U.S. Large Cap ETF",
        "long_name": "IQ Chaikin U.S. Large Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that track (before fees and expenses) the price and yield performance of the Nasdaq Chaikin Power US Large Cap Index (the \"underlying index\").\n The underlying index is an equally weighted index of large-capitalization securities. The fund generally will invest in all of the securities that comprise its underlying index in proportion to their weightings in the underlying index. It invests, under normal circumstances, at least 80% of the value of its assets (net assets plus the amount of any borrowings for investment purposes) in securities of large-capitalization U.S. issuers.",
        "category": "Large Value",
        "family": "IndexIQ",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 290389664
    },
    "COWZ": {
        "short_name": "Pacer US Cash Cows 100 ETF",
        "long_name": "Pacer US Cash Cows 100 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer US Cash Cows 100 Index (the \"index\").\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index. The index uses an objective, rules-based methodology to provide exposure to large and mid-capitalization U.S. companies with high free cash flow yields. Companies with high free cash flow yields are commonly referred to as \"cash cows\".",
        "category": "Large Value",
        "family": "Pacer",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 257612144
    },
    "DBLV": {
        "short_name": "AdvisorShares DoubleLine Value ",
        "long_name": "AdvisorShares DoubleLine Value Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to generate long-term capital appreciation.\n The fund is an actively managed exchange-traded fund that seeks to achieve its investment objective by primarily investing in the broad U.S. equity market. The fund invests at least 80% of its net assets (plus any borrowings for investment purposes) in equity securities.",
        "category": "Large Value",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 44493496
    },
    "DGRO": {
        "short_name": "iShares Core Dividend Growth ET",
        "long_name": "iShares Core Dividend Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Dividend Growth IndexSM.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index. The underlying index is a subset of the MorningstarÂ® US Market IndexSM, which is a diversified broad market index that represents approximately 97% of the market capitalization of publicly-traded U.S. stocks.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 18385700864
    },
    "DHS": {
        "short_name": "WisdomTree U.S. High Dividend F",
        "long_name": "WisdomTree U.S. High Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. High Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of companies with high dividend yields selected from the WisdomTree U.S. Dividend Index. The fund is non-diversified.",
        "category": "Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 774034432
    },
    "DIA": {
        "short_name": "SPDR Dow Jones Industrial Avera",
        "long_name": "SPDR Dow Jones Industrial Average ETF Trust",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of the Dow Jones Industrial Average (the â\u0080\u009cDJIAâ\u0080\u009d).\n The Trust seeks to achieve its investment objective by holding a portfolio of the common stocks that are included in the DJIA (the â\u0080\u009cPortfolioâ\u0080\u009d), with the weight of each stock in the Portfolio substantially corresponding to the weight of such stock in the DJIA.",
        "category": "Large Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 29874159616
    },
    "DJD": {
        "short_name": "Invesco Dow Jones Industrial Av",
        "long_name": "Invesco Dow Jones Industrial Average Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dow Jones Industrial Average Yield Weighted (the \"underlying index\").\n The fund will generally invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is designed to provide exposure to dividend-paying equity securities of companies included in the Dow Jones Industrial Averageâ\u0084¢, which is a price-weighted index of 30 U.S. companies that meet certain size, listing and liquidity requirements. The fund is non-diversified.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 126218632
    },
    "DLN": {
        "short_name": "WisdomTree U.S. LargeCap Divide",
        "long_name": "WisdomTree U.S. LargeCap Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. LargeCap Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the large-capitalization segment of the U.S. dividend-paying market. The fund is non-diversified.",
        "category": "Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2823467008
    },
    "DURA": {
        "short_name": "VanEck Vectors Morningstar Dura",
        "long_name": "VanEck Vectors Morningstar Durable Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MorningstarÂ® US Dividend Valuation IndexSM (the \"index\").\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of securities of companies with a high dividend yield, strong financial health and an attractive uncertainty-adjusted valuation. The fund is non-diversified.",
        "category": "Large Value",
        "family": "VanEck",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 46774988
    },
    "EDOW": {
        "short_name": "First Trust Dow 30 Equal Weight",
        "long_name": "First Trust Dow 30 Equal Weight ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield of an equity index called the Dow Jones Industrial Average Equal Weight Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is the equal weight version of the Dow Jones Industrial Average (the \"DJIA\"). The DJIA is composed of 30 securities issued by blue-chip U.S. companies covering all industries, with the exception of transportation and utilities.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 97624120
    },
    "EQRR": {
        "short_name": "ProShares Equities for Rising R",
        "long_name": "ProShares Equities for Rising Rates ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the Nasdaq U.S. Large Cap Equities for Rising Rates Index (the \"index\").\n The fund invests in securities that ProShare Advisors believes, in combination, should track the performance of the index. Under normal circumstances, the fund will invest at least 80% of its total assets in component securities. The index consists of 50 companies whose stock prices historically have tended to outperform the Universe during periods of rising interest rates.",
        "category": "Large Value",
        "family": "ProShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 2191949
    },
    "ERM": {
        "short_name": "EquityCompass Risk Manager ETF",
        "long_name": "EquityCompass Risk Manager ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide long term capital appreciation with capital preservation as a secondary objective.\n The fund seeks to achieve its investment objectives by investing in equity securities of companies domiciled in the U.S. or listed on a U.S. securities exchange. The fund&#39;s strategy seeks to provide exposure to U.S. listed equity securities and to avoid large, prolonged market losses and reduce volatility. It may invest all or a portion of its assets in cash, cash equivalents, money market funds and/or short-term fixed income ETFs.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 10998329
    },
    "FBCV": {
        "short_name": "Fidelity Blue Chip Value ETF",
        "long_name": "Fidelity Blue Chip Value ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term growth of capital.\n Normally the fund invests at least 80% of assets in blue chip companies (companies that, in Fidelity Management & Research Company LLC&#39;s (FMR) view, are well-known, well-established and well-capitalized), which generally have large or medium market capitalizations. It invests in companies that manager believes are undervalued in the marketplace in relation to factors such as assets, sales, earnings, growth potential, or cash flow, or in relation to securities of other companies in the same industry (stocks of these companies are often called \"value\" stocks). The fund is non-diversified.",
        "category": "Large Value",
        "family": "Fidelity Investments",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 75042392
    },
    "FDL": {
        "short_name": "First Trust Morningstar ETF",
        "long_name": "First Trust Morningstar Dividend Leaders Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the MorningstarÂ® Dividend Leaders IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to measure the performance of the 100 highest-yielding stocks that have a consistent record of dividend payment and have the ability to sustain their dividend payments. It is non-diversified.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1662533120
    },
    "FDRR": {
        "short_name": "Fidelity Dividend ETF for Risin",
        "long_name": "Fidelity Dividend ETF for Rising Rates",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the Fidelity Dividend Index for Rising Ratesâ\u0084 .\n The fund normally invests at least 80% of assets in securities included in the underlying index and in depository receipts representing securities included in the underlying index. The underlying index is designed to reflect the performance of stocks of large and mid-capitalization dividend-paying companies that are expected to continue to pay and grow their dividends and have a positive correlation of returns to increasing 10-year U.S. Treasury yields.",
        "category": "Large Value",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 386965664
    },
    "FDVV": {
        "short_name": "Fidelity High Dividend ETF",
        "long_name": "Fidelity High Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the Fidelity High Dividend Indexâ\u0084 .\n The fund normally invests at least 80% of assets in securities included in the underlying index and in depository receipts representing securities included in the underlying index. The underlying index is designed to reflect the performance of stocks of large and mid-capitalization high-dividend-paying companies that are expected to continue to pay and grow their dividends.",
        "category": "Large Value",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 769976320
    },
    "FLV": {
        "short_name": "American Century Focused Large ",
        "long_name": "American Century Focused Large Cap Value ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital growth.\n Under normal market conditions, the portfolio managers will invest at least 80% of the fund&#39;s assets in securities of large capitalization companies. The portfolio managers may sell stocks from the fund&#39;s portfolio if they believe a stock no longer meets their valuation criteria, a stock&#39;s risk parameters outweigh its return opportunity, more attractive alternatives are identified or specific events alter a stock&#39;s prospects.",
        "category": "Large Value",
        "family": "American Century Investments",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 198314848
    },
    "FNDB": {
        "short_name": "Schwab Fundamental U.S. Broad M",
        "long_name": "Schwab Fundamental U.S. Broad Market Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Russell RAFIâ\u0084¢ US Index.\n The fund will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in stocks included in the index. The index measures the performance of the constituent companies by fundamental overall company scores (scores), which are created using as the universe the U.S. companies in the FTSE Global Total Cap Index (the parent index). It may invest up to 10% of its net assets in securities not included in the index.",
        "category": "Large Value",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 348460064
    },
    "FNDX": {
        "short_name": "Schwab Fundamental U.S. Large C",
        "long_name": "Schwab Fundamental U.S. Large Company Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Russell RAFIâ\u0084¢ US Large Company Index.\n The fund normally will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in stocks included in the index. The index measures the performance of the large company size segment by fundamental overall company scores (scores), which are created using as the universe the U.S. companies in the FTSE Global Total Cap Index (the parent index).",
        "category": "Large Value",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6700401152
    },
    "FTA": {
        "short_name": "First Trust Large Cap Value Alp",
        "long_name": "First Trust Large Cap Value AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Large Cap Value Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select value stocks from the NASDAQ US 500 Large Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 989040960
    },
    "FVAL": {
        "short_name": "Fidelity Value Factor ETF",
        "long_name": "Fidelity Value Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the Fidelity U.S. Value Factor Indexâ\u0084 .\n The fund normally invests at least 80% of assets in securities included in the Fidelity U.S. Value Factor Indexâ\u0084 , which is designed to reflect the performance of stocks of large and mid-capitalization U.S. companies that have attractive valuations. It may lend securities to earn income for the fund.",
        "category": "Large Value",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 287880992
    },
    "FVD": {
        "short_name": "First Trust VL Dividend",
        "long_name": "First Trust Value Line Dividend Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Value LineÂ® Dividend Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index seeks to measure the performance of the securities ranked #1 or #2 according to the index provider&#39;s proprietary Value LineÂ® Safetyâ\u0084¢ Ranking System (the \"Safety Ranking System\") that are also still expected to provide above-average dividend yield.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 11451176960
    },
    "HDV": {
        "short_name": "iShares Core High Dividend ETF",
        "long_name": "iShares Core High Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MorningstarÂ® Dividend Yield Focus IndexSM composed of relatively high dividend paying U.S. equities.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is comprised of qualified income paying securities that are screened for superior company quality and financial health as determined by Morningstar, Inc.&#39;s (\"Morningstar\" or the \"index provider\") proprietary index methodology. The fund is non-diversified.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6839327232
    },
    "ILCV": {
        "short_name": "iShares Morningstar Large-Cap  ",
        "long_name": "iShares Morningstar Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Large-Mid Cap Broad Value IndexSM composed of large-and mid-capitalization U.S. equities that exhibit value characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by large-mid capitalization companies that have exhibited above-average â\u0080\u009cvalueâ\u0080\u009d characteristics as determined by Morningstar, Inc.â\u0080\u0099s (â\u0080\u009cMorningstarâ\u0080\u009d or the â\u0080\u009cindex providerâ\u0080\u009d) proprietary index methodology.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 650675072
    },
    "IUSV": {
        "short_name": "iShares Core S&P U.S. Value ETF",
        "long_name": "iShares Core S&P U.S. Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P 900 Value Index (the \"underlying index\"), which measures the performance of the large- and mid-capitalization value sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 8239393792
    },
    "IVE": {
        "short_name": "iShares S&P 500 Value ETF",
        "long_name": "iShares S&P 500 Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P 500 Value IndexTM, which measures the performance of the large-capitalization value sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 19373453312
    },
    "IWD": {
        "short_name": "iShares Russell 1000 Value ETF",
        "long_name": "iShares Russell 1000 Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell 1000Â® Value Index (the \"underlying index\"), which measures the performance of large- and mid- capitalization value sectors of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 51047985152
    },
    "IWX": {
        "short_name": "iShares Russell Top 200 Value E",
        "long_name": "iShares Russell Top 200 Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell Top 200 Value Index, which measures the performance of the largest capitalization value sector of the U.S. equity market.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, including shares of money market funds advised by BFA or its affiliates, as well as in securities not included in the underlying index, but which BFA believes will help the fund track the underlying index.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1057910400
    },
    "JDIV": {
        "short_name": "JPMorgan U.S. Dividend ETF",
        "long_name": "JPMorgan U.S. Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the JP Morgan US Dividend Index.\n The fund will invest at least 80% of its assets in securities included in the underlying index. \"Assets\" means net assets, plus the amount of borrowing for investment purposes. The underlying index is comprised of higher yielding U.S. equity securities.",
        "category": "Large Value",
        "family": "JPMorgan",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 21682084
    },
    "JVAL": {
        "short_name": "JPMorgan U.S. Value Factor ETF",
        "long_name": "JPMorgan U.S. Value Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the JP Morgan US Value Factor Index.\n The fund will invest at least 80% of its assets in securities included in the underlying index. \"Assets\" means net assets, plus the amount of borrowing for investment purposes. The underlying index is comprised of U.S. equity securities selected to represent value factor characteristics.",
        "category": "Large Value",
        "family": "JPMorgan",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 680655424
    },
    "LVHD": {
        "short_name": "Legg Mason Low Volatility High ",
        "long_name": "Legg Mason Low Volatility High Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the QS Low Volatility High Dividend Index composed of equity securities of U.S. companies with relatively high yield and low price and earnings volatility.\n The index is composed of stocks of U.S. companies across a wide range of market capitalizations, including the largest 3,000 U.S. stocks as determined by the Solactive US Broad Market Index. The fund will invest at least 80% of its net assets, plus borrowings for investment purposes, if any, in securities that compose the index.",
        "category": "Large Value",
        "family": "Franklin Templeton Investments",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 737598080
    },
    "MAGA": {
        "short_name": "Point Bridge GOP Stock Tracker ",
        "long_name": "Point Bridge GOP Stock Tracker ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the Point Bridge GOP Stock Tracker Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets will be invested in the component securities of the index. The index uses an objective, rules-based methodology to track the performance of companies whose employees and political action committees are highly supportive of Republican candidates for election to the United States Congress, the Vice Presidency, or the Presidency (\"Candidates\") and party-affiliated federal committees or groups that are subject to federal campaign contribution limits.",
        "category": "Large Value",
        "family": "Point Bridge Capital",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 10435559
    },
    "MGV": {
        "short_name": "Vanguard Mega Cap Value ETF",
        "long_name": "Vanguard Mega Cap Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Mega Cap Value Index. The index is a float-adjusted, market-capitalization-weighted index designed to measure equity market performance of mega-capitalization value stocks in the United States. The Advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Large Value",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4450708480
    },
    "NVQ": {
        "short_name": "QRAFT AI-Enhanced US Next Value",
        "long_name": "QRAFT AI-Enhanced U.S. Next Value ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation.\n Under normal circumstances, the fund will invest at least 80% of its net assets, plus the amounts of any borrowings for investment purposes, in securities of U.S.-listed companies. Currently, the Advisor expects to invest a significant portion of its assets in the securities of companies in the consumer discretionary sector, although this may change from time to time. The fund is non-diversified.",
        "category": "Large Value",
        "family": "Exchange Traded Concepts",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3677072
    },
    "OUSA": {
        "short_name": "OShares U.S. Quality Dividend E",
        "long_name": "O’Shares U.S. Quality Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance (before fees and expenses) of the O&#39;Shares U.S. Quality Dividend Index.\n The target index is designed to measure the performance of publicly listed large-capitalization and mid-capitalization dividend-paying issuers in the United States that meet certain market capitalization, liquidity, high quality, low volatility and dividend yield thresholds, as determined by O&#39;Shares Investment Advisers, LLC (the \"index provider\"). Under normal market conditions, the fund will invest at least 80% of its total assets in the components of the target index.",
        "category": "Large Value",
        "family": "O&#39;Shares Investments",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 591677056
    },
    "PFM": {
        "short_name": "Invesco Dividend Achievers ETF",
        "long_name": "Invesco Dividend Achievers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ US Broad Dividend AchieversTM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, Nasdaq, Inc. (\"Nasdaq\" or the \"index provider\") includes common stock in the underlying index pursuant to a proprietary selection methodology that identifies a universe of \"Dividend AchieversTM.\"",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 614933120
    },
    "PKW": {
        "short_name": "Invesco BuyBack Achievers ETF",
        "long_name": "Invesco BuyBack Achievers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ US BuyBack AchieversTM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The NASDAQ includes common stocks in the underlying index pursuant to a proprietary selection methodology that identifies a universe of \"BuyBack Achievers TM\".",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 1844045568
    },
    "PRF": {
        "short_name": "Invesco FTSE RAFI US 1000 ETF",
        "long_name": "Invesco FTSE RAFI US 1000 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the FTSE RAFIâ\u0084¢ US 1000 Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of 1,000 common stocks that FTSE International Limited and Research Affiliates LLC strictly in accordance with their guidelines and mandated procedures, include to track the performance of the largest U.S. companies based on the following four fundamental measures: book value, cash flow, sales and dividends.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5110559744
    },
    "PWV": {
        "short_name": "Invesco Dynamic Large Cap Value",
        "long_name": "Invesco Dynamic Large Cap Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Large Cap Value IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of large-capitalization U.S. value stocks that the Intellidex Provider includes principally on the basis of their capital appreciation potential.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 736454144
    },
    "QDEF": {
        "short_name": "FlexShares Quality Dividend Def",
        "long_name": "FlexShares Quality Dividend Defensive Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the Northern Trust Quality Dividend Defensive IndexSM.\n The underlying index is designed to reflect the performance of a selection of companies that, in aggregate, possess greater financial strength and stability characteristics relative to the Northern Trust 1250 Index, a float-adjusted market-capitalization weighted index of U.S. domiciled large- and mid-capitalization companies. The fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the underlying index.",
        "category": "Large Value",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 495668224
    },
    "QDF": {
        "short_name": "FlexShares Quality Dividend Ind",
        "long_name": "FlexShares Quality Dividend Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the Northern Trust Quality Dividend IndexSM.\n The index is designed to reflect the performance of a selection of companies that, in aggregate, possess greater financial strength and stability characteristics relative to the Northern Trust 1250 Index, a float-adjusted market-capitalization weighted index of U.S. domiciled large- and mid-capitalization companies. Under normal circumstances, the fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the index.",
        "category": "Large Value",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1482823808
    },
    "QDIV": {
        "short_name": "Global X S&P 500 Quality Divide",
        "long_name": "Global X S&P 500 Quality Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the S&P 500Â® Quality High Dividend Index (\"underlying index\").\n The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to U.S. equity securities included in the S&P 500Â® Index that exhibit high quality and dividend yield characteristics, as determined by Standard & Poor&#39;s Financial Services LLC, the provider of the underlying index (the \"index provider\"). The fund is non-diversified.",
        "category": "Large Value",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 7380973
    },
    "QDYN": {
        "short_name": "FlexShares Quality Dynamic Inde",
        "long_name": "FlexShares Quality Dividend Dynamic Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the Northern Trust Quality Dividend Dynamic IndexSM.\n The underlying index is designed to reflect the performance of a selection of companies that, in aggregate, possess greater financial strength and stability characteristics relative to the Northern Trust 1250 Index, a float-adjusted market-capitalization weighted index of U.S. domiciled large- and mid-capitalization companies. The fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the index.",
        "category": "Large Value",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15926065
    },
    "QSY": {
        "short_name": "WisdomTree U.S. Quality Shareho",
        "long_name": "WisdomTree U.S. Quality Shareholder Yield Fund",
        "currency": "USD",
        "summary": "The investment seeks income and capital appreciation.\n The fund, an exchange traded fund, is actively managed using a model-based approach. It seeks to achieve its investment objective by investing primarily in U.S. equity securities that provide a high \"total shareholder yield\" and exhibit favorable quality characteristics that demonstrate a company&#39;s profitability, such as strong ROE and/or ROA. The fund invests primarily in equity securities of companies domiciled in the U.S. or listed on a U.S. exchange. The advisor generally expects to invest in large- and mid-capitalization companies and may invest in any sector. The fund is non-diversified.",
        "category": "Large Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 58440620
    },
    "RDIV": {
        "short_name": "Invesco Exchange-Traded Fund Tr",
        "long_name": "Invesco S&P Ultra Dividend Revenue ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P 900Â® Dividend Revenue-Weighted Index.\n The fund will invest at least 90% of its total assets in the securities that comprise the index. The index provider maintains and calculates the index, which is designed to measure the performance of positive revenue-producing constituent securities of the parent index. The parent index is comprised of common stocks of approximately 900 mid- and large-cap companies, and is created by combining the S&P 500 Â® Index and S&P MidCap Â® 400 Index to form an investable benchmark for the large- and mid-cap universe of the U.S. equity market. It is non-diversified.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 956813440
    },
    "RDVY": {
        "short_name": "First Trust Rising Dividend Ach",
        "long_name": "First Trust Rising Dividend Achievers ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before fees and expenses) of the NASDAQ US Rising Dividend Achievers Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stock and depositary receipts that comprise the index. The index is designed to provide access to a diversified portfolio of small, mid and large capitalization companies with a history of raising their dividends while exhibiting the characteristics to continue to do so in the future by including companies with strong cash balances, low debt and increasing earnings.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 3872119552
    },
    "RFDA": {
        "short_name": "RiverFront Dynamic US Dividend ",
        "long_name": "RiverFront Dynamic US Dividend Advantage ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide capital appreciation and dividend income.\n The fund invests at least 65% of its net assets in a portfolio of equity securities of publicly traded U.S. companies with the potential for dividend income. Equity securities include common stocks and common or preferred shares of real estate investment trusts. The fund may invest in small-, mid- and large-capitalization companies. It is non-diversified.",
        "category": "Large Value",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 123388784
    },
    "RPV": {
        "short_name": "Invesco S&P 500 Pure Value ETF",
        "long_name": "Invesco S&P 500 Pure Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Pure Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of a subset of securities from the S&P 500Â® Index that exhibit strong value characteristics.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2032878592
    },
    "RWL": {
        "short_name": "Invesco Exchange-Traded Fund Tr",
        "long_name": "Invesco S&P 500 Revenue ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Revenue-Weighted Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index includes positive revenue producing constituent securities of the S&P 500Â® Index. The fund is non-diversified.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1013634752
    },
    "RWVG": {
        "short_name": "Direxion Russell 1000 Value Ove",
        "long_name": "Direxion Russell 1000 Value Over Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the Russell 1000Â® Value/Growth 150/50 Net Spread Index (the \"index\").\n The index measures the performance of a portfolio that has 150% long exposure to the Russell 1000Â® Value Index (the \"Long Component\") and 50% short exposure to the Russell 1000Â® Growth Index (the \"Short Component\"). The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in securities that comprise the Long Component of the index or shares of exchange-traded funds (â\u0080\u009cETFsâ\u0080\u009d) that track the Long Component of the index. The fund is non-diversified.",
        "category": "Large Value",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 30458668
    },
    "SCHD": {
        "short_name": "Schwab US Dividend Equity ETF",
        "long_name": "Schwab U.S. Dividend Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Dow Jones U.S. Dividend 100â\u0084¢ Index.\n To pursue its goal, the fund generally invests in stocks that are included in the index. The index is designed to measure the performance of high dividend yielding stocks issued by U.S. companies that have a record of consistently paying dividends, selected for fundamental strength relative to their peers, based on financial ratios. The fund invests at least 90% of its net assets in stocks that are included in the index.",
        "category": "Large Value",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23572721664
    },
    "SCHV": {
        "short_name": "Schwab U.S. Large-Cap Value ETF",
        "long_name": "Schwab U.S. Large-Cap Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Dow Jones U.S. Large-Cap Value Total Stock Market Index.\n To pursue its goal, the fund generally invests in stocks that are included in the Dow Jones U.S. Large-Cap Value Total Stock Market Index. The index includes the large-cap value portion of the Dow Jones U.S. Total Stock Market Index actually available to investors in the marketplace. The Dow Jones U.S. Large-Cap Value Total Stock Market Index includes the components ranked 1-750 by full market capitalization and that are classified as \"value\" based on a number of factors.",
        "category": "Large Value",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 9574978560
    },
    "SDGA": {
        "short_name": "Impact Shares Sustainable Devel",
        "long_name": "Impact Shares Sustainable Development Goals Global Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, track the performance of the MorningstarÂ® Societal Development Index.\n The fund will, under normal circumstances, invest at least 80% of its total assets plus any borrowings for investment purposes in component securities of the underlying index. The underlying index is constructed using a rules based methodology to select companies with specific characteristics from the MorningstarÂ® Global Markets Large-Mid Index (parent index). The fund is non-diversified.",
        "category": "Large Value",
        "family": "Impact Shares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4525449
    },
    "SDOG": {
        "short_name": "ALPS Sector Dividend Dogs ETF",
        "long_name": "ALPS Sector Dividend Dogs ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that replicate as closely as possible, before fees and expenses, the performance of the S-NetworkÂ® Sector Dividend Dogs Index.\n The underlying index generally consists of 50 stocks on each annual reconstitution date, which is the third Friday of December each year. The underlying index&#39;s stocks must be constituents of the S&P 500 Index, the leading benchmark index for U.S. large capitalization stocks. The underlying index methodology selects the five stocks in ten of the eleven GICS sectors that make up the S&P 500 which offer the highest dividend yields as of the last business day of November.",
        "category": "Large Value",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1082881152
    },
    "SDY": {
        "short_name": "SPDR S&P Dividend ETF",
        "long_name": "SPDR S&P Dividend ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P High Yield Dividend Aristocrats Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of the highest dividend yielding S&P Composite 1500Â® Index constituents that have followed a managed-dividends policy of consistently increasing dividends every year for at least 20 consecutive years.",
        "category": "Large Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 17140935680
    },
    "SPDV": {
        "short_name": "AAM S&P 500 High Dividend Value",
        "long_name": "AAM S&P 500 High Dividend Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the S&P 500 Dividend and Free Cash Flow Yield Index.\n The index is a rules-based, equal-weighted index that is designed to provide exposure to the constituents of the S&P 500Â® Index that exhibit both high dividend yield and sustainable dividend distribution characteristics, while maintaining diversified sector exposure. At least 80% of the fundâ\u0080\u0099s net assets, plus borrowings for investment purposes, will be invested in equity securities that (i) are included in the S&P 500 Index and (ii) have had a positive indicated annual dividend yield within the past year.",
        "category": "Large Value",
        "family": "AAM",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 28663396
    },
    "SPHD": {
        "short_name": "Invesco S&P 500 High Dividend L",
        "long_name": "Invesco S&P 500 High Dividend Low Volatility ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Low Volatility High Dividend Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, S&P Dow Jones Indices LLC (the â\u0080\u009cindex Providerâ\u0080\u009d) compiles, maintains and calculates the underlying index, which is designed to measure the performance of 50 least volatile high yielding constituents of the S&P 500 Â® Index in the past year.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2909184768
    },
    "SPVM": {
        "short_name": "Invesco S&P 500 Value with Mome",
        "long_name": "Invesco S&P 500 Value with Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® High Momentum Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is designed to track the performance of approximately 100 stocks in the S&P 500Â® Index that have the highest \"value\" and \"momentum\" scores.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 35370608
    },
    "SPVU": {
        "short_name": "Invesco S&P 500 Enhanced Value ",
        "long_name": "Invesco S&P 500 Enhanced Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500 Enhanced Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is designed to track the performance of approximately 100 stocks in the S&P 500Â® Index that have the highest \"value score,\" which the index provider calculates based on fundamental ratios of a company&#39;s stock. A value stock tends to trade at a lower price relative to such fundamentals and thus may be considered undervalued by investors.",
        "category": "Large Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 119081432
    },
    "SPYV": {
        "short_name": "SPDR Series Trust SPDR Portfoli",
        "long_name": "SPDR Portfolio S&P 500 Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P 500 Value Index that tracks the performance of large capitalization exchange traded U.S. equity securities exhibiting \"value\" characteristics.\n The fund employs a sampling strategy in seeking to track the performance of the S&P 500 Value Index. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the large-capitalization value segment of the U.S. equity market.",
        "category": "Large Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 11590807552
    },
    "STLV": {
        "short_name": "iShares Factors US Value Style ",
        "long_name": "iShares Factors US Value Style ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell US Large Cap Factors Value Style Index composed of U.S. large- and mid-capitalization stocks with favorable exposure to target style factors subject to constraints.\n The fund seeks to track the investment results of the Russell US Large Cap Factors Value Style Index. The underlying index is designed to select equity securities from the Russell 1000Â® Value Index, which in turn is a subset of the Russell 1000 Index. It generally will invest at least 90% of its assets in the component securities of the underlying index. The fund is non-diversified.",
        "category": "Large Value",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 7121087
    },
    "SYV": {
        "short_name": "SPDR MFS Systematic Value Equit",
        "long_name": "SPDR MFS Systematic Value Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation.\n Under normal circumstances, the fund invests at least 80% of its net assets (plus the amount of borrowings for investment purposes) in equity securities. Equity securities in which the fund invests include common stocks, preferred stocks, and securities convertible into stocks. In selecting securities for the fund, the Sub-Adviser utilizes a bottom-up approach to buying and selling investments for the fund.",
        "category": "Large Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15626145
    },
    "TERM": {
        "short_name": "EquityCompass Tactical Risk Man",
        "long_name": "EquityCompass Tactical Risk Manager ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide long term capital appreciation with capital preservation as a secondary objective.\n The fund will seek to achieve its investment objectives by investing in equity securities of companies domiciled in the U.S. or listed on a U.S. securities exchange. The fund&#39;s strategy seeks to provide exposure to U.S. listed equity securities and to avoid large, prolonged market losses and reduce volatility. It may also invest in inverse ETFs which seek to provide investment results that match a negative return of the performance of an underlying index like the S&P 500Â® Index.",
        "category": "Large Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 12313627
    },
    "ULVM": {
        "short_name": "VictoryShares USAA MSCI USA Val",
        "long_name": "VictoryShares USAA MSCI USA Value Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the MSCI USA Select Value Momentum Blend Index.\n Under normal circumstances, the fund seeks to achieve its investment objective by investing at least 80% of its assets in securities in the index. The index is designed to deliver exposure to equity securities of large- and mid-capitalization U.S. issuers within the MSCI USA Index (the \"parent index\") that have higher exposure to value and momentum factors, while also maintaining moderate index turnover and lower realized volatility than traditional capitalization-weighted indexes.",
        "category": "Large Value",
        "family": "Victory Capital",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 539537024
    },
    "VALQ": {
        "short_name": "American Century STOXX U.S. Qua",
        "long_name": "American Century STOXX U.S. Quality Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the iSTOXXÂ® American Century USA Quality Value Index (the underlying index).\n Under normal market conditions, the fund invests at least 80% of its assets in the component securities of the underlying index. The underlying index is designed to select securities of large- and mid-capitalization companies that are undervalued or have sustainable income.",
        "category": "Large Value",
        "family": "American Century Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 208069904
    },
    "VETS": {
        "short_name": "Pacer Military Times Best Emplo",
        "long_name": "Pacer Military Times Best Employers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Military Times Best for VetsSM Index (the \"index\").\n Normally at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index in the same approximate weight as such component securities. The index is generally composed of the U.S.-listed stocks of companies that have been included in the Best for Vets List for the last three consecutive years, have a minimum market capitalization of $200 million, and meet the index&#39;s liquidity threshold. The fund is non-diversified.",
        "category": "Large Value",
        "family": "Pacer",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 1737944
    },
    "VLU": {
        "short_name": "SPDR S&P 1500 Value Tilt ETF",
        "long_name": "SPDR S&P 1500 Value Tilt ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P 1500 Low Valuation Tilt Index.\n The fund employs a sampling strategy in seeking to track the index. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index applies an alternative weighting methodology to the S&P Composite 1500 Index so that stocks with relatively low valuations (i.e., relatively \"cheap\") are overweight relative to the S&P Composite 1500 Index and stocks with relatively high valuations are underweight. The fund is non-diversified.",
        "category": "Large Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 175913008
    },
    "VONV": {
        "short_name": "Vanguard Russell 1000 Value ETF",
        "long_name": "Vanguard Russell 1000 Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of large-capitalization value stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the Russell 1000Â® Value Index. The index is designed to measure the performance of large-capitalization value stocks in the United States. The Advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Large Value",
        "family": "Vanguard",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 6380196864
    },
    "VOOV": {
        "short_name": "Vanguard S&P 500 Value ETF",
        "long_name": "Vanguard S&P 500 Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of large-capitalization value stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the S&P 500Â® Value Index, which represents the value companies, as determined by the index sponsor, of the S&P 500 Index. The index measures the performance of large-capitalization value companies in the United States.",
        "category": "Large Value",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2347253248
    },
    "VSMV": {
        "short_name": "VictoryShares US Multi-Factor M",
        "long_name": "VictoryShares US Multi-Factor Minimum Volatility ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory US Multi-Factor Minimum Volatility Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets in securities included in the Nasdaq Victory US Multi-Factor Minimum Volatility Index (the \"index\"). The index utilizes a rules-based approach designed to generate investment returns with less volatility than the broader U.S. market.",
        "category": "Large Value",
        "family": "Victory Capital",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 152688352
    },
    "VTV": {
        "short_name": "Vanguard Value ETF",
        "long_name": "Vanguard Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of large-capitalization value stocks.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Large Cap Value Index, a broadly diversified index predominantly made up of value stocks of large U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Large Value",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 114191532032
    },
    "VYM": {
        "short_name": "Vanguard High Dividend Yield ET",
        "long_name": "Vanguard High Dividend Yield Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of common stocks of companies that are characterized by high dividend yield.\n The fund employs an indexing investment approach designed to track the performance of the FTSE High Dividend Yield Index, which consists of common stocks of companies that pay dividends that generally are higher than average. The adviser attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Large Value",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 46101467136
    },
    "WBIF": {
        "short_name": "WBI BullBear Value 3000 ETF",
        "long_name": "WBI BullBear Value 3000 ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation and the potential for current income, while also seeking to protect principal during unfavorable market conditions.\n The fund will seek to invest in the equity securities of small-capitalization, mid-capitalization, and large capitalization domestic and foreign companies that the sub-advisor to the fund and an affiliate of the advisor, believes display attractive prospects for growth in a company&#39;s intrinsic value, and in other tactical investment opportunities. It may invest up to 50% of its net assets in the securities of issuers in emerging markets.",
        "category": "Large Value",
        "family": "WBI Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 46231080
    },
    "WBIG": {
        "short_name": "WBI BullBear Yield 3000 ETF",
        "long_name": "WBI BullBear Yield 3000 ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation and the potential for current income, while also seeking to protect principal during unfavorable market conditions.\n The fund will seek to invest in the equity securities of small-capitalization, mid-capitalization, and large capitalization domestic and foreign companies that the sub-advisor to the fund and an affiliate of the advisor, believes display attractive prospects for growth in a company&#39;s intrinsic value, and in other tactical investment opportunities. It may invest up to 50% of its net assets in the securities of issuers in emerging markets.",
        "category": "Large Value",
        "family": "WBI Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 44837392
    }
}