{
    "BLV": {
        "short_name": "Vanguard Long-Term Bond ETF",
        "long_name": "Vanguard Long-Term Bond Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Bloomberg Barclays U.S. Long Government/Credit Float Adjusted Index.\n Bloomberg Barclays U.S. Long Government/Credit Float Adjusted Index includes all medium and larger issues of U.S. government, investment-grade corporate, and investment-grade international dollar-denominated bonds that have maturities of greater than 10 years and are publicly issued. All of its investments will be selected through the sampling process, and at least 80% of the fund&#39;s assets will be invested in bonds held in the index.",
        "category": "Long-Term Bond",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ILTB": {
        "short_name": "iShares Core 10  Year USD Bond ",
        "long_name": "iShares Core 10+ Year USD Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. Universal 10+ Year Index (the \"underlying index\").\n The underlying index measures the performance of U.S. dollar-denominated taxable bonds that are rated either investment-grade or high yield with remaining maturities greater than ten years. The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index.",
        "category": "Long-Term Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VCLT": {
        "short_name": "Vanguard Long-Term Corporate Bo",
        "long_name": "Vanguard Long-Term Corporate Bond Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a market-weighted corporate bond index with a long-term dollar-weighted average maturity.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. 10+ Year Corporate Bond Index. This index includes U.S. dollar-denominated, investment-grade, fixed-rate, taxable securities issued by industrial, utility, and financial companies, with maturities greater than 10 years. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in bonds included in the index.",
        "category": "Long-Term Bond",
        "family": "Vanguard",
        "exchange": "NGM",
        "market": "us_market"
    }
}