{
  "EDV": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Vanguard",
    "long_name": "Vanguard Extended Duration Treasury Index Fund ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard Extended Duration Trea",
    "summary": "The investment seeks to track the performance of an index of extended-duration zero-coupon U.S. Treasury securities.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. Treasury STRIPS 20-30 Year Equal Par Bond Index. This index includes zero-coupon U.S. Treasury securities (Treasury STRIPS), which are backed by the full faith and credit of the U.S. government, with maturities ranging from 20 to 30 years. The fund invests by sampling the index. At least 80% of it&#39;s assets will be invested in U.S. Treasury securities held in the index.",
    "total_assets": 2196064256
  },
  "GOVZ": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares 25+ Year Treasury STRIPS Bond ETF",
    "market": "us_market",
    "short_name": "iShares 25  Year Treasury STRIP",
    "summary": "The investment seeks to track the investment results of an index composed of the principal payments of U.S. Treasury bonds (specifically principal âSTRIPSâ, also known as âSeparate Trading of Registered Interest and Principal of Securitiesâ) with remaining maturities of at least 25 years.\n The fund seeks to track the investment results of the ICE BofA Long US Treasury Principal STRIPS Index, which measures the performance of long maturity Separate Trading of Registered Interest and Principal of Securities (âSTRIPSâ) representing the final principal payment of U.S. Treasury bonds. BFA uses a representative sampling indexing strategy to manage the fund.",
    "total_assets": 28853584
  },
  "IEF": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "NMS",
    "family": "iShares",
    "long_name": "iShares 7-10 Year Treasury Bond ETF",
    "market": "us_market",
    "short_name": "iShares 7-10 Year Treasury Bond",
    "summary": "The investment seeks to track the investment results of the ICE U.S. Treasury 7-10 Year Bond Index.\n The fund generally invests at least 90% of its assets in the bonds of the underlying index and at least 95% of its assets in U.S. government bonds. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity of greater than or equal to seven years and less than ten years.",
    "total_assets": 13733128192
  },
  "LGOV": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "PCX",
    "family": "First Trust",
    "long_name": "First Trust Long Duration Opportunities ETF",
    "market": "us_market",
    "short_name": "First Trust Long Duration Oppor",
    "summary": "The investment seeks to generate current income with a focus on preservation of capital.\n Under normal market conditions, the fund will invest at least 80% of its net assets (including investment borrowings) in a portfolio of investment-grade debt securities issued or guaranteed by the U.S. government, its agencies or government-sponsored entities, including publicly-issued U.S. Treasury securities and mortgage-related securities. It may also invest in exchange-traded funds (\"ETFs\") that principally invest in such securities. The fund is non-diversified.",
    "total_assets": 35326144
  },
  "SCHQ": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Schwab ETFs",
    "long_name": "Schwab Long-Term U.S. Treasury ETF",
    "market": "us_market",
    "short_name": "Schwab Long-Term U.S. Treasury ",
    "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Bloomberg Barclays US Long Treasury Index.\n To pursue its goal, the fund generally invests in securities that are included in the index. The index includes all publicly issued, U.S. Treasury securities that have a remaining maturity of ten or more years, are rated investment grade, and have $300 million or more of outstanding face value. It is the fund&#39;s policy that under normal circumstances it will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in securities included in the index.",
    "total_assets": 82829976
  },
  "TBJL": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Innovator ETFs",
    "long_name": "Innovator 20+ Year Treasury Bond Buffer ETF – July",
    "market": "us_market",
    "short_name": "Innovator 20  Year Treasury Bon",
    "summary": "The investment seeks to provide investors with returns that match the price return of the iShares 20+ Year Treasury Bond ETF, up to the upside cap of 9.25% (prior to taking into account management fees and other fees) and 8.57% (after taking into account management fees and other fees) while providing a buffer against the first 9% of iShares 20+ Year Treasury Bond ETF losses, over the period from August 18, 2020 to June 30, 2021.\n The fund invests at least 80% of its net assets in FLexible EXchangeÂ® Options (\"FLEX Options\") that reference the iShares 20+ Year Treasury Bond ETF (the \"Underlying ETF\"). It is non-diversified.",
    "total_assets": 4532256
  },
  "TFJL": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Innovator ETFs",
    "long_name": "Innovator Long Term Treasury Floor ETF - July",
    "market": "us_market",
    "short_name": "Innovator 20  Year Treasury Bon",
    "summary": "The investment seeks to provide investors with returns that match the price return of the iShares 20+ Year Treasury Bond ETF, up to the upside cap of 6.75% (prior to taking into account management fees and other fees) and 6.07% (after taking into account management fees and other fees) while providing a maximum loss of 5% of iShares 20+ Year Treasury Bond ETF losses, over the period from August 18, 2020 to June 30, 2021.\n The fund invests at least 80% of its net assets in FLexible EXchangeÂ® Options (\"FLEX Options\") that reference the iShares 20+ Year Treasury Bond ETF (the \"Underlying ETF\"). It is non-diversified.",
    "total_assets": 11764697
  },
  "TLH": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares 10-20 Year Treasury Bond ETF",
    "market": "us_market",
    "short_name": "iShares 10-20 Year Treasury Bon",
    "summary": "The investment seeks to track the investment results of the ICE U.S. Treasury 10-20 Year Bond Index.\n The fund generally invests at least 90% of its assets in the bonds of its underlying index and at least 95% of its assets in U.S. government bonds. It seeks to track the investment results of the underlying index which measures the performance of public obligations of the U.S. Treasury that have a remaining maturity of greater than or equal to ten years and less than twenty years.",
    "total_assets": 1185779328
  },
  "TLT": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "NGM",
    "family": "iShares",
    "long_name": "iShares 20+ Year Treasury Bond ETF",
    "market": "us_market",
    "short_name": "iShares 20+ Year Treasury Bond ",
    "summary": "The investment seeks to track the investment results of the ICE U.S. Treasury 20+ Year Bond Index (the \"underlying index\").\n The fund generally invests at least 90% of its assets in the bonds of the underlying index and at least 95% of its assets in U.S. government bonds. The underlying index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity greater than or equal to twenty years.",
    "total_assets": 14208894976
  },
  "VGLT": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "NMS",
    "family": "Vanguard",
    "long_name": "Vanguard Long-Term Treasury Index Fund ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard Long-Treasury ETF",
    "summary": "The investment seeks to track the performance of a market-weighted Treasury index with a long-term dollar-weighted average maturity.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. Long Treasury Bond Index. This index includes fixed income securities issued by the U.S. Treasury (not including inflation-protected bonds), with maturities greater than 10 years. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in bonds included in the index.",
    "total_assets": 5864970752
  },
  "ZROZ": {
    "category": "Long Government",
    "currency": "USD",
    "exchange": "PCX",
    "family": "PIMCO",
    "long_name": "PIMCO 25+ Year Zero Coupon U.S. Treasury Index Exchange-Traded Fund",
    "market": "us_market",
    "short_name": "PIMCO 25  Year Zero Coupon U.S.",
    "summary": "The investment seeks to provide total return that closely corresponds, before fees and expenses, to the total return of the ICE BofA Long US Treasury Principal STRIPS Index.\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the ICE BofA Long US Treasury Principal STRIPS Index (the \"underlying index\"). The underlying index is an unmanaged index comprised of long maturity Separate Trading of Registered Interest and Principal of Securities (\"STRIPS\") representing the final principal payment of U.S. Treasury bonds.",
    "total_assets": 286753376
  }
}
