{
    "DBMF": {
        "short_name": "iM DBi Managed Futures Strategy",
        "long_name": "iM DBi Managed Futures Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n The fund seeks to achieve its objective by: (i) investing its assets pursuant to managed futures strategy; (ii) allocating up to 20% of its total assets in its wholly-owned subsidiary, which is organized under the laws of the Cayman Islands, is advised by the Sub-Adviser, and will comply with the fund&#39;s investment objective and investment policies; and (iii) investing directly in select debt instruments for cash management and other purposes. It is non-diversified.",
        "category": "Managed Futures",
        "family": "iM Global Partner (US)",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 32880416
    },
    "FMF": {
        "short_name": "First Trust Managed Futures Str",
        "long_name": "First Trust Managed Futures Strategy Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with positive returns.\n The fund is an actively managed exchange-traded fund that seeks to achieve positive returns that are not directly correlated to broad market equity or fixed income returns. Under normal market conditions, the fund and a wholly-owned subsidiary of the fund organized under the laws of the Cayman Islands, invest significantly in a portfolio of exchange-listed futures.",
        "category": "Managed Futures",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 49352500
    },
    "FUT": {
        "short_name": "ProShares Managed Futures Strat",
        "long_name": "ProShares Managed Futures Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide positive returns that are not directly correlated to broad equity or fixed income markets.\n Under normal market conditions, the fund invests in a portfolio of commodity futures contracts and currency and U.S. Treasury futures contracts. The Advisor attempts to capture the economic benefit derived from rising and declining trends based on the price changes of these Futures Contracts. It will also hold cash or cash equivalents such as short-term U.S. Treasury securities or other high credit quality, short-term fixed-income or similar securities for direct investment or as collateral for Futures Contracts. It is non-diversified.",
        "category": "Managed Futures",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 4716487
    },
    "KMLM": {
        "short_name": "KFA Mount Lucas Index Strategy ",
        "long_name": "KFA Mount Lucas Index Strategy ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide a total return that, before fees and expenses, exceeds that of the KFA MLM Index over a complete market cycle.\n The fund seeks to achieve its goal by investing under normal circumstances in commodity, currency, and global fixed income futures contracts traded on U.S. and foreign exchanges that are the same as or similar to those included in the index and debt instruments. The index is a modified version of the MLM Index, which is an index constructed of a portfolio of commodity, currency, and global fixed income futures contracts traded on U.S. and foreign exchanges using a trend following methodology. It is non-diversified.",
        "category": "Managed Futures",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 29418454
    },
    "WTMF": {
        "short_name": "WisdomTree Managed Futures Stra",
        "long_name": "WisdomTree Managed Futures Strategy Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with positive total returns in rising or falling markets.\n The fund normally invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in \"managed futures\". It is an actively managed exchange traded fund (\"ETF\") that seeks to achieve positive total returns in rising or falling markets that are not directly correlated to broad market equity or fixed income returns. The fund is managed using a quantitative, rules-based strategy designed to provide returns that correspond to the performance of the WisdomTree Managed Futures Index. It is non-diversified.",
        "category": "Managed Futures",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 122751688
    }
}