{
    "ARB": {
        "short_name": "AltShares Merger Arbitrage ETF",
        "long_name": "AltShares Merger Arbitrage ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of its underlying index, the Water Island Merger Arbitrage USD Hedged Index.\n The fund seeks to track the performance of the index, which is designed to reflect a global merger arbitrage strategy. Under normal market conditions, it will invest at least 80% of its net assets (including borrowings for investment purposes) in the constituents of the index and in financial instruments with economic characteristics similar to such constituents such as swaps on such constituents. The fund is non-diversified.",
        "category": "Market Neutral",
        "family": "AltShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BTAL": {
        "short_name": "AGFiQ U.S. Market Neutral Anti-",
        "long_name": "AGFiQ U.S. Market Neutral Anti-Beta Fund",
        "currency": "USD",
        "summary": "The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Anti-Beta Index.\n The fund invests at least 80% of its net assets in common stock of the long positions in the underlying index and sells short at least 80% of the short positions in the underlying index. The underlying index is a long/short market neutral index that is dollar-neutral. As such, it identifies long and short securities positions of approximately equal dollar amounts.",
        "category": "Market Neutral",
        "family": "AGFiQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "CHEP": {
        "short_name": "AGFiQ U.S. Market Neutral Value",
        "long_name": "AGFiQ U.S. Market Neutral Value Fund",
        "currency": "USD",
        "summary": "The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Value Index.\n The fund invests at least 80% of its net assets in common stock of the long positions in the underlying index and sells short at least 80% of the short positions in the underlying index. The index is a long/short market neutral index that is dollar-neutral. As such, it identifies long and short securities positions of approximately equal dollar amounts. In choosing to track a market neutral index, the fund seeks to limit the effects of general market movements on the fund.",
        "category": "Market Neutral",
        "family": "AGFiQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "MNA": {
        "short_name": "IQ Merger Arbitrage ETF",
        "long_name": "IQ Merger Arbitrage ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance of its underlying index, the IQ Merger Arbitrage Index.\n The fund invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in the investments included in its underlying index. The underlying index seeks to employ a systematic investment process designed to identify opportunities in companies whose equity securities trade in developed markets, including the U.S., and which are involved in announced mergers, acquisitions and other buyout-related transactions. The fund is non-diversified.",
        "category": "Market Neutral",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "MOM": {
        "short_name": "AGFiQ U.S. Market Neutral Momen",
        "long_name": "AGFiQ U.S. Market Neutral Momentum Fund",
        "currency": "USD",
        "summary": "The investment seeks performance results that correspond to the price and yield performance, before fees and expenses, of the Dow Jones U.S. Thematic Market Neutral Momentum Index.\n The fund invests at least 80% of its net assets in common stock of the long positions in the underlying index and sell short at least 80% of the short positions in the underlying index. The index is a long/short market neutral index that is dollar-neutral. As such, it identifies long and short securities positions of approximately equal dollar amounts. In choosing to track a market neutral index, the fund seeks to limit the effects of general market movements on the fund.",
        "category": "Market Neutral",
        "family": "AGFiQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "QED": {
        "short_name": "IQ Hedge Event-Driven Tracker E",
        "long_name": "IQ Hedge Event-Driven Tracker ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the price and yield performance of its underlying index, the IQ Hedge Event-Driven Index (the \"underlying index\").\n The fund is a \"fund of funds\" which means it invests, under normal circumstances, at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in the investments included in its underlying index, which includes underlying funds. The underlying index consists of a number of components (\"underlying index components\") selected in accordance with IndexIQ&#39;s rules-based methodology of such underlying index.",
        "category": "Market Neutral",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "QMN": {
        "short_name": "IQ Hedge Market Neutral Tracker",
        "long_name": "IQ Hedge Market Neutral Tracker ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond (before fees and expenses) generally to the price and yield performance of its underlying index, the IQ Hedge Market Neutral Index.\n The fund is a \"fund of funds\" which means it invests, under normal circumstances, at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in the investments included in its underlying index, which includes underlying funds. The underlying index consists of a number of components (\"underlying index components\") selected in accordance with IndexIQ&#39;s rules-based methodology of such underlying index.",
        "category": "Market Neutral",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market"
    }
}