{"ARKK": {"short_name": "ARK Innovation ETF", "long_name": "ARK Innovation ETF", "currency": "USD", "summary": "The investment seeks long-term growth of capital.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that will invest under normal circumstances primarily (at least 65% of its assets) in domestic and foreign equity securities of companies that are relevant to the fund&#39;s investment theme of disruptive innovation. Its investments in foreign equity securities will be in both developed and emerging markets. It may invest in foreign securities (including investments in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\")) and securities listed on local foreign exchanges. The fund is non-diversified.", "category": "Mid-Cap Growth", "family": "ARK ETF Trust", "exchange": "PCX", "market": "us_market"}, "BFOR": {"short_name": "Barron's 400", "long_name": "Barron's 400 ETF", "currency": "USD", "summary": "The investment seeks investment results that correspond generally, before fees and expenses, to the performance of the Barron&#39;s 400SM Index (the \"underlying index\").\n The underlying index is a rules-based index intended to give investors a means of tracking the overall performance of high performing equity securities of U.S. companies. The fund will invest at least 80% of its total assets in the equity securities which comprise the underlying index.", "category": "Mid-Cap Growth", "family": "ALPS ETF Trust", "exchange": "PCX", "market": "us_market"}, "BFTR": {"short_name": "BlackRock Future Innovators ETF", "long_name": "BlackRock Future Innovators ETF", "currency": "USD", "summary": "The investment seeks long-term capital appreciation.\n Under normal market conditions, the fund will invest at least 80% of its net assets plus any borrowings for investment purposes in equity securities issued by mid- and small-capitalization companies that BFA believes have above-average earnings growth potential. It may invest in shares of companies through initial public offerings (\"IPOs\"). The fund may invest up to 25% of its assets in securities of foreign companies, including companies located in emerging markets. It is non-diversified.", "category": "Mid-Cap Growth", "family": "BlackRock", "exchange": "PCX", "market": "us_market"}, "BOSS": {"short_name": "Global X Funds Global X Founder", "long_name": "Global X Founder-Run Companies ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive U.S. Founder-Run Companies Index (\"underlying index\").\n The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to U.S. companies in which a founder or co-founder of the company is serving as the Chief Executive Officer of the company (collectively, \"Founder-Run Companies\"), as determined by Solactive AG, the provider of the underlying index. The fund is non-diversified.", "category": "Mid-Cap Growth", "family": "Global X Funds", "exchange": "BTS", "market": "us_market"}, "CWS": {"short_name": "AdvisorShares Focused Equity ET", "long_name": "AdvisorShares Focused Equity ETF", "currency": "USD", "summary": "The investment seeks long-term capital appreciation.\n The fund seeks to achieve its investment objective by investing primarily in a focused group of U.S. exchange listed equity securities, including common and preferred stock and ADRs. It will invest at least 80% of its net assets in equity securities. The Advisor allocates the fund&#39;s portfolio investments using research obtained from a proprietary model developed by Edward J. Elfenbein, which uses a variety of methods for security selection and focuses on firms that are fundamentally sound and have shown consistency in their financial results and high earnings quality.", "category": "Mid-Cap Growth", "family": "AdvisorShares", "exchange": "PCX", "market": "us_market"}, "ETHO": {"short_name": "Etho Climate Leadership U.S. ET", "long_name": "Etho Climate Leadership U.S. ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Etho Climate Leadership Index - US (the \"index\").\n The index tracks the performance of the equity securities of a diversified set of U.S. companies that are leaders in their industry with respect to their carbon impact. \"Carbon impact\" calculated based on the total greenhouse gas (\"GHG\") emissions from a company&#39;s operations, fuel use, supply chain, and business activities, divided by the company&#39;s market capitalization. The fund will invest at least 80% of its total assets in the component securities of the index.", "category": "Mid-Cap Growth", "family": "ETFMG", "exchange": "PCX", "market": "us_market"}, "FAD": {"short_name": "First Trust Multi Cap Growth Al", "long_name": "First Trust Multi Cap Growth AlphaDEX Fund", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of the Nasdaq AlphaDEXÂ® Multi Cap Growth Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select growth stocks from the NASDAQ US 500 Large Cap Index, NASDAQ US 600 Mid Cap Index and NASDAQ US 700 Small Cap Index that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.", "category": "Mid-Cap Growth", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "FNY": {"short_name": "First Trust Mid Cap Growth Alph", "long_name": "First Trust Mid Cap Growth AlphaDEX Fund", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Mid Cap Growth Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select growth stocks from the NASDAQ US 600 Mid Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.", "category": "Mid-Cap Growth", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "IJK": {"short_name": "iShares S&P Mid-Cap 400 Growth ", "long_name": "iShares S&P Mid-Cap 400 Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the S&P MidCap 400 Growth IndexTM, which measures the performance of the mid-capitalization growth sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.", "category": "Mid-Cap Growth", "family": "iShares", "exchange": "PCX", "market": "us_market"}, "JKH": {"short_name": "iShares Morningstar Mid-Cap Gro", "long_name": "iShares Morningstar Mid-Cap Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Mid Growth IndexSM composed of mid-capitalization U.S. equities that exhibit growth characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by mid-capitalization companies that have exhibited above-average \"growth\" characteristics as determined by Morningstar, Inc.&#39;s (\"Morningstar\" or the \"index provider\") proprietary index methodology.", "category": "Mid-Cap Growth", "family": "iShares", "exchange": "PCX", "market": "us_market"}, "PDP": {"short_name": "Invesco DWA Momentum ETF", "long_name": "Invesco DWA Momentum ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Technical Leaders Index.\n The fund generally will invest at least 90% of its total assets in securities that comprise the underlying index. The underlying index is composed of approximately 100 securities from an eligible universe of approximately 1,000 securities of the largest constituents by market capitalization within the NASDAQ US Benchmark Index.", "category": "Mid-Cap Growth", "family": "Invesco", "exchange": "NMS", "market": "us_market"}, "XMMO": {"short_name": "Invesco S&P MidCap Momentum ETF", "long_name": "Invesco S&P MidCap Momentum ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400Â® Momentum Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is composed of constituents of the S&P MidCap 400Â® Index that have the highest \"momentum score.\"", "category": "Mid-Cap Growth", "family": "Invesco", "exchange": "PCX", "market": "us_market"}}