{
    "ARKK": {
        "short_name": "ARK Innovation ETF",
        "long_name": "ARK Innovation ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term growth of capital.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that will invest under normal circumstances primarily (at least 65% of its assets) in domestic and foreign equity securities of companies that are relevant to the fund&#39;s investment theme of disruptive innovation. Its investments in foreign equity securities will be in both developed and emerging markets. It may invest in foreign securities (including investments in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\")) and securities listed on local foreign exchanges. The fund is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "ARK ETF Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23129204736
    },
    "BFOR": {
        "short_name": "Barron's 400",
        "long_name": "Barron's 400 ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally, before fees and expenses, to the performance of the Barron&#39;s 400SM Index (the \"underlying index\").\n The underlying index is a rules-based index intended to give investors a means of tracking the overall performance of high performing equity securities of U.S. companies. The fund will invest at least 80% of its total assets in the equity securities which comprise the underlying index.",
        "category": "Mid-Cap Growth",
        "family": "ALPS ETF Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 130787296
    },
    "CWS": {
        "short_name": "AdvisorShares Focused Equity ET",
        "long_name": "AdvisorShares Focused Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n The fund seeks to achieve its investment objective by investing primarily in a focused group of U.S. exchange listed equity securities, including common and preferred stock and ADRs. It will invest at least 80% of its net assets in equity securities. The Advisor allocates the fund&#39;s portfolio investments using research obtained from a proprietary model developed by Edward J. Elfenbein, which uses a variety of methods for security selection and focuses on firms that are fundamentally sound and have shown consistency in their financial results and high earnings quality.",
        "category": "Mid-Cap Growth",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24460914
    },
    "ETHO": {
        "short_name": "Etho Climate Leadership U.S. ET",
        "long_name": "Etho Climate Leadership U.S. ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Etho Climate Leadership Index - US (the \"index\").\n The index tracks the performance of the equity securities of a diversified set of U.S. companies that are leaders in their industry with respect to their carbon impact. \"Carbon impact\" calculated based on the total greenhouse gas (\"GHG\") emissions from a company&#39;s operations, fuel use, supply chain, and business activities, divided by the company&#39;s market capitalization. The fund will invest at least 80% of its total assets in the component securities of the index.",
        "category": "Mid-Cap Growth",
        "family": "ETFMG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 148507104
    },
    "FAD": {
        "short_name": "First Trust Multi Cap Growth Al",
        "long_name": "First Trust Multi Cap Growth AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of the Nasdaq AlphaDEXÂ® Multi Cap Growth Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select growth stocks from the NASDAQ US 500 Large Cap Index, NASDAQ US 600 Mid Cap Index and NASDAQ US 700 Small Cap Index that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Mid-Cap Growth",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 213901392
    },
    "FNY": {
        "short_name": "First Trust Mid Cap Growth Alph",
        "long_name": "First Trust Mid Cap Growth AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Mid Cap Growth Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select growth stocks from the NASDAQ US 600 Mid Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Mid-Cap Growth",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 428444192
    },
    "FRTY": {
        "short_name": "Alger Mid Cap 40 ETF",
        "long_name": "Alger Mid Cap 40 ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n Under normal circumstances, the fund invests at least 80% of its net assets in equity securities of mid-cap companies. Equity securities include common or preferred stocks that are listed on U.S. exchanges. It may invest a significant portion of its assets in the securities of companies conducting business in the information technology and healthcare sectors. The fund is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "Alger",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 250000
    },
    "GLRY": {
        "short_name": "Northern Lights Fund Trust IV I",
        "long_name": "Inspire Faithward Mid Cap Momentum ESG ETF",
        "currency": "USD",
        "summary": "The investment seeks to maximize growth and outperform the results (before fees and expenses) of the broader U.S. midcap stock market.\n The fund, an actively managed exchange traded fund (ETF), invests at least 80% of its net assets plus any borrowings for investment purposes in midcap stocks. Midcap stocks are defined as stocks of companies with market capitalizations between $3 billion and $10 billion that meet the fund&#39;s environmental, social and governance (ESG) criteria.",
        "category": "Mid-Cap Growth",
        "family": "Inspire",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 41249920
    },
    "HAIL": {
        "short_name": "SPDR S&P Kensho Smart Mobility ",
        "long_name": "SPDR S&P Kensho Smart Mobility ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Kensho Smart Transportation Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is comprised of U.S.-listed equity securities (including depositary receipts) of companies domiciled across developed and emerging markets worldwide which are included in the Smart Transportation sector as determined by a classification standard produced by the index provider. The fund is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 235827056
    },
    "IJK": {
        "short_name": "iShares S&P Mid-Cap 400 Growth ",
        "long_name": "iShares S&P Mid-Cap 400 Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P MidCap 400 Growth IndexTM, which measures the performance of the mid-capitalization growth sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Mid-Cap Growth",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 7911275008
    },
    "IMCG": {
        "short_name": "iShares Morningstar Mid-Cap Gro",
        "long_name": "iShares Morningstar Mid-Cap Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Mid Cap Broad Growth IndexSM composed of mid-capitalization U.S. equities that exhibit growth characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by mid-capitalization companies that have exhibited above-average \"growth\" characteristics as determined by Morningstar, Inc.&#39;s (\"Morningstar\" or the \"index provider\") proprietary index methodology.",
        "category": "Mid-Cap Growth",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1509979264
    },
    "IPO": {
        "short_name": "Renaissance IPO ETF",
        "long_name": "Renaissance IPO ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the Renaissance IPO Index (the \"index\").\n The fund seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the index. It normally invests at least 80% of its total assets in securities that comprise the index. The index is a portfolio of companies that have recently completed an initial public offering (\"IPO\") and are listed on a U.S. exchange. The fund is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "Renaissance Capital",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 647768768
    },
    "IVOG": {
        "short_name": "Vanguard S&P Mid-Cap 400 Growth",
        "long_name": "Vanguard S&P Mid-Cap 400 Growth Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of mid-capitalization growth stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the S&P MidCap 400Â® Growth Index, which represents the growth companies, as determined by the index sponsor, of the S&P MidCap 400 Index. The Advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Mid-Cap Growth",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1111338880
    },
    "IWP": {
        "short_name": "iShares Russell Midcap Growth E",
        "long_name": "iShares Russell Mid-Cap Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell Midcap Growth Index, which measures the performance of the mid-capitalization growth sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Mid-Cap Growth",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15177804800
    },
    "JSMD": {
        "short_name": "Janus Henderson Small/Mid Cap G",
        "long_name": "Janus Henderson Small/Mid Cap Growth Alpha ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally, to the performance of its underlying index, the Janus Henderson Small/Mid Cap Growth Alpha Index.\n The fund pursues its investment objective by normally investing at least 80% of its net assets in the securities that comprise the underlying index. The underlying index is composed of common stocks of small- and medium-sized companies that are included in the Solactive Small/Mid Cap Index, a universe of 2,500 small- and medium-sized capitalization stocks.",
        "category": "Mid-Cap Growth",
        "family": "Janus Henderson",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 186242992
    },
    "KOMP": {
        "short_name": "SPDR S&P Kensho New Economies C",
        "long_name": "SPDR S&P Kensho New Economies Composite ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Kensho New Economies Composite Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to capture companies whose products and services are driving innovation and transforming the global economy through the use of existing and emerging technologies, and rapid developments in robotics, automation, artificial intelligence, connectedness and processing power. The fund is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1957411200
    },
    "MDYG": {
        "short_name": "SPDR S&P 400 Mid Cap Growth ETF",
        "long_name": "SPDR S&P 400 Mid Cap Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P MidCap 400 Growth Index that tracks the performance of medium capitalization exchange traded U.S. equity securities exhibiting \"growth\" characteristics.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the mid-capitalization growth segment of the U.S. equity market.",
        "category": "Mid-Cap Growth",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1689008640
    },
    "MID": {
        "short_name": "American Century Mid Cap Growth",
        "long_name": "American Century Mid Cap Growth Impact ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital growth.\n The fund will invest principally in exchange-traded common stocks. Under normal market conditions, the portfolio managers will invest at least 80% of the fund&#39;s assets in securities of medium capitalization companies that the portfolio managers believe will create impact by aligning with at least one of the SDGs. The fund may purchase securities of small and large capitalization companies as well. It may engage in active and frequent trading of portfolio securities to achieve its principal investment strategies. The fund is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "American Century Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 14084391
    },
    "QQQJ": {
        "short_name": "Invesco NASDAQ Next Gen 100 ETF",
        "long_name": "Invesco NASDAQ Next Gen 100 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ Next Generation 100 IndexÂ®.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, Nasdaq, Inc. compiles, maintains and calculates the underlying index, which is comprised of securities of the next generation of Nasdaq-listed non-financial companies; that is, the largest 100 Nasdaq-listed companies outside of the NASDAQ-100 IndexÂ® (the â\u0080\u009cNASDAQ-100â\u0080\u009d) based on market capitalization. It is non-diversified.",
        "category": "Mid-Cap Growth",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 1151235456
    },
    "RFG": {
        "short_name": "Invesco S&P Midcap 400 Pure Gro",
        "long_name": "Invesco S&P MidCap 400 Pure Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400Â® Pure Growth Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of a subset of securities from the S&P MidCap 400Â® Index that exhibit strong growth characteristics.",
        "category": "Mid-Cap Growth",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 388190528
    },
    "RYJ": {
        "short_name": "Invesco Raymond James SB-1 Equi",
        "long_name": "Invesco Raymond James SB-1 Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Raymond James SB-1 Equity Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains, and calculates the underlying index, which is comprised of U.S.-listed equity securities that are rated Strong Buy 1 (\"SB-1\") by an affiliate of the index provider.",
        "category": "Mid-Cap Growth",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 141223680
    },
    "SFYF": {
        "short_name": "SoFi Social 50 ETF",
        "long_name": "SoFi Social 50 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the SoFi Social 50 Index (the \"index\").\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of any collateral held from securities lending) will be invested in the component securities of the index. The index follows a rules-based methodology that tracks the performance of a portfolio of the 50 most widely held U.S.-listed equity securities in self-directed brokerage accounts (the \"SoFi Accounts\") of SoFi Securities, LLC, an affiliate of Social Finance, Inc. (\"SoFi\"), as determined using the rules-based methodology.",
        "category": "Mid-Cap Growth",
        "family": "Sofi",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 16469724
    },
    "VFMO": {
        "short_name": "Vanguard U.S. Momentum Factor E",
        "long_name": "Vanguard U.S. Momentum Factor ETF ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to provide long-term capital appreciation by investing in stocks with strong recent performance as determined by the advisor.\n The fund invests primarily in U.S. common stocks with the potential to generate higher returns relative to the broad U.S. equity market by investing in stocks with strong recent performance as determined by the advisor. The portfolio will include a diverse mix of companies representing many different market sectors and industry groups. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in securities issued by U.S. companies.",
        "category": "Mid-Cap Growth",
        "family": "Vanguard",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 98936000
    },
    "VFQY": {
        "short_name": "Vanguard U.S. Quality Factor ET",
        "long_name": "Vanguard U.S. Quality Factor ETF ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to provide long-term capital appreciation by investing in stocks with strong fundamentals as determined by the advisor.\n The fund invests primarily in U.S. common stocks with the potential to generate higher returns relative to the broad U.S. equity market by investing in stocks with strong fundamentals as determined by the advisor. The portfolio will include a diverse mix of companies representing many different market sectors and industry groups. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in securities issued by U.S. companies.",
        "category": "Mid-Cap Growth",
        "family": "Vanguard",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 75613504
    },
    "VOT": {
        "short_name": "Vanguard Mid-Cap Growth ETF",
        "long_name": "Vanguard Mid-Cap Growth Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the CRSP US Mid Cap Growth Index that measures the investment return of mid-capitalization growth stocks.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Mid Cap Growth Index, a broadly diversified index of growth stocks of mid-size U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Mid-Cap Growth",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 21305860096
    },
    "XMMO": {
        "short_name": "Invesco S&P MidCap Momentum ETF",
        "long_name": "Invesco S&P MidCap Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400Â® Momentum Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is composed of constituents of the S&P MidCap 400Â® Index that have the highest \"momentum score.\"",
        "category": "Mid-Cap Growth",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 943917376
    }
}