{
  "BBMC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "JPMorgan",
    "long_name": "JPMorgan BetaBuilders U.S. Mid Cap Equity ETF",
    "market": "us_market",
    "short_name": "JPMorgan BetaBuilders U.S. Mid ",
    "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the Morningstar® US Mid Cap Target Market Exposure Extended IndexSM.\n The fund will invest at least 80% of its assets in securities included in the underlying index. The underlying index consists of equity securities primarily traded in the United States and targets those securities that fall between the 85th and 95th percentiles in market capitalization of the free float adjusted investable universe.",
    "total_assets": 1678801024
  },
  "BKMC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "BNY Mellon",
    "long_name": "BNY Mellon US Mid Cap Core Equity ETF",
    "market": "us_market",
    "short_name": "BNY Mellon US Mid Cap Core Equi",
    "summary": "The investment seeks to track the performance of the Morningstar® US Mid Cap IndexSM.\n Under normal circumstances, the fund generally invests in all of the stocks in the index in proportion to their weighting in the index. The index is a float-adjusted market capitalization weighted index designed to measure the performance of U.S. medium-capitalization stocks. It is non-diversified.",
    "total_assets": 105226248
  },
  "BUL": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Pacer",
    "long_name": "Pacer US Cash Cows Growth ETF",
    "market": "us_market",
    "short_name": "Pacer US Cash Cows Growth ETF",
    "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer US Cash Cows Growth Index.\n The index uses an objective, rules-based methodology to provide exposure to mid- and large-capitalization U.S. companies with high free cash flow yields. Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index. It is non-diversified.",
    "total_assets": 3417008
  },
  "CSD": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco S&P Spin-Off ETF",
    "market": "us_market",
    "short_name": "Invesco S&P Spin-Off ETF",
    "summary": "The investment seeks to track the investment results (before the fund&#39;s fees and expenses) of the S&P U.S. Spin-Off Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is designed to measure the performance of U.S. companies that have been spun off from a parent company within the past four years. The fund is non-diversified.",
    "total_assets": 74631904
  },
  "CZA": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco Zacks Mid-Cap ETF",
    "market": "us_market",
    "short_name": "Invesco Zacks Mid-Cap ETF",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Zacks Mid-Cap Core Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as American depositary receipts (\"ADRs\") that represent securities in the underlying index. The underlying index is composed of 100 securities that Zacks selects from a universe of mid-capitalization securities including common stocks, master limited partnerships (\"MLPs\"), ADRs, real estate investment trusts (\"REITs\") and business development companies (\"BDCs\").",
    "total_assets": 216922768
  },
  "DEUS": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Xtrackers",
    "long_name": "Xtrackers Russell US Multifactor ETF",
    "market": "us_market",
    "short_name": "Xtrackers Russell US Multifacto",
    "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the Russell 1000 Comprehensive Factor Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance of the underlying index, which is designed to track the equity market performance of companies in the United States selected on the investment style criteria (\"factors\") of value, momentum, quality, low volatility and size. It will invest at least 80% of its total assets (but typically far more) in component securities of the underlying index.",
    "total_assets": 181824688
  },
  "DMRM": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "DeltaShares",
    "long_name": "DeltaShares S&P 400 Managed Risk ETF",
    "market": "us_market",
    "short_name": "DeltaShares S&P 400 Managed Ris",
    "summary": "The investment seeks to track the investment results, before fees and expenses, of the S&P 400 Managed Risk 2.0 Index.\n Under normal market conditions, the fund invests a substantial portion, but at least 80%, of its assets, exclusive of collateral held from securities lending, in securities comprising the S&P 400 Managed Risk 2.0 Index. The underlying index seeks to achieve these objectives by allocating weightings among the S&P MidCap 400 Index, the S&P U.S. Treasury Bond Current 5-Year Index and the S&P U.S. Treasury Bill 0-3 Month Index. The fund is non-diversified.",
    "total_assets": 101167328
  },
  "EQAL": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco Russell 1000 Equal Weight ETF",
    "market": "us_market",
    "short_name": "Invesco Russell 1000 Equal Weig",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Russell 1000® Equal Weight Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is comprised of all of the securities in the Russell 1000 ® Index, which is designed to measure the performance of the large-cap segment of the U.S. equity market and consists of the stocks of the largest 1,000 U.S. companies by market capitalization.",
    "total_assets": 642682688
  },
  "EWMC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco S&P MidCap 400 Equal Weight ETF",
    "market": "us_market",
    "short_name": "Invesco S&P MidCap 400 Equal We",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400® Equal Weight Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index consists of all of the components of the S&P MidCap 400® Index, a broad-based index of approximately 400 securities that measures the mid-cap segment of the U.S. equity market.",
    "total_assets": 105655992
  },
  "FLQM": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Franklin Templeton Investments",
    "long_name": "Franklin LibertyQ U.S. Mid Cap Equity ETF",
    "market": "us_market",
    "short_name": "Franklin LibertyQ U.S. Mid Cap ",
    "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the LibertyQ U.S. Mid Cap Equity Index (the U.S. Mid Cap underlying index).\n Under normal market conditions, the fund invests at least 80% of its assets in the component securities of the U.S. Mid Cap underlying index. The U.S. Mid Cap underlying index is based on the Russell Midcap® Index using a methodology developed with Franklin Templeton to reflect Franklin Templeton&#39;s desired investment strategy.",
    "total_assets": 40872868
  },
  "FNX": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "NGM",
    "family": "First Trust",
    "long_name": "First Trust Mid Cap Core AlphaDEX Fund",
    "market": "us_market",
    "short_name": "First Trust Mid Cap Core AlphaD",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEX® Mid Cap Core Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select stocks from the NASDAQ US 600 Mid Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.",
    "total_assets": 1000566720
  },
  "HSMV": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "First Trust",
    "long_name": "First Trust Horizon Managed Volatility Small/Mid ETF",
    "market": "us_market",
    "short_name": "First Trust Horizon Managed Vol",
    "summary": "The investment seeks to provide investors with capital appreciation.\n Under normal market conditions, the fund seeks to achieve its investment objective by investing at least 80% of its net assets (including investment borrowings) in small- and/or mid-capitalization common stocks listed and traded on U.S. national securities exchanges that Sub-Advisor believes exhibit low future expected volatility. It is non-diversified.",
    "total_assets": 14099419
  },
  "IJH": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Core S&P Mid-Cap ETF",
    "market": "us_market",
    "short_name": "iShares Core S&P Mid-Cap ETF",
    "summary": "The investment seeks to track the investment results of the S&P MidCap 400 (the \"underlying index\"), which measures the performance of the mid-capitalization sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
    "total_assets": 61098835968
  },
  "IMCB": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Morningstar Mid-Cap ETF",
    "market": "us_market",
    "short_name": "iShares Morningstar Mid-Cap ETF",
    "summary": "The investment seeks to track the investment results of the Morningstar® US Mid Cap IndexSM composed of mid-capitalization U.S. equities.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by mid-capitalization companies that have exhibited both “growth” and “value” characteristics as determined by Morningstar, Inc.’s (“Morningstar” or the “index provider”) proprietary index methodology.",
    "total_assets": 865356416
  },
  "IVOO": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Vanguard",
    "long_name": "Vanguard S&P Mid-Cap 400 Index Fund ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard S&P Mid-Cap 400 ETF",
    "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of mid-capitalization stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the S&P MidCap 400® Index. The index measures the performance of mid-size companies in the United States. The Advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
    "total_assets": 2940042496
  },
  "IWR": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Russell Mid-Cap ETF",
    "market": "us_market",
    "short_name": "iShares Russell Mid-Cap ETF",
    "summary": "The investment seeks to track the investment results of the Russell Midcap Index, which measures the performance of the mid-capitalization sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
    "total_assets": 26413172736
  },
  "JHMM": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "John Hancock",
    "long_name": "John Hancock Multifactor Mid Cap ETF",
    "market": "us_market",
    "short_name": "John Hancock Multifactor Mid Ca",
    "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the John Hancock Dimensional Mid Cap Index.\n The fund normally invests at least 80% of its net assets (plus any borrowings for investment purposes) in securities that compose the fund&#39;s index. The index is designed to comprise a subset of securities in the U.S. Universe issued by companies whose market capitalizations are between the 200th and 951st largest U.S. company at the time of reconstitution.",
    "total_assets": 2024635648
  },
  "JPME": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "JPMorgan",
    "long_name": "JPMorgan Diversified Return U.S. Mid Cap Equity ETF",
    "market": "us_market",
    "short_name": "JPMorgan Diversified Return U.S",
    "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the JP Morgan Diversified Factor US Mid Cap Equity Index.\n The fund will invest at least 80% of its net assets in securities included in the underlying index. The underlying index is comprised of U.S. equity securities selected to represent a diversified set of factor characteristics: value, momentum, and quality.",
    "total_assets": 239734400
  },
  "MDY": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR S&P MIDCAP 400 ETF Trust",
    "market": "us_market",
    "short_name": "SPDR MidCap Trust Series I",
    "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of the S&P MidCap 400® Index™.\n The Trust seeks to achieve its investment objective by holding a portfolio of the common stocks that are included in the index (the “Portfolio”), with the weight of each stock in the Portfolio substantially corresponding to the weight of such stock in the index.",
    "total_assets": 21723785216
  },
  "MGMT": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Ballast Asset Management",
    "long_name": "Ballast Small/Mid Cap ETF",
    "market": "us_market",
    "short_name": "Ballast Small/Mid Cap ETF",
    "summary": "The investment seeks to generate positive risk adjusted returns.\n Under normal circumstances, the fund invests at least 80% of the value of its net assets (plus borrowings for investment purposes) in equity securities (principally common stocks) of domestic companies with small to medium market capitalizations. It may also invest all or substantially all of its assets in cash and cash equivalents, including money market funds and other short-term fixed income investments, in seeking to protect principal, or when, in the Adviser&#39;s opinion, there are not sufficient companies appropriate for investment.",
    "total_assets": 15096722
  },
  "MIDF": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI USA Mid-Cap Multifactor ETF",
    "market": "us_market",
    "short_name": "iShares MSCI USA Mid-Cap Multif",
    "summary": "The investment seeks to track the investment results of the MSCI USA Mid Cap Diversified Multiple-Factor Index.\n The index is designed to select equity securities from the MSCI USA Mid Cap Index (the \"parent index\") that have high exposure to four investment style factors: value, quality, momentum and low size, while maintaining a level of risk similar to that of the parent index. The fund generally will invest at least 90% of its assets in the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. It is non-diversified.",
    "total_assets": 3651334
  },
  "ONEO": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Russell 1000 Momentum Focus ETF",
    "market": "us_market",
    "short_name": "SPDR Russell 1000 Momentum Focu",
    "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Russell 1000 Momentum Focused Factor Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to reflect the performance of a segment of large-capitalization U.S. equity securities demonstrating a combination of core factors (high value, high quality, and low size characteristics), with a focus factor comprising high momentum characteristics.",
    "total_assets": 286211936
  },
  "ONEV": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Russell 1000 Low Volatility Focus ETF",
    "market": "us_market",
    "short_name": "SPDR Russell 1000 Low Volatilit",
    "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Russell 1000 Low Volatility Focused Factor Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to reflect the performance of a segment of large-capitalization U.S. equity securities demonstrating a combination of core factors (high value, high quality, and low size characteristics), with a focus factor comprising low volatility characteristics.",
    "total_assets": 538055744
  },
  "PAMC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Pacer",
    "long_name": "Pacer Lunt MidCap Multi-Factor Alternator ETF",
    "market": "us_market",
    "short_name": "Pacer Lunt MidCap Multi-Factor ",
    "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Lunt Capital U.S. MidCap Multi-Factor Rotation Index.\n Under normal circumstances, at least 80% of the fund’s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of its underlying index or in one or more ETFs that track the performance of all or a portion of such component securities in the same approximate proportion as in the fund’s underlying index. The index uses an objective, rules-based methodology to provide exposure to mid-capitalization U.S. companies. It is non-diversified.",
    "total_assets": 22550492
  },
  "PTMC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Pacer",
    "long_name": "Pacer Trendpilot US Mid Cap ETF",
    "market": "us_market",
    "short_name": "Pacer Trendpilot US Mid Cap ETF",
    "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer Trendpilot US Mid Cap Index.\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the index. The index implements a systematic trend-following strategy that directs exposure (i) 100% to the S&P MidCap 400® Index, (ii) 50% to the S&P MidCap 400 and 50% to 3-Month U.S. Treasury bills, or (iii) 100% to 3-Month U.S. Treasury bills, depending on the relative performance of the S&P MidCap 400 and its 200-business day historical simple moving average.",
    "total_assets": 436863968
  },
  "PWC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco Dynamic Market ETF",
    "market": "us_market",
    "short_name": "Invesco Dynamic Market ETF",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dynamic Market IntellidexSM Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of U.S. stocks that ICE Data included pursuant to a proprietary selection methodology. Stocks are selected from the top of each sector and size category in a manner designed to produce an index with sector and size dispersion similar to the overall broad market.",
    "total_assets": 135805472
  },
  "REGL": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "ProShares",
    "long_name": "ProShares S&P MidCap 400 Dividend Aristocrats ETF",
    "market": "us_market",
    "short_name": "ProShares S&P MidCap 400 Divide",
    "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the S&P MidCap 400® Dividend Aristocrats Index (the \"index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities. The index contains a minimum of 40 stocks which are equally weighted. No single sector is allowed to comprise more than 30% of the index weight.",
    "total_assets": 897920128
  },
  "RNMC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "NGM",
    "family": "First Trust",
    "long_name": "First Trust Mid Cap US Equity Select ETF",
    "market": "us_market",
    "short_name": "Mid Cap US Equity Select ETF",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq Riskalyze US Mid Cap Index (the \"index\").\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and real estate investment trusts (\"REITs\") that comprise the index. The index is designed to select dividend-paying securities issued by mid capitalization U.S. companies.",
    "total_assets": 17383712
  },
  "SCHM": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Schwab ETFs",
    "long_name": "Schwab U.S. Mid-Cap ETF",
    "market": "us_market",
    "short_name": "Schwab U.S. Mid Cap ETF",
    "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Dow Jones U.S. Mid-Cap Total Stock Market Index.\n The index includes the mid-cap portion of the Dow Jones U.S. Total Stock Market Index actually available to investors in the marketplace. The Dow Jones U.S. Mid-Cap Total Stock Market Index includes the components ranked 501-1000 by full market capitalization. The index is a float-adjusted market capitalization weighted index. The fund will invest at least 90% of its net assets in securities that are included in the index.",
    "total_assets": 8942110720
  },
  "SPMD": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Portfolio S&P 400 Mid Cap ETF",
    "market": "us_market",
    "short_name": "SPDR Portfolio S&P 400 Mid Cap ",
    "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P MidCap 400 Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of the mid-capitalization segment of the U.S. equity market.",
    "total_assets": 4712603648
  },
  "TPLC": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Timothy Plan",
    "long_name": "Timothy Plan US Large/Mid Cap Core ETF",
    "market": "us_market",
    "short_name": "Timothy Plan US Large/Mid Cap C",
    "summary": "The investment seeks to provide investment results that track the performance of the Victory US Large Cap Volatility Weighted BRI Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its net assets directly or indirectly in the securities included in the Victory US Large Cap Volatility Weighted BRI Index, an unmanaged, volatility weighted index created by the Sub-Advisor. The index combines fundamental criteria with individual security risk control achieved through volatility weighting of individual securities.",
    "total_assets": 172381488
  },
  "TUSA": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "NGM",
    "family": "First Trust",
    "long_name": "First Trust Total US Market AlphaDEX ETF",
    "market": "us_market",
    "short_name": "First Trust Total US Market Alp",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEX® Total US Market Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is a modified market capitalization index designed to quantitatively identify and select U.S. exchange-listed securities issued by small, mid and large cap U.S. companies that exhibit growth and value factors and appear to have the greatest potential for capital appreciation.",
    "total_assets": 21305530
  },
  "USEQ": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Invesco",
    "long_name": "Invesco Russell 1000 Enhanced Equal Weight ETF",
    "market": "us_market",
    "short_name": "Invesco Russell 1000 Enhanced E",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Russell 1000® Enhanced Value Equal Weight Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is comprised of securities in the Russell 1000® Index that exhibit upward price momentum and good relative valuation. The underlying index is a subset of the Russell 1000, which is designed to measure the performance of the large-cap segment of the U.S. equity market and consists of the stocks of the largest 1,000 U.S. companies.",
    "total_assets": 1709597
  },
  "USLB": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "NGM",
    "family": "Invesco",
    "long_name": "Invesco Russell 1000 Low Beta Equal Weight ETF",
    "market": "us_market",
    "short_name": "Invesco Russell 1000 Low Beta E",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Russell 1000® Low Beta Equal Weight Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is comprised of securities in the Russell 1000® Index that exhibit low beta characteristics. The underlying index is a subset of the Russell 1000, which is designed to measure the performance of the large-cap segment of the U.S. equity market and consists of the stocks of the largest 1,000 U.S. companies, by market capitalization.",
    "total_assets": 9269310
  },
  "USMF": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "WisdomTree",
    "long_name": "WisdomTree U.S. Multifactor Fund",
    "market": "us_market",
    "short_name": "WisdomTree U.S. Multifactor Fun",
    "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. Multifactor Index.\n Under normal circumstances, at least 80% of the fund&#39;s total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is generally comprised of 200 U.S. companies with the highest composite scores based on two fundamental factors (value and quality measures) and two technical factors (momentum and correlation). The fund is non-diversified.",
    "total_assets": 143758336
  },
  "VFLQ": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Vanguard",
    "long_name": "Vanguard U.S. Liquidity Factor ETF ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard U.S. Liquidity Factor ",
    "summary": "The investment seeks to provide long-term capital appreciation by investing in stocks with lower measures of trading liquidity as determined by the advisor.\n The fund invests primarily in U.S. common stocks with the potential to generate higher returns relative to the broad U.S. equity market by investing in stocks with lower measures of trading liquidity as determined by the advisor. The portfolio will include a diverse mix of companies representing many different market sectors and industry groups. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in securities issued by U.S. companies.",
    "total_assets": 50155248
  },
  "VFMF": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Vanguard",
    "long_name": "Vanguard U.S. Multifactor ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard U.S. Multifactor ETF",
    "summary": "The investment seeks to provide long-term capital appreciation.\n The fund invests primarily in U.S. common stocks with the potential to generate higher returns relative to the broad U.S. equity market by investing in stocks with relatively strong recent performance, strong fundamentals, and low prices relative to fundamentals as determined by the advisor. Under normal circumstances, at least 80% of its assets will be invested in securities issued by U.S. companies.",
    "total_assets": 79744496
  },
  "VFMV": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "Vanguard",
    "long_name": "Vanguard U.S. Minimum Volatility ETF ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard U.S. Minimum Volatilit",
    "summary": "The investment seeks to provide long-term capital appreciation with lower volatility relative to the broad U.S. equity market.\n The fund invests primarily in a group of U.S. common stocks that together are deemed by the advisor to have the potential to generate lower volatility relative to the broad U.S. equity market. The portfolio will include a diverse mix of companies representing many different market sectors and industry groups. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in securities issued by U.S. companies.",
    "total_assets": 48977248
  },
  "VO": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Vanguard",
    "long_name": "Vanguard Mid-Cap Index Fund ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard Mid-Cap ETF",
    "summary": "The investment seeks to track the performance of the CRSP US Mid Cap Index that measures the investment return of mid-capitalization stocks.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Mid Cap Index, a broadly diversified index of stocks of mid-size U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
    "total_assets": 144905732096
  },
  "VXF": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Vanguard",
    "long_name": "Vanguard Extended Market Index Fund ETF Shares",
    "market": "us_market",
    "short_name": "Vanguard Extended Market ETF",
    "summary": "The investment seeks to track the S&P Completion Index that measures the investment return of small- and mid-capitalization stocks.\n The fund employs an indexing investment approach designed to track the performance of S&P Completion Index, a broadly diversified index of stocks of small and mid-size U.S. companies. It invests by sampling the index, meaning that it holds a broadly diversified collection of securities that, in the aggregate, approximates the full index in terms of key characteristics. These characteristics include industry weightings and market capitalization, as well as certain financial measures, such as price/earnings ratio and dividend yield.",
    "total_assets": 107108974592
  },
  "XJH": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares ESG Screened S&P Mid-Cap ETF",
    "market": "us_market",
    "short_name": "iShares ESG Screened S&P Mid-Ca",
    "summary": "The investment seeks to track the investment results of an index composed of mid-capitalization U.S. equities while applying screens for company involvement in controversies and controversial business activities.\n The fund seeks to track the investment results of the S&P MidCap 400 Sustainability Screened Index, which measures the performance of the mid-capitalization sector of the U.S. equity market while excluding companies involved in controversial business activities and controversies, as determined by S&P Dow Jones Indices LLC. BFA uses a representative sampling indexing strategy to manage the fund. It is non-diversified.",
    "total_assets": 18949280
  },
  "XMHQ": {
    "category": "Mid-Cap Blend",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco S&P MidCap Quality ETF",
    "market": "us_market",
    "short_name": "Invesco S&P MidCap Quality ETF",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400® Quality Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider first calculates the quality score of each security in the S&P MidCap 400® Index.",
    "total_assets": 199770528
  }
}
