{"DDIV": {"short_name": "First Trust Dorsey Wright Momen", "long_name": "First Trust Dorsey Wright Momentum & Dividend ETF", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the Dorsey Wright Momentum Plus Dividend Yield Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the equity securities that comprise the index. The index is designed to track the overall performance of the 50 stocks with the highest dividend yield comprising the NASDAQ US Large Mid Index that still maintain high levels of \"relative strength.\"", "category": "Mid-Cap Value", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "DIV": {"short_name": "Global X Super Dividend ETF", "long_name": "Global X SuperDividend U.S. ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Indxx SuperDividend Â® U.S. Low Volatility Index (\"underlying index\").\n The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index tracks the performance of 50 equally-weighted common stocks, including Master Limited Partnerships (\"MLPs\") and Real Estate Investment Trusts (\"REITs\") that rank among the highest dividend yielding equity securities in the United States.", "category": "Mid-Cap Value", "family": "Global X Funds", "exchange": "PCX", "market": "us_market"}, "DON": {"short_name": "WisdomTree U.S. MidCap Dividend", "long_name": "WisdomTree U.S. MidCap Dividend Fund", "currency": "USD", "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. MidCap Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of the mid-capitalization segment of the U.S. dividend-paying market. The fund is non-diversified.", "category": "Mid-Cap Value", "family": "WisdomTree", "exchange": "PCX", "market": "us_market"}, "DVLU": {"short_name": "First Trust Dorsey Wright Momen", "long_name": "First Trust Dorsey Wright Momentum & Value ETF", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the Dorsey Wright Momentum Plus Value Index (the \"index\").\n Under normal conditions, the fund will invest at least 90% of its net assets (including investment borrowings) in the equity securities that comprise the index. The index is a rules-based equity index designed to track the overall performance of the 50 most undervalued stocks comprising the NASDAQ US Large Mid Index that exhibit high levels of \"relative strength.\" The fund is non-diversified.", "category": "Mid-Cap Value", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "FAB": {"short_name": "First Trust Multi Cap Value Alp", "long_name": "First Trust Multi Cap Value AlphaDEX Fund", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of the Nasdaq AlphaDEXÂ® Multi Cap Value Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select value stocks from the NASDAQ US 500 Large Cap Index, NASDAQ US 600 Mid Cap Index and NASDAQ US 700 Small Cap Index that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.", "category": "Mid-Cap Value", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "IJJ": {"short_name": "iShares S&P Mid-Cap 400 Value E", "long_name": "iShares S&P Mid-Cap 400 Value ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the S&P MidCap 400 Value IndexTM, which measures the performance of the mid-capitalization value sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.", "category": "Mid-Cap Value", "family": "iShares", "exchange": "PCX", "market": "us_market"}, "JKI": {"short_name": "iShares Morningstar Mid-Cap ETF", "long_name": "iShares Morningstar Mid-Cap Value ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Mid Value IndexSM composed of mid-capitalization U.S. equities that exhibit value characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by mid-capitalization companies that have exhibited \"value\" characteristics as determined by Morningstar, Inc.&#39;s (\"Morningstar\" or the \"index provider\") proprietary index methodology.", "category": "Mid-Cap Value", "family": "iShares", "exchange": "NGM", "market": "us_market"}, "ONEY": {"short_name": "SPDR Russell 1000 Yield Focus E", "long_name": "SPDR Russell 1000 Yield Focus ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Russell 1000 Yield Focused Factor Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to reflect the performance of a segment of large-capitalization U.S. equity securities demonstrating a combination of core factors (high value, high quality, and low size characteristics), with a focus factor comprising high yield characteristics (the \"Factor Characteristics\").", "category": "Mid-Cap Value", "family": "SPDR State Street Global Advisors", "exchange": "PCX", "market": "us_market"}, "PEY": {"short_name": "Invesco High Yield Equity Divid", "long_name": "Invesco High Yield Equity Dividend Achievers ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ US Dividend AchieversTM 50 Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, Nasdaq, Inc. includes common stocks in the underlying index that have a consistent record of dividend increases, principally on the basis of dividend yield and consistent growth in dividends.", "category": "Mid-Cap Value", "family": "Invesco", "exchange": "NMS", "market": "us_market"}, "WBIY": {"short_name": "WBI Power Factor High Dividend ", "long_name": "WBI Power Factor High Dividend ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that correspond to the price and yield of its underlying index, the Solactive Power Factor Â® High Dividend Index.\n Under normal circumstances the fund will invest at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to select securities from the Solactive US Broad Market Index that exhibit certain yield and fundamental value characteristics. The parent index includes large, mid- and small-cap securities listed in the U.S., including approximately the 3,000 largest U.S. companies that are selected and weighted according to free float market capitalization.", "category": "Mid-Cap Value", "family": "WBI Investments", "exchange": "PCX", "market": "us_market"}, "XMLV": {"short_name": "Invesco S&P MidCap Low Volatili", "long_name": "Invesco S&P MidCap Low Volatility ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400Â® Low Volatility Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, S&P Dow Jones Indices LLC compiles, maintains and calculates the index, which is designed to measure the performance of a subset of approximately 80 securities in the S&P MidCap 400 Â® Index that have the lowest realized volatility over the past 12 months.", "category": "Mid-Cap Value", "family": "Invesco", "exchange": "PCX", "market": "us_market"}, "XMVM": {"short_name": "Invesco S&P MidCap Value with M", "long_name": "Invesco S&P MidCap Value with Momentum ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400Â® High Momentum Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is designed to track the performance of approximately 80 stocks in the S&P MidCap 400Â® Index that have the highest \"value\" and \"momentum\" scores.", "category": "Mid-Cap Value", "family": "Invesco", "exchange": "PCX", "market": "us_market"}}