{
    "BOTZ": {
        "short_name": "Global X Robotics & Artificial ",
        "long_name": "Global X Robotics & Artificial Intelligence ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Indxx Global Robotics & Artificial Intelligence Thematic Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to exchange-listed companies in developed markets that are involved in the development of robotics and/or artificial intelligence as defined by Indxx, the provider of the underlying index. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "Global X Funds",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 2603186176
    },
    "DRIV": {
        "short_name": "Global X Autonomous & Electric ",
        "long_name": "Global X Autonomous & Electric Vehicles ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Autonomous & Electric Vehicles Index.\n The fund invests at least 80% of its total assets in the securities of the index. The index is designed to provide exposure to exchange-listed companies that are involved in the development of electric vehicles and/or autonomous vehicles, including companies that produce electric/hybrid vehicles, electric/hybrid vehicle components and materials, autonomous driving technology, and network connected services for transportation. It is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "Global X Funds",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 900170944
    },
    "ERTH": {
        "short_name": "Invesco MSCI Sustainable Future",
        "long_name": "Invesco MSCI Sustainable Future ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the MSCI Global Environment Select Index.\n The fund generally invests at least 90% of its total assets in the securities of companies that comprise the underlying index. The underlying index is a custom index comprised of companies that the index methodology has determined focus on offering products or services that contribute to a more environmentally sustainable economy by making a more efficient use of limited global natural resources.",
        "category": "Miscellaneous Sector",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 486795232
    },
    "FAN": {
        "short_name": "First Trust Global Wind Energy ",
        "long_name": "First Trust Global Wind Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield of an equity index called the ISE Clean Edge Global Wind EnergyTM Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index provides a benchmark for investors interested in tracking public companies throughout the world that are active in the wind energy industry. In order to be eligible for inclusion in the index, a security must be issued by a company that is actively engaged in some aspect of the wind energy industry. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 418699200
    },
    "GRID": {
        "short_name": "First Trust NASDAQ Clean Edge S",
        "long_name": "First Trust NASDAQ Clean Edge Smart Grid Infrastructure Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ OMXÂ® Clean EdgeÂ® Smart Grid Infrastructure IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index includes companies that are primarily engaged and involved in electric grid, electric meters and devices, networks, energy storage and management, and enabling software used by the smart grid infrastructure sector. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 266369328
    },
    "ICLN": {
        "short_name": "iShares S&P Global Clean Energy",
        "long_name": "iShares Global Clean Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P Global Clean Energy IndexTM composed of global equities in the clean energy sector.\n The index is designed to track the performance of approximately 100 clean energy-related companies. The fund generally invests at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the index. It is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 5811915776
    },
    "JETS": {
        "short_name": "U.S. Global Jets ETF",
        "long_name": "U.S. Global Jets ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the U.S. Global Jets Index.\n The fund uses a \"passive management\" (or indexing) approach to track the performance, before fees and expenses, of the index. The index is composed of the exchange-listed common stock (or depository receipts) of U.S. and international passenger airlines, aircraft manufacturers, airports, and terminal services companies (as determined by independent industry listings) across the globe (collectively, \"Airline Companies\"). The index may include small-, mid-, and large-capitalization companies. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "U.S. Global Investors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3887834880
    },
    "MJ": {
        "short_name": "ETFMG Alternative Harvest ETF",
        "long_name": "ETFMG Alternative Harvest ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Prime Alternative Harvest Index.\n The index is concentrated in the Pharmaceuticals, Biotechnology and Life Sciences group of industries and tracks the performance of the exchange-listed common stock (or corresponding ADRs or GDRs) of companies across the globe. The fund will invest at least 80% of its total assets, exclusive of collateral held from securities lending, in the component securities of the index and in ADRs and GDRs based on the component securities in the index. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "ETFMG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1811619840
    },
    "MJJ": {
        "short_name": "MicroSectors Cannabis ETNs",
        "long_name": "MicroSectors Cannabis ETNs",
        "currency": "USD",
        "summary": "The investment seeks to linked to the performance of the Indxx MicroSectorsTM North American Cannabis Index, which is described in this pricing supplement.\nThe index is designed to track the performance of companies that are publicly traded in the U.S. and/or Canada, and that provide products or services related to the medical or industrial use of cannabis or products derived from cannabis. The notes are unsecured and unsubordinated obligations of Bank of Montreal. Each note will have an initial principal amount of $50. The notes do not bear interest.",
        "category": "Miscellaneous Sector",
        "family": "Microsectors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 48387208
    },
    "MSOS": {
        "short_name": "AdvisorShares Trust AdvisorShar",
        "long_name": "AdvisorShares Pure US Cannabis ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n The fund is an actively managed ETF that seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets (plus any borrowings for investment purposes) in securities of companies that derive at least 50% of their net revenue from the marijuana and hemp business in the United States and in derivatives that have economic characteristics similar to such securities. It will concentrate at least 25% of its investments in the pharmaceuticals, biotechnology and life sciences industry group within the health care sector. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1033963264
    },
    "NLR": {
        "short_name": "VanEck Vectors Uranium & Nuclea",
        "long_name": "VanEck Vectors Uranium+Nuclear Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Uranium & Nuclear Energy Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes equity securities and depositary receipts issued by companies involved in uranium and nuclear energy. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 21818006
    },
    "PAWZ": {
        "short_name": "ProShares Pet Care ETF",
        "long_name": "ProShares Pet Care ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the FactSet Pet Care Index (the \"index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the index. The index consists of U.S. and non-U.S. companies that potentially stand to benefit from interest in, and resources spent on, pet ownership. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 303992800
    },
    "PBD": {
        "short_name": "Invesco Global Clean Energy ETF",
        "long_name": "Invesco Global Clean Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the WilderHill New Energy Global Innovation Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as American depositary receipts (\"ADRs\") and global depositary receipts (\"GDRs\") that represent securities in the underlying index. The underlying index is comprised primarily of companies whose technologies focus on the generation and use of cleaner energy, conservation and efficiency, and the advancement of renewable energy in general, as determined by the index provider.",
        "category": "Miscellaneous Sector",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 425351776
    },
    "PBW": {
        "short_name": "Invesco WilderHill Clean Energy",
        "long_name": "Invesco WilderHill Clean Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the WilderHill Clean Energy Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of stocks of publicly traded companies in the United States that are engaged in the business of the advancement of cleaner energy and conservation. Stocks are included in the underlying index based on the index provider&#39;s evaluation that such companies will substantially benefit from a societal transition toward the use of cleaner energy and conservation.",
        "category": "Miscellaneous Sector",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2200059904
    },
    "PEX": {
        "short_name": "ProShares Global Listed Private",
        "long_name": "ProShares Global Listed Private Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the LPX Direct Listed Private Equity Index (the \"index\").\n The index consists of up to 30 qualifying listed private equity companies. The fund invests insecurities that ProShare Advisors believes, in combination, should track the performance of the index. It will invest at least 80% of its total assets in component securities. The fund will concentrate its investments in a particular industry or group of industries, country or region to approximately the same extent as the index is so concentrated. It is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 18798416
    },
    "QCLN": {
        "short_name": "First Trust NASDAQ Clean Edge G",
        "long_name": "First Trust NASDAQ Clean Edge Green Energy Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQÂ® Clean EdgeÂ® Green Energy IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is designed to track the performance of small, mid and large capitalization clean energy companies that are publicly traded in the United States. It is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 2680650240
    },
    "SMOG": {
        "short_name": "VanEck Vectors Low Carbon Energ",
        "long_name": "VanEck Vectors Low Carbon Energy ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS Global Low Carbon Energy Index.\n The fund normally invests at least 80% of its total assets in stocks of low carbon energy companies. Such companies may include small- and medium-capitalization companies and foreign issuers. â\u0080\u009cLow carbon energy companiesâ\u0080\u009d refers to companies primarily engaged in renewable energy, including renewable energy production, alternative fuels, electric vehicles, and related technologies and building materials (such as advanced batteries). It is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 295391424
    },
    "TAN": {
        "short_name": "Invesco Solar ETF",
        "long_name": "Invesco Solar ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the MAC Global Solar Energy Index.\n The fund will generally invest at least 90% of its total assets in the securities (including American depositary receipts (â\u0080\u009cADRsâ\u0080\u009d)) that comprise the index. Strictly in accordance with its guidelines and mandated procedures, MAC Indexing LLC compiles, maintains, and calculates the index, which is designed to track the global solar energy equity sector. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3401499904
    },
    "THCX": {
        "short_name": "Spinnaker ETF Series The Cannab",
        "long_name": "The Cannabis ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Innovation Labs Cannabis Index.\n The fund will invest at least 80% of its total assets in the component securities of the index. It will also invest, under normal circumstances, at least 80% of its net assets, plus borrowings for investment purposes, in exchange listed common stock (or corresponding American Depositary Receipts (\"ADRs\") of Cannabis Companies. The index is a proprietary, rules-based index designed to track the performance of a portfolio of Cannabis Companies. The fund is non-diversified.",
        "category": "Miscellaneous Sector",
        "family": "Spinnaker Group",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 173881008
    },
    "TOKE": {
        "short_name": "Cambria Cannabis ETF",
        "long_name": "Cambria Cannabis ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation from investments in the global equity markets that have exposure to the broad cannabis industry.\n Under normal market conditions, at least 80% of the value of the fundâ\u0080\u0099s net assets (plus borrowings for investment purposes) will be invested in Cannabis Companies. The Advisor generally expects to invest in Cannabis Companies across a broad market capitalization spectrum of micro-, small-, and mid-capitalization stocks.",
        "category": "Miscellaneous Sector",
        "family": "CAMBRIA ETF TRUST",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 37847860
    },
    "VICE": {
        "short_name": "AdvisorShares Trust AdvisorShar",
        "long_name": "AdvisorShares Vice ETF",
        "currency": "USD",
        "summary": "The investment seeks long-term capital appreciation.\n The fund is an actively managed ETF that seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in securities of (i) companies that derive at least 50% of their net revenue from tobacco and alcoholic beverages, (ii) companies that derive at least 50% of their net revenue from the food and beverage industry, and (iii) companies that derive at least 50% of their net revenue from gaming activities. It invests primarily in U.S. exchange listed equity securities, including common and preferred stock and ADRs.",
        "category": "Miscellaneous Sector",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 13264179
    }
}