{"BOTZ": {"short_name": "Global X Robotics & Artificial ", "long_name": "Global X Robotics & Artificial Intelligence ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Indxx Global Robotics & Artificial Intelligence Thematic Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index. The underlying index is designed to provide exposure to exchange-listed companies in developed markets that are involved in the development of robotics and/or artificial intelligence as defined by Indxx, the provider of the underlying index. The fund is non-diversified.", "category": "Miscellaneous Sector", "family": "Global X Funds", "exchange": "NGM", "market": "us_market"}, "FAN": {"short_name": "First Trust Global Wind Energy ", "long_name": "First Trust Global Wind Energy ETF", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield of an equity index called the ISE Clean Edge Global Wind EnergyTM Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index provides a benchmark for investors interested in tracking public companies throughout the world that are active in the wind energy industry. In order to be eligible for inclusion in the index, a security must be issued by a company that is actively engaged in some aspect of the wind energy industry. The fund is non-diversified.", "category": "Miscellaneous Sector", "family": "First Trust", "exchange": "PCX", "market": "us_market"}, "FIW": {"short_name": "First Trust Water ETF", "long_name": "First Trust Water ETF", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the ISE Clean Edge Water Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is designed to track the performance of small, mid and large capitalization companies that derive a substantial portion of their revenues from the potable water and wastewater industry, according to Clean Edge.", "category": "Miscellaneous Sector", "family": "First Trust", "exchange": "PCX", "market": "us_market"}, "GRID": {"short_name": "First Trust NASDAQ Clean Edge S", "long_name": "First Trust NASDAQ Clean Edge Smart Grid Infrastructure Index Fund", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ OMXÂ® Clean EdgeÂ® Smart Grid Infrastructure IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index includes companies that are primarily engaged and involved in electric grid, electric meters and devices, networks, energy storage and management, and enabling software used by the smart grid infrastructure sector. The fund is non-diversified.", "category": "Miscellaneous Sector", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "ICLN": {"short_name": "iShares S&P Global Clean Energy", "long_name": "iShares Global Clean Energy ETF", "currency": "USD", "summary": "The investment seeks to track the S&P Global Clean Energy IndexTM.\n The fund generally invests at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the index. The index is designed to track the performance of approximately 28 clean energy-related companies. The fund is non-diversified.", "category": "Miscellaneous Sector", "family": "iShares", "exchange": "NMS", "market": "us_market"}, "JETS": {"short_name": "U.S. Global Jets ETF", "long_name": "U.S. Global Jets ETF", "currency": "USD", "summary": "The investment seeks to track the performance, before fees and expenses, of the U.S. Global Jets Index.\n The fund uses a \"passive management\" (or indexing) approach to track the performance, before fees and expenses, of the index. The index is composed of the exchange-listed common stock (or depository receipts) of U.S. and international passenger airlines, aircraft manufacturers, airports, and terminal services companies (as determined by independent industry listings) across the globe (collectively, \"Airline Companies\"). The index may include small-, mid-, and large-capitalization companies. The fund is non-diversified.", "category": "Miscellaneous Sector", "family": "U.S. Global Investors", "exchange": "PCX", "market": "us_market"}, "KOL": {"short_name": "VanEck Vectors Coal ETF", "long_name": "VanEck Vectors Coal ETF", "currency": "USD", "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Coal Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes companies in the global coal industry that generate at least 50% of their revenues from coal operation (production, mining and cokeries), transportation of coal, production of coal mining equipment as well as from storage and trade. It is non-diversified.", "category": "Miscellaneous Sector", "family": "VanEck", "exchange": "PCX", "market": "us_market"}, "MJ": {"short_name": "ETFMG Alternative Harvest ETF", "long_name": "ETFMG Alternative Harvest ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Prime Alternative Harvest Index.\n The fund will invest at least 80% of its total assets, exclusive of collateral held from securities lending, in the component securities of the index and in ADRs and GDRs based on the component securities in the index. The index is concentrated in the Pharmaceuticals, Biotechnology and Life Sciences group of industries and tracks the performance of the exchange-listed common stock (or corresponding ADRs or GDRs) of companies across the globe. The fund is non-diversified.", "category": "Miscellaneous Sector", "family": "ETFMG", "exchange": "PCX", "market": "us_market"}, "MJJ": {"short_name": "MicroSectors Cannabis ETNs", "long_name": "MicroSectors Cannabis ETNs", "currency": "USD", "summary": "The investment seeks to linked to the performance of the Indxx MicroSectorsTM North American Cannabis Index, which is described in this pricing supplement.\nThe index is designed to track the performance of companies that are publicly traded in the U.S. and/or Canada, and that provide products or services related to the medical or industrial use of cannabis or products derived from cannabis. The notes are unsecured and unsubordinated obligations of Bank of Montreal. Each note will have an initial principal amount of $50. The notes do not bear interest.", "category": "Miscellaneous Sector", "family": "Microsectors", "exchange": "PCX", "market": "us_market"}, "PZD": {"short_name": "Invesco Cleantech ETF", "long_name": "Invesco Cleantech ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the Cleantech IndexTM.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, which is designed to track the performance of publicly traded clean technology (or \"cleantech\") companies. Cleantech considers a company to be a cleantech company when it derives at least 50% of its revenues or operating profits from cleantech businesses.", "category": "Miscellaneous Sector", "family": "Invesco", "exchange": "PCX", "market": "us_market"}, "QCLN": {"short_name": "First Trust NASDAQ Clean Edge G", "long_name": "First Trust NASDAQ Clean Edge Green Energy Index Fund", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQÂ® Clean EdgeÂ® Green Energy IndexSM.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is designed to track the performance of small, mid and large capitalization clean energy companies that are publicly traded in the United States. It is non-diversified.", "category": "Miscellaneous Sector", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "VICE": {"short_name": "AdvisorShares Trust AdvisorShar", "long_name": "AdvisorShares Vice ETF", "currency": "USD", "summary": "The investment seeks long-term capital appreciation.\n The fund is an actively managed ETF that seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in securities of (i) companies that derive at least 50% of their net revenue from tobacco and alcoholic beverages, (ii) companies that derive at least 50% of their net revenue from the food and beverage industry, and (iii) companies that derive at least 50% of their net revenue from gaming activities. It invests primarily in U.S. exchange listed equity securities, including common and preferred stock and ADRs.", "category": "Miscellaneous Sector", "family": "AdvisorShares", "exchange": "PCX", "market": "us_market"}, "XT": {"short_name": "iShares Exponential Technologie", "long_name": "iShares Exponential Technologies ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the MorningstarÂ® Exponential Technologies IndexSM which composed of stocks of developed and emerging market companies that create or use exponential technologies.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is a subset of the Morningstar US Market Index and the Morningstar Global Markets ex-US Index family.", "category": "Miscellaneous Sector", "family": "iShares", "exchange": "NMS", "market": "us_market"}}