{
  "AFK": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "VanEck",
    "long_name": "VanEck Vectors Africa Index ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors-Africa Index ETF",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS® GDP Africa Index.\n The fund normallyinvests at least 80% of its total assets in securities that comprise the fund’s benchmark index. The index includes securities of African companies. African companies generally include local listings of companies that are incorporated in Africa and listings of companies incorporated outside of Africa but that have at least 50% of their revenues/related assets in Africa.",
    "total_assets": 55759140
  },
  "AGT": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Argentina and Global Exposure ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Argentina and Glob",
    "summary": "The investment seeks to track the investment results of the MSCI All Argentina 25/50 Index (the \"underlying index\").\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the broad Argentina equity universe, while including a minimum number of constituents, as defined by MSCI, Inc. (the \"index provider\" or \"MSCI\"). The fund is non-diversified.",
    "total_assets": 7413723
  },
  "ARGT": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Global X Funds",
    "long_name": "Global X MSCI Argentina ETF",
    "market": "us_market",
    "short_name": "Global X MSCI Argentina ETF",
    "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI All Argentina 25/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to represent the performance of the broad Argentina equity universe, while including a minimum number of constituents. The fund is non-diversified.",
    "total_assets": 53548432
  },
  "BDRY": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "ETFMG",
    "long_name": "Breakwave Dry Bulk Shipping ETF",
    "market": "us_market",
    "short_name": "Breakwave Dry Bulk Shipping ETF",
    "summary": "The investment seeks to provide investors with exposure to the daily change in the price of dry bulk freight futures, before expenses and liabilities of the fund, by tracking the performance of a portfolio consisting of a three-month strip of the nearest calendar quarter of futures contracts on specified indexes that measure rates for shipping dry bulk freight.\n The fund seeks to achieve its investment objective by investing substantially all of its assets in the Freight Futures currently constituting the Benchmark Portfolio. The Benchmark Portfolio includes a combination of Capesize, Panamax and Supramax Freight Futures.",
    "total_assets": 72806056
  },
  "DAX": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NMS",
    "family": "Global X Funds",
    "long_name": "Global X DAX Germany ETF",
    "market": "us_market",
    "short_name": "Global X DAX Germany ETF",
    "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, generally to the price and yield performance of the DAX® Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The index tracks the segment of the largest and most actively traded companies - known as blue chips - on the German equities market. The fund is non-diversified.",
    "total_assets": 33991520
  },
  "DBGR": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Xtrackers",
    "long_name": "Xtrackers MSCI Germany Hedged Equity ETF",
    "market": "us_market",
    "short_name": "Xtrackers MSCI Germany Hedged E",
    "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of the MSCI Germany US Dollar Hedged Index.\n The fund, using a \"passive\" or indexing investment approach, seeks investment results that correspond generally to the performance, before fees and expenses, of the underlying index, which is designed to track the performance of the German equity market while mitigating exposure to fluctuations between the value of the U.S. dollar and the euro. It will invest at least 80% of its total assets (but typically far more) in component securities of the underlying index. The fund is non-diversified.",
    "total_assets": 13268409
  },
  "DXGE": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NMS",
    "family": "WisdomTree",
    "long_name": "WisdomTree Germany Hedged Equity Fund",
    "market": "us_market",
    "short_name": "WisdomTree Germany Hedged Equit",
    "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree Germany Hedged Equity Index (the \"index\").\n The fund normally invests at least 80% of its total assets in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a dividend weighted index designed to provide exposure to Germany equity markets while at the same time neutralizing exposure to fluctuations of the value of the euro relative to the U.S. dollar. The fund is non-diversified.",
    "total_assets": 31460356
  },
  "ECH": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Chile ETF",
    "market": "us_market",
    "short_name": "iShares Inc. iShares MSCI Chile",
    "summary": "The investment seeks to track the investment results of the MSCI Chile IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index is a free float-adjusted market capitalization index that is designed to measure the performance of the large, mid and small cap segments of the Chilean market. The fund is non-diversified.",
    "total_assets": 505880448
  },
  "EDEN": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Denmark ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Denmar",
    "summary": "The investment seeks to track the investment results of the MSCI Denmark IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure broad-based equity market performance in Denmark. A capping methodology is applied that limits the weight of any single issuer to a maximum of 25% of the underlying index. The fund is non-diversified.",
    "total_assets": 180808320
  },
  "EFNL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Finland ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Finlan",
    "summary": "The investment seeks to track the investment results of the MSCI Finland IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure broad-based equity market performance in Finland. A capping methodology is applied that limits the weight of any single issuer to a maximum of 25% of the underlying index. The fund is non-diversified.",
    "total_assets": 29490344
  },
  "EGPT": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "VanEck",
    "long_name": "VanEck Vectors Egypt Index ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Egypt Index ETF",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS® Egypt Index.\n The fund will normally invest at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes securities of Egyptian companies. A company is generally considered to be an Egyptian company if it is incorporated in Egypt or is incorporated outside Egypt but has at least 50% of its revenues/related assets in Egypt. Such companies may include small- and medium-capitalization companies. It is non-diversified.",
    "total_assets": 24999100
  },
  "EIDO": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Indonesia ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Indonesia ETF",
    "summary": "The investment seeks to track the investment results of the MSCI Indonesia IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of the large-, mid- and small-capitalization segments of the Indonesian equity market. The fund is non-diversified.",
    "total_assets": 373507936
  },
  "EIRL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Ireland ETF",
    "market": "us_market",
    "short_name": "iShares Trust iShares MSCI Irel",
    "summary": "The investment seeks to track the investment results of the MSCI All Ireland Capped Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index. It is composed of Irish equities. The fund is non-diversified.",
    "total_assets": 58798396
  },
  "EIS": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Israel ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Israel",
    "summary": "The investment seeks to track the investment results of the MSCI Israel Capped Investable Market Index (IMI).\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization index designed to measure broad-based equity market performance in Israel. The fund is non-diversified.",
    "total_assets": 142206128
  },
  "ENOR": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Norway ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Norway",
    "summary": "The investment seeks to track the investment results of the MSCI Norway IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure broad-based equity market performance in Norway. A capping methodology is applied that limits the weight of any single issuer to a maximum of 25% of the underlying index. The fund is non-diversified.",
    "total_assets": 30011664
  },
  "ENZL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NMS",
    "family": "iShares",
    "long_name": "iShares MSCI New Zealand ETF",
    "market": "us_market",
    "short_name": "iShares MSCI New Zealand ETF",
    "summary": "The investment seeks to track the investment results of the MSCI New Zealand IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index primarily designed to measure the performance of equity securities in the approximately top 99% by market capitalization of equity securities listed on stock exchanges in New Zealand. The fund is non-diversified.",
    "total_assets": 177606704
  },
  "EPHE": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Philippines ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Philippines ETF",
    "summary": "The investment seeks to track the investment results of the MSCI Philippines IMI 25/50 Index(IMI).\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is a free float-adjusted market capitalization-weighted index designed to measure the performance of the Philippine equity markets. The fund is non-diversified.",
    "total_assets": 146933328
  },
  "EPOL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Poland ETF",
    "market": "us_market",
    "short_name": "iShares Trust iShares MSCI Pola",
    "summary": "The investment seeks to track the investment results of the MSCI Poland IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is a free float-adjusted market capitalization-weighted index designed to primarily measure the performance of equity securities listed on stock exchanges in Poland. The fund is non-diversified.",
    "total_assets": 250470784
  },
  "EPU": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Peru ETF",
    "market": "us_market",
    "short_name": "iShares Trust iShares MSCI Peru",
    "summary": "The investment seeks to track the investment results of the MSCI All Peru Capped Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is an index composed of Peruvian equities. The fund is non-diversified.",
    "total_assets": 189534224
  },
  "ERUS": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Russia ETF",
    "market": "us_market",
    "short_name": "iShares MSCI iShares MSCI Russi",
    "summary": "The investment seeks to track the investment results of the MSCI Russia 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to primarily measure the performance of equity securities listed on stock exchanges in Russia. The fund is non-diversified.",
    "total_assets": 460680800
  },
  "EWA": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Australia ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Australia Index Fu",
    "summary": "The investment seeks to track the investment results of the MSCI Australia Index composed of Australian equities.\n The fund generally invests at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index primarily consists of stocks traded on the Australian Stock Exchange. It will include large- and mid-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 1459900672
  },
  "EWC": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Canada ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Canada Index Fund",
    "summary": "The investment seeks to track the investment results of the MSCI Canada Custom Capped Index.\n The fund will at all times invest at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is designed to measure broad-based equity performance in Canada. The underlying index uses a capping methodology to limit the weight of any single issuer to a maximum of 25% of the underlying index. The underlying index will include large- and mid-capitalization companies and may change over time.",
    "total_assets": 3210412800
  },
  "EWD": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Sweden ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Sweden",
    "summary": "The investment seeks to track the investment results of the MSCI Sweden 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is designed to measure the performance of the large- and mid-cap segments of the Swedish market. A capping methodology is applied that limits the weight of any single issuer to a maximum of 25% of the underlying index. The fund is non-diversified.",
    "total_assets": 449093600
  },
  "EWG": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Germany ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Germany Index Fund",
    "summary": "The investment seeks to track the investment results of the MSCI Germany Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index primarily consists of stocks traded on the Frankfurt Stock Exchange. It will include large- and mid-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 2596413952
  },
  "EWGS": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Germany Small-Cap ETF",
    "market": "us_market",
    "short_name": "Ishares MSCI Germany Small Cap ",
    "summary": "The investment seeks to track the investment results of the MSCI Germany Small Cap Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities of German small capitalization companies.",
    "total_assets": 43292048
  },
  "EWI": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Italy ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Italy ",
    "summary": "The investment seeks to track the investment results of the MSCI Italy 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.",
    "total_assets": 248188976
  },
  "EWK": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Belgium ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Belgiu",
    "summary": "The investment seeks to track the investment results of the MSCI Belgium IMI 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index is designed to measure broad-based equity market performance in Belgium. A capping methodology is applied that limits the weight of any single issuer to a maximum of 25% of the underlying index. The fund is non-diversified.",
    "total_assets": 35679216
  },
  "EWL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Switzerland ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Switze",
    "summary": "The investment seeks to track the investment results of the MSCI Switzerland 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.",
    "total_assets": 1682998272
  },
  "EWM": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Malaysia ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Malaysia Index Fun",
    "summary": "The investment seeks to track the investment results of the MSCI Malaysia Index.\n The fund will at all times invest at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index primarily consists of stocks traded on the Kuala Lumpur Stock Exchange. It will include large- and mid-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 380267392
  },
  "EWN": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Netherlands ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Netherlands Index ",
    "summary": "The investment seeks to track the investment results of the MSCI Netherlands IMI 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index uses a capping methodology to limit the weight of any single issuer to a maximum of 25% of the underlying index. The underlying index will include large-, mid- and small-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 308692224
  },
  "EWO": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Austria ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Austri",
    "summary": "The investment seeks to track the investment results of the MSCI Austria IMI 25/50 Index.\n The fund generally invests at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.",
    "total_assets": 56604916
  },
  "EWP": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Spain ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Spain ",
    "summary": "The investment seeks to track the investment results of the MSCI Spain 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.",
    "total_assets": 550331648
  },
  "EWQ": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI France ETF",
    "market": "us_market",
    "short_name": "iShares MSCI France Index Fund",
    "summary": "The investment seeks to track the investment results of the MSCI France Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index primarily consists of stocks traded on the Paris Stock Exchange. It will include large- and mid-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 761960000
  },
  "EWS": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Singapore ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Singap",
    "summary": "The investment seeks to track the investment results of the MSCI Singapore 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The index is designed to measure the performance of the large- and mid-cap segments of the Singapore market. A capping methodology is applied that limits the weight of any single issuer to a maximum of 25% of the underlying index. The fund is non-diversified.",
    "total_assets": 687225344
  },
  "EWU": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI United Kingdom ETF",
    "market": "us_market",
    "short_name": "iShares MSCI",
    "summary": "The investment seeks to track the investment results of the MSCI United Kingdom Index.\n The fund will at all times invest at least 90% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index primarily consists of stocks traded on the London Stock Exchange. The underlying index will include large- and mid-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 3488841984
  },
  "EWUS": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI United Kingdom Small-Cap ETF",
    "market": "us_market",
    "short_name": "Ishares MSCI",
    "summary": "The investment seeks to track the investment results of the MSCI United Kingdom Small Cap Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the performance of equity securities of small-capitalization companies in the United Kingdom (the \"U.K.\") securities market.",
    "total_assets": 90829976
  },
  "EWW": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Mexico ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Mexico",
    "summary": "The investment seeks to track the investment results of the MSCI Mexico IMI 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.",
    "total_assets": 1102177408
  },
  "EWY": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI South Korea ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI South ",
    "summary": "The investment seeks to track the investment results of the MSCI Korea 25/50 Index.\n The fund will at all times invest at least 80% of its assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index is a free float-adjusted market capitalization-weighted index with a capping methodology applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. The fund is non-diversified.",
    "total_assets": 7541572096
  },
  "EZA": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI South Africa ETF",
    "market": "us_market",
    "short_name": "iShares MSCI South Africa Index",
    "summary": "The investment seeks to track the investment results of the MSCI South Africa 25/50 Index.\n The fund normally invests at least 95% of its total assets in the securities of its underlying index and in depositary receipts representing securities in its underlying index. The underlying index uses a capping methodology to limit the weight of any single issuer to a maximum of 25% of the underlying index. The underlying index will include large- and mid-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 363515744
  },
  "FGM": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NGM",
    "family": "First Trust",
    "long_name": "First Trust Germany AlphaDEX Fund",
    "market": "us_market",
    "short_name": "First Trust Germany AlphaDEX Fu",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEX® Germany Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Germany Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.",
    "total_assets": 111776840
  },
  "FKU": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NMS",
    "family": "First Trust",
    "long_name": "First Trust United Kingdom AlphaDEX Fund",
    "market": "us_market",
    "short_name": "First Trust",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEX® United Kingdom Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ United Kingdom Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.",
    "total_assets": 26115590
  },
  "FNI": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "First Trust",
    "long_name": "First Trust Chindia ETF",
    "market": "us_market",
    "short_name": "First Trust Chindia ETF",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the ISE ChIndiaTM Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is a modified market capitalization-weighted index designed to track the performance of U.S.-listed securities issued by small, mid and large capitalization companies domiciled in China or India. It is non-diversified.",
    "total_assets": 278460768
  },
  "FSZ": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NGM",
    "family": "First Trust",
    "long_name": "First Trust Switzerland AlphaDEX Fund",
    "market": "us_market",
    "short_name": "First Trust Switzerland AlphaDE",
    "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the NASDAQ AlphaDEX® Switzerland Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks, depositary receipts, real estate investment trusts (\"REITs\") and preferred shares that comprise the index. The index is designed to select stocks from the NASDAQ Switzerland Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEX® selection methodology.",
    "total_assets": 109540024
  },
  "GREK": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Global X Funds",
    "long_name": "Global X MSCI Greece ETF",
    "market": "us_market",
    "short_name": "Global X MSCI Greece ETF",
    "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI All Greece Select 25/50 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to represent the performance of the broad Greece equity universe. The fund is non-diversified.",
    "total_assets": 148438112
  },
  "GXF": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Global X Funds",
    "long_name": "Global X FTSE Nordic Region ETF",
    "market": "us_market",
    "short_name": "Global X FTSE Nordic Region ETF",
    "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the FTSE Nordic 30 Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to reflect the equity market performance of companies in Sweden, Denmark, Norway and Finland. The fund is non-diversified.",
    "total_assets": 29177584
  },
  "HEWG": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NGM",
    "family": "iShares",
    "long_name": "iShares Currency Hedged MSCI Germany ETF",
    "market": "us_market",
    "short_name": "iShares Currency Hedged MSCI Ge",
    "summary": "The investment seeks to track the investment results of the MSCI Germany 100% Hedged to USD Index.\n The fund generally will invest at least 90% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index primarily consists of stocks traded on the Frankfurt Stock Exchange with the currency risk inherent in the securities included in the underlying index hedged to the U.S. dollar on a monthly basis.",
    "total_assets": 68830032
  },
  "HEWU": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Currency Hedged MSCI United Kingdom ETF",
    "market": "us_market",
    "short_name": "iShares Currency Hedged MSCI",
    "summary": "The investment seeks to track the investment results of the MSCI United Kingdom 100% Hedged to USD Index.\n The fund generally will invest at least 80% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index primarily consists of stocks traded on the London Stock Exchange with the currency risk inherent in the securities included in the underlying index hedged to the U.S. dollar on a monthly basis.",
    "total_assets": 8103767
  },
  "HEWW": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Currency Hedged MSCI Mexico ETF",
    "market": "us_market",
    "short_name": "iShares Currency Hedged MSCI Me",
    "summary": "The investment seeks to track the investment results of the MSCI Mexico IMI 25/50 100% Hedged to USD Index.\n The fund generally will invest at least 80% of its assets in the component securities (including indirect investments through the underlying fund) and other instruments of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index primarily consists of stocks traded on the Mexican Stock Exchange with the currency risk inherent in the securities included in the underlying index hedged to the U.S. dollar on a monthly basis.",
    "total_assets": 687000
  },
  "ICOL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Colombia ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Colomb",
    "summary": "The investment seeks to track the investment results of the MSCI All Colombia Capped Index composed of Colombian equities.\n The fund generally will invest at least 80% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to represent the performance of the broad Colombia equity universe. The underlying index will include large-, mid- and small-capitalization companies and may change over time. The fund is non-diversified.",
    "total_assets": 25325960
  },
  "IDX": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "VanEck",
    "long_name": "VanEck Vectors Indonesia Index ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Indonesia Index ",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS® Indonesia Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes securities of Indonesian companies. A company is generally considered to be an Indonesian company if it is incorporated in Indonesia or is incorporated outside of Indonesia but has at least 50% of its revenues/related assets in Indonesia. Such companies may include small- and medium-capitalization companies. It is non-diversified.",
    "total_assets": 34532116
  },
  "ISRA": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "VanEck",
    "long_name": "VanEck Vectors Israel ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Israel ETF",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the BlueStar Israel Global Index®.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of equity securities, which may include depositary receipts, of publicly traded companies that are generally considered by MV Index Solutions GmbH to be Israeli companies. It may also utilize depositary receipts to seek performance that corresponds to the fund&#39;s benchmark index. The fund is non-diversified.",
    "total_assets": 80828400
  },
  "IZRL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "ARK ETF Trust",
    "long_name": "ARK Israel Innovative Technology ETF",
    "market": "us_market",
    "short_name": "ARK Israel Innovative Technolog",
    "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the ARK Israeli Innovation Index (\"index\").\n The fund normally invests at least 80% of its total assets in securities that are included in the fund&#39;s benchmark index, depositary receipts representing securities included in the index or underlying stocks in respect of depositary receipts included in the index. The index includes equity securities and depositary receipts of exchange listed companies that are incorporated and/or domiciled in Israel (\"Israeli Companies\"). The fund is non-diversified.",
    "total_assets": 342091296
  },
  "KWT": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares MSCI Kuwait ETF",
    "market": "us_market",
    "short_name": "iShares Trust iShares MSCI Kuwa",
    "summary": "The investment seeks to track the investment results of a broad-based equity index with exposure to Kuwait, as defined by the index provider.\n The fund seeks to track the investment results of the MSCI All Kuwait Select Size Liquidity Capped Index (the “underlying index”), which is designed to measure the performance of the Kuwait equity universe. The underlying index is a free float-adjusted market capitalization weighted index with a capping methodology applied to avoid concentration. BFA uses a representative sampling indexing strategy to manage the fund. It may or may not hold all of the securities in the underlying index. The fund is non-diversified.",
    "total_assets": 15861505
  },
  "NGE": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Global X Funds",
    "long_name": "Global X MSCI Nigeria ETF",
    "market": "us_market",
    "short_name": "Global X MSCI Nigeria ETF",
    "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI All Nigeria Select 25/50 Index.\n The fund will invest at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to represent the performance of the broad Nigeria equity universe, while including a minimum number of constituents. The fund is non-diversified.",
    "total_assets": 40498228
  },
  "PGAL": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Global X Funds",
    "long_name": "Global X MSCI Portugal ETF",
    "market": "us_market",
    "short_name": "Global X MSCI Portugal ETF",
    "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the MSCI All Portugal Plus 25/50 Index.\n The fund will invest at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to represent the performance of the broad Portugal equity universe, while including a minimum number of constituents. The fund is non-diversified.",
    "total_assets": 14644533
  },
  "RSX": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "VanEck",
    "long_name": "VanEck Vectors Russia ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Russia ETF",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS® Russia Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes securities, which may include depositary receipts, of Russian companies. A company is generally considered to be a Russian company if it is incorporated in Russia or is incorporated outside of Russia but has at least 50% of its revenues/related assets in Russia. Such companies may include medium-capitalization companies. It is non-diversified.",
    "total_assets": 1696135296
  },
  "RSXJ": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "VanEck",
    "long_name": "VanEck Vectors Russia Small-Cap ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Russia Small-Cap",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS® Russia Small-Cap Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes securities of Russian small-capitalization companies. It will normally invest at least 80% of its total assets in securities of small-capitalization Russian companies. The fund is non-diversified.",
    "total_assets": 32357232
  },
  "THD": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares MSCI Thailand ETF",
    "market": "us_market",
    "short_name": "iShares Inc iShares MSCI Thaila",
    "summary": "The investment seeks to track the investment results of the MSCI Thailand IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index primarily consists of stocks traded on the Stock Exchange of Thailand. A capping methodology is applied to issuer weights so that no single issuer exceeds 25% of the underlying index weight, and all issuers with a weight above 5% do not cumulatively exceed 50% of the underlying index weight. It is non-diversified.",
    "total_assets": 445188448
  },
  "TUR": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NMS",
    "family": "iShares",
    "long_name": "iShares MSCI Turkey ETF",
    "market": "us_market",
    "short_name": "iShares MSCI Turkey ETF",
    "summary": "The investment seeks to track the investment results of the MSCI Turkey IMI 25/50 Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The underlying index primarily consists of stocks traded on the Istanbul Stock Exchange (ISE). The fund is non-diversified.",
    "total_assets": 300544640
  },
  "UAE": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "NMS",
    "family": "iShares",
    "long_name": "iShares MSCI UAE ETF",
    "market": "us_market",
    "short_name": "iShares MSCI UAE ETF",
    "summary": "The investment seeks to track the investment results of the MSCI All UAE Capped Index composed of UAE equities.\n The fund generally will invest at least 80% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index is designed to measure the equity market in the United Arab Emirates (\"UAE\"). The fund is non-diversified.",
    "total_assets": 16773837
  },
  "VNM": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "BTS",
    "family": "VanEck",
    "long_name": "VanEck Vectors Vietnam ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Vietnam ETF",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVIS® Vietnam Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes securities of Vietnamese companies. A company is generally considered to be a Vietnamese company if it is incorporated in Vietnam or is incorporated outside of Vietnam but has at least 50% of its revenues/related assets in Vietnam. It is non-diversified.",
    "total_assets": 519291168
  },
  "ZCAN": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Solactive Canada ETF",
    "market": "us_market",
    "short_name": "SPDR Solactive Canada ETF",
    "summary": "The investment seeks to track the performance of the Solactive GBS Canada Large & Mid Cap USD Index NTR.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a free float-adjusted market capitalization index that is designed to measure the equity market performance of large- and mid-cap companies in Canada.",
    "total_assets": 51622612
  },
  "ZDEU": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Solactive Germany ETF",
    "market": "us_market",
    "short_name": "SPDR Solactive Germany ETF",
    "summary": "The investment seeks to track the performance of the Solactive GBS Germany Large & Mid Cap USD Index NTR.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a free float-adjusted market capitalization index that is designed to measure the equity market performance of large- and mid-cap companies in Germany. The fund is non-diversified.",
    "total_assets": 29159984
  },
  "ZGBR": {
    "category": "Miscellaneous Region",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Solactive United Kingdom ETF",
    "market": "us_market",
    "short_name": "SPDR Solactive",
    "summary": "The investment seeks to track the performance of the Solactive GBS United Kingdom Large & Mid Cap USD Index NTR.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is a free float-adjusted market capitalization index that is designed to measure the equity market performance of large- and mid-cap companies in the United Kingdom. The fund is non-diversified.",
    "total_assets": 14213800
  }
}
