{"ADFI": {"short_name": "Anfield Dynamic Fixed Income ET", "long_name": "Anfield Dynamic Fixed Income ETF", "currency": "USD", "summary": "The investment seeks to provide total return with capital preservation as a secondary objective.\n The fund is an actively managed ETF that is a \"fund of funds,\" meaning that it primarily invests its assets in securities of other ETFs. It normally invests at least 80% of its net assets, including any borrowings for investment purposes, in other unaffiliated ETFs that invest in any facet of the global debt markets, including corporate bonds, U.S. government and agency securities, private debt, foreign sovereign bonds, convertible securities, bank loans, asset-backed securities, mortgage-backed securities, and cash equivalent instruments.", "category": "Multisector Bond", "family": "Anfield", "exchange": "BTS", "market": "us_market"}, "AFIF": {"short_name": "Anfield Universal Fixed Income ", "long_name": "Anfield Universal Fixed Income ETF", "currency": "USD", "summary": "The investment seeks current income.\n The fund is an actively managed exchange traded fund (\"ETF\") that normally invests at least 80% of its net assets, including any borrowings for investment purposes, in a diversified portfolio of fixed income instruments. The principal investments of the fund include corporate bonds, U.S. government and agency securities, master-limited partners (\"MLPs\") (tied to energy-related commodities), private debt, foreign sovereign bonds, convertible securities, bank loans, asset-backed securities, mortgage-backed securities, and cash equivalent instruments.", "category": "Multisector Bond", "family": "Affinity", "exchange": "BTS", "market": "us_market"}, "DIAL": {"short_name": "Columbia Diversified Fixed Inco", "long_name": "Columbia Diversified Fixed Income Allocation ETF", "currency": "USD", "summary": "The investment seeks investment results that closely correspond to the performance of the Beta AdvantageÂ® Multi-Sector Bond Index.\n The fund invests at least 80% of its assets in securities within the index or in securities, that have economic characteristics that are substantially the same as the economic characteristics of the securities within the index. The index reflects a rules-based multi-sector strategic beta approach to measuring the performance of the debt market through representation of six sectors of the debt market in the index, each focused on yield, quality, and liquidity of the particular eligible universe.", "category": "Multisector Bond", "family": "Columbia Threadneedle", "exchange": "PCX", "market": "us_market"}, "DWFI": {"short_name": "SPDR Dorsey Wright Fixed Income", "long_name": "SPDR Dorsey Wright Fixed Income Allocation ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Dorsey Wright Fixed Income Allocation Index.\n The index is comprised of exchange-traded funds advised by SSGA Funds Management, Inc. The selection universe for the index includes U.S.-listed fixed income ETFs advised by SSGA FM or its affiliates that are designed to target exposure to fixed income securities. The fund invests at least 80%, of its total assets in securities comprising the index. It is non-diversified.", "category": "Multisector Bond", "family": "SPDR State Street Global Advisors", "exchange": "NMS", "market": "us_market"}, "FISR": {"short_name": "SPDR SSGA Fixed Income Sector R", "long_name": "SPDR SSGA Fixed Income Sector Rotation ETF", "currency": "USD", "summary": "The investment seeks to provide total return by focusing on investments in income and yield-generating assets.\n The fund is a \"fund of funds,\" meaning that it primarily invests its assets in securities of other exchange-traded funds (\"ETFs\"). Under normal circumstances, it invests at least 80% of its net assets (plus the amount of borrowings for investments purposes) directly, or indirectly through the underlying ETFs, in fixed income securities. The fund or ETFs in which it invests may use derivative instruments to gain or hedge exposure to certain securities as an alternative to investing directly in such securities.", "category": "Multisector Bond", "family": "SPDR State Street Global Advisors", "exchange": "PCX", "market": "us_market"}, "FWDB": {"short_name": "AdvisorShares FolioBeyond Smart", "long_name": "AdvisorShares FolioBeyond Smart Core Bond ETF", "currency": "USD", "summary": "The investment seeks investment results that exceed the price and yield performance of its benchmark, the Bloomberg Barclays U.S. Aggregate Bond Index.\n The Sub-Advisor selects a portfolio of fixed income (bond) exchange-traded funds (\"Underlying ETFs\") and other exchange-traded products, including, but not limited to, exchange-traded notes (\"ETNs\"), exchange-traded currency trusts, and exchange-traded commodity pools. The Advisor selects from among ETPs representing more than 20 distinct global bond classes, including, but not limited to, treasury bonds, municipal bonds, investment grade corporate bonds, high-yield U.S. corporate bonds.", "category": "Multisector Bond", "family": "AdvisorShares", "exchange": "PCX", "market": "us_market"}, "TGIF": {"short_name": "SoFi Weekly Income ETF", "long_name": "SoFi Weekly Income ETF", "currency": "USD", "summary": "The investment seeks to provide current income.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective, under normal circumstances, by investing in U.S.-dollar denominated investment grade and non-investment grade (also known as \"high-yield\" or \"junk\") fixed income securities and instruments and is expected to distribute income from its investments to shareholders weekly. It may invest in a variety of fixed income instruments with a fixed or floating (variable) interest rate. The fund is non-diversified.", "category": "Multisector Bond", "family": "Sofi", "exchange": "PCX", "market": "us_market"}}