{
    "ADFI": {
        "short_name": "Anfield Dynamic Fixed Income ET",
        "long_name": "Anfield Dynamic Fixed Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return with capital preservation as a secondary objective.\n The fund is an actively managed ETF that is a \"fund of funds,\" meaning that it primarily invests its assets in securities of other ETFs. It normally invests at least 80% of its net assets, including any borrowings for investment purposes, in other unaffiliated ETFs that invest in any facet of the global debt markets, including corporate bonds, U.S. government and agency securities, private debt, foreign sovereign bonds, convertible securities, bank loans, asset-backed securities, mortgage-backed securities, and cash equivalent instruments.",
        "category": "Multisector Bond",
        "family": "Anfield",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 6501273
    },
    "AFIF": {
        "short_name": "Anfield Universal Fixed Income ",
        "long_name": "Anfield Universal Fixed Income ETF",
        "currency": "USD",
        "summary": "The investment seeks current income.\n The fund is an actively managed exchange traded fund (\"ETF\") that normally invests at least 80% of its net assets, including any borrowings for investment purposes, in a diversified portfolio of fixed income instruments. The principal investments of the fund include corporate bonds, U.S. government and agency securities, master-limited partners (\"MLPs\") (tied to energy-related commodities), private debt, foreign sovereign bonds, convertible securities, bank loans, asset-backed securities, mortgage-backed securities, and cash equivalent instruments.",
        "category": "Multisector Bond",
        "family": "Affinity",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 129231632
    },
    "DEED": {
        "short_name": "First Trust TCW Securitized Plu",
        "long_name": "First Trust TCW Securitized Plus ETF",
        "currency": "USD",
        "summary": "The investment seeks to maximize long-term total return.\n Under normal market conditions, the fund will invest at least 80% of its net assets (including investment borrowings) in securitized debt securities, including asset-backed securities, residential and commercial mortgage-backed securities and collateralized loan obligations (\"CLOs\"). It will invest at least 50% of its total assets in securities issued or guaranteed by the U.S. government, its agencies or instrumentalities (such as Ginnie Mae), and U.S. government-sponsored entities (such as Fannie Mae and Freddie Mac). The fund is non-diversified.",
        "category": "Multisector Bond",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 93145840
    },
    "DIAL": {
        "short_name": "Columbia Diversified Fixed Inco",
        "long_name": "Columbia Diversified Fixed Income Allocation ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond to the performance of the Beta AdvantageÂ® Multi-Sector Bond Index.\n The fund invests at least 80% of its assets in securities within the index or in securities, that have economic characteristics that are substantially the same as the economic characteristics of the securities within the index. The index reflects a rules-based multi-sector strategic beta approach to measuring the performance of the debt market through representation of six sectors of the debt market in the index, each focused on yield, quality, and liquidity of the particular eligible universe.",
        "category": "Multisector Bond",
        "family": "Columbia Threadneedle",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 952977088
    },
    "DWFI": {
        "short_name": "SPDR Dorsey Wright Fixed Income",
        "long_name": "SPDR Dorsey Wright Fixed Income Allocation ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Dorsey Wright Fixed Income Allocation Index.\n The index is comprised of exchange-traded funds advised by SSGA Funds Management, Inc. The selection universe for the index includes U.S.-listed fixed income ETFs advised by SSGA FM or its affiliates that are designed to target exposure to fixed income securities. The fund invests at least 80%, of its total assets in securities comprising the index. It is non-diversified.",
        "category": "Multisector Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 80158112
    },
    "FISR": {
        "short_name": "SPDR SSGA Fixed Income Sector R",
        "long_name": "SPDR SSGA Fixed Income Sector Rotation ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide total return by focusing on investments in income and yield-generating assets.\n The fund is a \"fund of funds,\" meaning that it primarily invests its assets in securities of other exchange-traded funds (\"ETFs\"). Under normal circumstances, it invests at least 80% of its net assets (plus the amount of borrowings for investments purposes) directly, or indirectly through the underlying ETFs, in fixed income securities. The fund or ETFs in which it invests may use derivative instruments to gain or hedge exposure to certain securities as an alternative to investing directly in such securities.",
        "category": "Multisector Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 60363280
    },
    "FWDB": {
        "short_name": "AdvisorShares FolioBeyond Smart",
        "long_name": "AdvisorShares FolioBeyond Smart Core Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that exceed the price and yield performance of its benchmark, the Bloomberg Barclays U.S. Aggregate Bond Index.\n The Sub-Advisor selects a portfolio of fixed income (bond) exchange-traded funds (\"Underlying ETFs\") and other exchange-traded products, including, but not limited to, exchange-traded notes (\"ETNs\"), exchange-traded currency trusts, and exchange-traded commodity pools. The Advisor selects from among ETPs representing more than 20 distinct global bond classes, including, but not limited to, treasury bonds, municipal bonds, investment grade corporate bonds, high-yield U.S. corporate bonds.",
        "category": "Multisector Bond",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5793467
    },
    "HYTR": {
        "short_name": "CP High Yield Trend ETF",
        "long_name": "CP High Yield Trend ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track, before fees and expenses, the performance of the CP High Yield Trend Index(the \"index\").\n The fund seeks to achieve its investment objective by investing at least 80% of its net assets in securities included in the index. The rules-based index is comprised of a blend of allocations to two asset classes: U.S. high yield corporate bond exchange-traded funds (\"ETFs\") and U.S. 3-7 year Treasury ETFs.",
        "category": "Multisector Bond",
        "family": "Counterpoint Mutual Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 11928668
    },
    "KDFI": {
        "short_name": "KFA Dynamic Fixed Income ETF",
        "long_name": "KFA Dynamic Fixed Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, track the price and yield performance of the FTSE US High-Yield Treasury Rotation Index.\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the index. As of each monthly reconstitution, the underlying index will be fully invested in one of the three following sub-indexes: FTSE US Treasury 1-5 Years Index; FTSE US Treasury 7-10 Years Index; and FTSE US High-Yield Market BB/B-Rated Capped Custom Index. It is non-diversified.",
        "category": "Multisector Bond",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 73501440
    },
    "NFLT": {
        "short_name": "Virtus Newfleet Multi-Sector Bo",
        "long_name": "Virtus Newfleet Multi-Sector Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide a high level of current income and, secondarily, capital appreciation.\n Under normal market conditions, the fund will invest not less than 80% of its net assets (plus the amount of any borrowings for investment purposes) in bonds. The Sub-Adviser seeks to select securities using a sector rotation approach and seeks to adjust the proportion of fund investments in various sectors and sub-sectors in an effort to obtain higher relative returns.",
        "category": "Multisector Bond",
        "family": "Virtus",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 18810348
    },
    "TFLT": {
        "short_name": "Global X TargetIncome Plus 2 ET",
        "long_name": "Global X TargetIncome Plus 2 ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond to the price and yield performance, before fees and expenses, of the Wilshire TargetIncomeTM 10-Year Treasury +2% Plus Index.\n The fund is a fund of funds and invests at least 80% of its total assets in the securities of the underlying index. The underlying index seeks to provide broad exposure to income-producing asset classes using a portfolio of exchange-traded funds, with the goal, but not the guarantee, of providing exposure that may be sufficient to support an annualized yield of the U.S. 10-Year Treasury yield plus two percent for the fund, net of fees. The fund is non-diversified.",
        "category": "Multisector Bond",
        "family": "Global X Funds",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 4655321
    },
    "TGIF": {
        "short_name": "SoFi Weekly Income ETF",
        "long_name": "SoFi Weekly Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective, under normal circumstances, by investing in U.S.-dollar denominated investment grade and non-investment grade (also known as \"high-yield\" or \"junk\") fixed income securities and instruments and is expected to distribute income from its investments to shareholders weekly. It may invest in a variety of fixed income instruments with a fixed or floating (variable) interest rate. The fund is non-diversified.",
        "category": "Multisector Bond",
        "family": "Sofi",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 18318636
    },
    "VRP": {
        "short_name": "Invesco Variable Rate Preferred",
        "long_name": "Invesco Variable Rate Preferred ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Wells FargoÂ® Hybrid and Preferred Securities Floating and Variable Rate Index.\n The fund generally will invest at least 90% of its total assets in the components of the index. The index is a market capitalization-weighted index designed to track the performance of preferred stock, as well as certain types of hybrid securities that are comparable to preferred stocks, that are issued by U.S.-based or foreign issuers and that pay a floating or variable rate dividend or coupon. The fund is non-diversified.",
        "category": "Multisector Bond",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1532295680
    },
    "WBII": {
        "short_name": "WBI BullBear Global Income ETF",
        "long_name": "WBI BullBear Global Income ETF",
        "currency": "USD",
        "summary": "The investment seeks current income with the potential for long-term capital appreciation, while also seeking to protect principal during unfavorable market conditions.\n Under normal market conditions, the fund will invest at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in income-producing debt and equity securities of foreign and domestic issuers, including the securities of foreign and domestic corporate and government entities.",
        "category": "Multisector Bond",
        "family": "WBI Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 52939376
    }
}