{
    "DALT": {
        "short_name": "Anfield Capital Diversified Alt",
        "long_name": "Anfield Capital Diversified Alternatives ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide capital growth and income.\n The fund is an actively managed exchange traded fund (\"ETF\") that is a fund of funds. It seeks to achieve its investment objective by investing primarily in alternative asset classes and securities that represent sectors, market segments or asset classes that do not represent the general investment universe. The fund will implement this strategy primarily through investments in unaffiliated ETFs, closed-end funds (\"CEFs\"), business development companies (\"BDCs\") and real estate investment trusts (\"REITs\").",
        "category": "Multialternative",
        "family": "Regents Park Funds",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FLSP": {
        "short_name": "Franklin Liberty Systematic Sty",
        "long_name": "Franklin Liberty Systematic Style Premia ETF",
        "currency": "USD",
        "summary": "The investment seeks absolute return.\n The fund seeks to achieve its investment goal by allocating its assets across two underlying \"alternative\" investment strategies, which represent top-down and bottom-up approaches to capturing factor-based risk premia. Through the two strategies, it may invest in or obtain exposure to: (i) equity securities (which may include common stocks and preferred stocks), (ii) debt securities (which may include bonds, notes, debentures, banker&#39;s acceptances and commercial paper), (iii) commodity-linked derivative instruments and (iv) currency-related derivative instruments.",
        "category": "Multialternative",
        "family": "Franklin Templeton Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "QAI": {
        "short_name": "IQ Hedge MultiIQ Hedge Multi-St",
        "long_name": "IQ Hedge Multi-Strategy Tracker ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance of its underlying index, the IQ Hedge Multi-Strategy Index.\n The fund is a \"fund of funds\" which means it invests, under normal circumstances, at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in the investments included in its underlying index, which includes underlying funds. The underlying index consists of a number of components (\"underlying index Components\") selected in accordance with IndexIQ&#39;s rules-based methodology of such underlying index.",
        "category": "Multialternative",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market"
    }
}