{
  "MEAR": {
    "category": "Muni National Short",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares Short Maturity Municipal Bond ETF",
    "market": "us_market",
    "short_name": "BlackRock Short Maturity Munici",
    "summary": "The investment seeks to maximize tax-free current income.\n The fund normally invests at least 80% of its net assets in municipal securities such that the interest on each bond is exempt from U.S. federal income taxes and the federal alternative minimum tax (\"AMT\"). It primarily invests in U.S. dollar-denominated investment-grade short-term fixed- and floating-rate municipal securities with remaining maturities of five years or less, such as municipal bonds, municipal notes and variable rate demand obligations, as well as money market instruments and registered investment companies. The fund is an actively managed exchange-traded fund (\"ETF\").",
    "total_assets": 276214400
  },
  "SHM": {
    "category": "Muni National Short",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR Nuveen Bloomberg Barclays Short Term Municipal Bond ETF",
    "market": "us_market",
    "short_name": "SPDR Nuveen Bloomberg Barclays ",
    "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays Managed Money Municipal Short Term Index.\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Sub-Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to track the publicly traded municipal bonds that cover the U.S. dollar denominated short term tax exempt bond market.",
    "total_assets": 4622076416
  },
  "SMB": {
    "category": "Muni National Short",
    "currency": "USD",
    "exchange": "BTS",
    "family": "VanEck",
    "long_name": "VanEck Vectors Short Muni ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors ETF Trust VanEck",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the Bloomberg Barclays AMT-Free Short Continuous Municipal Index.\n The fund normally invests at least 80% of its total assets in fixed income securities that comprise the index. The index is comprised of publicly traded municipal bonds that cover the U.S. dollar denominated short-term tax-exempt bond market.",
    "total_assets": 282513696
  },
  "SMMU": {
    "category": "Muni National Short",
    "currency": "USD",
    "exchange": "PCX",
    "family": "PIMCO",
    "long_name": "PIMCO Short Term Municipal Bond Active Exchange-Traded Fund",
    "market": "us_market",
    "short_name": "Short Term Municipal Bond Activ",
    "summary": "The investment seeks attractive tax-exempt income, consistent with preservation of capital.\n The fund invests at least 80% of its assets in a diversified portfolio of debt securities whose interest is, in the opinion of bond counsel for the issuer at the time of issuance, exempt from federal income tax (\"Municipal Bonds\"). Municipal Bonds generally are issued by or on behalf of states and local governments and their agencies, authorities and other instrumentalities. It may only invest in U.S. dollar-denominated investment grade debt securities, rated Baa or higher.",
    "total_assets": 372669952
  },
  "SUB": {
    "category": "Muni National Short",
    "currency": "USD",
    "exchange": "PCX",
    "family": "iShares",
    "long_name": "iShares Short-Term National Muni Bond ETF",
    "market": "us_market",
    "short_name": "iShares Short-Term National Mun",
    "summary": "The investment seeks to track the investment results of the S&P Short Term National AMT-Free Municipal Bond IndexTM.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of the short-term investment-grade segment of the U.S. municipal bond market.",
    "total_assets": 4368611328
  }
}
