{"AVMU": {"short_name": "Avantis Core Municipal Fixed In", "long_name": "Avantis Core Municipal Fixed Income ETF", "currency": "USD", "summary": "The investment seeks current income that is exempt from federal income tax.\n Under normal market conditions, the fund will invest at least 80% of its net assets, plus any borrowings for investment purposes, in municipal fixed income securities with interest payments exempt from federal income tax. The advisor expects to maintain a weighted average duration within 2 years of the weighted average duration of its benchmark, the S&P National AMT-Free Municipal Bond index.", "category": "Muni National Interm", "family": "Avantis Investors", "exchange": "PCX", "market": "us_market"}, "FLMI": {"short_name": "Franklin Templeton ETF Trust Fr", "long_name": "Franklin Liberty Intermediate Municipal Opportunities ETF", "currency": "USD", "summary": "The investment seeks a high level of current income that is exempt from federal income taxes.\n Under normal market conditions, the fund invests at least 80% of its net assets in municipal securities whose interest is free from federal income taxes, including the federal alternative minimum tax. Although the fund tries to invest all of its assets in tax-free securities, it is possible that up to 20% of the fund&#39;s net assets may be in securities that pay interest that may be subject to the federal alternative minimum tax and, although not anticipated, in securities that pay interest subject to other federal or state income taxes.", "category": "Muni National Interm", "family": "Franklin Templeton Investments", "exchange": "PCX", "market": "us_market"}, "FMB": {"short_name": "First Trust Managed Municipal E", "long_name": "First Trust Managed Municipal ETF", "currency": "USD", "summary": "The investment seeks to generate current income that is exempt from regular federal income taxes and its secondary objective is long term capital appreciation.\n Under normal market conditions, the fund seeks to achieve its investment objectives by investing at least 80% of its net assets (including investment borrowings) in municipal debt securities that pay interest that is exempt from regular federal income taxes.", "category": "Muni National Interm", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "MUB": {"short_name": "iShares National Muni Bond ETF", "long_name": "iShares National Muni Bond ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the S&P National AMT-Free Municipal Bond IndexTM.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of the investment-grade segment of the U.S. municipal bond market.", "category": "Muni National Interm", "family": "iShares", "exchange": "PCX", "market": "us_market"}, "MUNI": {"short_name": "PIMCO Intermediate Municipal Bo", "long_name": "PIMCO Intermediate Municipal Bond Active Exchange-Traded Fund", "currency": "USD", "summary": "The investment seeks attractive tax-exempt income, consistent with preservation of capital.\n The fund invests at least 80% of its assets in a diversified portfolio of debt securities whose interest is, in the opinion of bond counsel for the issuer at the time of issuance, exempt from federal income tax (\"Municipal Bonds\"). It may invest 25% or more of its total assets in Municipal Bonds that finance similar projects, such as those relating to education, health care, housing, transportation, and utilities, and 25% or more of its total assets in industrial development bonds.", "category": "Muni National Interm", "family": "PIMCO", "exchange": "PCX", "market": "us_market"}, "TAXF": {"short_name": "American Century Diversified Mu", "long_name": "American Century Diversified Municipal Bond ETF", "currency": "USD", "summary": "The investment seeks current income that is exempt from federal income tax.\n The fund invests in municipal and other debt securities. Under normal market conditions, the portfolio managers invest at least 80% of the fund&#39;s net assets, plus borrowings for investment purposes, in municipal securities with interest payments exempt from federal income tax. The fund principally invests in investment-grade debt securities but may invest in high-yield securities (junk bonds).", "category": "Muni National Interm", "family": "American Century Investments", "exchange": "PCX", "market": "us_market"}, "VTEB": {"short_name": "Vanguard Tax-Exempt Bond ETF", "long_name": "Vanguard Tax-Exempt Bond Index Fund ETF Shares", "currency": "USD", "summary": "The investment seeks to track the Standard & Poor&#39;s National AMT-Free Municipal Bond Index, which measures the performance of the investment-grade segment of the U.S. municipal bond market.\n This index includes municipal bonds from issuers that are primarily state or local governments or agencies whose interest is exempt from U.S. federal income taxes and the federal alternative minimum tax (AMT). All of the fund&#39;s investments will be selected through the sampling process, and at least 80% of the fund&#39;s assets will be invested in securities held in the index.", "category": "Muni National Interm", "family": "Vanguard", "exchange": "PCX", "market": "us_market"}}