{
    "AQWA": {
        "short_name": "Global X Clean Water ETF",
        "long_name": "Global X Clean Water ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global Clean Water Industry Index.\n The fund invests at least 80% of its total assets, plus borrowings for investments purposes (if any), in the securities of the underlying index and in ADRs and GDRs based on the securities in the underlying index. The underlying index is designed to provide exposure to companies that have business operations in the provision of clean water. It is non-diversified.",
        "category": "Natural Resources",
        "family": "Global X Funds",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 3102779
    },
    "CGW": {
        "short_name": "Invesco S&P Global Water Index ",
        "long_name": "Invesco S&P Global Water Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P Global Water Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as ADRs and GDRs that represent securities in the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains, and calculates the underlying index, which is designed to measure the performance of approximately 50 of the largest global companies in water-related businesses. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 881670656
    },
    "COPX": {
        "short_name": "Global X Copper Miners ETF",
        "long_name": "Global X Copper Miners ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global Copper Miners Total Return Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to measure broad-based equity market performance of global companies involved in the copper mining industry. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 909414208
    },
    "CUT": {
        "short_name": "Invesco MSCI Global Timber ETF",
        "long_name": "Invesco MSCI Global Timber ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the MSCI ACWI IMI Timber Select Capped Index (the underlying index).\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as American depositary receipts (\"ADRs\") and global depositary receipts (\"GDRs\") that represent securities in the underlying index. The underlying index is comprised of equity securities of companies that are primarily engaged in the ownership and management of forests and timberlands and the production of finished products that use timber as a raw material. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 100231608
    },
    "EBLU": {
        "short_name": "Ecofin Global Water ESG Fund",
        "long_name": "Ecofin Global Water ESG Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and distribution rate (total return) performance of the Ecofin Global Water ESG Net Total Return IndexSM.\n The fund will normally invest at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in the types of securities suggested by its name (i.e., Water Companies). The index is a proprietary rules-based, modified market capitalization weighted, float adjusted index designed to track the overall performance of equity securities of global Water Companies listed on developed country exchanges. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Ecofin",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 31522768
    },
    "FIW": {
        "short_name": "First Trust Water ETF",
        "long_name": "First Trust Water ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the ISE Clean Edge Water Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is designed to track the performance of small, mid and large capitalization companies that derive a substantial portion of their revenues from the potable water and wastewater industry, according to Clean Edge.",
        "category": "Natural Resources",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 934449920
    },
    "FMAT": {
        "short_name": "Fidelity MSCI Materials Index E",
        "long_name": "Fidelity MSCI Materials Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Materials 25/50 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Materials 25/50 Index, which represents the performance of the materials sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Materials 25/50 Index. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 317550208
    },
    "FTAG": {
        "short_name": "First Trust Indxx Global Agricu",
        "long_name": "First Trust Indxx Global Agriculture ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Indxx Global Agriculture Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is a market capitalization weighted index designed to measure the performance of companies that are directly or indirectly engaged in improving agricultural yields. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 4312919
    },
    "FTRI": {
        "short_name": "First Trust Indxx Global Natura",
        "long_name": "First Trust Indxx Global Natural Resources Income ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Indxx Global Natural Resources Income Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and depositary receipts that comprise the index. The index is a free float adjusted market capitalization weighted index designed to measure the market performance of the 50 highest dividend yielding companies involved in the upstream segment of the natural resources sector. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 19863080
    },
    "FXZ": {
        "short_name": "First Trust Materials AlphaDEX ",
        "long_name": "First Trust Materials AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the StrataQuantÂ® Materials Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is a modified equal-dollar weighted index designed by IDI to objectively identify and select stocks from the Russell 1000Â® Index in the materials and processing sector that may generate positive alpha relative to traditional passive-style indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Natural Resources",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 286282464
    },
    "GNR": {
        "short_name": "SPDR S&P Global Natural Resourc",
        "long_name": "SPDR S&P Global Natural Resources ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that, before fees and expenses, correspond generally to the total return performance of the S&P Global Natural Resources Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in depositary receipts based on securities comprising the index. The index is comprised of 90 of the largest U.S. and foreign publicly traded companies, based on market capitalization, in natural resources and commodities businesses that meet certain investability requirements.",
        "category": "Natural Resources",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1940419712
    },
    "GRES": {
        "short_name": "IQ ARB Global Resources ETF",
        "long_name": "IQ Global Resources ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance of its underlying index, the IQ Global Resources Index.\n The fund invests at least 80% of its net assets, in the investments included in its underlying index. The underlying index seeks to employ a systematic investment process designed to identify opportunities in markets exhibiting trending or momentum characteristics across commodity asset classes, represented by companies that operate in commodity-specific market segments and whose equity securities trade in developed markets, including the U.S. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 18955700
    },
    "GUNR": {
        "short_name": "FlexShares Global Upstream Natu",
        "long_name": "FlexShares Morningstar Global Upstream Natural Resources Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the MorningstarÂ® Global Upstream Natural Resources IndexSM.\n The fund will invest at least 80% of its total assets (exclusive of collateral held from securities lending) in the securities of the index and in ADRs and GDRs based on the securities in the index. The index reflects the performance of a selection of equity securities that are traded in or are issued by companies domiciled in global developed or emerging markets, as determined by the index provider pursuant to its index methodology. It is non-diversified.",
        "category": "Natural Resources",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4264486656
    },
    "HAP": {
        "short_name": "VanEck Vectors Natural Resource",
        "long_name": "VanEck Vectors Natural Resources ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the VanEckÂ® Natural Resources Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of publicly traded companies engaged (derive greater than 50% of revenues from applicable sources) in the production and distribution of commodities and commodity-related products and services in the following sectors: 1) Agriculture; 2) Alternatives (Water & Alternative Energy); 3) Base and Industrial Metals; 4) Energy; 5) Forest Products; and 6) Precious Metals.",
        "category": "Natural Resources",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 66846076
    },
    "IGE": {
        "short_name": "iShares North American Natural ",
        "long_name": "iShares North American Natural Resources ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P North American Natural Resources Index composed of North American equities in the natural resources sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of U.S.-traded stocks of natural resource-related companies in the U.S. and Canada.",
        "category": "Natural Resources",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 367870560
    },
    "IYM": {
        "short_name": "iShares U.S. Basic Materials ET",
        "long_name": "iShares U.S. Basic Materials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Basic Materials Index composed of U.S. equities in the basic materials sector.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of the basic materials sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 602726016
    },
    "LIT": {
        "short_name": "Global X Lithium & Battery Tech",
        "long_name": "Global X Lithium & Battery Tech ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global Lithium Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to measure broad-based equity market performance of global companies involved in the lithium industry. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2806134272
    },
    "MOO": {
        "short_name": "VanEck Vectors Agribusiness ETF",
        "long_name": "VanEck Vectors Agribusiness ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® Global Agribusiness Index.\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index includes equity securities of companies that generate at least 50% of their revenues from agri-chemicals, animal health and fertilizers, seeds and traits, from farm/irrigation equipment and farm machinery, aquaculture and fishing, livestock, cultivation and plantations and trading of agricultural products. It is non-diversified.",
        "category": "Natural Resources",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1111348992
    },
    "MXI": {
        "short_name": "iShares Global Materials ETF",
        "long_name": "iShares Global Materials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P Global 1200 Materials IndexTM.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index. The index measures the performance of companies that the index provider deems to be part of the materials sector of the economy and that the index provider believes are important to global markets.",
        "category": "Natural Resources",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 677387712
    },
    "NANR": {
        "short_name": "SPDR S&P North American Natural",
        "long_name": "SPDR S&P North American Natural Resources ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the S&P BMI North American Natural Resources Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index comprises publicly traded large- and mid-capitalization U.S. and Canadian companies in the natural resources and commodities businesses that meet certain investability requirements and are classified within the sub-industries of one of three natural resources categories: energy, metals & mining or agriculture. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 618331200
    },
    "PHO": {
        "short_name": "Invesco Water Resources ETF",
        "long_name": "Invesco Water Resources ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the NASDAQ OMX US Water IndexSM (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index seeks to track the performance of companies that create products designed to conserve and purify water for homes, businesses and industries. The underlying index may include common stocks, ordinary shares, American depositary receipts (\"ADRs\"), shares of beneficial interest and tracking stocks. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 1465783552
    },
    "PIO": {
        "short_name": "Invesco Global Water ETF",
        "long_name": "Invesco Global Water ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Nasdaq OMX Global Water IndexSM (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index, as well as ADRs and GDRs that are based on the securities in the underlying index. The underlying index is comprised of securities of global exchange-listed companies located in the United States, as well as developed and emerging markets throughout the world, that create products designed to conserve and purify water for homes, businesses and industries. It is non-diversified.",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 252891936
    },
    "PSCM": {
        "short_name": "Invesco S&P SmallCap Materials ",
        "long_name": "Invesco S&P SmallCap Materials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results that (before fees and expenses) of the S&P SmallCap 600Â® Capped Materials Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. These companies are principally engaged in the business of producing raw materials, including paper or wood products, chemicals, construction materials, and mining and metals. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 23851734
    },
    "PYZ": {
        "short_name": "Invesco DWA Basic Materials Mom",
        "long_name": "Invesco DWA Basic Materials Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® Basic Materials Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of at least 30 securities of companies in the basic materials sector that have powerful relative strength or \"momentum\" characteristics.",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 114798096
    },
    "RTM": {
        "short_name": "Invesco S&P 500 Equal Weight Ma",
        "long_name": "Invesco S&P 500 Equal Weight Materials ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Equal Weight Materials Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of all of the components of the S&P 500Â® Materials Index, an index that contains the common stocks of all companies included in the S&P 500Â® Index that are classified as members of the materials sector, as defined according to the Global Industry Classification Standard (\"GICS\").",
        "category": "Natural Resources",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 637638656
    },
    "URA": {
        "short_name": "Global X Uranium ETF",
        "long_name": "Global X Uranium ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global Uranium & Nuclear Components Total Return Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index is designed to measure broad based equity market performance of global companies involved in the uranium industry. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Global X Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 418692512
    },
    "URNM": {
        "short_name": "NorthShore Global Uranium Minin",
        "long_name": "North Shore Global Uranium Mining ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the North Shore Global Uranium Mining Index.\n The fund will normally invest at least 80% of its total assets in securities of the index. The index is designed to track the performance of companies that devote at least 50% of their assets to (i) mining, exploration, development, and production of uranium; and/or (ii) holding physical uranium, owning uranium royalties, or engaging in other, non-mining activities that support the uranium mining industry. It is non-diversified.",
        "category": "Natural Resources",
        "family": "Exchange Traded Concepts",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 230325392
    },
    "VAW": {
        "short_name": "Vanguard Materials ETF",
        "long_name": "Vanguard Materials Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index.\n The fund employs an indexing investment approach designed to track the performance of the MSCI US Investable Market Index (IMI)/Materials 25/50, an index made up of stocks of large, mid-size, and small U.S. companies within the materials sector, as classified under the Global Industry Classification Standard (GICS). The Advisor attempts to replicate the target index by seeking to invest all, or substantially all, of its assets in the stocks that make up the index, in order to hold each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4222772480
    },
    "VEGI": {
        "short_name": "iShares MSCI Agriculture Produc",
        "long_name": "iShares MSCI Global Agriculture Producers ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI ACWI Select Agriculture Producers Investable Market Index (IMI).\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities of the underlying index. The index measures the combined performance of equity securities of companies in both developed and emerging markets that are primarily engaged in the business of agriculture. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 57715880
    },
    "WOOD": {
        "short_name": "iShares S&P Global Timber & For",
        "long_name": "iShares Global Timber & Forestry ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P Global Timber & Forestry IndexTM.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is comprised of approximately 25 of the largest publicly-traded companies engaged in the ownership, management or upstream supply chain of forests and timberlands. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 418503648
    },
    "XLB": {
        "short_name": "Materials Select Sector SPDR",
        "long_name": "Materials Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Materials Select Sector Index.\n In seeking to track the performance of the index, the fund employs a replication strategy. It generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: chemicals; metals and mining; paper and forest products; containers and packaging; and construction materials. The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8036850688
    },
    "XME": {
        "short_name": "SPDR S&P Metals & Mining ETF",
        "long_name": "SPDR S&P Metals and Mining ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of an index derived from the metals and mining segment of a U.S. total market composite index.\n In seeking to track the performance of the S&P Metals & Mining Select Industry Index (the \"index\"), the fund employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index represents the metals and mining segment of the S&P Total Market Index (\"S&P TMI\"). The fund is non-diversified.",
        "category": "Natural Resources",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1876304000
    }
}