{
    "AGZD": {
        "short_name": "WisdomTree Interest Rate Hedged",
        "long_name": "WisdomTree Interest Rate Hedged U.S. Aggregate Bond Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg Barclays Rate Hedged U.S. Aggregate Bond Index, Zero Duration (the \"index\").\n The index is designed to provide long exposure to the Bloomberg Barclays U.S. Aggregate Bond Index while seeking to manage interest rate risk through the use of short positions in U.S. Treasury securities. The fund normally invests at least 80% of its total assets in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. It is non-diversified.",
        "category": "Nontraditional Bond",
        "family": "WisdomTree",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 129466952
    },
    "HYHG": {
        "short_name": "ProShares High Yield Interest R",
        "long_name": "ProShares High Yield—Interest Rate Hedged",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the FTSE High Yield (Treasury Rate-Hedged) Index (the \"index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in high-yield bonds included in the index. The index is comprised of (a) long positions in U.S. dollar-denominated high yield corporate bonds (\"high yield bonds\") and (b) short positions in U.S. Treasury notes or bonds (\"Treasury Securities\") of, in aggregate, approximate equivalent duration to the high yield bonds.",
        "category": "Nontraditional Bond",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 84274240
    },
    "HYIN": {
        "short_name": "WisdomTree Alternative Income F",
        "long_name": "WisdomTree Alternative Income Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the Gapstow Liquid Alternative Credit Index (the â\u0080\u009cIndexâ\u0080\u009d).\n Under normal circumstances, at least 80% of the fundâ\u0080\u0099s total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is comprised of registered closed-end investment companies and real estate investment trusts that are listed and publicly traded on a major U.S. stock exchange. It is non-diversified.",
        "category": "Nontraditional Bond",
        "family": "WisdomTree",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": null
    },
    "HYZD": {
        "short_name": "WisdomTree Interest Rate Hedged",
        "long_name": "WisdomTree Interest Rate Hedged High Yield Bond Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. High Yield Corporate Bond, Zero Duration Index (the \"index\").\n The index is designed to provide long exposure to the performance of selected issuers in the U.S. non-investment-grade corporate bond (\"junk bonds\") market that are deemed to have favorable fundamental and income characteristics while seeking to manage interest rate risk through the use of short positions in U.S. treasury securities. The fund is non-diversified.",
        "category": "Nontraditional Bond",
        "family": "WisdomTree",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 134580240
    },
    "IGHG": {
        "short_name": "ProShares Investment Grade-Inte",
        "long_name": "ProShares Investment Grade—Interest Rate Hedged",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the FTSE Corporate Investment Grade (Treasury Rate-Hedged) Index (the \"index\").\n The index is comprised of (a) long positions in USD-denominated investment grade corporate bonds issued by both U.S. and foreign domiciled companies; and (b) short positions in U.S. Treasury notes or bonds (\"Treasury Securities\") of, in aggregate, approximate equivalent duration to the investment grade bonds. The fund will invest at least 80% of its total assets in component securities (i.e., securities of the index) and invest at least 80% of its total assets in investment grade bonds.",
        "category": "Nontraditional Bond",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 516505632
    },
    "RDFI": {
        "short_name": "Rareview Dynamic Fixed Income E",
        "long_name": "Rareview Dynamic Fixed Income ETF",
        "currency": "USD",
        "summary": "The investment seeks total return with an emphasis on providing current income.\n Under normal market conditions, the fund will invest at least 80% of its net assets (plus any borrowings for investment purposes) in fixed income closed-end funds trading at a discount or premium to their underlying net asset value and that pay regular periodic cash distributions. Through its investments in closed-end funds that hold non-U.S. fixed income securities, the fund may invest indirectly in foreign securities, including securities of issuers located in emerging markets. It is non-diversified.",
        "category": "Nontraditional Bond",
        "family": "Rareview Capital",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 19324372
    },
    "RINF": {
        "short_name": "ProShares Inflation Expectation",
        "long_name": "ProShares Inflation Expectations ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the FTSE 30-Year TIPS (Treasury Rate Hedged) Index (the \"index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the Index. The index tracks the performance of (i) long position in the most recently issued 30-year Treasury Inflation-Protected Securities (\"TIPS\") and (ii) duration-adjusted short position in U.S. Treasury bonds of, in aggregate, approximate equivalent duration dollars to the TIPS. The fund is non-diversified.",
        "category": "Nontraditional Bond",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 11851153
    },
    "VPC": {
        "short_name": "Virtus Private Credit Strategy ",
        "long_name": "Virtus Private Credit ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond the price and yield performance of the Indxx Private Credit Index (the \"underlying index\").\n Under normal market conditions, the fund will invest not less than 80% of its assets in component securities of the underlying index. The underlying index is designed to track the performance of U.S.-listed, registered closed-end investment companies that have elected to be regulated as \"business development companies\" under the Investment Company Act of 1940, as well as U.S.-listed, non-BDC registered closed-end funds. The fund is non-diversified.",
        "category": "Nontraditional Bond",
        "family": "Virtus",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24418260
    }
}