{
  "IPFF": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "BTS",
    "family": "iShares",
    "long_name": "iShares International Preferred Stock ETF",
    "market": "us_market",
    "short_name": "iShares International Preferred",
    "summary": "The investment seeks to track the investment results of the S&P International Preferred Stock IndexTM.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and in investments that have economic characteristics that are substantially identical to the component securities and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of a select group of preferred stocks from non-U.S. developed market issuers and traded on non-U.S. developed market exchanges as defined by the index provider. The fund is non-diversified.",
    "total_assets": 56355440
  },
  "PFF": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "NMS",
    "family": "iShares",
    "long_name": "iShares Preferred and Income Securities ETF",
    "market": "us_market",
    "short_name": "iShares Preferred and Income Se",
    "summary": "The investment seeks to track the investment results of the ICE Exchange-Listed Preferred & Hybrid Securities Index, which measures the performance of a select group of exchange-listed, U.S. dollar-denominated preferred securities, hybrid securities and convertible preferred securities listed on the NYSE or NASDAQ.\n The fund may invest at least 80% of its assets in the component securities of the index and may invest up to 20% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the index, but which the advisor believes will help the fund track the index.",
    "total_assets": 17569171456
  },
  "PFFA": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Virtus",
    "long_name": "Virtus InfraCap U.S. Preferred Stock ETF",
    "market": "us_market",
    "short_name": "Virtus InfraCap U.S. Preferred ",
    "summary": "The investment seeks current income and, secondarily, capital appreciation.\n Under normal market conditions, the fund will invest not less than 80% of its net assets (plus the amount of any borrowings for investment purposes) in U.S. preferred stock, and in derivatives and other instruments that have economic characteristics similar to such investments. The Sub-Adviser actively manages the fund&#39;s assets pursuant to a variety of quantitative, qualitative and relative valuation factors. The fund is non-diversified.",
    "total_assets": 347232640
  },
  "PFFD": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Global X Funds",
    "long_name": "Global X U.S. Preferred ETF",
    "market": "us_market",
    "short_name": "Global X U.S. Preferred ETF",
    "summary": "The investment seeks to provide investment results that correspond generally to the price and yield performance, before fees and expenses, of the ICE BofA Diversified Core U.S. Preferred Securities Index.\n The fund invests at least 80% of its total assets in the securities of its underlying index. It also invests at least 80% of its total assets in preferred securities that are domiciled in, principally traded in or whose revenues are primarily from the U.S. The underlying index is designed to track the broad-based performance of the U.S. preferred securities market.",
    "total_assets": 1478870784
  },
  "PFLD": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "AAM",
    "long_name": "AAM Low Duration Preferred and Income Securities ETF",
    "market": "us_market",
    "short_name": "AAM Low Duration Preferred and ",
    "summary": "The investment seeks to track the total return performance, before fees and expenses, of the ICE 0-5 Year Duration Exchange-Listed Preferred & Hybrid Securities Index.\n The index measures the performance of exchange-listed, U.S. dollar-denominated preferred securities and hybrid securities listed on the New York Stock Exchange (\"NYSE\") or NASDAQ Capital Market (\"NASDAQ\") with an option-adjusted duration of less than 5 years. Under normal circumstances, at least 80% of the fund’s net assets, plus borrowings for investment purposes, will be invested in preferred and income securities.",
    "total_assets": 12976741
  },
  "PFXF": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "VanEck",
    "long_name": "VanEck Vectors Preferred Securities ex Financials ETF",
    "market": "us_market",
    "short_name": "VanEck Vectors Preferred Securi",
    "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the Wells Fargo® Hybrid and Preferred Securities ex Financials Index (the \"Preferred Securities Index\").\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of convertible or exchangeable and non-convertible preferred securities listed on U.S. exchanges. The fund is non-diversified.",
    "total_assets": 899764480
  },
  "PGF": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco Financial Preferred ETF",
    "market": "us_market",
    "short_name": "Invesco Financial Preferred ETF",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the Wells Fargo® Hybrid and Preferred Securities Financial Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is a market capitalization weighted index designed to track the performance of preferred securities and securities that the index provider believes are functionally equivalent to preferred securities, including, but not limited to, depositary preferred securities, perpetual subordinated debt and certain capital securities. It is non-diversified.",
    "total_assets": 1826119552
  },
  "PGX": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "Invesco",
    "long_name": "Invesco Preferred ETF",
    "market": "us_market",
    "short_name": "Invesco Preferred ETF",
    "summary": "The investment seeks to track the investment results (before fees and expenses) of the ICE BofAML Core Plus Fixed Rate Preferred Securities Index.\n The fund generally will invest at least 80% of its total assets in the components of the index. Strictly in accordance with its guidelines and mandated procedures, ICE Data Indices, LLC selects securities for the index, which is a market capitalization-weighted index designed to measure the total return performance of the fixed rate U.S. dollar-denominated preferred securities market. It is non-diversified.",
    "total_assets": 6919269376
  },
  "PSK": {
    "category": "Preferred Stock",
    "currency": "USD",
    "exchange": "PCX",
    "family": "SPDR State Street Global Advisors",
    "long_name": "SPDR ICE Preferred Securities ETF",
    "market": "us_market",
    "short_name": "SPDR ICE Preferred Securities E",
    "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the ICE Exchange-Listed Fixed & Adjustable Rate Preferred Securities Index.\n In seeking to track the performance of the index, the adviser employs a sampling strategy. It generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of non-convertible preferred stock and securities that are functionally equivalent to preferred stock, including, but not limited to, senior and subordinated debt.",
    "total_assets": 1427546240
  }
}
