{
    "BBRE": {
        "short_name": "JPMorgan BetaBuilders MSCI U.S.",
        "long_name": "JPMorgan BetaBuilders MSCI U.S. REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the MSCI US REIT Custom Capped Index.\n The fund will invest at least 80% of its assets in securities included in the underlying index. The underlying index is a free-float adjusted market-cap weighted index designed to measure the performance of U.S. equity real estate investment trust (REIT) securities. The fund may invest up to 20% of its assets in exchange-traded futures to seek performance that corresponds to the underlying index.",
        "category": "Real Estate",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 1368243200
    },
    "EWRE": {
        "short_name": "Invesco S&P 500 Equal Weight Re",
        "long_name": "Invesco S&P 500 Equal Weight Real Estate ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P 500Â® Equal Weight Real Estate Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of all of the components of the S&P 500Â® Real Estate Index, an index that contains the common stocks of all companies included in the S&P 500Â® Index that are classified as members of the real estate sector, as defined according to the Global Industry Classification Standard (\"GICS\").",
        "category": "Real Estate",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 27866916
    },
    "FPRO": {
        "short_name": "Fidelity Real Estate Investment",
        "long_name": "Fidelity Real Estate Investment ETF",
        "currency": "USD",
        "summary": "The investment seeks above-average income and long-term capital growth, consistent with reasonable investment risk.\n The fund is an actively managed ETF that operates pursuant to an exemptive order from the Securities and Exchange Commission (Order) and is not required to publicly disclose its complete portfolio holdings each business day. The fund normally invests at least 80% of assets in securities of companies principally engaged in the real estate industry and other real estate related investments. It invests in domestic and foreign issuers. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "Fidelity Investments",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 6277093
    },
    "FREL": {
        "short_name": "Fidelity MSCI Real Estate Index",
        "long_name": "Fidelity MSCI Real Estate Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the MSCI USA IMI Real Estate 25/25 Index.\n The fund invests at least 80% of assets in securities included in the fund&#39;s underlying index. The fund&#39;s underlying index is the MSCI USA IMI Real Estate 25/25 Index, which represents the performance of the real estate sector in the U.S. equity market. It may or may not hold all of the securities in the MSCI USA IMI Real Estate 25/25 Index.",
        "category": "Real Estate",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1354441856
    },
    "FRI": {
        "short_name": "First Trust S&P REIT Index Fund",
        "long_name": "First Trust S&P REIT Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the S&P United States REIT Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the real estate investment trusts (\"REITs\") that comprise the index. The index seeks to measure the performance of publicly-traded traded REITs domiciled in the United States that meet certain eligibility requirements.",
        "category": "Real Estate",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 101888912
    },
    "ICF": {
        "short_name": "iShares Cohen & Steers REIT ETF",
        "long_name": "iShares Cohen & Steers REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Cohen & Steers Realty Majors Index, which consists of REITs.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The objective of the underlying index is to represent relatively large and liquid REITs that may benefit from future consolidation and securitization of the U.S. real estate industry. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 1949451008
    },
    "INDS": {
        "short_name": "Pacer Benchmark Industrial Real",
        "long_name": "Pacer Benchmark Industrial Real Estate SCTR ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Benchmark Industrial Real Estate SCTRâ\u0084  Index (the \"index\").\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index. The index was developed by Benchmark Investments, LLC, the index provider (the \"index provider\"), and measures the performance of the industrial real estate sector of the U.S. equity market, which includes warehouse and self-storage real estate sub-sectors. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "Pacer",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 157823504
    },
    "IYR": {
        "short_name": "iShares U.S. Real Estate ETF",
        "long_name": "iShares U.S. Real Estate ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Real Estate Capped Index.\n The fund seeks to track the investment results of the Dow Jones U.S. Real Estate Capped Index, which measures the performance of the real estate sector of the U.S. equity market, as defined by the \"index provider\". It generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index.",
        "category": "Real Estate",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5353554432
    },
    "KBWY": {
        "short_name": "Invesco KBW Premium Yield Equit",
        "long_name": "Invesco KBW Premium Yield Equity REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the KBW Nasdaq Premium Yield Equity REIT Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is a modified-dividend yield-weighted index of domestic equity real estate investment trusts (\"REITs\") of small- and mid-capitalization, as determined by the index provider. The underlying index is designed to track the performance of small- and mid-capitalization equity REITs that have competitive dividend yields and are publicly-traded in the U.S.",
        "category": "Real Estate",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 301816832
    },
    "MORT": {
        "short_name": "VanEck Vectors Mortgage REIT In",
        "long_name": "VanEck Vectors Mortgage REIT Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Mortgage REITs Index (the \"Mortgage REITs Index\").\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The Mortgage REITs Index may include small-, medium- and large-capitalization companies. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 295432000
    },
    "NETL": {
        "short_name": "NETLease Corporate Real Estate ",
        "long_name": "Fundamental Income Net Lease Real Estate ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the Fundamental Income Net Lease Real Estate Index.\n The index is generally composed of the U.S.-listed equity securities of companies that derive at least 85% of their earnings or revenues from real estate operations in the net lease real estate sector (\"Eligible Companies\"). Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of any collateral held from securities lending) will be invested in the component securities of the index. It is non-diversified.",
        "category": "Real Estate",
        "family": "Exchange Traded Concepts",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 68060160
    },
    "NURE": {
        "short_name": "Nuveen Short-Term REIT ETF",
        "long_name": "Nuveen Short-Term REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Dow Jones U.S. Select Short-Term REIT Index.\n The fund invests at least 80% of the sum of its net assets and the amount of any borrowings for investment purposes in REITs. The index is a subset of the Dow Jones U.S. Select REIT Index, which generally includes equity REITs traded on a national securities exchange in the U.S. that derive at least 75% of their total revenue from the ownership and operation of real estate assets and that have a minimum total market capitalization of $200 million at the time of their inclusion. It is non-diversified.",
        "category": "Real Estate",
        "family": "Nuveen",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 30098584
    },
    "OLD": {
        "short_name": "The Long-Term Care ETF",
        "long_name": "The Long-Term Care ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the performance, before fees and expenses, of an index which is designed to track the performance of companies globally that are positioned to profit from providing long-term care to the aging population, including companies owning or operating senior living facilities, nursing services, specialty hospitals, and senior housing, biotech companies for age-related illnesses, and companies that sell products and services to such facilities.\n The fund invests at least 80% of its net assets in the stocks that comprise the Solactive Long-Term Care Index. It is non-diversified.",
        "category": "Real Estate",
        "family": "Janus Henderson",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 25824816
    },
    "PPTY": {
        "short_name": "PPTY U.S. Diversified Real Esta",
        "long_name": "PPTY – U.S. Diversified Real Estate ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the USREX â\u0080\u0093 U.S. Diversified Real Estate Indexâ\u0084¢.\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of any collateral held from securities lending) will be invested in the component securities of the index. The index uses a rules-based methodology to provide diversified exposure to the liquid U.S. real estate market.",
        "category": "Real Estate",
        "family": "PPTY",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 120105216
    },
    "PSR": {
        "short_name": "Invesco Active U.S. Real Estate",
        "long_name": "Invesco Active U.S. Real Estate Fund",
        "currency": "USD",
        "summary": "The investment seeks high total return through growth of capital and current income.\n The fund invests normally at least 80% of its assets in securities of companies that are principally engaged in the U.S. real estate industry and included within the FTSE NAREIT All Equity REITs Index. It also may invest in real estate operating companies (\"REOCs\"), as well as securities of other companies principally engaged in the U.S. real estate industry. REOCs are similar to REITs, except that REOCs reinvest their earnings into the business, rather than distributing them to unitholders like REITs.",
        "category": "Real Estate",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 113752952
    },
    "RDOG": {
        "short_name": "ALPS ETF Trust ALPS REIT Divide",
        "long_name": "ALPS REIT Dividend Dogs ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that replicate as closely as possible, before fees and expenses, the performance of an index called the S-Network REIT Dividend Dogs Index (the \"underlying index\").\n The fund will normally invest at least 90% of its total assets in common stocks and other equity securities that comprise the underlying index. The underlying index is a rules-based index intended to give investors a means of tracking the overall performance of the highest dividend paying real estate investment trusts (\"REITs\") in the S-Network US Composite REIT Index, a universe of mainly REITs listed in the United States, on a segment-by-segment basis.",
        "category": "Real Estate",
        "family": "ALPS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 27854320
    },
    "REIT": {
        "short_name": "ALPS Active REIT ETF",
        "long_name": "ALPS Active REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks total return through dividends and capital appreciation.\n The fund will, under normal circumstances, seek to achieve its investment objective by investing at least 80% of its net assets in publicly traded equity securities of REITs. It will primarily invest in publicly traded common equity securities of U.S. REITs. The fund may also invest a portion of its assets in publicly traded common equity of U.S. real estate operating companies (not structured as REITs), publicly traded preferred equity of U.S. REITs and real estate operating companies, and cash and cash equivalents. It is non-diversified.",
        "category": "Real Estate",
        "family": "ALPS",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 13633598
    },
    "REM": {
        "short_name": "iShares Trust iShares Mortgage ",
        "long_name": "iShares Mortgage Real Estate Capped ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the FTSE NAREIT All Mortgage Capped Index composed of U.S. real estate investment trusts (\"REITs\") that hold U.S. residential and commercial mortgages.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index measures the performance of the residential and commercial mortgage real estate, mortgage finance and savings associations sectors of the U.S. equity market. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 1434264448
    },
    "REZ": {
        "short_name": "iShares Residential and Multise",
        "long_name": "iShares Residential and Multisector Real Estate ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the FTSE NAREIT All Residential Capped Index composed of U.S. residential, healthcare and self-storage real estate equities.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index measures the performance of the residential apartments, manufactured homes, healthcare and self-storage real estate sectors of the U.S. equity market. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 451573440
    },
    "ROOF": {
        "short_name": "IQ US Real Estate Small Cap ETF",
        "long_name": "IQ U.S. Real Estate Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance of its underlying index, the IQ U.S. Real Estate Small Cap Index.\n The fund invests at least 80% of its net assets, plus the amount of any borrowings for investment purposes, in the investments included in its index. The index is a rules based, modified capitalization weighted, float adjusted index intended to give investors a means of tracking the overall performance of the small capitalization sector of publicly traded companies domiciled and primarily listed on an exchange in the U.S. and that invest in real estate. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 47291584
    },
    "RWR": {
        "short_name": "SPDR DJ Wilshire REIT ETF",
        "long_name": "SPDR Dow Jones REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the Dow Jones U.S. Select REIT Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to provide a measure of real estate securities that serve as proxies for direct real estate investing, in part by excluding securities whose value is not always closely tied to the value of the underlying real estate.",
        "category": "Real Estate",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1752956288
    },
    "SCHH": {
        "short_name": "Schwab U.S. REIT ETF",
        "long_name": "Schwab U.S. REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Dow Jones Equity All REIT Capped Index, which is composed of U.S. real estate investment trusts classified as equities.\n The index excludes mortgage REITs, defined as REITs that lend money directly to real estate owners and/or operators or indirectly through the purchase of mortgages or mortgage-backed securities, and hybrid REITs, defined as REITs that participate both in equity and mortgage investing. It is the fundâ\u0080\u0099s policy that under normal circumstances it will invest at least 90% of its net assets in securities included in the index.",
        "category": "Real Estate",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5266199552
    },
    "SRET": {
        "short_name": "Global X SuperDividend REIT ETF",
        "long_name": "Global X SuperDividend REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield performance, before fees and expenses, of the Solactive Global SuperDividend Â® REIT Index.\n The fund invests at least 80% of its total assets in the securities of the underlying index and in American Depositary Receipts (\"ADRs\") and Global Depositary Receipts (\"GDRs\") based on the securities in the underlying index. The underlying index tracks the performance of REITs that rank among the highest yielding REITs globally, as determined by Solactive AG, the provider of the underlying index.",
        "category": "Real Estate",
        "family": "Global X Funds",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 499833152
    },
    "SRVR": {
        "short_name": "Pacer Benchmark Data & Infrastr",
        "long_name": "Pacer Benchmark Data & Infrastructure Real Estate SCTR ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Benchmark Data & Infrastructure Real Estate SCTRâ\u0084  Index (the \"index\").\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index. The index is generally composed of the U.S.-listed equity securities of companies that derive at least 85% of their earnings or revenues from real estate operations in the data and infrastructure real estate sectors (\"Eligible Companies\"). The fund is non-diversified.",
        "category": "Real Estate",
        "family": "Pacer",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1041885376
    },
    "USRT": {
        "short_name": "iShares Core U.S. REIT ETF",
        "long_name": "iShares Core U.S. REIT ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the FTSE NAREIT Equity REITs Index composed of U.S. real estate equities.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index measures the performance of U.S. listed equity real estate investment trusts (\"REITs\"), excluding infrastructure REITs, mortgage REITs, and timber REITs.",
        "category": "Real Estate",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1653767168
    },
    "VNQ": {
        "short_name": "Vanguard Real Estate ETF",
        "long_name": "Vanguard Real Estate Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to provide a high level of income and moderate long-term capital appreciation by tracking the performance of the MSCI US Investable Market Real Estate 25/50 Index that measures the performance of publicly traded equity REITs and other real estate-related investments.\n The advisor attempts to track the index by investing all, or substantially all, of its assets-either directly or indirectly through a wholly owned subsidiary, which is itself a registered investment company-in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 70168469504
    },
    "XLRE": {
        "short_name": "Real Estate Select Sector SPDR ",
        "long_name": "The Real Estate Select Sector SPDR Fund",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the price and yield performance of publicly traded equity securities of companies in the Real Estate Select Sector Index (the \"index\").\n Under normal market conditions, the fund generally invests substantially all, but at least 95%, of its total assets in the securities comprising the index. The index includes securities of companies from the following industries: real estate management and development and REITs, excluding mortgage REITs. The fund is non-diversified.",
        "category": "Real Estate",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2844107264
    }
}