{
    "BKSB": {
        "short_name": "BNY Mellon Short Duration Corpo",
        "long_name": "BNY Mellon Short Duration Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Bloomberg Barclays US Corporate 1-5 Years Total Return Index.\n To pursue its goal, the fund normally invests substantially all, but at least 80%, of its assets in bonds comprising the Bloomberg Barclays US Corporate 1-5 Years Total Return Index. The Bloomberg Barclays US Corporate 1-5 Years Total Return Index is designed to measure the market for investment grade, U.S. dollar-denominated, fixed-rate, taxable corporate bonds with one to five years left to maturity. It is non-diversified.",
        "category": "Short-Term Bond",
        "family": "BNY Mellon",
        "exchange": "PCX",
        "market": "us_market"
    },
    "BSV": {
        "short_name": "Vanguard Short-Term Bond ETF",
        "long_name": "Vanguard Short-Term Bond Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the Bloomberg Barclays U.S. 1-5 Year Government/Credit Float Adjusted Index.\n This index includes all medium and larger issues of U.S. government, investment-grade corporate, and investment-grade international dollar-denominated bonds that have maturities between 1 and 5 years and are publicly issued. All of the fund&#39;s investments will be selected through the sampling process, and at least 80% of its assets will be invested in bonds held in the index.",
        "category": "Short-Term Bond",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FLTB": {
        "short_name": "Fidelity Limited Term Bond ETF",
        "long_name": "Fidelity Limited Term Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide a high rate of income.\n The fund normally invests at least 80% of assets in investment-grade debt securities (those of medium and high quality) of all types and repurchase agreements for those securities. It is managed to have similar overall interest rate risk to the Fidelity Limited Term Composite Indexâ\u0084 . Normally, the fund maintains a dollar-weighted average maturity between two and five years.",
        "category": "Short-Term Bond",
        "family": "Fidelity Investments",
        "exchange": "PCX",
        "market": "us_market"
    },
    "GSIG": {
        "short_name": "Golden Sachs ETF Trust Goldman ",
        "long_name": "Goldman Sachs Access Investment Grade Corporate 1-5 Year Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the FTSE Goldman Sachs US Investment-Grade Corporate Bond 1-5 Years Index.\n The fund seeks to achieve its investment objective by investing at least 80% of its assets (exclusive of collateral held from securities lending) in securities included in its underlying index. The index is a rules-based index that is designed to measure the performance of investment grade, corporate bonds denominated in U.S. dollars with remaining maturities between one and five years that meet certain liquidity and fundamental screening criteria.",
        "category": "Short-Term Bond",
        "family": "Goldman Sachs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HSRT": {
        "short_name": "Hartford Short Duration ETF",
        "long_name": "Hartford Short Duration ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income and long-term total return.\n The fund seeks to achieve its investment objective by investing in securities that considered to be attractive giving consideration to both yield and total return. It normally invests in investment grade securities. The fund may invest up to 35% of its net assets in non-investment grade fixed income securities (also referred to as \"junk bonds\"). It may also invest up to 35% of its net assets in bank loans or loan participation interests in secured or unsecured variable, fixed or floating rate loans to U.S. and foreign corporations, partnerships and other entities (\"bank loans\").",
        "category": "Short-Term Bond",
        "family": "Hartford Mutual Funds",
        "exchange": "BTS",
        "market": "us_market"
    },
    "IGSB": {
        "short_name": "iShares 1-5 Year Investment Gra",
        "long_name": "iShares 1-5 Year Investment Grade Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE BofA 1-5 Year US Corporate Index.\n The fund generally invests at least 90% of its assets in securities of the underlying index. The underlying index measures the performance of investment-grade corporate bonds of both U.S. and non-U.S. issuers that are U.S. dollar-denominated and publicly issued in the U.S. domestic market and have a remaining maturity of greater than or equal to one year and less than five years.",
        "category": "Short-Term Bond",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "IIGD": {
        "short_name": "Invesco Investment Grade Defens",
        "long_name": "Invesco Investment Grade Defensive ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Invesco Investment Grade Defensive Index (the \"underlying index\").\n The fund generally will invest at least 80% of its total assets in securities that comprise the underlying index. The underlying index is designed to provide exposure to U.S. investment grade bonds having the highest \"quality scores\" (within the eligible universe of U.S. investment grade bonds) as determined by the index provider. The fund is non-diversified.",
        "category": "Short-Term Bond",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ISTB": {
        "short_name": "iShares Core 1-5 Year USD Bond ",
        "long_name": "iShares Core 1-5 Year USD Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. Universal 1-5 Year Index, which measures the performance of U.S. dollar-denominated taxable bonds that are rated either investment-grade or high yield with remaining effective maturities between one and five years.\n The fund invests at least 90% of its assets in the component securities of the index and in investments that have economic characteristics that are substantially identical to the component securities and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the index.",
        "category": "Short-Term Bond",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "JSCP": {
        "short_name": "JPMorgan Short Duration Core Pl",
        "long_name": "JPMorgan Short Duration Core Plus ETF",
        "currency": "USD",
        "summary": "The investment seeks total return, consistent with preservation of capital.\n Under normal conditions, at least 70% of the fund&#39;s net assets must be invested in securities that, at the time of purchase, are rated investment grade by a nationally recognized statistical rating organization (NRSRO) or in securities that are unrated but are deemed by the adviser to be of comparable quality. The fund will not invest more than 30% of its net assets in below investment grade securities (or the unrated equivalent) under normal conditions. Up to 25% of the fund&#39;s net assets may be invested in foreign securities including sovereign and agency debt.",
        "category": "Short-Term Bond",
        "family": "JPMorgan",
        "exchange": "PCX",
        "market": "us_market"
    },
    "LDSF": {
        "short_name": "First Trust Low Duration Strate",
        "long_name": "First Trust Low Duration Strategic Focus ETF",
        "currency": "USD",
        "summary": "The investment seeks to generate current income, with a secondary objective of preservation of capital.\n Under normal market conditions, the fund seeks to achieve its investment objectives by investing at least 80% of its net assets (including investment borrowings) in a portfolio of U.S.-listed exchange-traded funds (\"ETFs\") that principally invest in income-generating securities that provide it with a duration of three years or less. A significant portion of the ETFs in which the fund invests may be advised by First Trust. The fund is non-diversified.",
        "category": "Short-Term Bond",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "LDUR": {
        "short_name": "PIMCO Enhanced Low Duration Act",
        "long_name": "PIMCO Enhanced Low Duration Active Exchange-Traded Fund",
        "currency": "USD",
        "summary": "The investment seeks maximum total return, consistent with preservation of capital and prudent investment management.\n The fund seeks to achieve its investment objective by investing at least 80% of its net assets in a diversified portfolio of Fixed Income Instruments of varying maturities, which may be represented by forwards or derivatives such as options, futures contracts, or swap agreements. It invests primarily in investment grade debt securities, but may invest up to 15% of its total assets in high yield securities, as rated by Moody&#39;s, S&P or Fitch, or, if unrated, as determined by PIMCO.",
        "category": "Short-Term Bond",
        "family": "PIMCO",
        "exchange": "PCX",
        "market": "us_market"
    },
    "LSST": {
        "short_name": "Natixis ETF Trust Natixis Loomi",
        "long_name": "Natixis Loomis Sayles Short Duration Income ETF",
        "currency": "USD",
        "summary": "The investment seeks current income consistent with preservation of capital.\n Under normal circumstances, the fund will invest at least 80% of its net assets (plus any borrowings made for investment purposes) in fixed-income securities such as bonds, notes and debentures, as well as other investments that the subadviser believes have similar economic characteristics (such as loans). It is anticipated that the fund&#39;s weighted average duration will generally be between one and three years. The fund invests primarily in investment-grade fixed-income securities.",
        "category": "Short-Term Bond",
        "family": "Natixis Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "NUSA": {
        "short_name": "Nuveen Enhanced Yield 1-5 Year ",
        "long_name": "Nuveen Enhanced Yield 1-5 Year U.S. Aggregate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results, before fees and expenses, of the ICE BofAML Enhanced Yield 1-5 Year US Broad Bond Index (the \"index\").\n Under normal market conditions, the fund invests at least 80% of the sum of its net assets and the amount of any borrowings for investment purposes in component securities of the index. The index is designed to broadly capture the 1-5 year U.S. investment grade fixed income market, as represented by a modified version of the ICE BofAML 1-5 Year US Broad Market Index.",
        "category": "Short-Term Bond",
        "family": "Nuveen",
        "exchange": "PCX",
        "market": "us_market"
    },
    "OVT": {
        "short_name": "Overlay Shares Short Term Bond ",
        "long_name": "Overlay Shares Short Term Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks total return.\n The fund is an actively-managed ETF that seeks to achieve its objective by (i) investing in one or more other ETFs that seek to obtain exposure to the performance of short-term, investment grade, U.S. dollar-denominated, fixed-rate taxable bonds with a dollar-weighted average maturity of no more than three years with a maximum maturity of five years or directly in the securities held by such ETFs and (ii) selling and purchasing listed short-term put options to generate income to the fund.",
        "category": "Short-Term Bond",
        "family": "Overlay Shares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SCHJ": {
        "short_name": "Schwab 1-5 Year Corporate Bond ",
        "long_name": "Schwab 1-5 Year Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Bloomberg Barclays US 1-5 Year Corporate Bond Index.\n To pursue its goal, the fund generally invests in securities that are included in the index. The index measures the performance of U.S. investment grade, taxable corporate bonds with maturities greater than or equal to one year and less than five years that have $300 million or more of outstanding face value. It is the fund&#39;s policy that under normal circumstances it will invest at least 90% of its net assets in securities included in the index.",
        "category": "Short-Term Bond",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SHAG": {
        "short_name": "WisdomTree Yield Enhanced U.S. ",
        "long_name": "WisdomTree Yield Enhanced U.S. Short-Term Aggregate Bond Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg Barclays US Short Aggregate Enhanced Yield Index (the \"index\").\n Under normal circumstances, at least 80% of the fund&#39;s total assets will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to broadly capture the short-term U.S. investment grade, fixed income securities market while seeking to enhance yield within desired risk parameters and constraints. The fund is non-diversified.",
        "category": "Short-Term Bond",
        "family": "WisdomTree",
        "exchange": "BTS",
        "market": "us_market"
    },
    "SLQD": {
        "short_name": "iShares 0-5 Year Investment Gra",
        "long_name": "iShares 0-5 Year Investment Grade Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Markit iBoxxÂ® USD Liquid Investment Grade 0-5 Index composed of U.S. dollar-denominated, investment-grade corporate bonds with remaining maturities of less than five years.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to reflect the performance of U.S. dollar-denominated investment-grade corporate debt.",
        "category": "Short-Term Bond",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "SPSB": {
        "short_name": "SPDR Portfolio Short Term Corpo",
        "long_name": "SPDR Portfolio Short Term Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. 1-3 Year Corporate Bond Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of the short term U.S. corporate bond market.",
        "category": "Short-Term Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SUSB": {
        "short_name": "iShares ESG Aware 1-5 Year USD ",
        "long_name": "iShares ESG 1-5 Year USD Corporate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays MSCI US Corporate 1-5 Year ESG Focus Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index has been developed by Bloomberg Barclays Capital Inc. with environmental, social and governance (\"ESG\") rating inputs from MSCI ESG Research LLC pursuant to an agreement between MSCI ESG Research and Bloomberg Index Services Limited, a subsidiary of Bloomberg Barclays.",
        "category": "Short-Term Bond",
        "family": "iShares",
        "exchange": "NMS",
        "market": "us_market"
    },
    "USTB": {
        "short_name": "VictoryShares USAA Core Short-T",
        "long_name": "VictoryShares USAA Core Short-Term Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks high current income consistent with preservation of principal.\n Under normal circumstances, the fund invests at least 80% of its assets in debt securities and in derivatives and other instruments that have economic characteristics similar to such securities. It primarily invests in securities that have a dollar-weighted average portfolio maturity of three years or less. The fund may not invest more than 20% of fixed-income securities in non-agency, non-government sponsored entities, or privately issued mortgage- or asset-backed securities.",
        "category": "Short-Term Bond",
        "family": "Victory Capital",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VABS": {
        "short_name": "Virtus Newfleet ABS/MBS ETF",
        "long_name": "Virtus Newfleet ABS/MBS ETF",
        "currency": "USD",
        "summary": "The investment seeks income.\n The fund&#39;s sub-adviser, seeks to achieve its investment objective by investing in asset-backed securities (\"ABS\") and mortgage-backed securities (\"MBS\"), including commercial MBS and residential MBS. Under normal market conditions, the fund will invest not less than 80% of its net assets (plus the amount of any borrowings for investment purposes) in investment grade tranches of ABS and MBS, and in derivatives and other instruments that have economic characteristics similar to such investments.",
        "category": "Short-Term Bond",
        "family": "Virtus",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VCSH": {
        "short_name": "Vanguard Short-Term Corporate B",
        "long_name": "Vanguard Short-Term Corporate Bond Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a market-weighted corporate bond index with a short-term dollar-weighted average maturity.\n The fund employs an indexing investment approach designed to track the performance of the Bloomberg Barclays U.S. 1-5 Year Corporate Bond Index. This index includes U.S. dollar-denominated, investment-grade, fixed-rate, taxable securities issued by industrial, utility, and financial companies, with maturities between 1 and 5 years. Under normal circumstances, at least 80% of the fund&#39;s assets will be invested in bonds included in the index.",
        "category": "Short-Term Bond",
        "family": "Vanguard",
        "exchange": "NGM",
        "market": "us_market"
    },
    "WINC": {
        "short_name": "Western Asset Short Duration In",
        "long_name": "Western Asset Short Duration Income ETF",
        "currency": "USD",
        "summary": "The investment seeks current income.\n Under normal market conditions, the fund invests at least 80% of its net assets, plus borrowings for investment purposes, in \"investment grade\" fixed income securities. Corporate debt securities, including notes, bonds, debentures and commercial paper, are fixed income securities usually issued by businesses to finance their operations. These securities may be secured or unsecured, may be issued by U.S. or foreign entities and may carry variable or floating rates of interest.",
        "category": "Short-Term Bond",
        "family": "Franklin Templeton Investments",
        "exchange": "NGM",
        "market": "us_market"
    }
}