{
    "AFSM": {
        "short_name": "First Trust Active Factor Small",
        "long_name": "First Trust Active Factor Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide capital appreciation.\n Under normal market conditions, the fund will invest at least 80% of its net assets (including investment borrowings) in U.S.-listed equity securities issued by small capitalization companies. The manager defines small capitalization companies as those that, at the time of investment, have a market capitalization between a minimum of $250 million and the maximum market capitalization of a widely recognized index of small capitalization companies based upon the composition of the index at the time of investment. It is non-diversified.",
        "category": "Small Blend",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1289128
    },
    "BKSE": {
        "short_name": "BNY Mellon US Small Cap Core Eq",
        "long_name": "BNY Mellon US Small Cap Core Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the MorningstarÂ® US Small Cap IndexSM.\n Under normal circumstances, the fund generally invests in all of the stocks in the index in proportion to their weighting in the index. The index is a float-adjusted market capitalization weighted index designed to measure the performance of U.S. small-capitalization stocks. It is non-diversified.",
        "category": "Small Blend",
        "family": "BNY Mellon",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 126563312
    },
    "CSA": {
        "short_name": "VictoryShares US Small Cap Vola",
        "long_name": "VictoryShares US Small Cap Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory US Small Cap 500 Volatility Weighted Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory US Small Cap 500 Volatility Weighted Index, an unmanaged, volatility weighted index maintained exclusively by the index provider. The index combines fundamental criteria with individual security risk control achieved through volatility weighting of individual securities.",
        "category": "Small Blend",
        "family": "Victory Capital",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 25314352
    },
    "CSF": {
        "short_name": "VictoryShares US Discovery Enha",
        "long_name": "VictoryShares US Discovery Enhanced Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that match the performance of the Nasdaq Victory US Small Cap 500 Long/Cash Volatility Weighted Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory US Small Cap 500 Long/Cash Volatility Weighted Index. The index identifies the 500 largest U.S. companies with market capitalizations of less than $3 billion measured at the time the index&#39;s constituent securities are determined.",
        "category": "Small Blend",
        "family": "Victory Capital",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 58990552
    },
    "CSML": {
        "short_name": "IQ Chaikin U.S. Small Cap ETF",
        "long_name": "IQ Chaikin U.S. Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that track (before fees and expenses) the price and yield performance of its underlying index, the Nasdaq Chaikin Power US Small Cap Index.\n The fund invests at least 80% of the value of its assets (net assets plus the amount of any borrowings for investment purposes) in securities of small-capitalization U.S. issuers. The underlying index applies the Chaikin Power GaugeÂ®, a quantitative multi-factor model that seeks to identify securities that are expected to outperform peers, to select securities from the Nasdaq US 1500 Index.",
        "category": "Small Blend",
        "family": "IndexIQ",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 191081776
    },
    "DMRS": {
        "short_name": "DeltaShares S&P 600 Managed Ris",
        "long_name": "DeltaShares S&P 600 Managed Risk ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results, before fees and expenses, of the S&P 600 Managed Risk 2.0 Index.\n Under normal market conditions, the fund invests a substantial portion, but at least 80%, of its assets, exclusive of collateral held from securities lending, in securities comprising the S&P 600 Managed Risk 2.0 Index. The underlying index seeks to achieve these objectives by allocating weightings among the S&P SmallCap 600 Index, the S&P U.S. Treasury Bond Current 5-Year Index and the S&P U.S. Treasury Bill 0-3 Month Index. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "DeltaShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 45610520
    },
    "EES": {
        "short_name": "WisdomTree U.S. SmallCap Fund",
        "long_name": "WisdomTree U.S. SmallCap Earnings Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. SmallCap Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index that is comprised of earnings-generating companies within the small-capitalization segment of the U.S. stock market. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 609326976
    },
    "ESML": {
        "short_name": "iShares ESG Aware MSCI USA Smal",
        "long_name": "iShares ESG Aware MSCI USA Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MSCI USA Small Cap Extended ESG Focus Index.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is an optimized equity index designed to produce investment results comparable to the MSCI USA Small Cap Index (the \"parent index\"), while reflecting a higher allocation than that of the parent index to companies with favorable ESG profiles (as determined by MSCI).",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 826033600
    },
    "EWSC": {
        "short_name": "Invesco S&P SmallCap 600 Equal ",
        "long_name": "Invesco S&P SmallCap 600 Equal Weight ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Equal Weight Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index consists of all of the components of the S&P SmallCap 600Â® Index, a broad-based index of approximately 600 securities that measures the small-cap segment of the U.S. equity market.",
        "category": "Small Blend",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 55823900
    },
    "FLQS": {
        "short_name": "Franklin LibertyQ U.S. Small Ca",
        "long_name": "Franklin LibertyQ U.S. Small Cap Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the LibertyQ U.S. Small Cap Equity Index.\n Under normal market conditions, the fund invests at least 80% of its assets in the component securities of the underlying index. The underlying index is based on the Russell 2000Â® Index using a methodology developed with Franklin Templeton to reflect Franklin Templeton&#39;s desired investment strategy.",
        "category": "Small Blend",
        "family": "Franklin Templeton Investments",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 18819284
    },
    "FNDA": {
        "short_name": "Schwab Fundamental U.S. Small C",
        "long_name": "Schwab Fundamental U.S. Small Company Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Russell RAFIâ\u0084¢ US Small Company Index.\n The fund normally will invest at least 90% of its net assets (including, for this purpose, any borrowings for investment purposes) in stocks included in the index. The index measures the performance of the small company size segment by fundamental overall company scores (scores), which are created using as the universe the U.S. companies in the FTSE Global Total Cap Index (the parent index).",
        "category": "Small Blend",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4344750592
    },
    "FYX": {
        "short_name": "First Trust Small Cap Core Alph",
        "long_name": "First Trust Small Cap Core AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Small Cap Core Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select stocks from the NASDAQ US 700 Small Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Small Blend",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 938214464
    },
    "GSSC": {
        "short_name": "GS ActiveBeta U.S. Small Cap Eq",
        "long_name": "Goldman Sachs ActiveBeta U.S. Small Cap Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the Goldman Sachs ActiveBetaÂ® U.S. Small Cap Equity Index.\n The fund seeks to achieve its investment objective by investing at least 80% of its assets in securities included in its index, in depositary receipts representing securities included in the index and in underlying stocks in respect of depositary receipts included in its index. The index is designed to deliver exposure to equity securities of small capitalization U.S. issuers.",
        "category": "Small Blend",
        "family": "Goldman Sachs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 397668544
    },
    "IJR": {
        "short_name": "iShares Core S&P Small-Cap ETF",
        "long_name": "iShares Core S&P Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P SmallCap 600 (the \"underlying index\"), which measures the performance of the small-capitalization sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 65687891968
    },
    "ISCB": {
        "short_name": "iShares Morningstar Small-Cap E",
        "long_name": "iShares Morningstar Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Small-Cap Extended IndexSM composed of small-capitalization U.S. equities.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by small-capitalization companies that have exhibited both â\u0080\u009cgrowthâ\u0080\u009d and â\u0080\u009cvalueâ\u0080\u009d characteristics as determined by Morningstar, Inc.â\u0080\u0099s (â\u0080\u009cMorningstarâ\u0080\u009d or the â\u0080\u009cindex providerâ\u0080\u009d) proprietary index methodology.",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 244714032
    },
    "ISMD": {
        "short_name": "Inspire Small/Mid Cap Impact ET",
        "long_name": "Inspire Small/Mid Cap Impact ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate investment results that generally correspond to the performance of the Inspire Small/Mid Cap Impact Equal Weight Index.\n The fund generally invests at least 80% of its total assets in the component securities of the index. The index provider selects securities from a universe of publicly traded, domestic small and mid capitalization equity securities of companies with market capitalizations between $1 billion and $3.5 billion and which have an Inspire Impact ScoreÂ® of zero or higher.",
        "category": "Small Blend",
        "family": "Inspire",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 105608072
    },
    "IUSS": {
        "short_name": "Invesco RAFI Strategic US Small",
        "long_name": "Invesco RAFI Strategic US Small Company ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Invesco Strategic US Small Company Index.\n The fund generally will invest at least 80% of its total assets in securities that comprise the index. Strictly in accordance with its guidelines and mandated procedures, Invesco Indexing LLC compiles and maintains the index, which is designed to measure the performance of equity securities issued by higher quality, small-business-sized companies designated as U.S. companies. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "Invesco",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 33390644
    },
    "IWC": {
        "short_name": "iShares Microcap ETF",
        "long_name": "iShares Micro-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell Microcap Index, which measures the performance of the microcap sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1242606464
    },
    "IWM": {
        "short_name": "iShares Russell 2000 ETF",
        "long_name": "iShares Russell 2000 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell 2000Â® Index, which measures the performance of the small-capitalization sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 68056059904
    },
    "JPSE": {
        "short_name": "JPMorgan Diversified Return U.S",
        "long_name": "JPMorgan Diversified Return U.S. Small Cap Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that closely correspond, before fees and expenses, to the performance of the JP Morgan Diversified Factor US Small Cap Equity Index.\n The fund will invest at least 80% of its assets in securities included in the underlying index. \"Assets\" means net assets, plus the amount of borrowing for investment purposes. The underlying index is comprised of U.S. equity securities selected to represent a diversified set of factor characteristics. The rules based proprietary multi-factor selection process utilizes the following characteristics: value, momentum and quality.",
        "category": "Small Blend",
        "family": "JPMorgan",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 166784384
    },
    "KAPR": {
        "short_name": "Innovator Russell 2000 Power Bu",
        "long_name": "Innovator Russell 2000 Power Buffer ETF - April",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with returns that match the price return of the iShares Russell 2000 ETF.\n The fund invests at least 80% of its net assets in FLexible EXchangeÂ® Options (\"FLEX Options\") that reference the iShares Russell 2000 ETF. FLEX Options are exchange-traded options contracts with uniquely customizable terms. Although guaranteed for settlement by the Options Clearing Corporation (the \"OCC\"), FLEX Options are still subject to counterparty risk with the OCC and may be less liquid than more traditional exchange-traded options. It is non-diversified.",
        "category": "Small Blend",
        "family": "Innovator ETFs",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 14844346
    },
    "KJAN": {
        "short_name": "Innovator ETFs Trust Innovator ",
        "long_name": "Innovator Russell 2000 Power Buffer ETF January",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with returns that match the price return of the iShares Russell 2000 ETF.\n The fund invests at least 80% of its net assets in FLexible ExchangeÂ® Options (â\u0080\u009cFLEX Optionsâ\u0080\u009d) that reference the iShares Russell 2000 ETF (the â\u0080\u009cUnderlying ETFâ\u0080\u009d). FLEX Options are exchange-traded options contracts with uniquely customizable terms. The Underlying ETF is an exchange-traded fund that seeks to track the investment results of the Russell 2000 Index, which is a float-adjusted capitalization-weighted index of equity securities issued by the approximately 2,000 smallest issuers in the Russell 3000 Index. It is non-diversified.",
        "category": "Small Blend",
        "family": "Innovator ETFs",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 128381344
    },
    "KJUL": {
        "short_name": "Innovator Russell 2000 Power Bu",
        "long_name": "Innovator Russell 2000 Power Buffer ETF - July",
        "currency": "USD",
        "summary": "The investment seeks to provide investors with returns that match those of the Russell 2000 Price Index.\n The fund invests at least 80% of its net assets in FLexible EXchangeÂ® Options (â\u0080\u009cFLEX Optionsâ\u0080\u009d) that reference the Russell 2000 Price Index. FLEX Options are exchange-traded options contracts with uniquely customizable terms. Although guaranteed for settlement by the Options Clearing Corporation (the â\u0080\u009cOCCâ\u0080\u009d), FLEX Options are still subject to counterparty risk with the OCC and may be less liquid than more traditional exchange-traded options. It is non-diversified.",
        "category": "Small Blend",
        "family": "Innovator ETFs",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 23161596
    },
    "KSCD": {
        "short_name": "KFA Small Cap Quality Dividend ",
        "long_name": "KFA Small Cap Quality Dividend Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correlate generally to the price and yield performance of the Russell 2000 Dividend Select Equal Weight Index (the â\u0080\u009cunderlying indexâ\u0080\u009d).\n Under normal circumstances, the fund will invest at least 80% of its total assets in components of the underlying index. The underlying index is designed to track the equity market performance of small cap companies that have increased their dividend payments over a period of ten years (subject to certain exceptions), which the manager believes is a measure of a â\u0080\u009cqualityâ\u0080\u009d company. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "KraneShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 38352684
    },
    "OMFS": {
        "short_name": "Invesco Exchange-Traded Self-In",
        "long_name": "Invesco Russell 2000 Dynamic Multifactor ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the Russell 2000Â® Invesco Dynamic Multifactor Index.\n The fund generally will invest at least 80% of its total assets in the securities that comprise the underlying index. The underlying index is designed to select equity securities from within the Russell 2000 Index, which measures the performance of 2,000 small-capitalization companies in the United States. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "Invesco",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 85954896
    },
    "OSCV": {
        "short_name": "Opus Small Cap Value ETF",
        "long_name": "Opus Small Cap Value Plus ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation.\n The fund is an actively managed exchange-traded fund (\"ETF\") that invests under normal circumstances at least 80% of its net assets (plus any borrowings for investment purposes) in equity securities of small-capitalization U.S. companies. The fund&#39;s sub-adviser defines a small-capitalization company as an issuer whose market capitalization at the time of purchase is in the range of those found in the Russell 2000Â® Index. The fundâ\u0080\u0099s equity securities primarily include common stocks, real estate investment trusts (â\u0080\u009cREITsâ\u0080\u009d), and American Depositary Receipts (â\u0080\u009cADRsâ\u0080\u009d) representing the stock of a foreign company.",
        "category": "Small Blend",
        "family": "Aptus Capital Advisors",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 93224864
    },
    "PBSM": {
        "short_name": "Invesco PureBeta MSCI USA Small",
        "long_name": "Invesco PureBeta MSCI USA Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the MSCI USA Small Cap Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The index is designed to measure the performance of the small-capitalization segment of the U.S. equity market.",
        "category": "Small Blend",
        "family": "Invesco",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 27308798
    },
    "PRFZ": {
        "short_name": "Invesco FTSE RAFI US 1500 Small",
        "long_name": "Invesco FTSE RAFI US 1500 Small-Mid ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the FTSE RAFIâ\u0084¢ US Mid Small 1500 Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of 1,500 common stocks that the index provider strictly in accordance with its guidelines and mandated procedures, include to track the performance of small- and medium-sized U.S. companies based on the following four fundamental measures of firm size: book value, cash flow, sales and dividends.",
        "category": "Small Blend",
        "family": "Invesco",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 1904551552
    },
    "RNSC": {
        "short_name": "Small Cap US Equity Select ETF",
        "long_name": "First Trust Small Cap US Equity Select ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq Riskalyze US Small Cap Index (the \"index\").\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks and real estate investment trusts (\"REITs\") that comprise the index. The index is designed to select dividend-paying securities issued by small capitalization U.S. companies.",
        "category": "Small Blend",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 8673855
    },
    "SCHA": {
        "short_name": "Schwab U.S. Small-Cap ETF",
        "long_name": "Schwab U.S. Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track as closely as possible, before fees and expenses, the total return of the Dow Jones U.S. Small-Cap Total Stock Market Index.\n To pursue its goal, the fund generally invests in stocks that are included in the index. The index includes the small-cap portion of the Dow Jones U.S. Total Stock Market Index actually available to investors in the marketplace. The Dow Jones U.S. Small-Cap Total Stock Market Index includes the components ranked 751-2500 by full market capitalization. The index is a float-adjusted market capitalization weighted index. The fund will invest at least 90% of its net assets in these stocks.",
        "category": "Small Blend",
        "family": "Schwab ETFs",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15301006336
    },
    "SIXS": {
        "short_name": "6 Meridian Small Cap Equity ETF",
        "long_name": "6 Meridian Small Cap Equity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide capital appreciation.\n Under normal circumstances, the fund invests at least 80% of its net assets (plus the amount of any borrowings for investment purposes) in small-capitalization equity securities. The Sub-Adviser considers small-capitalization companies to be the smallest 75% of stocks included in the Russell 3000 Index by market capitalization. Although it invests primarily in small-capitalization securities, the fund may invest in equity securities of companies of any capitalization. The equity securities in which it invests are mainly common stocks.",
        "category": "Small Blend",
        "family": "Exchange Traded Concepts",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 42759676
    },
    "SLY": {
        "short_name": "SPDR S&P 600 Small Cap ETF (bas",
        "long_name": "SPDR S&P 600 Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P SmallCap 600 Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. In addition, in seeking to track the index, it may invest in equity securities that are not included in the index, cash and cash equivalents or money market instruments, such as repurchase agreements and money market funds. The index measures the performance of the small-capitalization segment of the U.S. equity market.",
        "category": "Small Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1784523392
    },
    "SMDV": {
        "short_name": "ProShares Russell 2000 Dividend",
        "long_name": "ProShares Russell 2000 Dividend Growers ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results, before fees and expenses, that track the performance of the Russell 2000 Â® Dividend Growth Index (the \"index\").\n Under normal circumstances, the fund will invest at least 80% of its total assets in component securities of the index. The index contains a minimum of 40 stocks, which are equally weighted, and no single sector is allowed to comprise more than 30% of the index weight.",
        "category": "Small Blend",
        "family": "ProShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 820926016
    },
    "SMLV": {
        "short_name": "SPDR SSGA US Small Cap Low Vola",
        "long_name": "SPDR SSGA US Small Cap Low Volatility Index ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the SSGA US Small Cap Low Volatility Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index is designed to measure the performance of the stocks of U.S. small capitalization companies that exhibit low volatility. Volatility is a statistical measurement of the magnitude of movements in a stock&#39;s price over time. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 227825776
    },
    "SPSM": {
        "short_name": "SPDR Portfolio S&P 600 Small Ca",
        "long_name": "SPDR Portfolio S&P 600 Small Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P SmallCap 600 Index.\n Under normal market conditions, the fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the small-capitalization segment of the U.S. equity market. The fund is non-diversified.",
        "category": "Small Blend",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4009281792
    },
    "SQLV": {
        "short_name": "Legg Mason Small-Cap Quality Va",
        "long_name": "Legg Mason Small-Cap Quality Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of an index composed of equity securities of small-capitalization companies that are traded in the United States.\n The fund seeks to track the investment results of the Royce Small-Cap Quality Value Index (the \"underlying index\"). The underlying index utilizes a proprietary methodology created and sponsored by the fund&#39;s subadviser. The subadviser is affiliated with both LMPFA and the fund. The fund will invest at least 80% of its net assets, plus borrowings for investment purposes, if any, in securities that compose its underlying index.",
        "category": "Small Blend",
        "family": "Franklin Templeton Investments",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 16122724
    },
    "SSLY": {
        "short_name": "Syntax Stratified SmallCap ETF",
        "long_name": "Syntax Stratified SmallCap ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before expenses, correspond generally to the total return performance of publicly traded equity securities of companies in the Syntax Stratified SmallCap Index.\n Under normal market conditions, the fund generally invests substantially all, and at least 80% of its total assets in the securities comprising the index. The index is the Stratified WeightTM version of the widely used S&P SmallCap 600Â® Index and holds the same constituents as the S&P SmallCap 600Â® Index.",
        "category": "Small Blend",
        "family": "Syntax",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 20651980
    },
    "STSB": {
        "short_name": "iShares Factors US Small Blend ",
        "long_name": "iShares Factors US Small Blend Style ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell US Small Cap Factors Blend Style Index.\n The fund generally will invest at least 80% of its assets in the component securities of its index and in investments that have economic characteristics that are substantially identical to the component securities of its index and may invest up to 20% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is designed to select equity securities from the Russell 2000Â® Index, with exposure to five equity style factors while maintaining a level of risk similar to that of the parent index. It is non-diversified.",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 7223672
    },
    "TPSC": {
        "short_name": "Timothy Plan US Small Cap Core ",
        "long_name": "Timothy Plan US Small Cap Core ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Victory US Small Cap Volatility Weighted BRI Index before fees and expenses.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its net assets directly or indirectly in the securities included in the Victory US Small Cap Volatility Weighted BRI Index, an unmanaged, volatility weighted index created by the fund&#39;s Sub-Advisor. The index combines fundamental criteria with individual security risk control achieved through volatility weighting of individual securities, rather than traditional market-cap weighting.",
        "category": "Small Blend",
        "family": "Timothy Plan",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 45320460
    },
    "USVM": {
        "short_name": "VictoryShares USAA MSCI USA Sma",
        "long_name": "VictoryShares USAA MSCI USA Small Cap Value Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the MSCI USA Small Cap Select Value Momentum Blend Index.\n Under normal circumstances, the fund seeks to achieve its investment objective by investing at least 80% of its assets in securities in the index. The index is designed to deliver exposure to equity securities of small-capitalization U.S. issuers within the MSCI USA Small Cap Index (the \"parent index\") that have higher exposure to value and momentum factors while also maintaining moderate index turnover and lower realized volatility than traditional capitalization weighted indexes.",
        "category": "Small Blend",
        "family": "Victory Capital",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 316439264
    },
    "VB": {
        "short_name": "Vanguard Small-Cap ETF",
        "long_name": "Vanguard Small-Cap Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of the CRSP US Small Cap Index that measures the investment return of small-capitalization stocks.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Small Cap Index, a broadly diversified index of stocks of small U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Small Blend",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 131794059264
    },
    "VIOO": {
        "short_name": "Vanguard S&P Small-Cap 600 ETF",
        "long_name": "Vanguard S&P Small-Cap 600 Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of small-capitalization stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the S&P SmallCap 600Â® Index. The Advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Small Blend",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3369538816
    },
    "VTWO": {
        "short_name": "Vanguard Russell 2000 ETF",
        "long_name": "Vanguard Russell 2000 Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of small-capitalization stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the Russell 2000Â® Index. The index is designed to measure the performance of small-capitalization stocks in the United States. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Small Blend",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 5948160512
    },
    "XJR": {
        "short_name": "iShares ESG Screened S&P Small-",
        "long_name": "iShares ESG Screened S&P Small-Cap ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of an index composed of small-capitalization U.S. equities while applying screens for company involvement in controversies and controversial business activities.\n The fund seeks to track the investment results of the S&P SmallCap 600 Sustainability Screened Index, which measures the performance of the small-capitalization sector of the U.S. equity market while excluding companies involved in controversial business activities and controversies, as determined by S&P Dow Jones Indices LLC. BFA uses a representative sampling indexing strategy to manage the fund. It is non-diversified.",
        "category": "Small Blend",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 9701336
    },
    "XSLV": {
        "short_name": "Invesco S&P SmallCap Low Volati",
        "long_name": "Invesco S&P SmallCap Low Volatility ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Low Volatility Index.\n The fund generally will invest at least 90% of its total assets in the securities that comprise the index. Strictly in accordance with its guidelines and mandated procedures, S&P Dow Jones Indices LLC compiles, maintains and calculates the index, which is designed to measure the performance of approximately 120 securities in the S&P SmallCap 600 Â® Index that have exhibited the lowest volatility over the past 12 months.",
        "category": "Small Blend",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1200877824
    }
}