{
    "CALF": {
        "short_name": "Pacer US Small Cap Cash Cows 10",
        "long_name": "Pacer US Small Cap Cash Cows 100 ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the total return performance, before fees and expenses, of the Pacer US Small Cap Cash Cows Index (the \"index\").\n Under normal circumstances, at least 80% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in the component securities of the index. The index uses an objective, rules-based methodology to provide exposure to small-capitalization U.S. companies with high free cash flow yields.",
        "category": "Small Value",
        "family": "Pacer",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 135343456
    },
    "CSB": {
        "short_name": "VictoryShares US Small Cap High",
        "long_name": "VictoryShares US Small Cap High Div Volatility Wtd ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that track the performance of the Nasdaq Victory US Small Cap High Dividend 100 Volatility Weighted Index.\n The fund seeks to achieve its investment objective by investing, under normal market conditions, at least 80% of its assets directly or indirectly in the securities included in the Nasdaq Victory US Small Cap High Dividend 100 Volatility Weighted Index, an unmanaged, volatility weighted index maintained exclusively by the index provider. The index identifies the 100 highest dividend yielding stocks in the Nasdaq Victory US Small Cap 500 Volatility Weighted Index.",
        "category": "Small Value",
        "family": "Victory Capital",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 196832288
    },
    "DEEP": {
        "short_name": "Roundhill Acquirers Deep Value ",
        "long_name": "Roundhill Acquirers Deep Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the performance, before fees and expenses, of the Acquirers Deep Value Index (the \"index\").\n The index was established in 2020 by Acquirers Funds LLC and tracks the performance of a portfolio of 100 of the most undervalued, fundamentally strong stocks drawn from the smallest 75% of stocks listed in the United States by market capitalization meeting certain liquidity thresholds. The fund uses a â\u0080\u009cpassive managementâ\u0080\u009d (or indexing) approach to track the performance, before fees and expenses, of the index. It is non-diversified.",
        "category": "Small Value",
        "family": "TWM FUNDS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 49107988
    },
    "DES": {
        "short_name": "WisdomTree U.S. SmallCap Divide",
        "long_name": "WisdomTree U.S. SmallCap Dividend Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the WisdomTree U.S. SmallCap Dividend Index.\n Under normal circumstances, at least 95% of the fund&#39;s total assets (exclusive of collateral held from securities lending) will be invested in component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is a fundamentally weighted index measuring the performance of the small-capitalization segment of the U.S. dividend-paying market. The fund is non-diversified.",
        "category": "Small Value",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1829817984
    },
    "FDM": {
        "short_name": "First Trust DJ Select MicroCap ",
        "long_name": "First Trust Dow Jones Select MicroCap Index Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Dow Jones Select MicroCap Index(SM).\n The fund will normally invest at least 80% of its net assets (including investment borrowings) in the common stocks of U.S. micro-capitalization companies which are publicly traded in the United States. The index is designed to measure the performance of micro-cap stocks issued by U.S. companies that are comparatively liquid and have strong fundamentals relative to the micro-cap segment as a whole.",
        "category": "Small Value",
        "family": "First Trust",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 164003168
    },
    "FNK": {
        "short_name": "First Trust Mid Cap Value Alpha",
        "long_name": "First Trust Mid Cap Value AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Mid Cap Value Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select value stocks from the NASDAQ US 600 Mid Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Small Value",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 105968944
    },
    "FYT": {
        "short_name": "First Trust Small Cap Value Alp",
        "long_name": "First Trust Small Cap Value AlphaDEX Fund",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Small Cap Value Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select value stocks from the NASDAQ US 700 Small Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.",
        "category": "Small Value",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 286756384
    },
    "IJS": {
        "short_name": "iShares S&P SmallCap 600 Value ",
        "long_name": "iShares S&P Small-Cap 600 Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the S&P SmallCap 600 Value IndexTM, which measures the performance of the small-capitalization value sector of the U.S. equity market.\n The fund generally will invest at least 80% of its assets in the component securities of its index and in investments that have economic characteristics that are substantially identical to the component securities of its index and may invest up to 20% of its assets in certain futures, options and swap contracts, cash and cash equivalents but which BFA believes will help the fund track the index.",
        "category": "Small Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8979070976
    },
    "ISCV": {
        "short_name": "iShares Morningstar Small-Cap V",
        "long_name": "iShares Morningstar Small-Cap Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Morningstar US Small Cap Broad Value Extended IndexSM composed of small-capitalization U.S. equities that exhibit value characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by small-capitalization companies that have exhibited above-average â\u0080\u009cvalueâ\u0080\u009d characteristics as determined by Morningstar, Inc.â\u0080\u0099s (â\u0080\u009cMorningstarâ\u0080\u009d or the â\u0080\u009cindex providerâ\u0080\u009d) proprietary index methodology.",
        "category": "Small Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 420728768
    },
    "IWN": {
        "short_name": "iShares Russell 2000 Value ETF",
        "long_name": "iShares Russell 2000 Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell 2000 Value Index, which measures the performance of the small-capitalization value sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.",
        "category": "Small Value",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 16503241728
    },
    "RFV": {
        "short_name": "Invesco S&P Midcap 400 Pure Val",
        "long_name": "Invesco S&P MidCap 400 Pure Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P MidCap 400Â® Pure Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of a subset of securities from the S&P MidCap 400Â® Index that exhibit strong value characteristics.",
        "category": "Small Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 136890608
    },
    "RWJ": {
        "short_name": "Invesco Exchange-Traded Fund Tr",
        "long_name": "Invesco S&P SmallCap 600 Revenue ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Revenue-Weighted Index.\n The fund will invest at least 90% of its total assets in the securities that comprise the index. The index is designed to measure the performance of positive revenue-producing constituent securities of the S&P SmallCap 600 Â® Index (the â\u0080\u009cParent indexâ\u0080\u009d). The Parent index is comprised of common stocks of approximately 600 small-capitalization companies that generally represent the small-cap universe of the U.S. equity market. The fund is non-diversified.",
        "category": "Small Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 480811040
    },
    "RZV": {
        "short_name": "Invesco S&P Smallcap 600 Pure V",
        "long_name": "Invesco S&P SmallCap 600 Pure Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Pure Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of a subset of securities from the S&P SmallCap 600Â® Index that exhibit strong value characteristics.",
        "category": "Small Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 357369760
    },
    "SLYV": {
        "short_name": "SPDR S&P 600 Small Cap Value ET",
        "long_name": "SPDR S&P 600 Small Cap Value ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the total return performance of the S&P SmallCap 600 Value Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index. The index measures the performance of the small-capitalization value segment of the U.S. equity market. It may purchase a subset of the securities in the index in an effort to hold a portfolio of securities with generally the same risk and return characteristics of the index.",
        "category": "Small Value",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3674825728
    },
    "SVAL": {
        "short_name": "iShares US Small Cap Value Fact",
        "long_name": "iShares US Small Cap Value Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Russell 2000 Focused Value Select Index composed of U.S. small-capitalization stocks with prominent value characteristics.\n The index measures the performance of small-capitalization U.S. companies with prominent value factor characteristics, as determined by the index provider. The fund generally will invest at least 80% of its assets in the component securities and other instruments of the index and may invest up to 20% of its assets in certain futures, options and swap contracts, cash and cash equivalents.",
        "category": "Small Value",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 58759632
    },
    "VBR": {
        "short_name": "Vanguard Small-Cap Value ETF",
        "long_name": "Vanguard Small-Cap Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of small-capitalization value stocks.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Small Cap Value Index, a broadly diversified index of value stocks of small U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Small Value",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 44636930048
    },
    "VIOV": {
        "short_name": "Vanguard S&P Small-Cap 600 Valu",
        "long_name": "Vanguard S&P Small-Cap 600 Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of small-capitalization value stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the S&P SmallCap 600Â® Value Index, which represents the value companies, as determined by the index sponsor, of the S&P SmallCap 600 Index. The Advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Small Value",
        "family": "Vanguard",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1387466240
    },
    "VTWV": {
        "short_name": "Vanguard Russell 2000 Value ETF",
        "long_name": "Vanguard Russell 2000 Value Index Fund ETF Shares",
        "currency": "USD",
        "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of small-capitalization value stocks in the United States.\n The fund employs an indexing investment approach designed to track the performance of the Russell 2000Â® Value Index. The index is designed to measure the performance of small-capitalization value stocks in the United States. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.",
        "category": "Small Value",
        "family": "Vanguard",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 1090626560
    },
    "XSHD": {
        "short_name": "Invesco S&P SmallCap High Divid",
        "long_name": "Invesco S&P SmallCap High Dividend Low Volatility ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Low Volatility High Dividend Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of 60 securities in the S&P SmallCap 600Â® Index that historically have provided high dividend yields with lower volatility.",
        "category": "Small Value",
        "family": "Invesco",
        "exchange": "BTS",
        "market": "us_market",
        "total_assets": 21717798
    },
    "XSVM": {
        "short_name": "Invesco S&P SmallCap Value with",
        "long_name": "Invesco S&P SmallCap Value with Momentum ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600 High Momentum Value Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is designed to track the performance of approximately 120 stocks in the S&P SmallCap 600Â® Index that have the highest \"value\" and \"momentum\" scores.",
        "category": "Small Value",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 251441376
    }
}