{"DWAS": {"short_name": "Invesco DWA SmallCap Momentum E", "long_name": "Invesco DWA SmallCap Momentum ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the Dorsey WrightÂ® SmallCap Technical Leaders Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index Provider selects securities of small capitalization companies trading on U.S. exchanges for inclusion in the index, pursuant to a proprietary methodology that is designed to identify securities that demonstrate powerful relative strength (or momentum) characteristics.", "category": "Small Growth", "family": "Invesco", "exchange": "NMS", "market": "us_market"}, "DWMC": {"short_name": "AdvisorShares Dorsey Wright Mic", "long_name": "AdvisorShares Dorsey Wright Micro-Cap ETF", "currency": "USD", "summary": "The investment seeks long term capital appreciation.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective by investing primarily in U.S.-traded equity securities consisting of common and preferred stock and American Depositary Receipts (\"ADRs\"). ADRs are securities traded on a local exchange stock exchange that represent interests in securities issued by a foreign publicly listed company. Under normal circumstances, the fund invests at least 80% of its net assets (plus any borrowings for investment purposes) in micro-cap securities.", "category": "Small Growth", "family": "AdvisorShares", "exchange": "NMS", "market": "us_market"}, "FYC": {"short_name": "First Trust Small Cap Growth Al", "long_name": "First Trust Small Cap Growth AlphaDEX Fund", "currency": "USD", "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an equity index called the Nasdaq AlphaDEXÂ® Small Cap Growth Index.\n The fund will normally invest at least 90% of its net assets (including investment borrowings) in the common stocks that comprise the index. The index is designed to select growth stocks from the NASDAQ US 700 Small Cap Index (the \"base index\") that may generate positive alpha, or risk-adjusted returns, relative to traditional indices through the use of the AlphaDEXÂ® selection methodology.", "category": "Small Growth", "family": "First Trust", "exchange": "NMS", "market": "us_market"}, "IJT": {"short_name": "iShares S&P SmallCap 600 Growth", "long_name": "iShares S&P Small-Cap 600 Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the S&P SmallCap 600 Growth IndexTM, which measures the performance of the small-capitalization growth sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.", "category": "Small Growth", "family": "iShares", "exchange": "NGM", "market": "us_market"}, "IWO": {"short_name": "iShares Russell 2000 Growth ETF", "long_name": "iShares Russell 2000 Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the Russell 2000 Growth Index, which measures the performance of the small-capitalization growth sector of the U.S. equity market.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. It may invest the remainder of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which the advisor believes will help the fund track the underlying index.", "category": "Small Growth", "family": "iShares", "exchange": "PCX", "market": "us_market"}, "JKK": {"short_name": "iShares Morningstar Small-Cap G", "long_name": "iShares Morningstar Small-Cap Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the MorningstarÂ® US Small Growth IndexSM composed of small-capitalization U.S. equities that exhibit growth characteristics.\n The fund generally invests at least 90% of its assets in securities of the underlying index and in depositary receipts representing securities of the underlying index. The underlying index measures the performance of stocks issued by small-capitalization companies that have exhibited above-average \"growth\" characteristics as determined by Morningstar, Inc.&#39;s (\"Morningstar\" or the \"index provider\") proprietary index methodology.", "category": "Small Growth", "family": "iShares", "exchange": "PCX", "market": "us_market"}, "RZG": {"short_name": "Invesco S&P Smallcap 600 Pure G", "long_name": "Invesco S&P SmallCap 600 Pure Growth ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600Â® Pure Growth Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. The underlying index is composed of a subset of securities from the S&P SmallCap 600Â® Index that exhibit strong growth characteristics. The fund is non-diversified.", "category": "Small Growth", "family": "Invesco", "exchange": "PCX", "market": "us_market"}, "VBK": {"short_name": "Vanguard Small-Cap Growth ETF", "long_name": "Vanguard Small-Cap Growth Index Fund ETF Shares", "currency": "USD", "summary": "The investment seeks to track the performance of a benchmark index that measures the investment return of small-capitalization growth stocks.\n The fund employs an indexing investment approach designed to track the performance of the CRSP US Small Cap Growth Index, a broadly diversified index of growth stocks of small U.S. companies. The advisor attempts to replicate the target index by investing all, or substantially all, of its assets in the stocks that make up the index, holding each stock in approximately the same proportion as its weighting in the index.", "category": "Small Growth", "family": "Vanguard", "exchange": "PCX", "market": "us_market"}, "XSMO": {"short_name": "Invesco S&P SmallCap Momentum E", "long_name": "Invesco S&P SmallCap Momentum ETF", "currency": "USD", "summary": "The investment seeks to track the investment results (before fees and expenses) of the S&P SmallCap 600 Momentum Index (the \"underlying index\").\n The fund generally will invest at least 90% of its total assets in the securities that comprise the underlying index. Strictly in accordance with its guidelines and mandated procedures, the index provider compiles, maintains and calculates the underlying index, which is composed of constituents of the S&P SmallCap 600Â® that have the highest \"momentum score.\"", "category": "Small Growth", "family": "Invesco", "exchange": "PCX", "market": "us_market"}}