{
    "BIS": {
        "short_name": "ProShares UltraShort Nasdaq Bio",
        "long_name": "ProShares UltraShort Nasdaq Biotechnology",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times the inverse (-2x) of the daily performance of the Nasdaq Biotechnology IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a modified capitalization weighted index that includes securities of Nasdaq listed companies that are classified as either biotechnology or pharmaceutical. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 12297766
    },
    "BNKD": {
        "short_name": "MicroSectors U.S. Big Banks Ind",
        "long_name": "MicroSectors U.S. Big Banks Index -3X Inverse Leveraged ETNs",
        "currency": "USD",
        "summary": "The investment seeks to provide a leveraged inverse return based on the performance of the Solactive MicroSectorsTM U.S. Big Banks Index.\n The notes are senior unsecured medium-term notes issued by Bank of Montreal with a return linked to a three times leveraged participation in the inverse performance of the index, compounded daily, less a Daily Investor Fee, any negative Daily Interest and, if applicable, the Redemption Fee Amount. The index is an equal-dollar weighted index designed to represent the 10 U.S. stocks with the largest market capitalization in the banking sector.",
        "category": "Trading--Inverse Equity",
        "family": "Microsectors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8537872
    },
    "BZQ": {
        "short_name": "ProShares UltraShort MSCI Brazi",
        "long_name": "ProShares UltraShort MSCI Brazil Capped",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the MSCI Brazil 25/50 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is designed to measure the performance of the large and mid cap segments of the Brazilian market. It covers approximately 85% of the free float-adjusted market capitalization in Brazil. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 14363944
    },
    "CHAD": {
        "short_name": "Direxion Daily CSI 300 China A ",
        "long_name": "Direxion Daily CSI 300 China A Share Bear 1X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 100% of the inverse of the daily performance of the CSI 300 Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is a modified free-float market capitalization weighted index comprised of the largest and most liquid stocks in the Chinese A-share market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 324719776
    },
    "CLDS": {
        "short_name": "Direxion Daily Cloud Computing ",
        "long_name": "Direxion Daily Cloud Computing Bear 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the inverse (or opposite) of the daily performance of the Indxx USA Cloud Computing Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is provided by Indxx, LLC and includes domestic companies that deliver cloud computing infrastructure, platforms, or services. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 17675252
    },
    "DDG": {
        "short_name": "ProShares Short Oil & Gas",
        "long_name": "ProShares Short Oil & Gas",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the Dow Jones U.S. Oil & GasSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the oil and gas sector of the U.S. equity market. Component companies include, among others, exploration and production, integrated oil and gas, oil equipment and services, pipelines, renewable energy equipment companies and alternative fuel producers. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3326665
    },
    "DOG": {
        "short_name": "ProShares Short Dow30",
        "long_name": "ProShares Short Dow30",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the Dow Jones Industrial AverageÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a price-weighted index and includes 30 large-cap, \"blue-chip\" U.S. stocks, excluding utility and transportation companies. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 238416544
    },
    "DRIP": {
        "short_name": "Direxion Daily S&P Oil & Gas Ex",
        "long_name": "Direxion Daily S&P Oil & Gas Exp. & Prod. Bear 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, of 200% of the inverse (or opposite) of the daily performance of the S&P Oil & Gas Exploration & Production Select Industry Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is designed to measure the performance of a sub-industry or group of sub-industries determined based on the Global Industry Classification Standards (\"GICS\"). The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 57481108
    },
    "DRV": {
        "short_name": "Drexion Daily Real Estate Bear ",
        "long_name": "Direxion Daily MSCI Real Estate Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse of the daily performance of the MSCI US IMI Real Estate 25/50 Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse or short leveraged exposure to the index equal to at least 80% of its net assets (plus borrowing for investment purposes). The index is designed to measure the performance of the large-, mid- and small-capitalization segments of the U.S. equity universe that are classified in the real estate sector as per the GICS. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23570564
    },
    "DUG": {
        "short_name": "ProShares UltraShort Oil & Gas",
        "long_name": "ProShares UltraShort Oil & Gas",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. Oil & GasSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the oil and gas sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15996056
    },
    "DUST": {
        "short_name": "Direxion Daily Gold Miners Inde",
        "long_name": "Direxion Daily Gold Miners Index Bear 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results before fees and expenses of 200% of the inverse of the daily performance of the NYSE Arca Gold Miners Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets. The index is a modified market capitalization weighted index comprised of publicly traded companies that operate globally in both developed and emerging markets, and are involved primarily in mining for gold and, to a lesser extent, in mining for silver. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 93122152
    },
    "DXD": {
        "short_name": "ProShares UltraShort Dow30",
        "long_name": "ProShares UltraShort Dow30",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones Industrial AverageÂ® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a price-weighted index and includes 30 large-cap, \"blue-chip\" U.S. stocks, excluding utility and transportation companies. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 110048192
    },
    "EDZ": {
        "short_name": "Direxion Emerging Markets Bear ",
        "long_name": "Direxion Daily MSCI Emerging Markets Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse of the daily performance of the MSCI Emerging Markets IndexSM.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is a free float-adjusted market capitalization weighted index that is designed to represent the performance of large- and mid-capitalizations securities across 27 emerging market countries. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 27527252
    },
    "EEV": {
        "short_name": "ProShares UltraShort MSCI Emerg",
        "long_name": "ProShares UltraShort MSCI Emerging Markets",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the MSCI Emerging Markets IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 85% of the free float-adjusted market capitalization in emerging market countries. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5880464
    },
    "EFU": {
        "short_name": "ProShares UltraShort MSCI EAFE",
        "long_name": "ProShares UltraShort MSCI EAFE",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the MSCI EAFE IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 85% of the free float-adjusted, market capitalization in each industry group in developed market countries, excluding the U.S. and Canada. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1521279
    },
    "EFZ": {
        "short_name": "ProShares Short MSCI EAFE",
        "long_name": "ProShares Short MSCI EAFE",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the MSCI EAFE IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 85% of the free float-adjusted, market capitalization in each industry group in developed market countries, excluding the U.S. and Canada. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 9910675
    },
    "EMTY": {
        "short_name": "ProShares Decline of the Retail",
        "long_name": "ProShares Decline of the Retail Store ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation from the decline of bricks and mortar retailers through short exposure (-1x) to the Solactive-ProShares Bricks and Mortar Retail Store Index (the \"index\").\n The fund invests in financial instruments that the Advisor believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of publicly traded \"bricks and mortar\" retail companies whose retail revenue is derived principally from in-store sales. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8791980
    },
    "EPV": {
        "short_name": "ProShares UltraShort FTSE Europ",
        "long_name": "ProShares UltraShort FTSE Europe",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the FTSE Developed Europe All Cap IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a free float-adjusted market cap weighted index representing the performance of large, mid- and small cap companies in Developed European markets, including the UK. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 7702031
    },
    "ERY": {
        "short_name": "Direxion Daily Energy Bear 2X S",
        "long_name": "Direxion Daily Energy Bear 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the inverse of the daily performance of the Energy Select Sector Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is provided by S&P Dow Jones Indices and includes domestic companies from the energy sector which includes the following industries: oil, gas and consumable fuels; and energy equipment and services. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 33185256
    },
    "EUM": {
        "short_name": "ProShares Short MSCI Emerging M",
        "long_name": "ProShares Short MSCI Emerging Markets",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the MSCI Emerging Markets IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 85% of the free float-adjusted market capitalization in emerging market countries. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 20569728
    },
    "EWV": {
        "short_name": "ProShares UltraShort MSCI Japan",
        "long_name": "ProShares UltraShort MSCI Japan",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the MSCI Japan IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index adjusts the market capitalization of Index constituents for free float and targets for Index inclusion 85% of the free float-adjusted market capitalization in each industry group in Japan. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4886824
    },
    "FAZ": {
        "short_name": "Direxion Financial Bear 3X Shar",
        "long_name": "Direxion Daily Financial Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the Russell 1000Â® Financial Services Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is a subset of the Russell 1000Â® Index that measures the performance of the securities classified in the financial services sector of the large-capitalization U.S. equity market. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 161604704
    },
    "FNGD": {
        "short_name": "MicroSectors FANG  Index -3X In",
        "long_name": "MicroSectors FANG+ Index -3X Inverse Leveraged ETN",
        "currency": "USD",
        "summary": "The investment seeks return linked to a three times inverse leveraged participation in the daily performance of the NYSE Fang+â\u0084¢ Index, total return (the â\u0080\u009cindexâ\u0080\u009d).\n The notes are intended to be daily trading tools for sophisticated investors to manage daily trading risks as part of an overall diversified portfolio. The index is an equal-dollar weighted index designed to represent a segment of the technology and consumer discretionary sectors consisting of highly-traded growth stocks of technology and tech-enabled companies.",
        "category": "Trading--Inverse Equity",
        "family": "BMO Capital Markets Corp.",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 56542616
    },
    "FXP": {
        "short_name": "ProShares Ultrashort FTSE China",
        "long_name": "ProShares UltraShort FTSE China 50",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the FTSE China 50 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index consists of 50 of the largest and most liquid Chinese stocks listed and traded on the Stock Exchange of Hong Kong. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 21141688
    },
    "HDGE": {
        "short_name": "Ranger Equity Bear Bear ETF",
        "long_name": "AdvisorShares Ranger Equity Bear ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation through short sales of domestically traded equity securities.\n The Sub-Advisor seeks to achieve the fund&#39;s investment objective by short selling a portfolio of liquid mid- and large-cap U.S. exchange-traded equity securities, ETFs, ETNs and other exchange-traded products. The fund invests at least 80% of its net assets, plus any borrowings for investment purposes, in short positions in equity securities. The Sub-Advisor implements a bottom-up, fundamental, research driven security selection process.",
        "category": "Trading--Inverse Equity",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 51847896
    },
    "HIBS": {
        "short_name": "Direxion Daily S&P 500 High Bet",
        "long_name": "Direxion Daily S&P 500 High Beta Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the S&P 500Â® High Beta Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets. The index provider selects 100 securities to include in the index from the S&P 500Â® Index that have the highest sensitivity to market movements, or \"beta\" over the past 12 months as determined by the index provider. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 22502976
    },
    "JDST": {
        "short_name": "Direxion Daily Junior Gold Mine",
        "long_name": "Direxion Daily Junior Gold Miners Index Bear 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the inverse (or opposite) of the daily performance of the MVIS Global Junior Gold Miners Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index tracks the performance of foreign and domestic micro-, small- and mid-capitalization companies. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 78472000
    },
    "LABD": {
        "short_name": "Direxion Daily S&P Biotech Bear",
        "long_name": "Direxion Daily S&P Biotech Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse of the daily performance of the S&P Biotechnology Select Industry Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is designed to measure the performance of the biotechnology sub-industry based on the Global Industry Classification Standards (\"GICS\"). The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 60279848
    },
    "MYY": {
        "short_name": "ProShares Short MidCap400",
        "long_name": "ProShares Short MidCap400",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the S&P MidCap 400Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of mid-size company U.S. stock market performance. It is a float-adjusted, market capitalization-weighted index of 400 U.S. operating companies and real estate investment trusts selected through a process that factors in criteria such as liquidity, price, market capitalization and financial viability. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15838533
    },
    "MZZ": {
        "short_name": "ProShares UltraShort MidCap400",
        "long_name": "ProShares UltraShort MidCap400",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the S&P MidCap 400Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of mid-size company U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2031941
    },
    "PSQ": {
        "short_name": "ProShares Short QQQ",
        "long_name": "ProShares Short QQQ",
        "currency": "USD",
        "summary": "The investment seeks daily investment results before fees and expenses that correspond to the inverse (-1x) of the daily performance of the NASDAQ-100 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 523352448
    },
    "QID": {
        "short_name": "ProShares UltraShort QQQ",
        "long_name": "ProShares UltraShort QQQ",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the NASDAQ-100 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 195632944
    },
    "REK": {
        "short_name": "ProShares Short Real Estate",
        "long_name": "ProShares Short Real Estate",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the Dow Jones U.S. Real EstateSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the real estate industry of the U.S. equity market. Component companies include, among others, real estate holding and development and real estate services companies and real estate investment trusts (\"REITs\"). The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 8719069
    },
    "REW": {
        "short_name": "ProShares UltraShort Technology",
        "long_name": "ProShares UltraShort Technology",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. TechnologySM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the technology industry of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6217772
    },
    "RWM": {
        "short_name": "ProShares Short Russell2000",
        "long_name": "ProShares Short Russell2000",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the Russell 2000Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. It is a float-adjusted, market capitalization-weighted index containing approximately 2000 of the smallest companies in the Russell 3000Â® Index or approximately 10% of the total market capitalization of the Russell 3000Â® Index, which in turn represents approximately 98% of the investable U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 253764496
    },
    "RXD": {
        "short_name": "ProShares UltraShort Health Car",
        "long_name": "ProShares UltraShort Health Care",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. Health CareSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the healthcare industry of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1303258
    },
    "SBB": {
        "short_name": "ProShares Short SmallCap600",
        "long_name": "ProShares Short SmallCap600",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the S&P SmallCap 600Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of small-cap company U.S. stock market performance. It is a float-adjusted, market capitalization-weighted index of 600 U.S. operating companies selected through a process that factors in criteria such as liquidity, price, market capitalization, financial viability and public float. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5349320
    },
    "SBM": {
        "short_name": "Short Basic Materials",
        "long_name": "ProShares Short Basic Materials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the Dow Jones U.S. Basic MaterialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the basic materials industry of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1047247
    },
    "SCC": {
        "short_name": "ProShares UltraShort Consumer S",
        "long_name": "ProShares UltraShort Consumer Services",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. Consumer ServicesSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the stock performance of certain U.S. companies in the consumer services sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1004943
    },
    "SDD": {
        "short_name": "ProShares UltraShort SmallCap60",
        "long_name": "ProShares UltraShort SmallCap600",
        "currency": "USD",
        "summary": "The investment seeks daily investment results before fees and expenses that correspond to two times the inverse (-2x) of the daily performance of the S&P SmallCap 600Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of small-cap company U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2177873
    },
    "SDOW": {
        "short_name": "UltraPro Short Dow30",
        "long_name": "ProShares UltraPro Short Dow30",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times the inverse (-3x) of the daily performance of the Dow Jones Industrial AverageÂ® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a price-weighted index and includes 30 large-cap, \"blue-chip\" U.S. stocks, excluding utility and transportation companies. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 380258464
    },
    "SDP": {
        "short_name": "ProShares UltraShort Utilities",
        "long_name": "ProShares UltraShort Utilities",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. UtilitiesSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the utilities sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2445817
    },
    "SDS": {
        "short_name": "ProShares UltraShort S&P500",
        "long_name": "ProShares UltraShort S&P500",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the S&P 500Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of large-cap U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 588870848
    },
    "SEF": {
        "short_name": "ProShares Short Financials",
        "long_name": "ProShares Short Financials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the Dow Jones U.S. FinancialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the financial services sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 11460885
    },
    "SH": {
        "short_name": "ProShares Short S&P500",
        "long_name": "ProShares Short S&P500",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to the inverse (-1x) of the daily performance of the S&P 500Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of large-cap U.S. stock market performance. It is a float-adjusted, market capitalization-weighted index of 500 U.S. operating companies and real estate investment trusts selected through a process that factors in criteria such as liquidity, price, market capitalization and financial viability. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1522299648
    },
    "SIJ": {
        "short_name": "ProShares UltraShort Industrial",
        "long_name": "ProShares UltraShort Industrials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. IndustrialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the industrial sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 979590
    },
    "SKF": {
        "short_name": "ProShares UltraShort Financials",
        "long_name": "ProShares UltraShort Financials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. FinancialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the financial services sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 15232163
    },
    "SKYU": {
        "short_name": "ProShares Ultra Nasdaq Cloud Co",
        "long_name": "ProShares Ultra Cloud Computing",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the ISE CTA Cloud Computing Index.\n The index is comprised of companies classified as \"cloud computing\" companies by the CTA. The Advisor expects that its cash balances maintained in connection with the use of financial instruments will typically be held in money market instruments. It invests in common stock issued by public companies. The fund invests in derivatives, which are financial instruments whose value is derived from the value of an underlying asset or assets. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 2073732
    },
    "SMDD": {
        "short_name": "UltraPro Short MidCap400",
        "long_name": "ProShares UltraPro Short MidCap400",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times the inverse (-3x) of the daily performance of the S&P MidCap 400Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of mid-size company U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4430286
    },
    "SMN": {
        "short_name": "ProShares UltraShort Basic Mate",
        "long_name": "ProShares UltraShort Basic Materials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. Basic MaterialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the basic materials sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1592654
    },
    "SOXS": {
        "short_name": "Direxion Daily Semiconductor Be",
        "long_name": "Direxion Daily Semiconductor Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the PHLX Semiconductor Sector Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index measures the performance of domestic companies engaged in the design, distribution, manufacture and sale of semiconductors. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 77576232
    },
    "SPDN": {
        "short_name": "Direxion Daily S&P 500 Bear 1X ",
        "long_name": "Direxion Daily S&P 500 Bear 1X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 100% of the inverse (or opposite) of the daily performance of the S&P 500Â® Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is a float-adjusted and market capitalization-weighted index. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 136193248
    },
    "SPXS": {
        "short_name": "Direxion Daily S&P 500 Bear 3X",
        "long_name": "Direxion Daily S&P 500 Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the S&P 500Â® Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is a float-adjusted, market capitalization-weighted index. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 397439040
    },
    "SPXU": {
        "short_name": "ProShares UltraPro Short S&P500",
        "long_name": "ProShares UltraPro Short S&P500",
        "currency": "USD",
        "summary": "The investment seeks daily investment results before fees and expenses that correspond to three times the inverse (-3x) of the daily performance of the S&P 500Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of large-cap U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 510833920
    },
    "SQQQ": {
        "short_name": "ProShares UltraPro Short QQQ",
        "long_name": "ProShares UltraPro Short QQQ",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times the inverse (-3x) of the daily performance of the NASDAQ-100 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 1515028608
    },
    "SRS": {
        "short_name": "ProShares UltraShort Real Estat",
        "long_name": "ProShares UltraShort Real Estate",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. Real EstateSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the real estate sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 21347308
    },
    "SRTY": {
        "short_name": "ProShares UltraPro Short Russel",
        "long_name": "ProShares UltraPro Short Russell2000",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to three times the inverse (-3x) of the daily performance of the Russell 2000Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of small-cap U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 110506288
    },
    "SSG": {
        "short_name": "ProShares UltraShort Semiconduc",
        "long_name": "ProShares UltraShort Semiconductors",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. SemiconductorsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the semiconductor sub-sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3219442
    },
    "SZK": {
        "short_name": "ProShares UltraShort Consumer G",
        "long_name": "ProShares UltraShort Consumer Goods",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times the inverse (-2x) of the daily performance of the Dow Jones U.S. Consumer GoodsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the stock performance of certain U.S. companies in the consumer goods sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1029473
    },
    "TECS": {
        "short_name": "Direxion Technology Bear 3X Sha",
        "long_name": "Direxion Daily Technology Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the Technology Select Sector Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index is provided by S&P Dow Jones Indices (the \"index provider\") and includes domestic companies from the technology sector. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 74867928
    },
    "TWM": {
        "short_name": "ProShares UltraShort Russell200",
        "long_name": "ProShares UltraShort Russell2000",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times the inverse (-2x) of the daily performance of the Russell 2000Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of small-cap U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 72166264
    },
    "TZA": {
        "short_name": "Direxion Small Cap Bear 3X Shar",
        "long_name": "Direxion Daily Small Cap Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the Russell 2000Â® Index.\n The fund invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index measures the performance of approximately 2,000 small-capitalization companies in the Russell 3000Â® Index, based on a combination of their market capitalization and current index membership. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 390964800
    },
    "WEBS": {
        "short_name": "Direxion Daily Dow Jones Intern",
        "long_name": "Direxion Daily Dow Jones Internet Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the Dow Jones Internet Composite Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets. The index includes companies that generate at least 50% of their annual sales/revenue from the internet as determined by the index provider. It is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3869617
    },
    "YANG": {
        "short_name": "Direxion Daily FTSE China Bear ",
        "long_name": "Direxion Daily FTSE China Bear 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the inverse (or opposite) of the daily performance of the FTSE China 50 Index.\n The fund, under normal circumstances, invests in swap agreements, futures contracts, short positions or other financial instruments that, in combination, provide inverse (opposite) or short leveraged exposure to the index equal to at least 80% of the fund&#39;s net assets (plus borrowing for investment purposes). The index consists of the 50 largest and most liquid public Chinese companies currently trading on the Hong Kong Stock Exchange (\"SEHK\"). The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 34311948
    },
    "YXI": {
        "short_name": "ProShares Short FTSE China 50",
        "long_name": "ProShares Short FTSE China 50",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to the inverse (-1x) of the daily performance of the FTSE China 50 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index consists of 50 of the largest and most liquid Chinese stocks listed and traded on the Stock Exchange of Hong Kong. The fund is non-diversified.",
        "category": "Trading--Inverse Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3542694
    }
}