{
    "BIB": {
        "short_name": "ProShares Ultra Nasdaq Biotechn",
        "long_name": "ProShares Ultra Nasdaq Biotechnology",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the Nasdaq Biotechnology IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a modified capitalization weighted index that includes securities of Nasdaq listed companies that are classified as either biotechnology or pharmaceutical. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 216155152
    },
    "BNKU": {
        "short_name": "MicroSectors U.S. Big Banks Ind",
        "long_name": "MicroSectors U.S. Big Banks Index 3X Leveraged ETNs",
        "currency": "USD",
        "summary": "The investment seeks to reflect a 3x leveraged long exposure to the performance of the Solactive MicroSectorsTM U.S. Big Banks Index.\n The notes are senior unsecured medium-term notes issued by Bank of Montreal with a return linked to a three times leveraged participation in the performance of the index, compounded daily, less a Daily Investor Fee, the Daily Financing Charge and, if applicable, the Redemption Fee Amount. The index is an equal-dollar weighted index designed to represent the 10 U.S. stocks with the largest market capitalization in the banking sector.",
        "category": "Trading--Leveraged Equity",
        "family": "Microsectors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 86868064
    },
    "BRZU": {
        "short_name": "Direxion Daily Brazil Bull 2X S",
        "long_name": "Direxion Daily MSCI Brazil Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the MSCI Brazil 25/50 Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to measure the performance of the large- and mid-capitalization segments of the Brazilian equity market, covering approximately 85% of the free float-adjusted market capitalization of Brazilian issuers. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 189592928
    },
    "CHAU": {
        "short_name": "Direxion Daily CSI 300 China A ",
        "long_name": "Direxion Daily CSI 300 China A Share Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the CSI 300 Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a modified free-float market capitalization weighted index comprised of the largest and most liquid stocks in the Chinese A-share market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 162359712
    },
    "CLDL": {
        "short_name": "Direxion Daily Cloud Computing ",
        "long_name": "Direxion Daily Cloud Computing Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the the Indxx USA Cloud Computing Index.\n The fund, under normal circumstances, invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is provided by Indxx, LLC and includes domestic companies that deliver cloud computing infrastructure, platforms, or services. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24391488
    },
    "CURE": {
        "short_name": "Direxion Daily Healthcare Bull ",
        "long_name": "Direxion Daily Healthcare Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Health Care Select Sector Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index includes domestic companies from the healthcare sector, which includes: pharmaceuticals; health care equipment and supplies; health care providers and services; biotechnology; life sciences tools and services; and etc. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 127001056
    },
    "DDM": {
        "short_name": "ProShares Ultra Dow30",
        "long_name": "ProShares Ultra Dow30",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones Industrial AverageÂ® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a price-weighted index and includes 30 large-cap, \"blue-chip\" U.S. stocks, excluding utility and transportation companies. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 471324608
    },
    "DFEN": {
        "short_name": "Direxion Daily Aerospace & Defe",
        "long_name": "Direxion Daily Aerospace & Defense Bull 3X Shares Direxion Daily Aerospace",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Dow Jones U.S. Select Aerospace & Defense Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, and securities of the index, ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index attempts to measure the performance of the aerospace and defense industry of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 354400992
    },
    "DIG": {
        "short_name": "ProShares Ultra Oil & Gas",
        "long_name": "ProShares Ultra Oil & Gas",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the Dow Jones U.S. Oil & GasSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the oil and gas sector of the U.S. equity market. Component companies include, among others, exploration and production, integrated oil and gas, oil equipment and services, pipelines, renewable energy equipment companies and alternative fuel producers. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 168822816
    },
    "DPST": {
        "short_name": "Direxion Daily Regional Banks B",
        "long_name": "Direxion Daily Regional Banks Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P Regional Banks Select Industry Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a modified equal-weighted index that is designed to measure performance of the stocks comprising the S&P Total Market Index that are classified in the GICS regional banks sub-industry. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 363291776
    },
    "DRN": {
        "short_name": "Direxion Daily Real Estate Bull",
        "long_name": "Direxion Daily MSCI Real Estate Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results of 300% of the daily performance of the MSCI US IMI Real Estate 25/50 Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to measure the performance of the large-, mid- and small-capitalization segments of the U.S. equity universe that are classified in the real estate sector as per the GICS. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 80903712
    },
    "DUSL": {
        "short_name": "Direxion Daily Industrials Bull",
        "long_name": "Direxion Daily Industrials Bull 3X Shares Direxion Daily Industrials Bull 3",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Industrials Select Sector Index.\n The fund, under normal circumstances, invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index includes domestic companies from the industrials sector which includes the following industries: aerospace and defense; industrial conglomerates; marine and etc. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 41260476
    },
    "EDC": {
        "short_name": "Direxion Emerging Markets Bull ",
        "long_name": "Direxion Daily MSCI Emerging Markets Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the MSCI Emerging Markets IndexSM.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, exchange-traded funds (\"ETFs\") that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to represent the performance of large- and mid-capitalizations securities across 27 emerging market countries. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 233579312
    },
    "EET": {
        "short_name": "ProShares Ultra MSCI Emerging M",
        "long_name": "ProShares Ultra MSCI Emerging Markets",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the MSCI Emerging Markets IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 85% of the free float-adjusted market capitalization in emerging market countries. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 72934864
    },
    "EFO": {
        "short_name": "ProShares Ultra MSCI EAFE",
        "long_name": "ProShares Ultra MSCI EAFE",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the MSCI EAFE IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 85% of the free float-adjusted, market capitalization in each industry group in developed market countries, excluding the U.S. and Canada. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 14051111
    },
    "ERX": {
        "short_name": "Direxion Energy Bull 2X Shares",
        "long_name": "Direxion Daily Energy Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the Energy Select Sector Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is provided by S&P Dow Jones Indices and includes domestic companies from the energy sector which includes the following industries: oil, gas and consumable fuels; and energy equipment and services. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 626202240
    },
    "EURL": {
        "short_name": "Direxion Daily FTSE Europe Bull",
        "long_name": "Direxion Daily FTSE Europe Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the FTSE Developed Europe All Cap Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a market capitalization weighted index that is designed to measure the equity market performance of large-, mid- and small-cap companies in developed European markets. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 34752824
    },
    "EZJ": {
        "short_name": "ProShares Ultra MSCI Japan",
        "long_name": "ProShares Ultra MSCI Japan",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the MSCI Japan IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index adjusts the market capitalization of Index constituents for free float and targets for Index inclusion 85% of the free float-adjusted market capitalization in each industry group in Japan. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 5931969
    },
    "FAS": {
        "short_name": "Direxion Financial Bull 3X Shar",
        "long_name": "Direxion Daily Financial Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Russell 1000Â® Financial Services Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a subset of the Russell 1000Â® Index that measures the performance of the securities classified in the financial services sector of the large-capitalization U.S. equity market. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3107539968
    },
    "FNGO": {
        "short_name": "MicroSectors FANG  Index 2X Lev",
        "long_name": "MicroSectors FANG+ Index 2X Leveraged ETN",
        "currency": "USD",
        "summary": "The investment seeks to approximate the returns that might be available to investors through a leveraged â\u0080\u009clongâ\u0080\u009d investment in the NYSE FANG+â\u0084¢ Index (the index).\n The notes are senior unsecured medium-term notes issued by Bank of Montreal with a return linked to a 2X leveraged participation in the performance of the index, compounded daily, less a Daily Investor Fee, the Daily Financing Charge and, if applicable, the Redemption Fee Amount. The index is an equal-dollar weighted index designed to represent a segment of the technology and consumer discretionary sectors consisting of highly-traded growth stocks of technology and tech-enabled companies.",
        "category": "Trading--Leveraged Equity",
        "family": "BMO Capital Markets",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 211602752
    },
    "FNGU": {
        "short_name": "MicroSectors FANG  Index 3X Lev",
        "long_name": "MicroSectors FANG+ Index 3X Leveraged ETN",
        "currency": "USD",
        "summary": "The investment seeks return linked to a three times leveraged participation in the daily performance of the NYSE FANG+â\u0084¢ Index, total return (the â\u0080\u009cindexâ\u0080\u009d).\n The notes are intended to be daily trading tools for sophisticated investors to manage daily trading risks as part of an overall diversified portfolio. The index is an equal-dollar weighted index designed to represent a segment of the technology and consumer discretionary sectors consisting of highly-traded growth stocks of technology and tech-enabled companies.",
        "category": "Trading--Leveraged Equity",
        "family": "BMO Capital Markets Corp.",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1600799616
    },
    "GUSH": {
        "short_name": "Direxion Daily S&P Oil & Gas Ex",
        "long_name": "Direxion Daily S&P Oil & Gas Exp. & Prod. Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, of 200% of the daily performance of the S&P Oil & Gas Exploration & Production Select Industry Index.\n The fund, under normal circumstances, invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to measure the performance of a sub-industry or group of sub-industries determined based on the Global Industry Classification Standards. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 752131328
    },
    "HIBL": {
        "short_name": "Direxion Daily S&P 500 High Bet",
        "long_name": "Direxion Daily S&P 500 High Beta Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P 500Â® High Beta Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index provider selects 100 securities to include in the index from the S&P 500Â® Index that have the highest sensitivity to market movements, or \"beta\" over the past 12 months as determined by the index provider. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 86899184
    },
    "INDL": {
        "short_name": "Direxion Daily MSCI India Bull ",
        "long_name": "Direxion Daily MSCI India Bull 2x Shares",
        "currency": "USD",
        "summary": "The investment seeks daily leveraged investment results, before fees and expenses, of 200% of the daily performance of the MSCI India Index.\n The fund, under normal circumstances, invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to measure the performance of the large- and mid-capitalization segments of the Indian equity market, covering approximately 85% of the Indian equity universe. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 110051872
    },
    "IWDL": {
        "short_name": "ETRACS 2x Leveraged US Value Fa",
        "long_name": "ETRACS 2x Leveraged US Value Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide a 2 times leveraged return linked to the compounded quarterly performance of the Russell 1000 Value Index.\nThe index includes approximately 1,000 of the largest securities that form the Russell 3000Â® Index. The index measures the performance large-cap value segments of the U.S. equity market. The index includes those Russell 1000Â® companies with higher or lower forecasted growth values.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 25864000
    },
    "IWFL": {
        "short_name": "ETRACS 2x Leveraged US Growth F",
        "long_name": "ETRACS 2x Leveraged US Growth Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide a 2 times leveraged return linked to the compounded quarterly performance of the Russell 1000 Growth Index.\nThe index includes approximately 1,000 of the largest securities that form the Russell 3000Â® Index. The index measures the performance of the large-cap growth segments of the U.S. equity market. The index includes those Russell 1000Â® companies with higher or lower price-to-book ratios.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 22746100
    },
    "IWML": {
        "short_name": "ETRACS 2x Leveraged US Size Fac",
        "long_name": "ETRACS 2x Leveraged US Size Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide a 2 times leveraged return linked to the compounded quarterly performance of the Russell 2000 Index.\nThe index includes approximately 2,000 of the smallest securities that form the Russell 3000Â® Index. The index is intended to provide a comprehensive and unbiased small-cap barometer and is completely reconstituted annually to ensure larger stocks do not distort the performance and characteristics of the true small-cap opportunity set.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24971200
    },
    "JNUG": {
        "short_name": "Direxion Daily Junior Gold Mine",
        "long_name": "Direxion Daily Junior Gold Miners Index Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the MVIS Global Junior Gold Miners Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index includes companies from markets that are freely investable to foreign investors, including \"emerging markets,\" as that term is defined by the index provider. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 627537216
    },
    "KORU": {
        "short_name": "Direxion Daily South Korea Bull",
        "long_name": "Direxion Daily South Korea Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the MSCI Korea 25/50 Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to measure the performance of the large- and mid-cap segments of the South Korean equity market, covering approximately 85% of the free float-adjusted market capitalization of South Korean issuers. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 62710008
    },
    "LABU": {
        "short_name": "Direxion Daily S&P Biotech Bull",
        "long_name": "Direxion Daily S&P Biotech Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P Biotechnology Select Industry Index (\"index\").\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments and securities of the index, exchange-traded funds (\"ETFs\") that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index is designed to measure the performance of the biotechnology sub-industry based on the Global Industry Classification Standards (\"GICS\"). The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 716608576
    },
    "LBJ": {
        "short_name": "Direxion Daily Latin America Bu",
        "long_name": "Direxion Daily Latin America Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily leveraged investment results, before fees and expenses, of 200% of the daily performance of the S&P Latin America 40 Index.\n The fund, under normal circumstances, invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a float-adjusted market capitalization weighted equity index of issuers drawn from five major Latin American markets: Brazil, Chile, Columbia, Mexico, and PerÃº. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 21811464
    },
    "LTL": {
        "short_name": "ProShares Ultra Telecommunicati",
        "long_name": "ProShares Ultra Telecommunications",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. Select TelecommunicationsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of U.S. stock market performance of fixed line (regional and long-distance carriers) and mobile telephone services (cellular, satellite and paging services). The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2357694
    },
    "MEXX": {
        "short_name": "Direxion Daily MSCI Mexico Bull",
        "long_name": "Direxion Daily MSCI Mexico Bull 3X Shares Direxion Daily MSCI Mexico Bull 3",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the MSCI Mexico IMI 25/50 Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to measure the performance of the large-, mid- and small-capitalization segments of the Mexican equity market, covering approximately 99% of the free float-adjusted market capitalization in Mexico. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 17243088
    },
    "MIDU": {
        "short_name": "Direxion Mid Cap Bull 3X Shares",
        "long_name": "Direxion Daily Mid Cap Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P MidCapÂ® 400 Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, exchange-traded funds (\"ETFs\") that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index measures the performance of 400 mid-sized companies in the United States. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 80251840
    },
    "MJO": {
        "short_name": "MicroSectors Cannabis 2X Levera",
        "long_name": "MicroSectors Cannabis 2X Leveraged ETNs",
        "currency": "USD",
        "summary": "The investment seeks a two times leveraged participation in the daily performance of the Indxx MicroSectorsTM North American Cannabis Index.\nThe index is designed to track the performance of companies that are publicly traded in the U.S. and/or Canada, and that provide products or services related to the medical or industrial use of cannabis or products derived from cannabis. The notes are unsecured and unsubordinated obligations of Bank of Montreal. Each note will have an initial principal amount of $50. The notes do not bear interest.",
        "category": "Trading--Leveraged Equity",
        "family": "Microsectors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 20562972
    },
    "MTUL": {
        "short_name": "ETRACS 2x Leveraged MSCI US Mom",
        "long_name": "ETRACS 2x Leveraged MSCI US Momentum Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide a 2 times leveraged return linked to the compounded quarterly performance of the MSCI USA Momentum Index.\nThe index is designed to reflect the performance of an equity momentum strategy by emphasizing stocks with high price momentum, while maintaining reasonably high trading liquidity, investment capacity and moderate index turnover. The parent index is designed to measure the performance of the large and mid-cap segments of the U.S. equity market.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 22151300
    },
    "MVV": {
        "short_name": "ProShares Ultra MidCap400",
        "long_name": "ProShares Ultra MidCap400",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the S&P MidCap 400Â®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a float-adjusted, market capitalization-weighted index of 400 U.S. operating companies and real estate investment trusts selected through a process that factors in criteria such as liquidity, price, market capitalization and financial viability. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 189080352
    },
    "NAIL": {
        "short_name": "Direxion Daily Homebuilders & S",
        "long_name": "Direxion Daily Homebuilders & Supplies Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results of 300% of the daily performance of the Dow Jones U.S. Select Home Construction Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index measures U.S. companies in the home construction sector that provide a wide range of products and services related to homebuilding, including home construction and producers, sellers and suppliers of building materials, furnishings and fixtures and etc. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 472544736
    },
    "NUGT": {
        "short_name": "Direxion Daily Gold Miners Inde",
        "long_name": "Direxion Daily Gold Miners Index Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the NYSE Arca Gold Miners Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a comprised of publicly traded companies that operate globally in both developed and emerging markets, and are involved primarily in mining for gold and, in mining for silver. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 924551296
    },
    "PILL": {
        "short_name": "Direxion Daily Pharmaceutical &",
        "long_name": "Direxion Daily Pharmaceutical & Medical Bull 3X Shares ETF",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P Pharmaceuticals Select Industry Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a modified equal-weighted index that is designed to measure performance of the stocks comprising the S&P Total Market Index that are classified in the GICS pharmaceuticals sub-industry. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 14687323
    },
    "QLD": {
        "short_name": "ProShares Ultra QQQ",
        "long_name": "ProShares Ultra QQQ",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the NASDAQ-100 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3962962944
    },
    "QULL": {
        "short_name": "ETRACS 2x Leveraged MSCI US Qua",
        "long_name": "ETRACS 2x Leveraged MSCI US Quality Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide 2 times leveraged long exposure to the compounded quarterly performance of the MSCI USA Sector Neutral Quality GR USD.\nThe index aims to capture the performance of large- and mid-cap U.S. equities among the existing constituent securities of the parent index that exhibit stronger quality characteristics relative to their peers within the same Global Industry Classification Standard (GICSÂ®) sector based on three winsorized fundamental variables: high return-on-equity, low leverage and low earnings variability.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 24662100
    },
    "RETL": {
        "short_name": "Direxion Daily Retail Bull 3X S",
        "long_name": "Direxion Daily Retail Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P Retail Select Industry Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a modified equal-weighted index that is designed to measure performance of the stocks comprising the S&P Total Market Index that are classified in the GICS retail sub-industry. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 74815440
    },
    "ROM": {
        "short_name": "ProShares Ultra Technology",
        "long_name": "ProShares Ultra Technology",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the Dow Jones U.S. TechnologySM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the technology industry of the U.S. equity market. Component companies include, among others, those involved in computers and office equipment, software, communications technology, semiconductors, diversified technology services and Internet services. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 711568128
    },
    "RUSL": {
        "short_name": "Direxion Daily Russia Bull 2X S",
        "long_name": "Direxion Daily Russia Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results of 200% of the daily performance of the MVIS Russia Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is intended to represent the overall performance of publically traded companies that are domiciled and primarily listed on an exchange in Russia or that are not Russian companies, but nonetheless generate at least 50% of revenues in Russia and may include DRs. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 60566560
    },
    "RXL": {
        "short_name": "ProShares Ultra Health Care",
        "long_name": "ProShares Ultra Health Care",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. Health CareSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the healthcare industry of the U.S. equity market. Component companies include, among others, health care providers, biotechnology companies, medical supplies, advanced medical devices and pharmaceuticals. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 119255816
    },
    "SAA": {
        "short_name": "ProShares Ultra SmallCap600",
        "long_name": "ProShares Ultra SmallCap600",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the S&P SmallCap 600Â®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. It is a float-adjusted, market capitalization-weighted index of 600 U.S. operating companies selected through a process that factors in criteria such as liquidity, price, market capitalization, financial viability and public float. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 46004496
    },
    "SCDL": {
        "short_name": "ETRACS 2x Leveraged US Dividend",
        "long_name": "ETRACS 2x Leveraged US Dividend Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide 2 times leveraged long exposure to the compounded quarterly performance of the Dow Jones US Dividend 100 TR USD.\nThe fund is linked to the performance of the Dow Jones U.S. Dividend 100 Total Return Index, which is sponsored by S&P Dow Jones Indices. The index is designed to measure the performance of 100 high dividend-paying U.S. companies, excluding REITS, with a record of consistently paying dividends. The Securities seek to approximate the quarterly returns that might be available to investors through a leveraged â\u0080\u009clongâ\u0080\u009d investment in the Index Constituent Securities.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 26251200
    },
    "SOXL": {
        "short_name": "Direxion Daily Semiconductor Bu",
        "long_name": "Direxion Daily Semiconductor Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the PHLX Semiconductor Sector Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index measures the performance of domestic companies engaged in the design, distribution, manufacture and sale of semiconductors. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3563695104
    },
    "SPUU": {
        "short_name": "Direxion Daily S&P 500 Bull 2X ",
        "long_name": "Direxion Daily S&P 500 Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 200% of the daily performance of the S&P 500Â® Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and exchange-traded funds (\"ETFs\") that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is a float-adjusted, market capitalization-weighted index. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 25604860
    },
    "SPXL": {
        "short_name": "Direxion Daily S&P 500 Bull 3X ",
        "long_name": "Direxion Daily S&P500 Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the S&P 500Â® Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and exchange-traded funds (\"ETFs\") that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index is a float-adjusted, market capitalization-weighted index. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1621961856
    },
    "SSO": {
        "short_name": "ProShares Ultra S&P500",
        "long_name": "ProShares Ultra S&P500",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the S&P 500Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of large-cap U.S. stock market performance. It is a float-adjusted, market capitalization-weighted index of 500 U.S. operating companies and real estate investment trusts selected through a process that factors in criteria such as liquidity, price, market capitalization and financial viability. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 3010747648
    },
    "TECL": {
        "short_name": "Direxion Technology Bull 3X Sha",
        "long_name": "Direxion Daily Technology Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Technology Select Sector Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, and securities of the index, ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index includes domestic companies from the technology sector. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1768905216
    },
    "TNA": {
        "short_name": "Direxion Small Cap Bull 3X Shar",
        "long_name": "Direxion Daily Small Cap Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Russell 2000Â® Index.\n The fund invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index measures the performance of approximately 2,000 small-capitalization companies in the Russell 3000Â® Index, based on a combination of their market capitalization and current index membership. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1779822336
    },
    "TPOR": {
        "short_name": "Direxion Daily Transportation B",
        "long_name": "Direxion Daily Transportation Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Dow Jones Transportation AverageTM.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and exchange-traded funds (\"ETFs\") that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index measures the performance of large, well-known companies within the transportation industry. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 51509960
    },
    "TQQQ": {
        "short_name": "ProShares UltraPro QQQ",
        "long_name": "ProShares UltraPro QQQ",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times (3x) the daily performance of the NASDAQ-100 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index includes 100 of the largest domestic and international non-financial companies listed on The Nasdaq Stock Market based on market capitalization. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "NMS",
        "market": "us_market",
        "total_assets": 11266327552
    },
    "UBOT": {
        "short_name": "Direxion Daily Robotics, Artifi",
        "long_name": "Direxion Daily Robotics, Artificial Intelligence & Automation Index Bull 2X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily leveraged investment results of 200% of the daily performance of the Indxx Global Robotics and Artificial Intelligence Thematic Index.\n The fund normally invests at least 80% of its net assets in financial instruments, such as swap agreements, ETFs that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index is designed to provide exposure to exchange-listed companies in developed markets that are expected to benefit from the adoption and utilization of robotics and/or artificial intelligence. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 52689488
    },
    "UBR": {
        "short_name": "ProShares Ultra MSCI Brazil Cap",
        "long_name": "ProShares Ultra MSCI Brazil Capped",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the MSCI Brazil 25/50 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is designed to measure the performance of the large and mid cap segments of the Brazilian market. It covers approximately 85% of the free float-adjusted market capitalization in Brazil. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 6746547
    },
    "UCC": {
        "short_name": "ProShares Ultra Consumer Servic",
        "long_name": "ProShares Ultra Consumer Services",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. Consumer ServicesSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the stock performance of certain U.S. companies in the consumer services sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 27742336
    },
    "UCYB": {
        "short_name": "ProShares Ultra Nasdaq Cybersec",
        "long_name": "ProShares Ultra Nasdaq Cybersecurity",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Nasdaq CTA Cybersecurity IndexSM.\n The index is a modified liquidity weighted index comprised of companies classified as \"cybersecurity\" companies by CTA. The Advisor expects that its cash balances maintained in connection with the use of financial instruments will typically be held in money market instruments. It invests in common stock issued by public companies. The fund invests in derivatives, which are financial instruments whose value is derived from the value of an underlying asset or assets. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "NGM",
        "market": "us_market",
        "total_assets": 2580559
    },
    "UDOW": {
        "short_name": "ProShares UltraPro Dow30",
        "long_name": "ProShares UltraPro Dow30",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times (3x) the daily performance of the Dow Jones Industrial AverageÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a price-weighted index and includes 30 large-cap, \"blue-chip\" U.S. stocks, excluding utility and transportation companies. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 878027840
    },
    "UGE": {
        "short_name": "ProShares Ultra Consumer Goods",
        "long_name": "ProShares Ultra Consumer Goods",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. Consumer GoodsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the stock performance of certain U.S. companies in the consumer goods industry of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 12834069
    },
    "UMDD": {
        "short_name": "UltraPro MidCap400",
        "long_name": "ProShares UltraPro MidCap400",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times (3x) the daily performance of the S&P MidCap 400Â®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of mid-size company U.S. stock market performance. It is a float-adjusted, market capitalization-weighted index of 400 U.S. operating companies and real estate investment trusts selected through a process. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 64463816
    },
    "UPRO": {
        "short_name": "ProShares UltraPro S&P 500",
        "long_name": "ProShares UltraPro S&P500",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to three times (3x) the daily performance of the S&P 500Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of large-cap U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 2007678080
    },
    "UPV": {
        "short_name": "ProShares Ultra FTSE Europe",
        "long_name": "ProShares Ultra FTSE Europe",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the FTSE Developed Europe All Cap IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a free float-adjusted market cap weighted index representing the performance of large, mid and small cap companies in Developed European markets, including the UK. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 4399248
    },
    "UPW": {
        "short_name": "ProShares Ultra Utilities",
        "long_name": "ProShares Ultra Utilities",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. UtilitiesSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the utilities sector of the U.S. equity market. Component companies include, among others, electric utilities, gas utilities, multi-utilities and water utilities. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 13413841
    },
    "URE": {
        "short_name": "ProShares Ultra Real Estate",
        "long_name": "ProShares Ultra Real Estate",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. Real EstateSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the real estate sector of the U.S. equity market. Component companies include, among others, real estate holding and development and real estate services companies and real estate investment trusts (\"REITs\"). The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 97090408
    },
    "URTY": {
        "short_name": "ProShares UltraPro Russell2000",
        "long_name": "ProShares UltraPro Russell2000",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to three times (3x) the daily performance of the Russell 2000Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a measure of small-cap U.S. stock market performance. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 444823904
    },
    "USD": {
        "short_name": "ProShares Ultra Semiconductors",
        "long_name": "ProShares Ultra Semiconductors",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the Dow Jones U.S. SemiconductorsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index measures the performance of certain companies in the semiconductor sub-sector of the U.S. equity market. Component companies are engaged in the production and distribution of semiconductors and other integrated chips, as well as other related products such as semiconductor capital equipment and mother-boards. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 226525040
    },
    "USML": {
        "short_name": "ETRACS 2x Leveraged MSCI US Min",
        "long_name": "ETRACS 2x Leveraged MSCI US Minimum Volatility Factor TR ETN",
        "currency": "USD",
        "summary": "The investment seeks to provide 2 times leveraged long exposure to the compounded quarterly performance of the MSCI USA Minimum Volatility GR USD.\nThe index is designed to optimize the parent index for the lowest absolute volatility with a certain set of constraints. The parent index is designed to measure the performance of the large and mid-cap segments of the U.S. equity market. The index is designed to provide the lowest return variance for a given covariance matrix of stock returns.",
        "category": "Trading--Leveraged Equity",
        "family": "UBS",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23802900
    },
    "UTSL": {
        "short_name": "Direxion Daily Utilities Bull 3",
        "long_name": "Direxion Daily Utilities Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Utilities Select Sector Index.\n The fund invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index includes domestic companies from the utilities sector which includes the following industries: electric utilities; multi-utilities; water utilities and etc. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 18275846
    },
    "UWM": {
        "short_name": "ProShares Ultra Russell2000",
        "long_name": "ProShares Ultra Russell2000",
        "currency": "USD",
        "summary": "The investment seeks daily investment results that correspond to two times (2x) the daily performance of the Russell 2000Â® Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index is a float-adjusted, market capitalization-weighted index containing approximately 2000 of the smallest companies in the Russell 3000Â® Index or approximately 10% of the total market capitalization of the Russell 3000Â® Index, which in turn represents approximately 98% of the investable U.S. equity market. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 746080128
    },
    "UXI": {
        "short_name": "ProShares Ultra Industrials",
        "long_name": "ProShares Ultra Industrials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. IndustrialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the industrial sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 38547132
    },
    "UYG": {
        "short_name": "ProShares Ultra Financials",
        "long_name": "ProShares Ultra Financials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. FinancialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the financial services sector of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 874340224
    },
    "UYM": {
        "short_name": "ProShares Ultra Basic Materials",
        "long_name": "ProShares Ultra Basic Materials",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Dow Jones U.S. Basic MaterialsSM Index.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index seeks to measure the performance of certain companies in the basic materials industry of the U.S. equity market. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 55023480
    },
    "WANT": {
        "short_name": "Direxion Daily Consumer Discret",
        "long_name": "Direxion Daily Cnsmr Discret Bull 3XShrs",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Consumer Discretionary Select Sector Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, and securities of the index, ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or ETFs that track the index. The index is provided by S&P Dow Jones Indices (the \"index provider\") and includes domestic companies from the consumer discretionary sector. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 25121928
    },
    "WEBL": {
        "short_name": "Direxion Daily Dow Jones Intern",
        "long_name": "Direxion Daily Dow Jones Internet Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the Dow Jones Internet Composite Index.\n The fund, under normal circumstances, invests at least 80% of its net assets in financial instruments, such as swap agreements, securities of the index, and ETFs that track the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index includes companies that generate at least 50% of their annual sales/revenue from the internet as determined by the index provider. It is non-diversified. It is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 51711376
    },
    "XPP": {
        "short_name": "ProShares Ultra FTSE China 50",
        "long_name": "ProShares Ultra FTSE China 50",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the FTSE China 50 IndexÂ®.\n The fund invests in financial instruments that ProShare Advisors believes, in combination, should produce daily returns consistent with the fund&#39;s investment objective. The index consists of 50 of the largest and most liquid Chinese stocks listed and traded on the Stock Exchange of Hong Kong. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 35944344
    },
    "YINN": {
        "short_name": "Direxion Daily FTSE China Bull ",
        "long_name": "Direxion Daily FTSE China Bull 3X Shares",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, of 300% of the daily performance of the FTSE China 50 Index.\n The fund, under normal circumstances, invests at least 80% of its net assets (plus borrowing for investment purposes) in financial instruments, such as swap agreements, exchange-traded funds (\"ETFs\") that track the index, securities of the index and other financial instruments that provide daily leveraged exposure to the index or to ETFs that track the index. The index consists of the 50 largest and most liquid public Chinese companies currently trading on the Stock Exchange of Hong Kong. The fund is non-diversified.",
        "category": "Trading--Leveraged Equity",
        "family": "Direxion Funds",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 366037280
    }
}