{
    "AGQ": {
        "short_name": "ProShares Ultra Silver",
        "long_name": "ProShares Ultra Silver",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Bloomberg Silver SubindexSM.\n The fund seeks to meet its investment objective by investing, under normal market conditions, in any one of, or combinations of, Financial Instruments (including swap agreements, futures contracts, forward contracts and option contracts) based on the benchmark. The types and mix of Financial Instruments in which the fund invests may vary daily at the discretion of the Sponsor. It will not invest directly in any commodity.",
        "category": "Trading--Leveraged Commodities",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 645783616
    },
    "BOIL": {
        "short_name": "ProShares Ultra Bloomberg Natur",
        "long_name": "ProShares Ultra Bloomberg Natural Gas",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Bloomberg Natural Gas SubindexSM.\n The fund seeks to meet their investment objectives by investing normally in Natural Gas futures contracts. It may also invest in swaps if the market for a specific futures contract experiences emergencies (e.g., natural disaster, terrorist attack, or an act of God) or disruptions (e.g., a trading halt or a flash crash) or in situations where the Sponsor deems it impractical or inadvisable to buy or sell futures contracts (such as during periods of market volatility or illiquidity).",
        "category": "Trading--Leveraged Commodities",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 92011136
    },
    "DGP": {
        "short_name": "DB Gold Double Long ETN due Feb",
        "long_name": "DB Gold Double Long ETN",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, twice the daily performance of the Deutsche Bank Liquid Commodity index - Optimum Yield Gold Excess Return.\n The index is intended to reflect changes in the market value of certain gold futures contracts and is comprised of a single unfunded gold futures contract.",
        "category": "Trading--Leveraged Commodities",
        "family": "Deutsche Bank AG",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 98438136
    },
    "GDXU": {
        "short_name": "MicroSectors Gold Miners 3X Lev",
        "long_name": "MicroSectors Gold Miners 3X Leveraged ETNs",
        "currency": "USD",
        "summary": "The investment seeks the return on the notes is linked to a three times leveraged participation in the daily performance of the S-Network MicroSectorsTM Gold Miners Index.\nThe index is a total return index that tracks the performance of two exchange traded funds, the VanEck VectorsÂ® Gold Miners ETF (the â\u0080\u009cGDXâ\u0080\u009d) and the VanEck VectorsÂ® Junior Gold Miners ETF (the â\u0080\u009cGDXJâ\u0080\u009d).",
        "category": "Trading--Leveraged Commodities",
        "family": "Microsectors",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 23013992
    },
    "UCO": {
        "short_name": "ProShares Ultra Bloomberg Crude",
        "long_name": "ProShares Ultra Bloomberg Crude Oil",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Bloomberg WTI Crude Oil SubindexSM.\n The fund seeks to meet its investment objective by investing, under normal market conditions, in any one of, or combinations of, Financial Instruments (including swap agreements, futures contracts, forward contracts, and option contracts) based on WTI sweet, light crude oil. It will not invest directly in oil.",
        "category": "Trading--Leveraged Commodities",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 1127778048
    },
    "UGAZF": {
        "short_name": "VelocityShares 3X Long Natural ",
        "long_name": "VelocityShares 3x Long Natural Gas ETN Linked to the S&P GSCI Natural Gas Index ER",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, three times the performance of the S&P GSCI Natural Gas Index ER.\n The index comprises futures contracts on a single commodity and is calculated according to the methodology of the S&P GSCI Index.",
        "category": "Trading--Leveraged Commodities",
        "family": "Credit Suisse AG",
        "exchange": "PNK",
        "market": "us_market",
        "total_assets": 43850880
    },
    "UGL": {
        "short_name": "ProShares Ultra Gold",
        "long_name": "ProShares Ultra Gold",
        "currency": "USD",
        "summary": "The investment seeks daily investment results, before fees and expenses, that correspond to two times (2x) the daily performance of the Bloomberg Gold SubindexSM.\n The fund seeks to meet its investment objective by investing, under normal market conditions, in any one of, or combinations of, Financial Instruments (including swap agreements, futures contracts and forward contracts) based on the benchmark. The types and mix of Financial Instruments in which the fund invest may vary daily at the discretion of the Sponsor. It will not invest directly in any commodity.",
        "category": "Trading--Leveraged Commodities",
        "family": "ProShares",
        "exchange": "PCX",
        "market": "us_market",
        "total_assets": 213684736
    },
    "UGLDF": {
        "short_name": "CREDIT SUISSE NASSAU TRACKER ZE",
        "long_name": "VelocityShares 3x Long Gold ETN Linked to the S&P GSCI Gold Index ER",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, three times the S&P GSCI Gold index ER.\n The index comprises futures contracts on a single commodity. The fluctuations in the values of it are intended generally to correlate with changes in the price of gold in global markets.",
        "category": "Trading--Leveraged Commodities",
        "family": "Credit Suisse AG",
        "exchange": "PNK",
        "market": "us_market",
        "total_assets": 84603608
    },
    "USLVF": {
        "short_name": "CREDIT SUISSE NASSAU TRACKER ZE",
        "long_name": "VelocityShares 3x Long Silver ETN Linked to the S&P GSCI Silver Index ER",
        "currency": "USD",
        "summary": "The investment seeks to replicate, net of expenses, three times the S&P GSCI Silver index ER.\n The index comprises futures contracts on a single commodity. The fluctuations in the values of it are intended generally to correlate with changes in the price of silver in global markets.",
        "category": "Trading--Leveraged Commodities",
        "family": "Credit Suisse AG",
        "exchange": "PNK",
        "market": "us_market",
        "total_assets": 190302432
    }
}