{
    "ARCM": {
        "short_name": "Arrow Reserve Capital Managemen",
        "long_name": "Arrow Reserve Capital Management ETF",
        "currency": "USD",
        "summary": "The investment seeks to preserve capital while maximizing current income.\n The fund invests in a variety of domestic fixed income securities. It will invest in fixed income instruments with a dollar-weighted average effective maturity of 0 to 2 years issued by U.S. Dollar-denominated issuers, including mortgage- or asset-backed securities, rated Baa- or higher by Moody&#39;s, or equivalently rated by S&P or Fitch, or, if unrated, determined by the Sub-Advisor. It may also invest in interest rate futures and forwards. The Sub-Advisor attempts to maximize income by identifying securities that offer an acceptable yield for a given level of credit risk and maturity.",
        "category": "Ultrashort Bond",
        "family": "ArrowShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "AWTM": {
        "short_name": "Aware Ultra-Short Duration Enha",
        "long_name": "Aware Ultra-Short Duration Enhanced Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to maximize current income while maintaining a portfolio consistent with the preservation of capital and daily liquidity designed to meet the requirements of the relevant standard-setting and regulatory support organization applicable to U.S. insurance companies.\n The fund is an actively-managed ETF that seeks to achieve its investment objective, under normal circumstances, by investing at least 80% of its net assets in U.S.-dollar denominated investment-grade fixed- and floating-rate bonds, and debt securities with an overall effective duration of less than one year.",
        "category": "Ultrashort Bond",
        "family": "Aware",
        "exchange": "PCX",
        "market": "us_market"
    },
    "CLTL": {
        "short_name": "Invesco Treasury Collateral ETF",
        "long_name": "Invesco Treasury Collateral ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results (before fees and expenses) of the ICE U.S. Treasury Short Bond Index.\n The fund generally will invest at least 80% of its total assets in the components of the index. The index is designed to measure the performance of U.S. Treasury Obligations with a maximum remaining maturity of 12 months. \"U.S. Treasury Obligations\" refer to securities issued or guaranteed by the U.S. Treasury where the payment of principal and interest is backed by the full faith and credit of the U.S. government. They include U.S. Treasury notes, bills and bonds.",
        "category": "Ultrashort Bond",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FLDR": {
        "short_name": "Fidelity Low Duration Bond Fact",
        "long_name": "Fidelity Low Duration Bond Factor ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment returns that correspond, before fees and expenses, generally to the performance of the Fidelity Low Duration Investment Grade Factor Indexâ\u0084 .\n The fund normally invests at least 80% of assets in securities included in the index. The index is designed to optimize the balance of interest rate risk and credit risk such that both returns and risk measures may be improved relative to traditional U.S. investment grade floating rate note indices. The index is comprised solely of U.S. investment grade floating rate notes and U.S. Treasury notes.",
        "category": "Ultrashort Bond",
        "family": "Fidelity Investments",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FLOT": {
        "short_name": "iShares Floating Rate Bond ETF",
        "long_name": "iShares Floating Rate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays US Floating Rate Note < 5 Years Index (the \"underlying index\"), which measures the performance of U.S. dollar-denominated, investment-grade floating rate notes.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents, as well as in securities not included in the underlying index, but which BFA believes will help the fund track the underlying index.",
        "category": "Ultrashort Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FLRN": {
        "short_name": "SPDR Bloomberg Barclays Investm",
        "long_name": "SPDR Bloomberg Barclays Investment Grade Floating Rate ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays U.S. Dollar Floating Rate Note < 5 Years Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of U.S. dollar-denominated, investment grade floating rate notes.",
        "category": "Ultrashort Bond",
        "family": "SPDR State Street Global Advisors",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FLTR": {
        "short_name": "VanEck Vectors Investment Grade",
        "long_name": "VanEck Vectors Investment Grade Floating Rate ETF",
        "currency": "USD",
        "summary": "The investment seeks to replicate as closely as possible, before fees and expenses, the price and yield performance of the MVISÂ® US Investment Grade Floating Rate Index (the \"Floating Rate Index\").\n The fund normally invests at least 80% of its total assets in securities that comprise the fund&#39;s benchmark index. The index is comprised of U.S. dollar-denominated floating rate notes issued by corporate entities or similar commercial entities that are public reporting companies in the United States and rated investment grade. The fund is non-diversified.",
        "category": "Ultrashort Bond",
        "family": "VanEck",
        "exchange": "PCX",
        "market": "us_market"
    },
    "FTSM": {
        "short_name": "First Trust Enhanced Short Matu",
        "long_name": "First Trust Enhanced Short Maturity ETF",
        "currency": "USD",
        "summary": "The investment seeks current income, consistent with preservation of capital and daily liquidity.\n Under normal market conditions, the Advisor intends to achieve its investment objective by investing at least 80% of its net assets in a portfolio of U.S. dollar-denominated fixed- and variable-rate debt securities. Normally the fund&#39;s portfolio is expected to have an average duration of less than one year and an average maturity of less than three years.",
        "category": "Ultrashort Bond",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "GBIL": {
        "short_name": "Goldman Sachs Access Treasury 0",
        "long_name": "Goldman Sachs Access Treasury 0-1 Year ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide investment results that closely correspond, before fees and expenses, to the performance of the FTSE US Treasury 0-1 Year Composite Select Index.\n The fund seeks to achieve its investment objective by investing at least 80% of its assets (exclusive of collateral held from securities lending) in securities included in its underlying index. The index is designed to measure the performance of U.S. Treasury Securities with a maximum remaining maturity of 12 months. The investment adviser uses a representative sampling strategy to manage the fund.",
        "category": "Ultrashort Bond",
        "family": "Goldman Sachs",
        "exchange": "PCX",
        "market": "us_market"
    },
    "GSY": {
        "short_name": "Invesco Ultra Short Duration ET",
        "long_name": "Invesco Ultra Short Duration ETF",
        "currency": "USD",
        "summary": "The investment seeks maximum current income, consistent with preservation of capital and daily liquidity.\n The fund will invest at least 80% of its net assets in fixed income securities and in ETFs and closed-end funds that invest substantially all of their assets in fixed income securities. It uses a low duration strategy to seek to outperform the ICE BofA US Treasury Bill Index in addition to providing returns in excess of those available in U.S. Treasury bills, government repurchase agreements, and money market funds, while seeking to provide preservation of capital and daily liquidity.",
        "category": "Ultrashort Bond",
        "family": "Invesco",
        "exchange": "PCX",
        "market": "us_market"
    },
    "HOLD": {
        "short_name": "AdvisorShares Sage Core Reserve",
        "long_name": "AdvisorShares Sage Core Reserves ETF",
        "currency": "USD",
        "summary": "The investment seeks to preserve capital while maximizing income.\n Sage Advisory Services, Ltd. Co. (the \"Sub-Advisor\") seeks to achieve the fund&#39;s investment objective by investing in a variety of fixed income securities, including bonds, forwards and instruments issued by U.S. and foreign issuers. It will invest in U.S. dollar-denominated investment grade debt securities, including mortgage- or asset-backed securities, rated Baa- or higher by Moody&#39;s Investors Service, Inc. (\"Moody&#39;s\"), or equivalently rated by Standard & Poor&#39;s Ratings Services (\"S&P\") or Fitch, Inc. (\"Fitch\"), or, if unrated, determined by the Sub-Advisor to be of comparable quality.",
        "category": "Ultrashort Bond",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ICSH": {
        "short_name": "BlackRock Ultra Short-Term Bond",
        "long_name": "iShares Ultra Short-Term Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income consistent with preservation of capital.\n The fund seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in a portfolio of U.S. dollar-denominated investment-grade fixed- and floating-rate debt securities that are rated BBB- or higher by S&P Global Ratings and/or Fitch Ratings, Inc. (\"Fitch\"), or Baa3 or higher by Moody&#39;s Investors Service, Inc. (\"Moody&#39;s\"), or, if unrated, determined by BFA to be of equivalent quality.",
        "category": "Ultrashort Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "JPST": {
        "short_name": "JPMorgan Ultra-Short Income ETF",
        "long_name": "JPMorgan Ultra-Short Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income while seeking to maintain a low volatility of principal.\n Under normal circumstances, the fund seeks to achieve its investment objective by investing at least 80% of its Assets in investment grade, U.S. dollar denominated short-term fixed, variable and floating rate debt. \"Assets\" means net assets, plus the amount of borrowings for investment purposes. As part of its principal investment strategy, it may invest in corporate securities, asset-backed securities, mortgage-backed and mortgage-related securities, and high quality money market instruments such as commercial paper and certificates of deposit.",
        "category": "Ultrashort Bond",
        "family": "JPMorgan",
        "exchange": "BTS",
        "market": "us_market"
    },
    "MINT": {
        "short_name": "PIMCO Enhanced Short Maturity A",
        "long_name": "PIMCO Enhanced Short Maturity Active Exchange-Traded Fund",
        "currency": "USD",
        "summary": "The investment seeks maximum current income, consistent with preservation of capital and daily liquidity.\n The fund invests at least 80% of its net assets in a diversified portfolio of Fixed Income Instruments of varying maturities, which may be represented by forwards. \"Fixed Income Instruments\" include bonds, debt securities and other similar instruments issued by various U.S. and non-U.S. public- or private-sector entities. The average portfolio duration of this fund will vary based on PIMCO&#39;s market forecasts and will normally not exceed one year.",
        "category": "Ultrashort Bond",
        "family": "PIMCO",
        "exchange": "PCX",
        "market": "us_market"
    },
    "NEAR": {
        "short_name": "BlackRock Short Maturity Bond E",
        "long_name": "iShares Short Maturity Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to maximize current income.\n The fund seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets in a portfolio of U.S. dollar-denominated investment-grade fixed-income securities. Under normal circumstances, the effective duration of its portfolio is expected to be one year or less, as calculated by the management team. It is an actively managed exchange-traded fund (\"ETF\") that does not seek to replicate the performance of a specified index.",
        "category": "Ultrashort Bond",
        "family": "iShares",
        "exchange": "BTS",
        "market": "us_market"
    },
    "OPER": {
        "short_name": "ETF Series Solutions ETF ClearS",
        "long_name": "ClearShares Ultra-Short Maturity ETF",
        "currency": "USD",
        "summary": "The investment seeks current income.\n The fund is an actively-managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective primarily by investing in repurchase agreements collateralized by U.S. government securities and, to a lesser extent, directly in individual fixed income instruments. It is not a money market fund and does not seek to maintain a stable net asset value (\"NAV\") of $1.00 per share.",
        "category": "Ultrashort Bond",
        "family": "ClearShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "PULS": {
        "short_name": "PGIM Ultra Short Bond ETF",
        "long_name": "PGIM Ultra Short Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks total return through a combination of current income and capital appreciation, consistent with preservation of capital.\n The fund invests primarily in a portfolio of investment grade, U.S. dollar denominated short-term fixed, variable and floating rate debt instruments. Under normal market conditions, it invests at least 80% of its investable assets in bonds with varying maturities. Although the fund may invest in instruments of any duration or maturity, it normally will seek to maintain a weighted average portfolio duration of one year or less and a weighted average maturity of three years or less.",
        "category": "Ultrashort Bond",
        "family": "PGIM Funds (Prudential)",
        "exchange": "PCX",
        "market": "us_market"
    },
    "RAVI": {
        "short_name": "FlexShares Ready Access Variabl",
        "long_name": "FlexShares Ready Access Variable Income Fund",
        "currency": "USD",
        "summary": "The investment seeks maximum current income consistent with the preservation of capital and liquidity.\n The fund seeks to achieve its investment objective by investing at least 80% of its total assets in a non-diversified portfolio of fixed-income instruments, including bonds, debt securities and other similar instruments issued by U.S. and non-U.S. public and private sector entities. The dollar-weighted average portfolio maturity of the fund is normally not expected to exceed two years. It may invest up to 20% of its total assets in fixed-income securities and instruments of issuers in emerging markets. The fund is non-diversified.",
        "category": "Ultrashort Bond",
        "family": "Flexshares Trust",
        "exchange": "PCX",
        "market": "us_market"
    },
    "SHV": {
        "short_name": "iShares Short Treasury Bond ETF",
        "long_name": "iShares Short Treasury Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the ICE Short US Treasury Securities Index.\n The fund generally invests at least 90% of its assets in the bonds of the underlying index and at least 95% of its assets in U.S. government bonds. The index measures the performance of public obligations of the U.S. Treasury that have a remaining maturity of less than or equal to one year.",
        "category": "Ultrashort Bond",
        "family": "iShares",
        "exchange": "NGM",
        "market": "us_market"
    },
    "TFLO": {
        "short_name": "iShares Treasury Floating Rate ",
        "long_name": "iShares Treasury Floating Rate Bond ETF",
        "currency": "USD",
        "summary": "The investment seeks to track the investment results of the Bloomberg Barclays U.S. Treasury Floating Rate Index, which is composed of U.S. Treasury floating rate bonds.\n The fund generally will invest at least 90% of its assets in the component securities of the underlying index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The underlying index is a market capitalization-weighted index that measures the performance of floating rate public obligations of the U.S. Treasury.",
        "category": "Ultrashort Bond",
        "family": "iShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "ULTR": {
        "short_name": "IQ Ultra Short Duration ETF",
        "long_name": "IQ Ultra Short Duration ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income while maintaining limited price volatility.\n The fund, under normal circumstances, invests at least 80% of its net assets in fixed income securities. It typically invests at least 80% of its assets in fixed income securities rated BBB- or A-2 or higher by S&P Global Ratings (\"S&P\"), BBB- or F-2 or higher by Fitch Ratings, Inc. (\"Fitch\"), or Baa3 or Prime-2 or higher by Moody&#39;s Investors Service, Inc. (\"Moody&#39;s\"), or, if unrated, determined by the fund&#39;s management to be of equivalent quality.",
        "category": "Ultrashort Bond",
        "family": "IndexIQ",
        "exchange": "PCX",
        "market": "us_market"
    },
    "USFR": {
        "short_name": "WisdomTree Floating Rate Treasu",
        "long_name": "WisdomTree Floating Rate Treasury Fund",
        "currency": "USD",
        "summary": "The investment seeks to track the price and yield performance, before fees and expenses, of the Bloomberg U.S. Treasury Floating Rate Bond Index (the \"index\").\n The fund invests at least 80% of its total assets (exclusive of collateral held from securities lending) in the component securities of the index and investments that have economic characteristics that are substantially identical to the economic characteristics of such component securities. The index is designed to measure the performance of floating rate public obligations of the U.S. Treasury. The fund is non-diversified.",
        "category": "Ultrashort Bond",
        "family": "WisdomTree",
        "exchange": "PCX",
        "market": "us_market"
    },
    "USI": {
        "short_name": "Principal Ultra-Short Active In",
        "long_name": "Principal Ultra-Short Active Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income.\n The fund is an actively managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective by investing, under normal circumstances, at least 80% of its net assets, plus any borrowings for investment purposes, in investment-grade bonds and other debt securities. The fund invests in fixed- and floating-rate securities. Under normal circumstances, the fund maintains an average effective maturity of three years or less and an average portfolio duration of one year or less.",
        "category": "Ultrashort Bond",
        "family": "Principal Funds",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VALT": {
        "short_name": "ETFMG Sit Ultra Short ETF",
        "long_name": "ETFMG Sit Ultra Short ETF",
        "currency": "USD",
        "summary": "The investment seeks maximum current income to the extent consistent with preserving capital and maintaining liquidity.\n The fund is an actively managed exchange-traded fund (\"ETF\") that seeks to achieve its investment objective by investing in a diversified portfolio of high-quality short-term U.S. dollar denominated domestic and foreign debt securities and other instruments. It will, under normal circumstances, invest primarily in fixed-income securities. The fund invests in investment grade domestic debt obligations.",
        "category": "Ultrashort Bond",
        "family": "ETFMG",
        "exchange": "PCX",
        "market": "us_market"
    },
    "VNLA": {
        "short_name": "Janus Henderson Short Duration ",
        "long_name": "Janus Henderson Short Duration Income ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide a steady income stream with capital preservation across various market cycles and consistently outperform the FTSE 3-Month US Treasury Bill Index by a moderate amount through various market cycles while at the same time providing low volatility.\n The fund normally invests at least 80% of its net assets in a portfolio of fixed income instruments of varying maturities. It may invest up to 20% in asset-backed securities that are rated investment grade or of similar quality as determined by Janus Capital. The average portfolio duration of the fund generally will be within 0-2 years of the index.",
        "category": "Ultrashort Bond",
        "family": "Janus Henderson",
        "exchange": "PCX",
        "market": "us_market"
    }
}