{
    "DALI": {
        "short_name": "First Trust DorseyWright DALI 1",
        "long_name": "First Trust Dorsey Wright DALI 1 ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that correspond generally to the price and yield (before the fund&#39;s fees and expenses) of an index called the Nasdaq Dorsey Wright DALI 1 Index.\n Under normal conditions, the fund will invest at least 90% of its net assets (including investment borrowings) in the equity securities that comprise the index. The index has been designed based upon the principle that the asset class exhibiting the highest levels of \"relative strength,\" based on current prices, will be the asset class with the best performance over the near term. It is non-diversified.",
        "category": "World Allocation",
        "family": "First Trust",
        "exchange": "NMS",
        "market": "us_market"
    },
    "EUCG": {
        "short_name": "Euclid Capital Growth ETF",
        "long_name": "Euclid Capital Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks capital appreciation.\n The fund is an actively-managed ETF that seeks to achieve its investment objective by utilizing systematic trend-following techniques, market analysis and risk management to direct its exposure to various U.S. and non-U.S. equity sectors, styles, and asset classes in a low-risk environment and to fixed income securities, cash, or cash equivalents for non-equity exposure in a higher-risk environment. The fund is non-diversified.",
        "category": "World Allocation",
        "family": "Virtus",
        "exchange": "BTS",
        "market": "us_market"
    },
    "FCEF": {
        "short_name": "First Trust CEF Income Opportun",
        "long_name": "First Trust CEF Income Opportunity ETF",
        "currency": "USD",
        "summary": "The investment seeks to provide current income with a secondary emphasis on total return.\n The fund seeks to achieve its investment objectives by investing at least 80% of its net assets (including investment borrowings) in a portfolio of closed-end investment companies that are listed and traded in the United States on registered exchanges. In selecting the closed-end funds for it&#39;s portfolio, the fund&#39;s investment advisor utilizes a range of investment approaches.",
        "category": "World Allocation",
        "family": "First Trust",
        "exchange": "NGM",
        "market": "us_market"
    },
    "GAA": {
        "short_name": "Cambria Global Asset Allocation",
        "long_name": "Cambria Global Asset Allocation ETF",
        "currency": "USD",
        "summary": "The investment seeks income and capital appreciation.\n Under normal market conditions, the fund invests at least 80% of its total assets in affiliated and unaffiliated exchange-traded funds (\"ETFs\") and other exchange-traded products (\"ETPs\") (collectively, \"underlying vehicles\") that provide exposure to various (i) investment asset classes, including equity and fixed income securities, real estate, commodities, and currencies, and (ii) factors such as value, momentum, and trend investing.",
        "category": "World Allocation",
        "family": "CAMBRIA ETF TRUST",
        "exchange": "BTS",
        "market": "us_market"
    },
    "GYLD": {
        "short_name": "Arrow Dow Jones Global Yield ET",
        "long_name": "Arrow Dow Jones Global Yield ETF",
        "currency": "USD",
        "summary": "The investment seeks investment results that generally correspond, before fees and expenses, to the price and yield performance of the Dow Jones Global Composite Yield Index (the \"underlying index\").\n The fund uses a \"passive\" or \"indexing\" investment approach to seek to track the price and yield performance of the underlying index. It invests at least 80% of its total assets in the component securities of the underlying index (or depositary receipts representing those securities). The underlying index seeks to identify the 150 highest yielding investable securities in the world within three \"asset classes.\"",
        "category": "World Allocation",
        "family": "ArrowShares",
        "exchange": "PCX",
        "market": "us_market"
    },
    "QPX": {
        "short_name": "AdvisorShares Q Dynamic Growth ",
        "long_name": "AdvisorShares Q Dynamic Growth ETF",
        "currency": "USD",
        "summary": "The investment seeks to achieve long-term growth.\n The fund invests in ETFs representing all asset classes, including, but not limited to, treasury bonds, municipal bonds, investment grade corporate bonds, high-yield U.S. corporate bonds (sometimes referred to as \"junk bonds\"), municipal bonds, U.S. and foreign equities, commodities, and volatility products. These underlying investments may be of any market capitalization, duration, maturity, and quality.",
        "category": "World Allocation",
        "family": "AdvisorShares",
        "exchange": "PCX",
        "market": "us_market"
    }
}