{"BWX": {"short_name": "SPDR Bloomberg Barclays Intl Tr", "long_name": "SPDR Bloomberg Barclays International Treasury Bond ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that, before fees and expenses, correspond generally to the price and yield performance of the Bloomberg Barclays Global Treasury ex-US Capped Index.\n The fund generally invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to track the fixed-rate local currency sovereign debt of investment grade countries outside the United States. It is non-diversified.", "category": "World Bond", "family": "SPDR State Street Global Advisors", "exchange": "PCX", "market": "us_market"}, "BWZ": {"short_name": "SPDR Bloomberg Barclays Short T", "long_name": "SPDR Bloomberg Barclays Short Term International Treasury Bond ETF", "currency": "USD", "summary": "The investment seeks to provide investment results that correspond generally to the Bloomberg Barclays 1-3 Year Global Treasury ex-US Capped Index.\n The fund invests substantially all, but at least 80%, of its total assets in the securities comprising the index and in securities that the Adviser determines have economic characteristics that are substantially identical to the economic characteristics of the securities that comprise the index. The index is designed to measure the performance of fixed-rate local currency sovereign debt of investment grade countries outside the United States that have remaining maturities of 1-3 years. The fund is non-diversified.", "category": "World Bond", "family": "SPDR State Street Global Advisors", "exchange": "PCX", "market": "us_market"}, "FLIA": {"short_name": "Franklin Liberty International ", "long_name": "Franklin Liberty International Aggregate Bond ETF", "currency": "USD", "summary": "The investment seeks total investment return, consistent with prudent investing, consisting of a combination of interest income and capital appreciation.\n Under normal market conditions, the fund invests at least 80% of its net assets in bonds and investments that provide exposure to bonds. Bonds include debt obligations of any maturity, such as bonds, notes, bills and debentures. The fund invests predominantly in fixed and floating-rate bonds issued by governments, government agencies and governmental-related or corporate issuers located outside the U.S. It is non-diversified.", "category": "World Bond", "family": "Franklin Templeton Investments", "exchange": "BTS", "market": "us_market"}, "ISHG": {"short_name": "iShares 1-3 Year International ", "long_name": "iShares 1-3 Year International Treasury Bond ETF", "currency": "USD", "summary": "The investment seeks to track the investment results of the FTSE World Government Bond Index â\u0080\u0093 Developed Markets 1-3 Years Capped Select Index.\n The fund will invest at least 90% of its assets in the component securities of the index and may invest up to 10% of its assets in certain futures, options and swap contracts, cash and cash equivalents. The index is the performance of fixed-rate, local currency, investment-grade, sovereign bonds from certain developed markets. The fund is non-diversified.", "category": "World Bond", "family": "iShares", "exchange": "NMS", "market": "us_market"}}