{
    "3IINFOTECH.NS": {
        "short_name": "3I INFOTECH LTD",
        "long_name": "3i Infotech Limited",
        "summary": "3i Infotech Limited provides IP based software solutions and information technology services in India and internationally. The company offers Kastle Universal Lending System, a centralized database and browser based application to integrate and streamline the loan processing cycle; Kastle Treasury, a treasury management solution; Kastle Core Banking that provides banking operations for commercial and consumer banking; Kastle Transaction Banking that enables cash and securities movement; Factor/SQL, a factoring software solution; Kastle Integrated Risk Management solution; AMLOCK, an anti-money laundering, and financial crime detection and management solution; Kastle Digital Banking solutions suite to cater the trends of banking and lending practices; and Kastle Business Intelligence, an enterprise analytics platform. It also provides general, life, and health insurance products under the PREMIA brands; PREMIA Blogs; PREMIA Pension; MFund Plus WMS, a wealth management platform technology solution; MFund Plus Suite, an investment/fund management solution; MFund Investor Services System; and PREMIA e-portal, an insurance-specific web portal solution. In addition, the company offers enterprise resource planning solutions, including ORION enterprise suite, a solution that provides industry-specific solutions; ORION financial management solution, which streamlines and unifies financial management process; ORION HRMS and payroll to enhance employee productivity and organizational efficiency; and ORION Mobile ERP, a mobile application to integrate various business processes and modules. Further, it provides customer relationship management and B2C solutions under ORION brand. It serves customers in banking, insurance, capital markets, asset and wealth management, government, manufacturing, retail, distribution, telecom, and healthcare industry verticals. The company was founded in 1993 and is headquartered in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "543282.BO": {
        "short_name": "Niks Technology Ltd",
        "long_name": "Niks Technology Limited",
        "summary": "Niks Technology Limited, an IT solution services enabling company, provides software development and educational services in India and internationally. The company offers school, hospital, real estate, hotel, retail point of sale, and tour and travel management system software solutions, as well as provides pharmacy, gym, matrimonial, food ordering, inventory saloon, and bus reservation management software solutions. It also provides IT and IT security services; and digital marketing services, such as search engine optimization and marketing, content and Influencer marketing, content automation, campaign and e-commerce marketing, email direct marketing, pay per click, online reputation management, display advertising, e-books, optical disks and games, and other forms of digital media. In addition, the company offers online and offline courses, including ethical hacking and cyber security, embedded system and robotics, digital marketing, android application development, Internet of things, machine learning, artificial intelligence, data science , PLC-SCADA, web development, software development, programming language, server administrator, VLSI designing, networking, and software testing. Further, it provides web development services, such as website design, custom web design, responsive website design, SEO friendly web design, PHP design and application development, website hosting, e-commerce web design, website support and maintenance, and website redesigning; and mobile app development services. Niks Technology Limited was incorporated in 2014 and is headquartered in Patna, India.",
        "currency": null,
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "BSE",
        "market": "in_market",
        "country": "India",
        "city": "Patna"
    },
    "ACCELYA.NS": {
        "short_name": "ACCELYA SOLUTIONS",
        "long_name": "Accelya Solutions India Limited",
        "summary": "Accelya Solutions India Limited, together with its subsidiaries, provides software solutions to the airline and travel industry in the Asia Pacific, the Middle East, Africa, the Americas, and Europe. It offers software products, managed processes, technology, and hosting services. The company also provides airline financial solutions, which include airline revenue accounting, airline payments management, airline cost and billing management, and airline revenue assurance solutions, as well as airline refund management, early warning system, and agency debit memo management solutions. In addition, it offers airline commercial solutions, such as revenue management, agency incentive management, CRM and loyalty management, and sales intelligence and analytics solutions; and BSP processing, simplified invoicing and settlement, and neutral fare proration engine solutions, as well as BSP Link, a distribution platform for the BSP community, which include agents, airline users, agent group users, GDS users, and third-party users. Further, the company provides air cargo solutions, such as offer and order management, warehouse management, revenue management, regulatory broker, service management, logistics, and analytics. Additionally, it offers implementation, analytics and consulting, business process re-engineering, and technology audit and analysis services. The company was founded in 1986 and is based in Pune, India. Accelya Solutions India Limited is a subsidiary of Accelya Holding World S.L.U.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "ADROITINFO.NS": {
        "short_name": "ADROIT INFOTECH LT",
        "long_name": "Adroit Infotech Limited",
        "summary": "Adroit Infotech Limited operates as a SAP consulting company in India and internationally. It offers a range of business solutions, including business and technology consulting, enterprise solutions, systems integration, custom application development, application maintenance and production support, infrastructure management, cloud ecosystem integration, product engineering and lifecycle solutions, business process management, and business platforms and solutions, as well as software products. The company was formerly known as Sphere Global Services Limited and changed its name to Adroit Infotech Limited in February 2018. Adroit Infotech Limited was incorporated in 1990 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "ADSL.NS": {
        "short_name": "ALLIED DIGITAL SER",
        "long_name": "Allied Digital Services Limited",
        "summary": "Allied Digital Services Limited designs, develops, deploys, and delivers IT infrastructure management services in India and internationally. The company offers IT-as-a-Service, such as IT transformation consulting, IT optimization and modernization, and disaster recovery hosting services, as well as datacenter hosting, migration, and management; and infrastructure services, such as Infrastructure-as-a-Service, infrastructure management, managed security, and professional services. It also provides end user IT support services, including service desk management, remote device management, virtual desktop infrastructure, enterprise mobility management, desk-side support, and professional services; and IT asset lifecycle services comprising deployment, maintenance, and disposal services, as well as install, move, add, and change services. In addition, the company offers enterprise applications consisting of custom application development, product engineering, ERP and CRM development and support, and business monitoring and management services; helpdesk/service desk management and work order management system solutions; and integrated solutions, such as security command and control center, video surveillance, access control, IoT, and RFID and smart card integrated solutions. Further, it provides perimeter intrusion detection, fire alarm, building management, public address, baggage scanning/explosive detection, and toll plaza and highway traffic management systems; and dispatch and depot services, including installation, datacenter smart hand, VOIP/PBX, datacenter transformation, maintenance and warranty, end user device, site survey, and satellite AV services. The company offers its services in 35 countries across 5 continents. Allied Digital Services Limited was incorporated in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "AGCNET.NS": {
        "short_name": "AGC NETWORKS LTD",
        "long_name": "AGC Networks Limited",
        "summary": "AGC Networks Limited provides information and communications technology solutions worldwide. It operates through System Integration, Technology Product Solution, and Others segments. The company offers unified communication solutions, such as IP communication, multimedia integration, contact center, and collaboration solutions. It also provides data center and edge IT solutions, such as hyper converged infrastructure that integrates computing, storage, networking, and virtualization resources and other technologies; private cloud; mobility; and software defined networking. In addition, the company offers a portfolio of cyber security services, which include certification, compliance, implementation, management, and audit services. Further, it provides digital transformation and applications, such as gamification, customer experience and journey, automation, and IoT solutions. Additionally, the company offers guardian support services consisting of IT infrastructure remote and on-site management services; global security operations center and global network operations center services; managed services, including enterprise service management, integrated management data center, and cloud computing services; and professional services comprising consulting, deployment, design, customization, and audit services. It serves banking, financial service, and insurance; education; healthcare; travel and hospitality; IT/ITES; and manufacturing industries. The company was founded in 1986 and is based in Mumbai, India. AGC Networks Limited is a subsidiary of Essar Global Fund Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "AIRAN.NS": {
        "short_name": "AIRAN LTD",
        "long_name": "Airan Limited",
        "summary": "Airan Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and digital and software services in India. It offers information technology (IT) and IT-enabled services, including banking transaction processing services and document management services for telecommunication companies, internet services providers, and payment banks. The company offers cash management, door step banking and pickup, CTS clearing processing, bank account opening forms processing, e-stamping certificate/e-registration fee collection, records management, address and credit verification, contact center, back office management, and software development services, as well as manages collection counters. It provides its services for banking, telecom, software development, field operations, and back-office and front-office management sectors. Airan Limited was founded in 1989 and is headquartered in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "AKSHOPTFBR.NS": {
        "short_name": "AKSH OPTIFIBRE",
        "long_name": "Aksh Optifibre Limited",
        "summary": "Aksh Optifibre Limited designs, manufactures, and sells optical fiber cables in India. It operates through Manufacturing, Services, and Trading of Goods segments. The company offers optical fibers, including single mode and multimode; and a range of optical fiber cables, such as duct, steel and glass armored, fiber to the home (FTTH), aerial, indoor, and special application cables for various applications in telecommunication networks. It also provides cable reinforcement solutions comprising fiber and aramid reinforcement plastic rods, Teleglass water blocking yarns, and non-water blocking yarns/Teleglass SS; ophthalmic lens; network connectivity products consisting of work area outlet, patching, cross connect, and optical fiber systems, as well as patch cords, cable and cable assemblies, and support structures; and LED bulbs. In addition, the company offers various services, such as Internet protocol television services under the iControl brand; voice over Internet protocol services under the Pigeon brand name; and FTTH solutions for home owners, business owners, and property developers, as well as an integrated set of components, systems, engineering, and installations for turn-key projects. Further, it provides e-governance services under the 1 Stopaksh brand name. The company also exports its products to the United States, Europe, South America, CIS, Africa, the Middle East, and Asia. Aksh Optifibre Limited was founded in 1986 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "ALANKIT.NS": {
        "short_name": "ALANKIT LIMITED",
        "long_name": "Alankit Limited",
        "summary": "Alankit Limited provides in e-governance services and products in India. The company accepts permanent account number (PAN) card applications; change in PAN particulars applications; and e-TDS/e-TCS/AIR/e-TBAF returns in electronic mode from corporate and non-corporate assesses, as well as digitizes paper returns filed with income tax department. The company is also involved in the resident enrolment, uploading of details, correction/ updation in Aadhaar, a unique identification number; and development of National Skills Registry, a fact sheet of credible, permanent and accessible information about each registered person. In addition, it offers GST Suvidha Provider, an end to end goods and services tax (GST) compliance solution provider; manpower consultancy services; business correspondent services; National InsuranceÂ\u0096Policy Repository services to store insurance policies electronically; GST Billing Software that creates e-way bills, tax invoices, quotes, and others; online GST registration services; kiosk banking services; and PAN card correction services, as well as provides services to apply for new and duplicate PAN card. Further, the company engages in the distribution of card printers and accessories; and implementation and management of Paper to Follow Process for the cheque truncation system. Additionally, it operates Atal Pension Yojana to encourage people to save small amounts during their productive years, which will enable them to draw pension in the old age; and Recordxpert.com, a web-based health and wellness portal for scanning and digitization of medical records. The company was formerly known as Euro Finmart Limited and changed its name to Alankit Limited in September 2014. Alankit Limited was incorporated in 1989 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "AMBER.NS": {
        "short_name": "AMBER ENTERPRISES",
        "long_name": "Amber Enterprises India Limited",
        "summary": "Amber Enterprises India Limited provides solutions to air conditioner OEM/ODM industries in India. It designs and manufactures a range of room air conditioners (RACs), including window air conditioners, indoor units, and outdoor units of split air conditioners; and inverter RACs. The company also offers functional components of RACs, such as heat exchangers, motors, and multi-flow condensers and invertor printed circuit boards; and other RAC components comprising sheet metal components, copper tubing, plastic extrusion, vacuum forming, and injection molding components. In addition, it manufactures components for other consumer durables and automobiles, such as case liners for refrigerators; plastic extrusion sheets for consumer durables and automobile industry; sheet metal components for microwave; and washing machine tub assemblies, as well as products for automobiles and metal ceiling industries. Further, the company provides mobile air conditioners for railway, metro, bus, and defense and telecommunication industries. The company also exports its products. Amber Enterprises India Limited was incorporated in 1990 and is based in Gurugram, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "ASTRAMICRO.NS": {
        "short_name": "ASTRA MICROWAVE PR",
        "long_name": "Astra Microwave Products Limited",
        "summary": "Astra Microwave Products Limited designs, develops, and manufactures sub-systems for radio frequency and microwave systems used in defense, space, meteorology, and telecommunication applications in India. It offers radar electronics, including active antenna array units, TR modules, wideband TR modules, solid state power amplifiers, receiver exciters, central units, antenna beam forming units, all receiver subsystems, array group and monopulse receivers, waveform generators, and MMIC; electronic warfare comprising antennas, EDLVA and BLI super components, EW simulators, DIFM receivers, front end receivers, up/down convertors, and homodyne receivers; and strategic electronics and telemetry, such as command guidance units, radio proximity fuze, phased array based telemetry tracking system, sub-systems for gimbal based and AESA seeker, ground and air-borne data link systems, data and video telemetry transmitters, transponders, encoders and decoders, and telemetry receivers, as well as L, S, C, and X-Band transponders. The company also provides ground-based systems consisting of sub-systems for multi-object, tracking radar, coherent frequency generators, L-band modulators, 8x8 switchable routers for earth station, V/UHF T/R modules for ST radar, and Ka-band indoor/outdoor units; S-level (on-board) / flight model systems, which includes sub-systems for SAR payloads, geostationary satellites, and remote sensing satellites; water level measurement, agromet meteorological stations, automatic rain gauge, automatic weather stations, mini boundary layer masts, 50m tower masts, and agro met towers; and perimeter surveillance system and non-linear junction detector. In addition, it offers MMIC testing and assembly, and contract manufacturing services, as well as products for homeland security. It also exports its products. Astra Microwave Products Limited was incorporated in 1991 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "AURIONPRO.NS": {
        "short_name": "AURIONPRO SOLUTION",
        "long_name": "Aurionpro Solutions Limited",
        "summary": "Aurionpro Solutions Limited provides technology solutions and consultancy services in India, the Asia-Pacific regions, and internationally. The company offers digital payments solutions comprising Aurionpro payments framework, a platform that delivers payments gateways with pre built-in risk and fraud controls; remittance platform that enable remittance and money transfer services; and commerce platform to deliver tailor-made payment solutions to payment processors, merchants, and consumers. It also provides enterprise security solutions, including Isla, a Web malware isolation platform that prevents cyber-attacks; and identity and access management solutions that delivers identity, risk management, and security solutions. In addition, the company offers digital content solutions portfolio that connect people, process, and information. Further, it provides product engineering, enterprise portal and content, enterprise customer relationship management, and mobile application development services; iCashPro, an integrated transaction banking suite; FXConnect, a real time FX branch transaction platform for forex business; and loan origination system, a credit risk management system. Additionally, the company engages in sale of equipment; and software licensing activities. Aurionpro Solutions Limited provides solutions in the areas of banking and financial services, telecommunications, logistics, government organizations, and PSU sectors. The company was founded in 1997 and is headquartered in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "BARTRONICS.NS": {
        "short_name": "BARTRONICS INDIA L",
        "long_name": "Bartronics India Limited",
        "summary": "Bartronics India Limited provides automatic identification and data capture solutions in India and internationally. The company offers smart cards, including memory, crypto memory, GSM, contactless, biometric, and national cards; radio frequency identification equipment; enterprise mobility solutions; and e-government solutions, such as financial inclusion, public distribution, and pilgrim management systems, as well as health insurance projects, and smart card based driving license and vehicle registration. It also provides track and trace solutions, such as MRO tools, weapon, vehicle, surgical set, patient, and document tracking, as well as infant protection/monitoring and animal identification technology solutions; warehouse and fleet management systems; inventory and asset, library, visitor, contract labor, and pilgrim management solutions; and time and attendance, and access control systems. In addition, the company offers application development services; application management services, such as application modernization, application operation and support, middleware support, and database; enterprise solutions, including enterprise resource planning, enterprise application integration, business process management, business intelligence, services oriented architecture, enterprise portal and content management, and enterprise mobility; IT infrastructure management services, such as data center, end user computing, enterprise network and security, remote infrastructure management, and IT service desk; and strategic sourcing services. It serves banking and financial services, education, government, health care, law enforcement and public safety, manufacturing, telecom, transport and logistics, and aerospace industries. The company was formerly known as Super Bartronics Limited and changed its name to Bartronics India Limited in January 1996. Bartronics India Limited was incorporated in 1990 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "BGLOBAL.NS": {
        "short_name": "BHARATIYA GLOBAL I",
        "long_name": "Bharatiya Global Infomedia Limited",
        "summary": "Bharatiya Global Infomedia Limited provides information technology (IT), and media and entertainment products and services in India. It offers traffic engineering solutions, such as parking management, parking guidance, toll management, ticket dispensing, automatic number plate recognition, under vehicle surveillance, automatic vehicle counter-cum-classifier systems; and facility management solutions comprising smart campus, visitor management, canteen management, asset tracking, laptop tracking, file tracking, and lighting management systems, as well as CCTV, access control, perimeter fencing, etc. The company also provides personnel management solutions consisting of employee tracking, time-attendance, library automation and management, and student information systems; and customized solutions, including automated binning systems, intelligent converters, GSM based mast or I/O controllers, GSM logic controllers, boom barriers, loop detectors, LED panels, and kiosk applications, as well as other customizable converters, counters, etc. In addition, it offers building solutions, such as building management systems, i-BMS systems, energy services, lighting control products, and maintenance services. Further, the company provides home automation for RWA management and jewelry tracking systems. It primarily serves road and transportation, infra and building, health and medical, defense, security and surveillance, and other sectors. The company was formerly known as Bhartiya Global Software Limited and changed its name to Bharatiya Global Infomedia Limited in November 2003. Bharatiya Global Infomedia Limited was incorporated in 1994 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "BIRLACABLE.NS": {
        "short_name": "BIRLA CABLE LTD",
        "long_name": "Birla Cable Limited",
        "summary": "Birla Cable Limited manufactures and sells optical fiber cables, copper telecommunication cables, structured copper cables, specialty cables, and related accessories in India. The company provides fiber optical cables, including armored and unarmored, multi-tube ribbon type, di-electric rodent protected, di-electric self-supporting aerial, figure-8 type aerial, drop, central and multi tube micro, and interconnect cables. It also offers specialty cables, such as stainless steel wire armored tactical, fiber to antenna, coaxial, data communication, switchboard, drop, screened PCM, and CAT cables, as well as automobile wires. In addition, the company provides telecom fiber accessories comprising connectors, adapters, pigtails, patch cords, rackmounts, wall mounts, and cable accessories. It also exports its products. The company was formerly known as Birla Ericsson Optical Limited and changed its name to Birla Cable Limited in September 2016. The company was incorporated in 1992 and is based in Rewa, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Rewa"
    },
    "BPL.NS": {
        "short_name": "BPL",
        "long_name": "BPL Limited",
        "summary": "BPL Limited manufactures and sells electronic products primarily in India. It offers televisions, washing machines, refrigerators, microwave ovens, air conditioners, dish washers, and soundbars, as well as printed circuit boards. The company provides its products under the BPL brand name. BPL Limited was founded in 1963 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "BSOFT.NS": {
        "short_name": "BIRLASOFT (INDIA)",
        "long_name": "Birlasoft Limited",
        "summary": "Birlasoft Limited provides enterprise digital IT services in the United States, the United Kingdom and rest of Europe, and internationally. It offers digital transformation services, including data analytics, connected products, intelligent automation, cloud, transformation, and blockchain services; and enterprise technologies and services in the areas of Oracle and JD Edwards, SAP, Infor, Microsoft, customer relationship management, manufacturing execution systems, product lifecycle management, supply chain management, IT transformation, applications management, testing, and infrastructure and cloud technology. The company also offers solutions, such as intelliOpen, an intelligent system for contactless screening of people, social distancing monitoring, and contact tracing; intelliAsset, a platform for asset visualization, analytics, and actions; TruView CLM, a cloud based contract lifecycle management solution; TruServ FSM, a cloud based touchless automation solution for field services; TruLens, a tool that provides insights into the existing Salesforce implementation; iLink, a solution for the integration of PLM applications and ERP systems; Supplier Risk Radar, an AI-powered preventive risk mitigation solution in the areas of supply chains; Akoya, an engineering analytics solution; Producer Workspace, an insurance brokerage solution; Submission Automation, an insurance broker submission solution; and ZeROTechDebt, a solution that provides structured framework for capturing and analyzing IT asset information. It serves automotive, banking, high tech, manufacturing, insurance, media and entertainment, energy and resources, life sciences and healthcare, and utility industries, as well as capital markets. The company has a strategic cloud alliance partnership with Microsoft Corporation. Birlasoft Limited was incorporated in 1990 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "CALSOFT.NS": {
        "short_name": "CALIFORNIA SOFTWAR",
        "long_name": "California Software Company Limited",
        "summary": "California Software Company Limited provides software development, business process outsourcing, and IT infrastructure services. It offers CLPM, a loyalty business management solution; CsIoT, an Internet of Things solution; CsDigital platform that provides cloud strategy services to design, deploy, and manage cloud environments; CsBigData, a big data analytics solution; CsCloud, a cloud computing solution; CLISAC, a clinical data management solution; CLIDAC, a clinical data warehouse and analytics console; and CASP, a chat-based artificial intelligence (AI) assistance system. The company also offers ARGCIC, a pharmaco-vigilance application; Chronscrapper, an automated data extraction tool used in structuring the data of PDF and scanned documents; EYWA, an AI assistant for doctors; and YesGeeCom solution that enables digital transformation of e commerce solutions by AI integration for business-to-business and business-to-customer segments. The company was founded in 1992 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "CENTUM.NS": {
        "short_name": "CENTUM ELECTRONICS",
        "long_name": "Centum Electronics Limited",
        "summary": "Centum Electronics Limited designs, manufactures, and sells electronic products in India, Europe, North America, and internationally. The company offers embedded computers and power converters, test tools, LRU and data recorders, and satellite bus systems for the aerospace and space industries. It also provides onboard computer systems, receiver and seeker electronics, transmit receive modules, high power RF amplifiers, vibration hardened oscillators, power converters and systems, digital receivers, digital sequencer and payload controllers, power conditioning and processing units, and radar finger printing systems for the defense industry. In addition, the company offers base station equipment and RF filters for the communication industry; and industrial equipment diagnosis and circuit breaker control systems, solar energy power cabinets, and HIL test simulator turbo alternator regulation products for the industrial and energy sectors. Further, it provides medical devices and equipment that include digital radiography systems, automated pumps for drug injection, ultrasound equipment, patient monitoring devices, customized room controls for operation theaters, and others; and railway automation system gateways, railway embedded controllers and computer boards, and railway energy storage systems and modules, as well as specialist engineering and manufacturing services for the transportation sector. Additionally, the company offers assisted car navigation-passive rollover avoidance systems, automatic telematics modules, automotive flexray demonstrators, automotive elec boards for solar roofs, and power steering encoder acquisition systems for the automotive industry. Centum Electronics Limited was founded in 1993 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "CEREBRAINT.NS": {
        "short_name": "CEREBRA INTEGRATED",
        "long_name": "Cerebra Integrated Technologies Limited",
        "summary": "Cerebra Integrated Technologies Limited engages in the trading of refurbished computer products and accessories in India and internationally. It offers personal computers, servers, laptops, and workstations. The company also provides electronics manufacturing services for motherboards, memory modules, graphic cards, and networking products; and designs, plans, and implements IT hardware and software infrastructure, such as security, networking, server, storage, endpoint, operating system, and application software products. In addition, the company offers infrastructure management solutions, including IT asset management that consists of software and hardware asset management; and remote infrastructure monitoring services comprising server management and monitoring, network management and monitoring, network performance management, desktop and devices management, asset tracking and inventory management, operating system management, workstations, security management, and helpdesk services. Further, it provides e-waste recycling services, consisting of repair, refurbishment, and reuse services for electronic and electrical equipment; integrated EHS system; salvaging services for components; web-based trading services; e-waste management and base-metal recycling; logistics and warehousing facilities; waste management at source; training services; support services for scrap handling, collection, transport, documentation, shipping, and other related areas; market support services; and security systems, as well as data destruction services. Additionally, the company offers IT training and consulting services; and IT solutions, such as LPO, BPO and KPO services. Cerebra Integrated Technologies Limited was founded in 1992 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "CIGNITITEC.NS": {
        "short_name": "CIGNITI TECHNOLOGI",
        "long_name": "Cigniti Technologies Limited",
        "summary": "Cigniti Technologies Limited provides software testing services worldwide. It offers quality assurance services, such as test automation, security testing, regression testing, performance testing, mobile testing, functional testing, crowdsourced testing, and compatibility testing. The company also provides quality engineering services, including agile testing, DevOps testing, service virtualization, and test data management; and digital assurance services comprising robotic process automation, medical device testing, ERP testing, big data and analytics testing, and digital assurance and testing; and test advisory and transformation services, as well as artificial intelligence testing, Internet of Things testing, and blockchain testing services. It serves the airlines, banking, communications, energy and utilities, financial services, healthcare and life sciences, insurance, logistics, manufacturing, media and entertainment, retail and ecommerce, and travel and hospitality industries. The company was formerly known as Chakkilam Infotech Limited. Cigniti Technologies Limited was incorporated in 1998 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "COFORGE.NS": {
        "short_name": "COFORGE LIMITED",
        "long_name": "COFORGE Limited",
        "summary": "COFORGE Limited provides information technology (IT) and IT enabled Services in Americas, India, Europe, the Middle East and Africa, and the Asia Pacific. The company offers Tron intelligent automation services, including business process automation, IT operations automation, robotic process automation, development automation, and cognitive services; and business process services, such as back office operations, contact center operations, KPO, process re-engineering, consulting, and automation. It also provides cyber security services comprising security controls and technology management, threat and vulnerability management, and security crisis and incident response services; data and analytics services that include machine learning, data management, data modernization, and data monetization services; and digital process transformation services. In addition, the company offers infrastructure management services, which comprise data center, DevOps and automation, digital workplace, IT operations management, and services management services; and digital services, including digital experience and integration services. Further, it provides application services, such as application management, quality engineering, business agility and simplification, and salesforce services; and cloud services comprising cloud advisory, migration, operation, management, security, and testing services, as well as CloudPixy, a multi-cloud provisioning and orchestration solution. The company serves the travel and transportation, insurance, banking and financial services, enterprise services, manufacturing, media, and other industries. The company was formerly known as NIIT Technologies Limited and changed its name to COFORGE Limited in August 2020. COFORGE Limited was incorporated in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "COMPINFO.NS": {
        "short_name": "COMPUAGE INFOCOM L",
        "long_name": "Compuage Infocom Limited",
        "summary": "Compuage Infocom Limited, an information technology (IT) and mobility distribution company, trades in computer parts and peripherals, and software and telecom products in India and internationally. The company also provides products support services for IT products. Compuage Infocom Limited was founded in 1987 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CREATIVE.NS": {
        "short_name": "Creative Peripherals and",
        "long_name": "Creative Peripherals and Distribution Limited",
        "summary": "Creative Peripherals and Distribution Limited distributes information technology (IT)/gaming, imaging, lifestyle, and security products in India and internationally. It offers printers, storage devices and cartridges, as well as PC components, such as monitors, hard disks, CD writers, and CD ROMS; cameras, tripods, and other imaging products and accessories; and TVs, headphones, other lifestyle products, and IT accessories. The company offers its products through sub distributors, channel partners, e-commerce/online channels, large format retails, and system integrators. Creative Peripherals and Distribution Limited was founded in 1992 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "CTE.NS": {
        "short_name": "CAMBRIDGE TECH ENT",
        "long_name": "Cambridge Technology Enterprises Limited",
        "summary": "Cambridge Technology Enterprises Limited, a business and technology services company, provides service oriented architecture-based enterprise transformation and integration solutions, and services in India, the United States, Qatar, and the Philippines. The company offers artificial intelligence (AI) services, including AI advisory, AI solutions, and AI as a Service; and big data services, such as data potential, warehouse, analytics and visualization, and value services. It also provides cloud services comprising cloud strategy, transformation and migration, and Software as a Service, as well as managed services; and application services that include application development, migration and transformation, management, application testing, and enterprise mobility. In addition, the company offers DevOps services, which comprise DevOps advisory, implementation, and support; and identity access and management (IAM) consulting solutions, including IAM strategy, implementation, and managed services. Further, it provides infrastructure management services, such as IaaS and PaaS solutions, database and middleware management services, and operating system management. The company serves the midsize market enterprises and the midsize units of Global 2000 enterprises across a range of industries. Cambridge Technology Enterprises Limited was founded in 1999 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "CURATECH.NS": {
        "short_name": "CURA TECHNOLOGIES LTD",
        "long_name": "CURA Technologies Limited",
        "summary": "CURA Technologies Limited provides enterprise class software applications for organizations to manage risk, compliance, and audit framework through an automated process worldwide. It primarily serves energy sector The company was formerly known as Softpro Systems Limited and changed its name to CURA Technologies Limited in October 2010. CURA Technologies Limited was incorporated in 1991 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "CYBERTECH.NS": {
        "short_name": "CYBERTECH SYSTEMS",
        "long_name": "CyberTech Systems and Software Limited",
        "summary": "CyberTech Systems and Software Limited, together with its subsidiaries, provides information technology solutions to the government, education, utilities, public safety and homeland defense, technology, telecom, retail, healthcare, and manufacturing industries in India and the United States. The company offers GeoShield, a public safety solution; and GeoCivic. It also provides Spatialitics Health, a spatial analytics; and Spatialitics Utilities, a spatial analytics suite using SAP business suite or SAP S/4HANA. In addition, the company offers CyberSupport, an on demand IT support platform; and CyberServe, a healthcare analytics platform for population health. Further, it provides SAP S/4HANA, SAP cloud and analytics, SAP spatial enablement, digital supply chain, Spatial apps on SAP HANA, intelligent asset management, and geodata management services. The company was founded in 1990 and is based in Thane, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Thane"
    },
    "DATAMATICS.NS": {
        "short_name": "DATAMATICS GLOBAL",
        "long_name": "Datamatics Global Services Limited",
        "summary": "Datamatics Global Services Limited provides consulting and advisory, information technology, business process management, engineering, and big data and analytic solutions in the United States, Europe, and internationally. The company operates through IT Services and Business Process Management segments. It offers TruBot for robotic process automation; TruCap+ for intelligent data capture; iPM for end-to-end workflow management; TruBI for business intelligence and data visualization; TruFare for automated fare collection; Trade Finance, a solution that automates trade lifecycle; True Test for test automation; and TrueAI, a text analytics and pattern detection platform. The company serves banking and finance, publishing, healthcare, transportation, insurance, manufacturing and logistics, travel and hospitality, retail and e-commerce, market research, education technology, and international organizations. It has a strategic partnership with BizXL Solutions to offer end-to-end digital transformation and lean automation capability to enterprises in North America. The company was formerly known as Datamatics Technologies Limited and changed its name to Datamatics Global Services Limited in January 2009. The company was founded in 1975 and is based in Mumbai, India. Datamatics Global Services Limited is a subsidiary of Delta Infosolutions Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "DIGISPICE.NS": {
        "short_name": "DIGISPICE TECHNOLOGIES LT",
        "long_name": "DiGiSPICE Technologies Limited",
        "summary": "DiGiSPICE Technologies Limited operates as an information and communication technology company in India and internationally. It operates through two segments, Digital Technology Services and Financial Technology Services. The company provides value added and mobile content services to the telecom operators, as well as develops and sells telecom related software. It offers Horizon, an enabling platform for network operators, and acts as a gateway for their content and service partners; Mziiki, a music app and mobisite that provides African music experience; CNema, a video on demand mobile app; My Studio, a music service app; and NextGen CRBT platform for 4G and LTE networks that helps to provide video RBT, HD Audio RBT, Live Streaming RBT, and Social RBT to end users. The company also provides UNIGOV, a digital government solution, which offers citizen-centric services; Spice Money, a merchant-only mobile wallet; and DiGiMoney, a mobile wallet. In addition, it offers robotic process automation solutions; pView, an enterprise platform, which simplifies operations by capturing, processing, and reporting data; Cognitive Engagement Platform for telecom operators; and DiGi Identifier, an AI driven remote biometric digital authentication on boarding technology platform that helps enterprises speed up customer on-boarding through automated document collection, authentication, and verification process. The company was formerly known as Spice Mobility Limited and changed its name to DiGiSPICE Technologies Limited in August 2019. DiGiSPICE Technologies Limited was incorporated in 1986 and is based in Noida, India. DiGiSPICE Technologies Limited is a subsidiary of Spice Connect Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "DIXON.NS": {
        "short_name": "DIXON TECHNOLOGIES",
        "long_name": "Dixon Technologies (India) Limited",
        "summary": "Dixon Technologies (India) Limited operates in the electronic manufacturing services space in India. The company offers consumer electronics, including LED TVs; home appliances, such as washing machines; lighting products comprising LED bulbs, battens, indoor and outdoor LED drivers, electronics lamp drivers, and down lighters; mobile phones; and security surveillance systems. It also provides solutions in reverse logistics, such as repair and refurbishment services of set top boxes, LED TVs, mobile phones, CCTVs, modems, and computer peripherals; medical electronics; and set top boxes. The company was incorporated in 1993 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "DLINKINDIA.NS": {
        "short_name": "D-LINK (INDIA)LTD",
        "long_name": "D-Link (India) Limited",
        "summary": "D-Link (India) Limited markets and distributes D-Link branded networking products for consumers, small businesses, medium to large-sized enterprises, and service providers in India and internationally. The company offers home networking products, such as Wi-Fi systems, routers, range extenders, adapters, switches, DSL modems and routers, and mobile Wi-Fi hotspots; home cameras, CCTV solutions, smart plugs, and sensors; USB hubs; smart home eco systems; and cloud services. It also provides core and edge routers; chassis, cloud managed, unmanaged, smart managed, fully managed, and industrial switches, as well as switch accessories; and cameras, network video recorders, video management software, and related accessories. In addition, the company offers point-to-point/multipoint, software managed, and controller managed access points, as well as wireless controllers; VPN routers; copper, fiber, and structured cabling solutions; and optical transport network accessories and switches. Further, it provides nuclias cloud, a cloud based networking solution; nuclias connect, a network management solution; D-ViewCam, a video management software; and central Wi-Fi manager. The company was formerly known as Smartlink Network Systems Limited. D-Link (India) Limited was incorporated in 2008 and is headquartered in Mumbai, India. D-Link (India) Limited is a subsidiary of D-Link Holding Mauritius Inc.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "DRCSYSTEMS.NS": {
        "short_name": "DRC Systems India Limited",
        "long_name": "DRC Systems India Limited",
        "summary": "DRC Systems India Limited, a software development company, offers IT business solutions worldwide. It provides consultancy and discovery workshop services, and dedicated developers; UI/UX, wireframe, and frontend design services; web, mobile app, development content management system, digital commerce/e-commerce, and eLearning services; blockchain, big data, engineering, and IOT services; and cyber security, manual testing, automation testing, and performance testing services. It also offers DevOps and cloud, salesforce, and support and maintenance services; data analytics, and AI & automation transformation services; and enterprise resource planning, enterprise, digital marketing, and digital process automation solutions. The company was founded in 2012 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gandhinagar"
    },
    "DSSL.NS": {
        "short_name": "DYNACONS SYS SOLUT",
        "long_name": "Dynacons Systems & Solutions Limited",
        "summary": "Dynacons Systems & Solutions Limited operates as an IT solutions provider in India. It offers system integration services, such as architecture, integration, and management of custom application and information infrastructures; and datacenter solutions, comprising hyper converged infrastructure, server virtualization, software defined storage, enterprise backup and recovery solutions, data replication, DR automation, power and cooling, fire and safety, electrical and civil works, and physical access control solutions. The company also provides workplace solutions consisting of design and develop mobility strategies, BYOD implementation integration and migration, monitoring management and end user support, MS infra management tools, IT asset management services, secure virtual desktop, print services, unified communication, and workforce optimization; and network monitoring and management solutions comprising network monitoring of bandwidth utilization, network errors/collisions, network troubleshooting, day-to-day network operations, network performance monitoring, and tuning network operating systems. In addition, it offers project management and execution solutions; and managed services, such as data center and network management, service desk, managed security, cloud, infrastructure management, IT staff augmentation, and vendor management services. It serves BFSI, healthcare/pharmaceuticals, and other enterprises, as well as governments and PSUs. Dynacons Systems & Solutions Limited was founded in 1995 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ECLERX.NS": {
        "short_name": "ECLERX SERVICES",
        "long_name": "eClerx Services Limited",
        "summary": "eClerx Services Limited provides data management, analytics, and process outsourcing services in the United States, the United Kingdom, Europe, and the Asia Pacific. The company offers customer experience solutions for business process optimization and customer interaction monitoring; field technical operations services for avoidable truck roll, dispatch services, connected homes, return merchandise authorization, and revenue assurance; omnichannel customer support services; advanced and digital analytics, and enterprise business intelligence solutions; and robotic process automation, Q-clips, workforce manager solutions, as well as chatbots and QA testing with test assure. It also provides digital solutions, such as A/B testing and optimization, campaign operations, computer generated imagery, creative services, data management, digital analytics, digital asset management, forecasting solutions, intelligent automation, personalization, pricing and competitive intelligence, replatforming, search engine optimization, social media services, tag management, and Website search optimization. In addition, the company offers derivative trade support, cash securities operations, regulatory compliance and data, document management, and analytics solutions, as well as technology products. It serves financial services, cable and telecommunications, retail, fashion, media and entertainment, manufacturing, travel and leisure, software, and high-tech industries. The company was founded in 2000 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "EUROMULTI.NS": {
        "short_name": "EURO MULTIVISION L",
        "long_name": "Euro Multivision Limited",
        "summary": "Euro Multivision Limited manufactures and sells optical discs and solar photovoltaic cells in India. The company offers compact disc and digital versatile disc recordable products for various applications, including data storage, recording, and reproduction of audio and video media for entertainment, education, software installation, etc. It also provides mono and multi crystalline solar cells, solar power plants, solar glasses, solar aluminum frames, street and garden lights, rooftops, telecom systems, water pumps, solar lanterns, solar water pumps, home lighting systems, street lighting systems, and others, as well as solar products for architects. The company was incorporated in 2004 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "EXPLEOSOL.NS": {
        "short_name": "EXPLEO SOLUTIONS",
        "long_name": "Expleo Solutions Limited",
        "summary": "Expleo Solutions Limited, together with its subsidiaries, primarily provides software validation and verification services worldwide. The company offers consultancy services, such as business agility, digital business, and transformation delivery; engineering services, including design, production, and in-service support; quality engineering, testing, and management services; and training services. It serves aeronautics, automotive, banking and financial services, energy and utilities, gaming, industrial, public sector, telecoms and media, space and defense, insurance, rail transportation, healthcare and pharmaceutical, naval, and retail and logistics industries. The company was formerly known as SQS India BFSI Limited and changed its name to Expleo Solutions Limited in April 2019. Expleo Solutions Limited was founded in 1993 and is based in Chennai, India. SQS India BFSI Limited is a subsidiary of Expleo Technology Germany GmbH.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "FCSSOFT.NS": {
        "short_name": "FCS SOFTWARE SOLUT",
        "long_name": "FCS Software Solutions Limited",
        "summary": "FCS Software Solutions Limited engages in the provision of software development and marketing, and support services to corporate business entities in the BPO, software development, and e-learning service sector in India and the United States. The company offers IT consulting services, including application development and maintenance, portals, mobile apps, product development, SaaS, open source platforms and applications, predictive data sciences, big data analytics, and automation services; IT infra management services, such as colocation data centers, virtualization, system and networks support, plug and play infrastructure provisioning, WAN, IP based voice, and cyber security; and IT enabled services comprising multilingual helpdesk for technical and user support, business process outsourcing, and surveys, as well as learning solutions, such as content aggregation, learning management systems, portals, and assessments. It also provides consulting; and incubator services for startups. FCS Software Solutions Limited was incorporated in 1993 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "FSL.NS": {
        "short_name": "FIRSTSOURCE SOLUTI",
        "long_name": "Firstsource Solutions Limited",
        "summary": "Firstsource Solutions Limited provides customized business process management services in India, the United States, the United Kingdom, the Philippines, and internationally. The company offers various services across the customer lifecycle, Including acquisition, account servicing, collection, and retentions; sales ledger administration and collection, cash management and administration, payroll, VAT, and tax management services; credit and bank cards, private label retail cards, automotive and personal loans, overdraft accounts, and mortgage collection services; healthcare collection services; and default management, prevention, and recovery solutions. It also provides contact center and back-office processing services; claims processing and adjudication, digital mailroom and document, enterprise claim, Omni channel contact center, provider data management and credentialing, quality assurance, and telehealth support services, as well as member enrollment, billing, and eligibility services; and MedAssist, a revenue cycle product suite to enhance the revenue for hospitals and patient experience. In addition, the company manages claims handling transactions, including claims management, adjudication, remediation, and fulfillment; origination, home equity, routine and default servicing, title, and closing and escrow underwriting services; invoice factoring and discounting, payroll finance, debtor protection, deal management and pay-outs, cash allocation, sales ledger management, account servicing, complaints handling, credit control, and payment recovery; and business process consulting services. It serves the banking and financial services, healthcare, telecom and media, insurance, mortgage, and utilities sectors. The company was formerly known as ICICI Onesource Limited and changed its name to Firstsource Solutions Limited in 2006. The company was founded in 2001 and is based in Mumbai, India. Firstsource Solutions Limited is a subsidiary of CESC Ventures Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GENESYS.NS": {
        "short_name": "GENESYS INTL",
        "long_name": "Genesys International Corporation Limited",
        "summary": "Genesys International Corporation Limited provides mapping, survey, and geospatial services worldwide. The company offers geospatial consulting services, including mapping/GIS needs assessments, QA/QC analysis, and project design; GIS data capture and analysis for digital photogrammetry; cadastral mapping, topographical mapping, and parcel mapping services; digitization services for raster to vector conversion; and contour, topographic, zonal, cadastral, and utility maps. It also provides 3D and HD mapping; light detection and ranging data acquisition and processing using mobile, aerial, and terrestrial technologies for various applications, such as telecom fiber roll-out, and utilities planning, as well as in forestry and agriculture, oil and gas, and other industries; and engineering services for telcos and utility companies. In addition, the company offers software development services for enterprises, government, and consumers; WoNoBo, a mapping platform; photogrammetry services; building information modeling; and business consulting services, including requirement analysis, project design and planning, GIS orientation seminars and workshops, and database and application design with system configuration. Further, it provides various solutions, such as TeleSCAPE, InfraSCAPE, CitySCAPE, WaterSCAPE, and market analysis and route planning system, a Web based decision support system. The company provides its services to the utility, infrastructure, navigation, natural resources, urban development, and disaster management companies. Genesys International Corporation Limited was founded in 1983 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GSS.NS": {
        "short_name": "GSS INFOTECH LTD",
        "long_name": "GSS Infotech Limited",
        "summary": "GSS Infotech Limited provides information technology (IT) services and solutions in India, Bangladesh, and the United States. The company provides consulting services in the areas of digital transformation, professional, application management, and managed services. It also offers applied intelligence solutions, such as artificial intelligence, data science and machine learning, Internet of Things, and automation; enterprise security solutions, including digital identity governance, application security, and cyber security services; cloud infrastructure, cloud migration, and hybrid cloud management services; and remote infrastructure management services. In addition, the company offers TruVu, a data visualization and simplification platform; UniDesk, a cloud based managed service desk; and ibStream, a mobile marketing solution, as well as IT service support management tools, including enterprise identity and data management, unified cloud platform (UCP), and UCP Software Interfaces. It serves government, telecom, cloud, and healthcare sectors, as well as small, medium, and large businesses. The company was formerly known as GSS America Infotech Limited and changed its name to GSS Infotech Limited in March 2011. GSS Infotech Limited was founded in 1999 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "GTLINFRA.NS": {
        "short_name": "GTL INFRASTRUCTURE",
        "long_name": "GTL Infrastructure Limited",
        "summary": "GTL Infrastructure Limited, an independent and neutral telecom tower company, builds, owns, operates, and maintains shared passive telecom infrastructure sites. The company provides telecom towers on a shared basis to various telecom operators to host their active equipment; and delivers uninterrupted power on towers. It operates a portfolio of approximately 28,000 telecom towers across 22 telecom circles in India. The company was formerly known as GTL Infras Engineering & Managed Network Services Limited and changed its name to GTL Infrastructure Limited in February 2005. GTL Infrastructure Limited was founded in 2004 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "HAPPSTMNDS.NS": {
        "short_name": "Happiest Minds Techno Ltd",
        "long_name": "Happiest Minds Technologies Limited",
        "summary": "Happiest Minds Technologies Limited offers IT solutions and services in India, the United States, Canada, the United Kingdom, Australia, the Netherlands, and the Middle East. The company operates through three segments: Infrastructure Management & Security Services (IMSS); Digital Business Solutions (DBS); and Product Engineering Services (PES). The IMSS segment provides security services, including cyber and infrastructure security, governance, risk and compliance, data privacy and security, identity and access management, and threat and vulnerability management; and infrastructure services comprises of DC and hybrid cloud services, workspace services, service automation, database and middleware services, and software defined infrastructure services. The DBS segment offers enterprise applications and customized solutions, comprising of advisory, design and architecture, custom-app development, package implementation, and testing and on-going support services to IT initiatives. The PES segment assists software product companies in building products and services that integrates mobile, cloud, and social technologies. It also provides Internet of Things (IoT) solutions, consisting of digital strategy creation consultation, device/edge/platform engineering, end-to-end system integration on IoT platforms, IoT security and managed services, implementation of IoT roadmap, derivation of insights from connecting assets, connecting manufacturing, and supply chain. In addition, the company offers analytics/artificial intelligence solutions, including implementation of advanced analytics using artificial intelligence, machine learning and statistical models, and engineering big data platforms; and digital process automation solutions, such as robotic process automation, intelligent business process management, and cognitive automation using AI and machine learning based models. Happiest Minds Technologies Limited was founded in 2011 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "HCL-INSYS.NS": {
        "short_name": "HCL INFOSYSTEMS",
        "long_name": "HCL Infosystems Limited",
        "summary": "HCL Infosystems Limited sells computer hardware and mobile handsets to enterprises and consumers primarily in India. It operates through Hardware Products & Solution, Learning, and distribution segments. The Hardware Products and Solutions segment sells IT products and solutions to enterprise and government customers. The Learning segment offers training services; and sells educational digital content and related hardware offerings for private schools, colleges, and other education institutes, as well as vocational training. The Distribution segment distributes consumer products, including telecommunication products, digital lifestyle products, and consumer electronic and home appliances; and enterprise products, such as IT products, enterprise software, and office automation products. The company was founded in 1976 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "HCLTECH.NS": {
        "short_name": "HCL TECHNOLOGIES",
        "long_name": "HCL Technologies Limited",
        "summary": "HCL Technologies Limited offers software development, business process outsourcing, and infrastructure management services worldwide. It provides application development and maintenance services; SAP landscape transformation, system conversion, and implementation services; Microsoft customer relationship management services; Oracle business consulting, implementation, upgrade, managed, and migration services; and quality assurance and testing services, as well as autonomics and orchestration services, products, and platforms. The company also offers data center, workplace, network, mainframe, and service integration and management services. In addition, it provides embedded, software, digital, mechanical, and system and hardware engineering services, as well as product lifecycle management, product testing, and VLSI design services. Further, the company offers supply chain management, finance and accounting, digital and content, and automation services. It serves financial services, consumer services, life science and healthcare, manufacturing, and public services industries. HCL Technologies Limited has a strategic alliance with Alteryx, Inc. to enhance analytics automation and digital transformation for Global 2000 enterprises. The company was founded in 1976 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "HFCL.NS": {
        "short_name": "HFCL LTD",
        "long_name": "HFCL Limited",
        "summary": "HFCL Limited manufactures and sells telecom products in India and internationally. It offers a range of optical fiber cables for telecommunication, NLD, access, and FTT-x networks, as well as addresses applications through offerings, such as fire survival cables, tactical cables, etc. The company also provides microwave solutions, including packet microwave, hybrid microwave, and small cell radio solutions, as well as network management systems; and gigabit passive optical network system, which enables multi services access network for high bandwidth applications, such as video conferencing, remote education, tele-medicine, etc. In addition, it offers power electronic solutions, including AC and DC power, network integrated control and monitoring, integrated power racks, and network management systems for passive telecom infrastructure; and battery management systems, as well as renewable energy solutions using hybrid solar PV, wind, geothermal, and fuel cell energy sources. Further, the company provides telecom network solutions, including feasibility studies, choice of media survey, design, planning, engineering supply, laying of optical fiber cables, installation, integration, commissioning, and network operations and maintenance services. Additionally, it offers network design, equipment supply, installation and commissioning, network integration, and post deployment warranty and AMC support for metro lines and mainline railways, as well as dedicated railway freight corridors. The company also offers various solutions, including communication/IT/telecom infrastructure, data center, disaster recovery and management, security, surveillance, traffic management, and citizen/mobile applications, as well as power, water, waste, and other utility managements. The company was formerly known as Himachal Futuristic Communications Limited and changed its name to HFCL Limited in October 2019. HFCL Limited was founded in 1987 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "HOVS.NS": {
        "short_name": "HOV SERVICES LTD",
        "long_name": "HOV Services Limited",
        "summary": "HOV Services Limited, together with its subsidiaries, provides software and information technology enabled services in India and internationally. It offers software development, maintenance, and support services; BPO services; and data entry services. The company was founded in 1989 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "IFBIND.NS": {
        "short_name": "IFB INDUSTRIES LTD",
        "long_name": "IFB Industries Limited",
        "summary": "IFB Industries Limited, together with its subsidiaries, manufactures and trades in home appliances primarily in India. It offers domestic washing machines, microwave ovens, domestic and industrial dishwashers, clothes dryers, and modular kitchens; kitchen appliances, such as hobs, chimneys, and built-in ovens; air conditioners; and industrial washing systems, including dry cleaning and other finishing equipment. The company also provides a range of parts and accessories for motor vehicles, etc.; and fine blanked components and cold rolled steel sheets, as well as tools and related machine tools, such as straighteners, decoilers, strip loaders, and others. In addition, it exports its products. The company was formerly known as Indian Fine Blanks Limited. IFB Industries Limited was founded in 1974 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "INDOSOLAR.NS": {
        "short_name": "INDOSOLAR LTD",
        "long_name": "Indosolar Limited",
        "summary": "Indosolar Limited is under corporate insolvency resolution process. Previously, it was engaged in the manufacture and sale of solar photovoltaic cells. The company was incorporated in 2005 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "INFIBEAM.NS": {
        "short_name": "INFIBEAM AVENUES L",
        "long_name": "Infibeam Avenues Limited",
        "summary": "Infibeam Avenues Limited, a digital payment and e-commerce technology company, provides digital payment solutions, data center infrastructure, and software platforms for businesses and governments to execute e-commerce transactions. The company offers CCAvenue, an online payment gateway to merchants to accept payments through net-banking, credit cards, debit cards, digital wallets, and UPI. It also provides BillAvenue, an online bill payment platform; ResAven, a central reservation system that offers hotel reservation services; and Government eMarketplace, which is the national public procurement portal of the Government of India. The company also operates Infibeam BuildaBazaar, an e-commerce marketplace that provides plug-and-play online storefront and e-commerce gateway services, including online e-commerce site creation, digital product catalogue, and promotion handling and fulfilment services. It has a collaboration with IBM India to develop, implement, and promote blockchain capabilities on LinuxONE in India. The company operates in India, the United Arab Emirates, and internationally. The company was formerly known as Infibeam Incorporation Limited and changed its name to Infibeam Avenues Limited in July 2018. Infibeam Avenues Limited was incorporated in 2010 and is based in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gandhinagar"
    },
    "INFOBEAN.NS": {
        "short_name": "InfoBeans Techno. Ltd.",
        "long_name": "InfoBeans Technologies Limited",
        "summary": "InfoBeans Technologies Limited, a software services company, develops enterprise software in India and internationally. The company offers cloud computing, migration, configuration, deployment, and sustenance; enterprise mobility; and UX and UI design services, as well as distributed storage systems, and eCommerce platforms for mobile and web. It also provides publishing services for Web, mobile, and print, including data conversion; standard publishing process automation; digital transformation and mobility; workflow and document management; and digital selling and distribution services, as well as portal for accreditation enablement. In addition, the company offers automation services, such as continuous integration and delivery, and robotic process automation; and system integration services for IT service management, and business and operations management, as well as managed and consulting services. The company was founded in 2000 and is headquartered in Indore, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Indore"
    },
    "INFY.NS": {
        "short_name": "INFOSYS LTD",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "INFY": {
        "short_name": "Infosys Limited",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "INFYN.MX": {
        "short_name": "INFOSYS LTD",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "INSPIRISYS.NS": {
        "short_name": "INSPIRISYS SOLUTIO",
        "long_name": "Inspirisys Solutions Limited",
        "summary": "Inspirisys Solutions Limited operates as an information technology services and consulting company in India and internationally. The company provides endpoint, network, application, data, and mobile security services; and risk and compliance, malware defense, and consulting services. It also offers cloud solutions, including infrastructure as a service, platform as a service, application services, and management services; and Internet of Things (IoT) solutions, such as research and development (R&D) services, IoT system integration, outsourced support of IoT system development, custom IoT solution design and development, support of IoT applications/systems, and digital transformation services. In addition, the company provides infrastructure solutions comprising data center, network, workplace transformation, tools and services automation, managed services, staff augmentation services, and digital kiosk, as well as audit, consulting, and professional services. Further, it offers product engineering and development solutions, such as banking solutions, payment suite for government, business intelligence solutions, artificial intelligence solutions, robotic process automation solutions, multi-function banking kiosks, and application development and maintenance services. Additionally, the company offers warranty management services, including onsite warranty support, return to bench, repairs and refurbishments, logistics, customized CRM software solution, extended warranty program, data recovery, and warehouse support services. It serves BFSI, telecom, government/PSU, manufacturing, and healthcare industries. The company was formerly known as Accel Frontline Limited and changed its name to Inspirisys Solutions Limited in September 2018. The company was founded in 1991 and is based in Chennai, India. Inspirisys Solutions Limited is a subsidiary of CAC Holdings Corporation.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "INTELLECT.NS": {
        "short_name": "INTELLECT DESIGN A",
        "long_name": "Intellect Design Arena Limited",
        "summary": "Intellect Design Arena Limited provides software development and related services for banking, insurance, and other financial services in India and internationally. The company offers platforms and products, such as iGTB, a digital transaction banking platform that provides digital payment, liquidity, supply chain finance, and trade products; iGCB, a full-spectrum suite of consumer banking products comprising digital core, digital lending, digital wealth, and quantum central banking; iRTM, a risk, treasury, and markets platform that supports straight-through processing (STP) and various asset classes over a configurable and scalable platform; Intellect SEEC, an insurance solution; and Intellect Wealth Qube, a digital wealth management solution with STP from front and mid to back office for private and commercial banks, wealth and asset management firms, advisory firms, brokers/dealers, trusts, and IFAs to service various client segments. It also develops, sells, and licenses products, as well as implements customization support based on the contracts with its customers. The company was formerly known as Fin Tech Grid Limited. Intellect Design Arena Limited was incorporated in 2011 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "INTENTECH.NS": {
        "short_name": "INTENSE TECHNOLOGI",
        "long_name": "Intense Technologies Limited",
        "summary": "Intense Technologies Limited, together with its subsidiaries, engages in the development of software products for data analytics in India and internationally. The company develops UniServe NXT, a rapid enterprise application production platform that enhances customer experience. Its platform includes solutions, such as digitalization of customer onboarding; customer communications management solution; customer engagement solution; customer identity management solution that eliminates data redundancy and creates a single identity for each customer; B2B customer experience management solution; order management modernization solution; and omni-channel customer experience solution. The company serves communications and media, telecom, banking and financial services, insurance, energy and utilities, and manufacturing sectors, as well as governments. Intense Technologies Limited was incorporated in 1990 and is headquartered in Secunderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Secunderabad"
    },
    "IOY.F": {
        "short_name": "INFOSYS LTD. ADR/1 IR5",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "IOY.VI": {
        "short_name": "INFOSYS LTD-SP ADR",
        "long_name": "Infosys Limited",
        "summary": "Infosys Limited, together with its subsidiaries, provides consulting, technology, outsourcing, and next-generation digital services in North America, Europe, India, and internationally. It provides application development and management, independent validation, product engineering and management, infrastructure management, enterprise application management, and support and integration services. The company's products and platforms include Finacle, a core banking solution; Edge suite of products; Infosys Nia, an artificial intelligence platform; Infosys McCamish - an insurance platform; Wingspan, a customizable learning platform; Stater mortgage servicing platform; Panaya automation suite; and Skava, an e-commerce suite. The company serves clients in the financial services and insurance, life sciences and healthcare, manufacturing, retail, consumer packaged goods and logistics, hi-tech, communications, telecom OEM, media, energy, utilities, resources, services, and other industries. Infosys has strategic partnership with Rolls-Royce for aerospace engineering. The company was formerly known as Infosys Technologies Limited and changed its name to Infosys Limited in June 2011. Infosys Limited was founded in 1981 and is headquartered in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "ITI.NS": {
        "short_name": "INDIAN TEL IND(ITI",
        "long_name": "ITI Limited",
        "summary": "ITI Limited engages in the manufacture, sale, and servicing of telecommunication equipment primarily in India. Its telecom products and solutions include switching, transmission, access, and subscriber premises equipment. The company also offers energy meters, mini personal computers, 3D printing products, bank automation products, gigabit passive optical network OLT and ONT products, PCM multiplexers, ruggedized telephones for defense forces, smart and banking cards, set top boxes, hand held terminals for smart card authentication, and Wi-Fi equipment. In addition, it provides encryption devices for defense, solar power modules, switched mode power supply systems, Internet of Things products, radio modems, and AN rack hardware products, as well as HDPE ducts, OFC cables, solar panels, smart energy meters, and payment cards. Further, the company trades in optical transport network products, such as DWDM; managed leased line network products; signaling point network products; IP/MPLS routers and switches; network management system solutions; microwave and satellite communication equipment; next generation network equipment; and information technology products and solutions. Additionally, it offers installation, commissioning, operation, and maintenance services; electronic contract manufacturing services; mechanical fabrication services; printed circuit board manufacturing services; data center hosting services; EMI/EMC and environmental testing of electronic products; three dimensional printing services; mechanical fabrication services; and component screening services. ITI Limited was founded in 1948 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "IZMO.NS": {
        "short_name": "IZMO LIMITED",
        "long_name": "IZMO Limited",
        "summary": "IZMO Limited offers hi-tech automotive e-retailing solutions in the United States, Mexico, Europe, and Asia. The company provides Internet solutions to the automotive industry through websites, such as izmocars.com, govirtual.com, izmocars.eu, izmocars.fr, and carazoosolutions.com. It also operates websites for various businesses and professions that include izmoweb.com and izmoweb.in. In addition, the company offers interactive media solutions for the automotive industry through automotive images and animation, virtual brochures, video brochures with voice over, and CGI graphics through websites, such as izmostock.com and izmostudio.com for stock photography, as well as izmomedia.com, izmotion.com, and izmofx.com for interactive media solutions. Further, it provides enterprise products that offers packaged product solutions to meet enterprise requirements in connectivity, security, and interoperability. The company was formerly known as Logix Microsystems Limited and changed its name to IZMO Limited in 2014. IZMO Limited was founded in 1995 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "JCHAC.NS": {
        "short_name": "JOHNSON CONTROLS-H",
        "long_name": "Johnson Controls-Hitachi Air Conditioning India Limited",
        "summary": "Johnson Controls-Hitachi Air Conditioning India Limited manufactures and trades in various window and split air conditioners, chillers, refrigerators, air purifiers, and variable refrigerant flow systems in India. It offers inverter and fixed speed split, packaged, and window air conditioners; ducted and ductless air conditioners; water and air cooled screw chillers, and centrifugal chillers; space makers; and side by side and slim line refrigerators. The company also provides accessories and spare parts for its products, as well as undertakes after sales services, including repair and maintenance. It offers its products under the Hitachi brand. The company's distribution network consists of 5 regional offices, 21 branch offices, and approximately 10,000 sales points and 1,400 after sales service providing partners. It also exports its products to Nepal, Bhutan, Sri Lanka, Maldives, Indonesia, Vietnam, the United Arab Emirates, Qatar, Oman, Bahrain, Iraq, Kuwait, and Saudi Arabia. The company was formerly known as Hitachi Home & Life Solutions (India) Limited and changed its name to Johnson Controls-Hitachi Air Conditioning India Limited in September 2016. The company was founded in 1984 and is headquartered in Kadi, India. Johnson Controls-Hitachi Air Conditioning India Limited is a subsidiary of JCHAC India Holdco Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kadi"
    },
    "JUMPNET.NS": {
        "short_name": "Jump Networks Limited",
        "long_name": "Jump Networks Limited",
        "summary": "Jump Networks Limited provides information technology and advertisement services. The company offers JumpTalk, a Voice over Internet Protocol (VoIP) service that enables users to make high-quality audio and video calls; JUMP, a device that provides multitude of digital services; Edmission, a digital education platform that offers education for learners and educators; and GAIA Agritech, a technology used by farmer to produce organic milk and eggs. It is also involved in the resale of IT products. The company was formerly known as Iris Mediaworks Limited and changed its name to Jump Networks Limited in May 2019. Jump Networks Limited was incorporated in 1992 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "KAVVERITEL.NS": {
        "short_name": "KAVVERI TELECOM PR",
        "long_name": "Kavveri Telecom Products Limited",
        "summary": "Kavveri Telecom Products Limited designs, develops, manufactures, and sells radio frequency (RF) products and antennas for telecom, defense, and space applications in India and internationally. The company provides base station, microwave, broadband in-building, and other customized design antennas; RF components, including co-location interference filters, duplexers, combiners, diplexers, and triplexers; and capacity enhancers consisting of tower mount amplifiers and boosters, and multi-carrier power amplifiers. It also offers coverage products, such as multi-band antennas, power splitters, couplers, and repeaters; coverage solutions, including neutral host BOL and repeater based solutions for home, office, hospital buildings, and shopping malls; and RF line products comprising feeder cables, connectors, jumper cables, lightning arrestors, feeder clamps, grounding kits, etc. In addition, the company provides defense and space products, such as MIL grade channelizers; coax and WG components; broadband transceivers, LNBs, and PAs; standard and wideband antennas; filters, duplexers, and diplexers; passive components; and NATO band high gain military antennas. Further, Kavveri Telecom Products Limited offers contract-manufacturing services. It provides solutions for telecom manufacturers, service providers, and users. The company was formerly known as Kaveri Telecoms Limited and changed its name to Kavveri Telecom Products Limited in August 2003. Kavveri Telecom Products Limited was founded in 1991 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "KELLTONTEC.NS": {
        "short_name": "KELLTON TECH SOLU",
        "long_name": "Kellton Tech Solutions Limited",
        "summary": "Kellton Tech Solutions Limited provides digital transformation, ERP, and other IT services worldwide. The company offers agile software development, digital commerce and marketing, digital integration, outsourced product development, platform modernization, professional, research and development, technology consulting, and testing and automation services. It also provides digital transformation solutions, including artificial intelligence and machine learning, augmented and virtual reality, block chain, data science and analytics, design studio, enterprise mobility, Internet of Things, and robotic process automation. In addition, the company offers Kellton4Media, a solution that gives control for ad publishing, story filing, and content editing; KLGAME, a location based gamification, analytics, and rich messaging engine platform, which sends text, audio, and video notifications to customers' smartphones or wearable devices; Optima, an IoT enabled digital oilfield analytics platform; and tHRive, a human capital management solution, which engages in real-time staff tracking, performance governance, and seamless operations. It serves customers in various industries comprising retail, travel, e-commerce, education, hospitality, manufacturing, consumer goods, logistics, supply-chain management, lifestyle, non-profits and banking, financial services, and insurance. The company was formerly known as VMF Soft Tech Limited and changed its name to Kellton Tech Solutions Limited in November 2012. Kellton Tech Solutions Limited was incorporated in 1993 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "KERNEX.NS": {
        "short_name": "KERNEX MICROSYSTEM",
        "long_name": "Kernex Microsystems (India) Limited",
        "summary": "Kernex Microsystems (India) Limited engages in conceptualizing, designing, developing, manufacturing, installing, and maintaining of level crossing protection systems and anti-collision systems for the railroad sector. The company offers LxGuard, a level crossing protection system; TrainSHIELD, a train collision avoidance system; SAFELx, a train actuated warning device; SENTINEX, a level crossing warning system; and CASRY, a collision avoidance system for yards and terminals. It also provides KMDAX, a multi section digital axle counting system; ACD, an anti-collision device; ATRW, an automatic timing (recording) device for railway wagons; KTPIS, a train passenger information system; and BCPS2440, a battery charger and power supply product. In addition, the company provides product development, electronic product design, embedded software design, electronic manufacturing, ESS testing, offshore development, quality control, and training services. It operates in India, Egypt, South Africa, Sri Lanka, and internationally. Kernex Microsystems (India) Limited was founded in 1991 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "KPITTECH.NS": {
        "short_name": "KPIT TECHNOLOGIES",
        "long_name": "KPIT Technologies Limited",
        "summary": "KPIT Technologies Limited, a technology company, provides engineering, embedded software, artificial intelligence, and digital solutions for automobile and mobility industries in the Americas, the United Kingdom, Europe, and internationally. The company offers autonomous driving and ADAS solutions, including system engineering, functional safety, multicore engineering, feature development, annotation and labeling, semantic segmentation, multi sensor, data analytics, feature validation, and virtual and closed loop simulation solutions; and electric and conventional powertrain solutions comprising production software/function development, model based system engineering, and verification and validation solutions. It also operates vehicle infotainment platform and infotainment connectivity platform for connected vehicles; and K-DCP engineering toolchain and K-DCP aftersales suite to provide vehicle diagnostic solutions, as well as K-DCP connected diagnostics solutions. In addition, the company offers integration, and verification and validation services; MCAL and complex device driver development services; and micro controllers supported services, as well as operates AUTOSAR platform. Further, it provides mechatronics solutions, including new product development for NDP/sub systems ownerships, wiring harness, and mechatronics/smart interiors; epowertain solutions for battery packaging, thermal management, and E&E packaging; and knowledge based engineering solutions for design automation-mechanical and electrical, and digital process automation. The company was formerly known as KPIT Engineering Limited and changed its name to KPIT Technologies Limited in March 2019. The company was incorporated in 2018 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "LTI.NS": {
        "short_name": "LARSEN AND TOUBRO",
        "long_name": "Larsen & Toubro Infotech Limited",
        "summary": "Larsen & Toubro Infotech Limited, a technology consulting and digital solutions company, provides information technology services and solutions in India, North America, Europe, the Asia Pacific, and internationally. The company operates through Banking, Financial Services & Insurance; Manufacturing; Energy & Utilities; HighÂ\u0096Tech, Media & Entertainment; and CPG, Retail, Pharma & Others segments. It offers application development, maintenance and outsourcing, enterprise solution, infrastructure management, testing, digital solution, and platform-based solution services. Larsen & Toubro Infotech Limited has an alliance with IBM to help businesses transform their operations through hybrid cloud adoption. The company was formerly known as L&T Information Technology Limited and changed its name to Larsen & Toubro Infotech Limited in June 2001. The company was incorporated in 1996 and is based in Mumbai, India. Larsen & Toubro Infotech Limited is a subsidiary of Larsen & Toubro Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "LTTS.NS": {
        "short_name": "L&T TECHNOLOGY SER",
        "long_name": "L&T Technology Services Limited",
        "summary": "L&T Technology Services Limited provides engineering, research, and development (ER&D) services in North America, Europe, India, and internationally. Its Transportation segment offers engineering services and solutions to transportation industry that includes original equipment manufacturers (OEM) and Tier 1 suppliers in automotive, trucks and off-highway vehicles, aerospace, and rail industries. Its Industrial Products segment helps OEM customers in building automation, home and office products, energy, process control, and machinery sectors. This segment offers product development counsel, software expertise, electronics, connectivity, mechanical engineering, industrial networking protocols, user interface/user experience, test frameworks, and enterprise control solutions. Its Telecom & Hi-Tech segment provides digital engineering services, such as the cloud, Internet of Things (IoT), artificial intelligence, data analytics, and others. The company's Plant Engineering segment provides engineering services in E/EPCM, engineering reapplication and global rollouts, plant sustenance and management, and regulatory compliance engineering, as well as to chemical, consumer packaged goods, and energy and utility sector clients. The company's Medical Devices segment delivers solutions in diagnostics, patient mobility services, musculoskeletal services, life sciences, surgical services, cardiovascular, home healthcare, and general medical to medical device OEMs. L&T Technology Services Limited has a strategic partnership with Exponential-e Ltd. to jointly offer workplace transformation solutions. The company was formerly known as L&T Technology and Engineering Services Company Limited and changed its name to L&T Technology Services Limited in July 2012. L&T Technology Services Limited was incorporated in 2012 and is headquartered in Vadodara, India. L&T Technology Services Limited is a subsidiary of Larsen & Toubro Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Vadodara"
    },
    "MAJESCO.NS": {
        "short_name": "MAJESCO LIMITED",
        "long_name": "Majesco Limited",
        "summary": "Majesco Limited, together with its subsidiaries, provides cloud-based software solutions for the insurance industry in North America, Europe, and internationally. The company offers Property & Casualty Core Suite that provides core system capabilities, including policy, billing, and claims for property and casualty personal, commercial, workers' compensation, and specialty insurance; and L&A and Group Core Suite insurance software for individual, group, and voluntary benefits insurance. It also provides LifePlus Solutions for individual life, pensions, and wealth management; insurance distribution management software; Data and Analytics Platform, a business intelligence and analytics tool for claims, underwriting, policy, and billing functions; and Digital Insurance platform, a digital and micro-services based cloud-only platform solution. Majesco Limited offers software solutions for property, casualty and life, and annuity providers. In addition, it provides cloud implementation, cloud subscription, professional, and support and maintenance services. The company was formerly known as Minefields Computers Limited and changed its name to Majesco Limited in June 2015. Majesco Limited was incorporated in 2013 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "MASTEK.NS": {
        "short_name": "MASTEK",
        "long_name": "Mastek Limited",
        "summary": "Mastek Limited, together with its subsidiaries, provides enterprise technology solutions. The company offers business and technology services comprising application development, ERP and cloud migration, digital commerce, application support and maintenance, business intelligence and analytics, agile consulting, testing and assurance, and legacy modernization. It also provides data warehousing and enterprise digital transformation services. The company serves customers spanning government, healthcare, defense, retail, and financial services sectors in India, the United Kingdom, the Middle East, the Asia Pacific, the United States, and internationally. Mastek Limited was founded in 1982 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "MEGASOFT.NS": {
        "short_name": "MEGASOFT LTD",
        "long_name": "Megasoft Limited",
        "summary": "Megasoft Limited, together with its subsidiaries, provides information technology services focusing on telecommunication domain primarily in the United States, Canada, South America, Latin America, the Middle East, Africa, and the Asia-Pacific. The company engages in the computer programming, consultancy, and related activities. It offers mobile infrastructure solutions, including XIUS mobile services platform (MSP), which provides end-to-end infrastructure for 3G, 4G, 5G mobile operators, MVNE/mobile virtual network operators, converged broadband 4G/LTE service providers, mobile operator wholesale departments, and machine-to-machine/Internet of Things (IoT) service providers; XIUS MSP that offers a suite of infrastructure options, which enable real-time rating and billing; and Megasoft that enables service providers to navigate mobile ecosystems. The company also provides mobile payment technologies and services, including platforms and applications, e-wallets, and mobile and digital currencies. In addition, it offers analytics, cloud, cyber security, mobile enablement, and IoT services. Megasoft Limited was founded in 1994 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "MELSTAR.NS": {
        "short_name": "MELSTAR INFORMATIO",
        "long_name": "Melstar Information Technologies Limited",
        "summary": "Melstar Information Technologies Limited, a software services company, provides various information technology (IT) solutions primarily to banking, insurance, government, education, healthcare, and IT sectors in India and internationally. It offers application development services; application management, maintenance, and support services; packaged application services, including consulting, implementation, application maintenance and support, upgrades, and testing in the areas of enterprise resource planning; testing and applications modernization services; and other technology services. In addition, the company provides man power supply services. Melstar Information Technologies Limited was incorporated in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "MIC.NS": {
        "short_name": "MIC ELECTRONICS LT",
        "long_name": "MIC Electronics Limited",
        "summary": "MIC Electronics Limited designs, develops, manufactures, and sells LED video displays, and electronic and telecommunication equipment worldwide. The company offers indoor displays, such as indoor video screens and digital posters; outdoor displays, including outdoor video walls, digital billboards, digital posters, ticker displays, and perimeter displays; mobile displays comprising trailer and truck displays; and application-specific displays, such as passenger information displays and infrastructure equipment for digital theme parks. It also provides indoor lighting products comprising area lights, down lights, tube lights, and bulbs; outdoor lighting products, such as street, parking, and industrial lights; solar lighting products, including street and home lighting products; and portable products, such as lanterns, home lights, and angels. The company's indoor/outdoor/mobile LED video displays are used in sports stadiums, transportation hubs, digital theatres and theme parks, advertisements, and public information displays. MIC Electronics Limited was founded in 1988 and is headquartered in Hyderabad, India. MIC Electronics Limited is in Corporate Insolvency Resolution Process under the Insolvency and Bankruptcy Code 2016.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "MINDTECK.NS": {
        "short_name": "MINDTECK(INDIA)",
        "long_name": "Mindteck (India) Limited",
        "summary": "Mindteck (India) Limited provides product engineering and information technology (IT) services in the United States, India, and internationally. The company offers smart grid communication services, OEM solutions, data center and in-premises energy management services, and IT application solutions; embedded design services, embedded verification and validation services, and system solutions; product lifecycle management (PLM) consulting, advisory, system implementation and administration, system validation/testing, program management, and system integration/data migration services; and SAP-based solutions. It also provides mobile strategy consulting, user experience, design and development, and mobility testing services; hybrid cloud appliance, interoperable cloud storage, and business data analytics services; business intelligence, data/information management, and big data services, as well as advanced analytics and analytics on unstructured data; and IT security services. In addition, it offers system and integration, specialized, software product, and cloud based testing services, as well as test strategy, automation, and infrastructure services; product engineering, re-engineering, and sustenance services; data center transformation and IT infrastructure management services; custom application development, application maintenance and management, legacy modernization, and performance engineering and enhancement services; application and enterprise systems integration, business process management, packaged application, and service oriented architecture services; and smart city solutions. Further, it sources and deploys IT talent. It serves start-ups, universities, and government entities. The company was formerly known as Hinditron Informatics Limited and changed its name to Mindteck (India) Limited in September 1999. The company was founded in 1991 and is headquartered in Bengaluru, India. Mindteck (India) Limited is a subsidiary of Embtech Holdings Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "MINDTREE.NS": {
        "short_name": "MINDTREE LTD",
        "long_name": "Mindtree Limited",
        "summary": "Mindtree Limited provides digital transformation and technology services in India, the United States, Canada, Continental Europe, the United Kingdom, and internationally. It operates in four segments: Retail, Consumer Packaged Goods and Manufacturing; Banking, Financial Services and Insurance; Technology, Media and Services; and Travel and Hospitality. The company offers services in the areas of agile, analytics and information management, application development and maintenance, business process management, business technology consulting, cloud, digital business, independent testing, infrastructure management, mobility, product engineering, and SAP services. It also provides Gladius connected buildings platform, an Internet of Things platform; and ShotClasses, a mobile based micro-learning platform for enterprises. The company serves the banking, capital market, consumer packaged goods, consumer technology, education, enterprise technology, insurance, manufacturing, media and entertainment, retail, transportation and logistics, and travel and hospitality industries. The company was formerly known as Mindtree Consulting Limited and changed its name to Mindtree Limited in March 2008. Mindtree Limited was founded in 1999 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "MPHASIS.NS": {
        "short_name": "MPHASIS LTD",
        "long_name": "Mphasis Limited",
        "summary": "Mphasis Limited operates as an information technology solutions provider that specializes in cloud and cognitive services worldwide. The company operates through Banking and Capital Market, Insurance, Information Technology, Communication and Entertainment, and Emerging Industries segments. It offers application, blockchain, business process, cloud, cognitive, cyber security, DevOps, digital, product engineering, infrastructure, and enterprise automation, as well as governance, risk, and compliance services. The company serves customers operating in the banking and capital, insurance, and payment markets, as well as other industries, including communications, energy and utilities, healthcare, life sciences, logistics, manufacturing, and travel and transportation. It has a partnership agreement with R3 to develop a blockchain-enabled payment solutions. Mphasis Limited was incorporated in 1992 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "NELCO.NS": {
        "short_name": "NELCO",
        "long_name": "Nelco Limited",
        "summary": "Nelco Limited provides systems and solutions in the areas of very small aperture terminals (VSAT) connectivity, and integrated security and surveillance. It offers VSAT satellite communication services for renewable energy, enterprise, oil, energy, and gas sectors, as well as to bank ATM and branches. The company is also involved in the design, supply, installation, and maintenance of integrated security and surveillance solutions for application in industrial plants, power stations, broadcasting stations, telecommunications stations, airports, railways, seaports, and borders. It serves businesses and government institutions. The company was founded in 1940 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Navi Mumbai"
    },
    "NEWGEN.NS": {
        "short_name": "NEWGEN SOFTWARE",
        "long_name": "Newgen Software Technologies Limited",
        "summary": "Newgen Software Technologies Limited provides software products and solutions in India, Australia, Europe, the Middle East, Africa, the Asia Pacific, and the United States. The company offers enterprise content management suite, which enables end-to-end management of enterprise content, from capture to disposition; business process management suite that provides a platform to drive enterprise-wide digital transformation; and customer communication management suite, a communication platform, which enables to share of customers' wallet by tapping various cross-sell/up-sell opportunities across touch points, such as email, SMS, Web, and print. It serves various industries, which include banking and financial services, insurance, healthcare, government, shared services, utilities, pharmaceuticals, cross, and legal. The company was founded in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "NITIRAJ.NS": {
        "short_name": "Nitiraj Engineers Ltd",
        "long_name": "Nitiraj Engineers Limited",
        "summary": "Nitiraj Engineers Limited manufactures and sells a range of electronic weighing scales and systems, currency counting machines, and electronic fare meters for industrial and domestic consumption. It offers jewelry, tabletop, price computing, piece counting, platform, hanging, industrial weighing, baby weighing, person weighing, mother and child weighing, adult weighing, body mass index, and kitchen scales; and special application indicators, currency counting machines, taxi and rickshaw fare meters, and home and hotel automation products, as well as accessories. The company supplies its products under the Phoenix brand name through a network of dealers to customers in India and internationally. Nitiraj Engineers Limited was founded in 1989 and is based in Dhule, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Scientific & Technical Instruments",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Dhule"
    },
    "NUCLEUS.NS": {
        "short_name": "NUCLEUS SOFTWARE",
        "long_name": "Nucleus Software Exports Limited",
        "summary": "Nucleus Software Exports Limited provides software solutions in India, the Far East, South East Asia, Europe, the Middle East, Africa, Australia, and internationally. Its products include FinnOne Neo, a lending solution designed to support retail, corporate, and Islamic sectors comprising customer acquisition system, a loan origination software; loan management system, a bank loan management solution; web based and workflow driven solution that allows financial institutions to manage, monitor, and control the delinquent loan accounts; enterprise content management that automates the document management processes; finance against securities that establishes credit lines to individuals and corporate against the pledging of financial securities; and lending analytics, a solution for decision making. The company also offers FinnOne Neo digital portal for loan self-sourcing; digital channels that enable banks and financial services companies to provide digital lending on mobile and web portals; and lending mobility suite. In addition, it provides FinnAxia, an integrated global transaction banking solution comprising global receivables, global payments, global liquidity management, and virtual account management; FinnAxia digital compass, business internet banking, and advisory services; and FarEdge anomaly detector to detect fraudulent and dual transactions. Further, the company offers project management, consulting, training and testing, support, and analytics; application development and management, digital transformation, data management and analytics, mobile and Web application, and verification and validation; and managed infrastructure services comprising 24x7 help desk, network, end user computing and end point security, infrastructure application support, and data center. It serves retail, corporate, and Islamic banking, as well as other sectors. Nucleus Software Exports Limited was founded in 1986 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "OFSS.NS": {
        "short_name": "ORACLE FIN SERVICE",
        "long_name": "Oracle Financial Services Software Limited",
        "summary": "Oracle Financial Services Software Limited provides information technology (IT) solutions and business processing services to the financial services industry worldwide. It operates through three segments: Product Licenses and Related Activities, IT Solutions and Consulting Services, and Business Processing Outsourcing Services. The company offers Oracle FLEXCUBE, a banking platform for retail, corporate and investment banking, consumer lending, asset management, and investor servicing with payments; Oracle Banking Digital Experience, a digital transformation providing digital account and loan origination, digital wallet, and mobile payments; Oracle Banking APIs that enables banks to build partnerships with third-party technology organizations; and Oracle Banking Platform, a suite of business applications for banks; It also provides Oracle Banking Enterprise Product Manufacturing, a suite of Product master data management capability for the banking domain; Oracle Banking Enterprise Collections platform; Oracle Banking Enterprise Originations platform; Oracle Banking Corporate Lending, an end-to-end digitally enabled lending solution; and Oracle Financial Services Analytical Applications Infrastructure, Oracle Banking Liquidity Management, and Oracle Banking Virtual Account Management solutions. In addition, the company offers Oracle Banking Corporate Lending Process Management, Oracle Banking Credit Facilities Process Management, Oracle Banking Enterprise Limits and Collateral Management, Oracle Banking Trade Finance Process Management, Oracle Banking Payments, Oracle Financial Services Lending and Leasing, and Oracle FLEXCUBE Investor Servicing solutions. Further, it provides end-to-end consulting partnership, and business and technology solutions; and business process outsourcing services. The company was incorporated in 1989 and is based in Mumbai, India. Oracle Financial Services Software Limited is a subsidiary of Oracle Global (Mauritius) Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Infrastructure",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ONWARDTEC.NS": {
        "short_name": "ONWARD TECHNO",
        "long_name": "Onward Technologies Limited",
        "summary": "Onward Technologies Limited provides mechanical engineering design and IT consulting services in India and internationally. The company offers product engineering, manufacturing engineering, mechanical engineering, simulation engineering, and engineering change management services; electronics and embedded systems; electrical and electronics solutions; and technical publications. It also provides IT consulting services comprising software product engineering, big data and analytics, application development and maintenance, and infrastructure support services; and enterprise software, enterprise mobility, and digital transformation solutions, as well as social, mobile, analytics, and cloud solutions. In addition, the company offers product sales and support services; staffing services, such as contract-to-hire; and robotic business process automation and enterprise managed services for infrastructure, applications, and databases. It primarily serves automotive; aerospace; off highway and agri equipment; industrial equipment and machinery; medical equipment and healthcare; banking and financial services; e-governance and education; aerospace; and insurance industries. The company was founded in 1991 and is based in Mumbai, India. Onward Technologies Limited is a subsidiary of Onward Network Technologies Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "OPTIEMUS.NS": {
        "short_name": "OPTIEMUS INFRACOM",
        "long_name": "Optiemus Infracom Limited",
        "summary": "Optiemus Infracom Limited trades in mobile handsets and mobile accessories in India and internationally. The company provides Blackberry, Zen, and Kult mobile devices; OptiSafe, a technology-based personal security and safety devices; and smartphone accessories under the Molife brand names, as well as engages in booking of hotel rooms through online portal. It also rents immovable property. The company was formerly known as Akanksha Cellular Limited and changed its name to Optiemus Infracom Limited in June 2011. Optiemus Infracom Limited was incorporated in 1993 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronics & Computer Distribution",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "PALREDTEC.NS": {
        "short_name": "PALRED TECHNOLOGIE",
        "long_name": "Palred Technologies Limited",
        "summary": "Palred Technologies Limited engages in the e-commerce, information technology, and media and entertainment businesses in India. It offers middleware and master data management services. The company also operates LatestOne.com, an e-commerce Website which sells tech and mobile accessories such as Bluetooth speakers and headsets, cables, power banks, headsets, smart watches, fashion accessories, etc.; Saverable.com for banking accounts, insurance schemes, loan offers, and various other products; and Great indian t.com, an online entertainment site for uploading videos. In addition, it offers system and process solutions for media and entertainment businesses. The company was formerly known as Four Soft Technologies Limited and changed its name to Palred Technologies Limited in January 2014. Palred Technologies Limited was founded in 1999 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "PANACHE.NS": {
        "short_name": "Panache Digilife Limited",
        "long_name": "Panache Digilife Limited",
        "summary": "Panache Digilife Limited manufactures, distributes, sells, and services information, communication and technology, and internet of thing devices in India and internationally. The company provides smart compute devices, such as squair, clair, flair AIO, air, desair, and desktop PCs, as well as laptops and NUCs; and POS terminals, thermal printers, cash drawers, and touch monitors, as well as consumer light-emitting diode televisions, commercial signage displays, and AV solutions. It also offers smart education solutions, such as OPS, IFPD, AI4YOUTH, and squair PCs for classroom learning and teaching; healthy living solutions, including Aquatatva that provides healthy water, and IoT ready smart metering solution to monitor water consumption patterns remotely; and electronic signature solutions, such as signature pads, pen displays, multi authentication devices, and pen tablets. In addition, the company provides queue management system, a branch of automation system that dynamically manages the customer queues in real time. The company was formerly known as Vardhaman Technology Limited and changed its name to Panache Digilife Limited in February 2017. Panache Digilife Limited was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "PARACABLES.NS": {
        "short_name": "PARAMOUNT COMMUNIC",
        "long_name": "Paramount Communications Limited",
        "summary": "Paramount Communications Limited, together with its subsidiaries, manufactures and sells wire and cables to public and private sector organizations in India and internationally. The company provides power cables, including high tension and low tension power and aerial bunch cables; screened and unscreened type control cables; instrumentation cables for process control, A/D converters, and other microprocessor based instrumentation circuits; and thermocouple extension and compensating cables for connecting thermocouples to control and measurement devices. It also offers telecom cables comprising optical fiber, jelly filled, switched board, fiber to the home, and installation cables, as well as buried service and jumper wires. In addition, the company provides underground railway signaling and quad axle counter cables, and specialized instrumentation cables for underground and elevated metro projects; fire survival, XLPE, multicore round, solar, PTFE, and special cables; and building and PVC wires. Further, it offers turnkey services for construction, design, supply, engineering, and installation testing and commissioning. The company serves power, railways, telecom, IT and communications, construction, defense, space research, electronics, export, specialized EPC, renewable, and oil and gas sectors. Paramount Communications Limited was founded in 1955 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "PERSISTENT.NS": {
        "short_name": "PERSISTENT SYSTEMS",
        "long_name": "Persistent Systems Limited",
        "summary": "Persistent Systems Limited provides software products, services, and technology solutions. The company operates through three segments: Banking, Financial Services and Insurance (BFSI), Healthcare & Life Sciences, and Technology Companies and Emerging Verticals. It provides Persistent Digital Banking and Credit Union Solution, and Loan Originating Solution; Digital Insurance Solutions, comprising claims lifecycle management automation, CX transformation for insurance, and integrated wellness and care solution for insurance; and Persistent trade finance automation. The company also offers Persistent Patient Mobile App for enhanced efficiency, patient experience, and care co-ordination; digital care pathways; Denials Management for measuring performance reimbursement, identifying payment errors, and streamlining collections; and digital device and diagnostics, digital lab, and research collaboration. Additionally, it provides product life management and systems engineering solutions; and digital manufacturing solutions comprising Dassault Planning and Optimization Software and Dassault manufacturing and operations software. Further, the company offers Network Assurance and Performance Management, and 5G AI Operations and Management solutions; and Mobile Edge Cloud Accelerators, Network API Optimization, and digital product engineering service, as well as provides software innovation and engineering services. It serves customers in the banking, financial services, insurance, health care and life science, software and hi-tech, and telecom and media sectors. It has operations in India, South Africa, Japan, Israel, Malaysia, Singapore, Sri Lanka, Australia, England, France, Germany, Ireland, the Netherlands, Switzerland, Canada, Mexico, and the United States. The company was incorporated in 1990 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "PGEL.NS": {
        "short_name": "PG ELECTROPLAST LT",
        "long_name": "PG Electroplast Limited",
        "summary": "PG Electroplast Limited provides electronic manufacturing and plastic injection molding services for original equipment manufacturers in India and internationally. The company manufactures plastic parts for a range of consumer electronic products, such as air conditioners, colour TV, DVD players, air coolers, refrigerators, automotive plastic, sanitary ware, washing machines, etc.; assembles AC-IDU, including heat exchange part for Tier-I OEMs; and printed circuit board for various applications, which include flat LED and smart TVs, energy meters, set top boxes, and multimedia speakers, as well as mobile phones, tablets, and refurbishment. It also offers small, medium, big sized, high-precision, and surface critical injection molded components; polymers for various hollow plastic products; moldings of thermoset polymers; and small and medium sized tools for applications in the automotive, white goods, home appliances, lighting, and electrical equipment industries. In addition, the company provides end-to-end assembly for products, such as washing machines, air coolers, and UF toilet seats, as well as owns and operates PU paint shop. The company was founded in 2003 and is based in Greater Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Greater Noida"
    },
    "POWERINDIA.NS": {
        "short_name": "ABB POWER PRODUCTS",
        "long_name": "ABB Power Products and Systems India Limited",
        "summary": "ABB Power Products and Systems India Limited develops, engineers, manufactures, and sells products, systems, and projects for electricity transmission and related activities in India and internationally. The company's products include a range of high-voltage products, transformers, grid automation and integration products, high-voltage direct current products, and power quality products and systems. The company was incorporated in 2019 and is headquartered in Bengaluru, India. ABB Power Products and Systems India Limited is a subsidiary of ABB Asea Brown Boveri Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Electronic Components",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "QUICKHEAL.NS": {
        "short_name": "QUICK HEAL TECHNOL",
        "long_name": "Quick Heal Technologies Limited",
        "summary": "Quick Heal Technologies Limited provides security software products and solutions to consumer, small businesses, government establishments, and corporate houses in India and internationally. The company offers cloud-based products under the Quick Heal and Seqrite brands. It also offers technical service and after-sales support services. The company sells its products through a network of service providers, system-integrators, resellers, and distributors. Quick Heal Technologies Limited was incorporated in 1995 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "QUINTEGRA.NS": {
        "short_name": "QUINTEGRA SOLUTION",
        "long_name": "Quintegra Solutions Limited",
        "summary": "Quintegra Solutions Limited does not have significant operations. Previously, it was engaged in the design and development services of software applications. The company was founded in 1994 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "RAMCOSYS.NS": {
        "short_name": "RAMCO SYSTEMS",
        "long_name": "Ramco Systems Limited",
        "summary": "Ramco Systems Limited operates as an enterprise software company in India, the Americas, Europe, APAC, the Middle East, and Africa. The company offers Ramco AviationSoftware, an enterprise-wide M&E/MRO software to address the needs of airlines, heli operators, MROs, and business aviation segments; Ramco VirtualWorks, a software meta model that captures data required to generate and deliver solutions in various technology platforms; and Ramco DecisionWorks for analytics/reporting. It also provides Ramco ERP on Cloud, a suite of products that covers enterprise functions, such as manufacturing; financial, supply chain, human capital, customer relationship, enterprise asset, and project management; process control; analytics; advanced planning and optimization; and connectors. In addition, the company offers Ramco Human Capital Management, a HR and talent management, and payroll software; and Ramco Logistics Software, a cloud based software that covers the needs of third-party logistics, freight forwarders, and parcel/courier service providers. Further, it provides computer programming, consultancy, hosting, and related services. Ramco Systems Limited was founded in 1992 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "REDINGTON.NS": {
        "short_name": "REDINGTON INDIA LT",
        "long_name": "Redington (India) Limited",
        "summary": "Redington (India) Limited provides supply chain solutions for information technology products, telecom, lifestyle, healthcare, and solar products in India and internationally. The company distributes IT hardware and software products, including consumer and commercial PCs, desktops, laptops, and MacBooks; tablets and phablets; deskjets, laserjets, and related consumables and accessories; smartphones and augmented reality/virtual reality-powered wearables; and networking, enterprise server and storage, and security products, as well as software solutions, and licensing and subscription support services. It also offers cloud consulting, migration, DevOps, integration, and security products, as well as managed services; and develops, manufactures, and markets digital printing solutions comprising printing presses, proprietary consumables, and workflow. The company is also involved in the on demand part manufacturing business that consists of SLA, SLS, multi jet printing, color jet printing, vacuum casting, direct metal printing, metal die casting, CNC machines plastic and metals, and investment casting patterns; medical technologies and solar products distribution. In addition, it provides enterprise solutions and services, such as SOC and NOC services, converged network solutions, ICT and physical security solutions, and cloud services and solutions, as well as IT consulting, storage, data center, and virtualization solutions; and infrastructure managed services, including annual maintenance contracts, facility management services, managed print services, and IT outsourcing and helpdesk services. Further, the company offers spare part management; professional services comprising RBT and onsite repair, one time implementation projects, vendor managed support, and migrations and upgrades, as well as DOA validations, pats, and product screening; and logistics services. Redington (India) Limited was founded in 1961 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "ROLTA.NS": {
        "short_name": "ROLTA INDIA",
        "long_name": "Rolta India Limited",
        "summary": "Rolta India Limited, together with its subsidiaries, provides various information technology (IT) solutions and services in India and internationally. The company operates in two segments, Enterprise Geospatial and Engineering Solutions; and System Integration and Enterprise IT Solutions. Its solutions include BI and big data analytics, smart city, cloud security and IT transformation, geospatial fusion, enterprise application, e-Governance, financial analytics, defense, safety and security, and engineering AIM solutions. The company also provides application development and maintenance, managed, Rolta adviser, business consulting, enterprise performance management, geospatial, and engineering services. Its products include Rolta OneView, a BI and big data analytics solution; Rolta IT-OT Fusion, a middleware integration solution; ROLTA iPerspective, an enterprise suite for SOA needs; Rolta SmartMigrate solution; Rolta OnPoint, a spatial integration application; Rolta GeoCAD, an emergency response management solution; Rolta Command and Control Solution; Rolta Photogrammetry Suite, a solution to publish GIS data; Rolta Image Processing Suite; Rolta 3D Analysis and Visualization Suite; and Rolta Battlefield Management Systems. The company serves defense, homeland and maritime security, government, infrastructure and natural resources, oil and gas, chemicals, discrete manufacturing, transportation, banking and financial services, and retail and healthcare industries, as well as utilities comprising power, water, gas, and telecom. Rolta India Limited was incorporated in 1989 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RSSOFTWARE.NS": {
        "short_name": "RS SOFTWARE (I)",
        "long_name": "R S Software (India) Limited",
        "summary": "R S Software (India) Limited provides software solutions to the electronic payment industry in India, the United States, and the United Kingdom. The company engages in the development, testing, and maintenance of software products. Its solutions cover merchant acquiring, QA and testing, data analytics, digital payments, security and compliance, and payment processing solutions, as well as Payabbhi, a payment platform. The company serves consumers, merchants, banks, and payment networks. R S Software (India) Limited was incorporates in 1987 and is headquartered in Kolkata, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "RSYSTEMS.NS": {
        "short_name": "R SYSTEMS INTERNAT",
        "long_name": "R Systems International Limited",
        "summary": "R Systems International Limited provides information technology and business process outsourcing (BPO) services worldwide. The company offers AWS powered, campaign to closure, customer experience analytics, and TOP testing suite solutions. It also provides technology solutions, such as cloud enablement, digital platforms and solutions, Internet of Things, product engineering, and QA testing; automation and AI data and analytics services, including advanced analytics, AI machine learning, business analytics, business automation, data monetization and modernization, and modern data management; and design services, including re-engineering, UX engineering, mobile user experience, and visual design services. The company serves finance and insurance, healthcare and life science, telecom, technology, and retail and e-commerce sectors. R Systems International Limited was incorporated in 1993 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Noida"
    },
    "SAKSOFT.NS": {
        "short_name": "SAKSOFT LTD",
        "long_name": "Saksoft Limited",
        "summary": "Saksoft Limited, an information technology company, provides digital transformation solutions in Europe, the United States, the Asia Pacific, and internationally. The company offers application services in the areas of custom application development, Internet of Things, mobile application development, cloud, and block chain. It also provides information management services, including big data solutions comprising data management, multi-dimensional aggregation and allocation, data tagging and standardization, extract-transfer-load process, centralized repositories or data warehouse, real-time reporting with analytical alerts, data mart, key performance indicators optimization, version control and process management, and risk management and insights; business intelligence (BI) solutions, such as data warehousing, data discovery and visualization, master data/data quality management, data integration, data governance, and data warehouse modernization, as well as self-service BI solutions; and data analytics solutions. In addition, the company offers testing, robotic process automation, cloud, and mobility services. It serves transportation and logistics, fintech, healthcare, retail e-commerce, telecommunication, and public sectors. The company was founded in 1999 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SASKEN.NS": {
        "short_name": "SASKEN TECHNOLOGIE",
        "long_name": "Sasken Technologies Limited",
        "summary": "Sasken Technologies Limited provides product engineering and digital transformation services worldwide. Its services include test automation, consultancy, test specifications, product testing, and application testing; and platform development and sustenance, mobility, data analytics, Internet of Things, and blockchain services to digital solutions. The company offers IC and hardware designs, platform and application software, modem software development services for semiconductor industry; hardware design and development, embedded software development, application development, android security management services, and device and platform testing solutions for smart devices and wearables; and connected infotainment, autonomous, ADAS, V2X, telematics, mobility, analytics, and cloud services for automotive industry. It also provides hardware design and development, middleware development, bearers/protocol stack porting, optimization, android security management services, device and platform testing, and mobility solutions for enterprise grade devices; heavy machinery, industrial products, smart building and home automation services, and industry 4.0 solutions for industrial automation and control services; and terminal design and development, embedded software development, access network enhancement, maintenance, IP, and application development solutions for satellite communication industry. In addition, it offers services for transportation industry. The company was formerly known as Sasken Communication Technologies Limited and changed its name to Sasken Technologies Limited in February 2017. Sasken Technologies Limited was founded in 1989 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "SECURKLOUD.NS": {
        "short_name": "SECUREKLOUD TECH LIMITED",
        "long_name": "SecureKloud Technologies Limited",
        "summary": "SecureKloud Technologies Limited provides information and technology services in the United States, India, the Middle East, North America, and internationally. The company's solutions include CloudEz, an enterprise cloud management solution; EzIAM, an user life cycle management platform; CloudAuth, a multi-factor authentication-as-a-service for governing enterprise applications; DataEz, a data lake management platform; CloudEzRX, an user life cycle management platform; and CloudEzSecure, a cloud framework that provides security, which surpasses stringent security regulations. Its solutions also comprise multi-domain identity services platform, an on-demand platform that extends the capabilities of existing identity management, SSO, and legacy services; Cassandra-as-a-Service, a combination of integrated consulting and operations to enhance agility; Automaton, a cloud platform to manage security, cost, and performance in cloud; HER, an end-to-end HER services; and EzMFA, a multi-factor authentication solution for enterprise applications. In addition, the company provides cloud transformation, identity access management, Big data, cloud data analytics, managed, and UI/UX services. It serves healthcare and pharma industries. The company was formerly known as 8K Miles Software Services Limited and changed its name to SecureKloud Technologies Limited in January 2021. SecureKloud Technologies Limited was incorporated in 1985 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SHYAMTEL.NS": {
        "short_name": "SHYAM TELECOM",
        "long_name": "Shyam Telecom Limited",
        "summary": "Shyam Telecom Limited trades in telephone, mobile phone, and communication equipment and parts in India. It also distributes home appliances. The company was founded in 1976 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "SMARTLINK.NS": {
        "short_name": "SMARTLINK HOLDINGS",
        "long_name": "Smartlink Holdings Limited",
        "summary": "Smartlink Holdings Limited, together with its subsidiaries, develops, manufactures, markets, distributes, and services networking products in India. The company operates in two segments, Investment and Networking Products. It offers networking products, such as switches, broadband routers, wireless LANs, and GPON and GePON under the DIGISOL brand name. The company also develops and manufactures copper and fiber range of cabling products, which include cabling solutions, patch panels, patch cords, fiber cables and connectors, couplers, etc.; manufactures electronic products for the IT, networking, and telecom industries; and provides technical assistance center services. In addition, it offers real estate services. Smartlink Holdings Limited also exports its products to other countries internationally. The company was formerly known as Smartlink Network Systems Limited and changed its name to Smartlink Holdings Limited in April 2018. Smartlink Holdings Limited was founded in 1993 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SONATSOFTW.NS": {
        "short_name": "SONATA SOFTWARE",
        "long_name": "Sonata Software Limited",
        "summary": "Sonata Software Limited, together with its subsidiaries, provides information technology services and solutions in India, the United States, Europe, Australia, and the Middle East. It also offers software development, technical, and product marketing services, as well as consulting services. In addition, the company delivers solutions for customers in travel, retail, manufacturing, distribution, transportation, and services and software industries through IP-led platform solutions, such as Rezopia, Brick & Click Retail, Kartopia, Modern Distribution, Halosys, commodity trading and risk management (CTRM), and KODO. Further, it resells product licenses of software companies. Sonata Software Limited has alliances with SAP and Microsoft. The company was incorporated in 1994 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "STLTECH.NS": {
        "short_name": "STERLITE TECHNOLOGIES LTD",
        "long_name": "Sterlite Technologies Limited",
        "summary": "Sterlite Technologies Limited manufactures and sells telecom products and solutions in India and internationally. It offers fiber optical cables, optical fibers, and copper telecom cables; and fibre optical cable laying services. The company also designs and deploys high-capacity converged fibre, cable, and wireless networks; and designs, builds, and manages cloud-native software-defined networks. In addition, it exports its products and services. The company was formerly known as Sterlite Optical Technologies Limited and changed its name to Sterlite Technologies Limited in 2007. Sterlite Technologies Limited was founded in 1988 and is based in Pune, India. Sterlite Technologies Limited is a subsidiary of Twin Star Overseas Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "SUBEXLTD.NS": {
        "short_name": "Subex Ltd",
        "long_name": "Subex Limited",
        "summary": "Subex Limited provides operations and business support systems to communication service providers (CSPs) worldwide. The company offers ROC Revenue Assurance, a solution that helps CSPs enhance CX minimize risk, manage margins, and get business insights true business assurance; and ROC Fraud Management solution to protect operator's voice and SMS services, data services, and new-age digital services from consumer, partner, and internal fraud. It also provides ROC Network Asset Management solution that offers a framework to audit network assets, evaluate inventory, and makes a business case for network upgradation, as well as a view of network assets and inventory to optimize opex and capex; and ROC Capacity Management, a solution, which gleans insights from network capacity trends, identifies capacity hot-spots, and predicts time-to-exhaustion. In addition, the company offers ROC Partner Management, a solution that facilitates in swift partner onboarding, partner self-care, revenue visibility, and communication between Telco and its partners; ROC Route Optimization solution, which processes from dial code/destination operator rate imports to switch updates; and Partner Settlement, a solution that facilitates billing and settlement to manage revenue and margins across interconnect and digital ecosystem. Further, it provides Internet of Things security, a solution from real-time discovery and monitoring to response and recovery; Analytics Center of Trust that offers end-to-end analytics framework; CrunchMetrics, a real-time analytics platform that analyzes streaming data to identify critical incidents and business opportunities; IDcentral, an identity repository enabling enterprises to convert attributes to digital identities; and managed, and consulting and assessment services. The company was formerly known as Subex Azure Limited and changed its name to Subex Limited in December 2007. Subex Limited was founded in 1992 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "SURANASOL.NS": {
        "short_name": "SURANA SOLAR LTD",
        "long_name": "Surana Solar Limited",
        "summary": "Surana Solar Limited manufactures and sells solar panels and solar photovoltaic modules in India and internationally. It operates through Solar products, and Wind and Solar Power segments. It also generates wind and solar power; and trades in other solar related products. The company was formerly known as Surana Ventures Limited. Surana Solar Limited was incorporated in 2006 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Secunderabad"
    },
    "SUVIDHAA.NS": {
        "short_name": "Suvidhaa Infoserve Ltd",
        "long_name": "Suvidhaa Infoserve Limited",
        "summary": "Suvidhaa Infoserve Limited offers payment services. The company provides its payment services for domestic remittance, individual and business loans, mutual fund and other investment products, ATM, utility bill payments, recharges, travel ticketing, general and life insurance, E-Commerce, bank account opening, pre-paid/gift card issuance, and cash collection and bank account deposit services through S-Commerce Platform. It serves customers through Suvidhaa Centres, a financial services hub; Suvidhaa Points; and sPAY, a POS based transaction acquiring platform. The company was incorporated in 2007 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "SWELECTES.NS": {
        "short_name": "SWELECT ENERGY SYS",
        "long_name": "Swelect Energy Systems Limited",
        "summary": "Swelect Energy Systems Limited manufactures and trades in solar modules, mounting structures, transformers, and inverters in India, Europe, and internationally. The company operates through Solar and Solar Related Activities, Foundry Business, and Others segments. It offers mono and multi crystalline solar photovoltaic modules, and building integrated photovoltaic modules; solar inverters; solar water pumps; and hydro panels. The company also engages in iron, steel, and investment casting activities. In addition, it provides stabilizers; energy conservation and audits, design/retrofit sustainable buildings, and LED lighting system; site feasibility analysis; engineering, procurement, and construction contracts; and operation and maintenance services, as well as engages in solar and wind power generation activities. The company was formerly known as Numeric Power Systems Limited and changed its name to Swelect Energy Systems Limited in May 2012. Swelect Energy Systems Limited was incorporated in 1994 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "SWSOLAR.NS": {
        "short_name": "Sterling & Wilson So Ltd",
        "long_name": "Sterling and Wilson Solar Limited",
        "summary": "Sterling and Wilson Solar Limited provides engineering, procurement, and construction (EPC) services to solar power projects. Its EPC services primarily include the design and engineering functions, procurement of raw materials and selection of vendors, inspection and audit, construction of the solar power project, and field quality monitoring services. The company also provides operations and maintenance services to third-party projects. Additionally, it imports, exports, and trades in solar modules, structures, invertors, and related accessories. Further, the company engages in the installation and maintenance of solar power generating facilities and other related activities. It has 245 solar power projects with an aggregate capacity of 10,134 mega-watt peak. The company's customers include independent power producers, developers, and equity funds. It operates in 25 countries with operations in India, the South-East Asia, the Middle East, Africa, Europe, the Americas, and Australia. The company was founded in 2011 and is based in New Delhi, India. Sterling and Wilson Solar Limited is a subsidiary of Shapoorji Pallonji and Company Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TANLA.NS": {
        "short_name": "TANLA PLATFORMS L",
        "long_name": "Tanla Platforms Limited",
        "summary": "Tanla Platforms Limited, together with its subsidiaries, provides cloud communication services for mobile operators and enterprises in India and internationally. It offers messaging products and services, such as Application to Peer short message services (SMS) on business-as-a-service basis; SMS Firewall, a telco grade platform that plugs loop holes in the telecom network for fraud and revenue leakage using various filtering capabilities; SMS Hub, a solution that simplifies SMS interoperability, manages number portability, and introduces real-time online monitoring to manage large volumes of SMS; unstructured supplementary service data (USSD) Center for service providers, MVNO's, and wireless operators to offer USSD-based applications and services to enterprises; and Push Notifications to create and manage multiple push notification campaigns through a single user interface. The company also provides cloud voice services, including Hosted IVR solution that enables enterprises to design, build, and update custom IVR applications using a web interface; Voice Broadcast technology that enables enterprises to initiate and deploy personalized interactive voice broadcasts; Free Ring, a solution for engaging and interactive communications with customers and prospects; and Source Trace, which enables enterprises and agencies to track inbound calls back to the marketing source. In addition, it offers IoT platform, which enables businesses to connect people, machines, and processes, as well as provides chat and marketing automation products, and aggregator and offshore development services. Tanla Platforms Limited has partnership with Microsoft to launch blockchain-enabled CPaaS platform. The company was formerly known as Tanla Solutions Limited and changed its name to Tanla Platforms Limited in October 2020. Tanla Platforms Limited was incorporated in 1995 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "TATAELXSI.NS": {
        "short_name": "TATA ELXSI",
        "long_name": "Tata Elxsi Limited",
        "summary": "Tata Elxsi Limited provides product design and engineering, and systems integration and support services in India, the United States, Europe, and internationally. It operates through two segments, Software Development and Services; and Systems Integration and Support. The company offers technology consulting, new product design, development, and testing services for broadcast, consumer electronics, healthcare, telecom, and transportation industries; and electronics, software development, and system design services for automotive and aerospace industries. It also provides animation and visual effects services in the areas of 3D stereoscopy, CG animation, visual effects, and gaming for television service and commercials, custom content development, logos and graphics, and films. In addition, the company offers services in collecting, managing, visualizing, and analyzing data to provide actionable insights combined with predictive/prescriptive analytics; and industrial design services in the areas of consumer insight, branding, industrial design, visual design and merchandising, design engineering, and manufacturing support. Further, it offers design, branding, and mechanical detailing for devices, sensors, and gateways; device, sensor, gateway hardware, system, and application development services; communications integration and testing services; connectivity, device management, big data, network management, analysis and prediction model, and hosted services; and application service/workflow, and user experience and UI design services, as well as mobile/Web-based app development services. Additionally, the company implements and integrates systems and solutions for computing, CAD/CAM/CAE/PLM, broadcast, virtual reality, storage, and disaster recovery, as well as provides professional services for the maintenance and support of IT infrastructure. Tata Elxsi Limited was incorporated in 1989 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "TCS.NS": {
        "short_name": "TATA CONSULTANCY S",
        "long_name": "Tata Consultancy Services Limited",
        "summary": "Tata Consultancy Services Limited provides information technology (IT) and IT enabled services worldwide. It operates through Banking, Financial Services and Insurance; Manufacturing; Retail and Consumer Business; Communication, Media and Technology; and Others segments. The company offers CHROMA, a cloud-based talent management solution; ignio, a cognitive automation software product; iON, an assessment platform; TAP, a procurement offering; TCS MasterCraft, a platform to automate and manage IT processes; and Quartz, a blockchain solution. It also provides customer intelligence and insight solutions to deliver retail, banking, and communications experiences; Intelligent Urban Exchange, an integrated software to accelerate smart city programs; OPTUMERA, a digital merchandising suite; TCS BaNCS, a financial platform; and Jile, an agile DevOps product. In addition, the company offers advanced drug development and connected intelligent platforms; ERP on cloud, an enterprise solution that offers hosted ERP applications and services; HOBS, a platform for subscription based digital business. Further, it provides cognitive business, consulting, analytics, automation and artificial intelligence, Internet of Things, cloud applications, blockchain, cloud infrastructure, cyber security, interactive, industrial engineering, quality engineering, and enterprise services. The company serves banking, financial, and public services; consumer goods and distribution, insurance, life sciences and healthcare, manufacturing, retail, hi-tech, travel, transportation, and hospitality industries; communications, media, and technology industries; and energy, resource, and utility industries. It has strategic partnerships with Posten Norge AS and the University of Tokyo; Zendesk, Inc.; IBM; and PagerDuty, Inc. The company was founded in 1968 and is based in Mumbai, India. Tata Consultancy Services Limited is a subsidiary of Tata Sons Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TECHM.NS": {
        "short_name": "TECH MAHINDRA",
        "long_name": "Tech Mahindra Limited",
        "summary": "Tech Mahindra Limited provides information technology (IT) services and solutions in the Americas, Europe, India, and internationally. The company operates through IT Business and Business Processing Outsourcing (BPO) segments. It offers IT outsourcing, consulting, application outsourcing, network, infrastructure outsourcing, integrated engineering, BPO, platform, and mobile value added services. The company also provides consulting-led integrated portfolio services to telecom equipment manufacturers and service providers, IT infrastructure service providers, and business process outsourcing service providers; and IT and IT-enabled enterprise solutions. In addition, it offers IT enabled, application development and maintenance, consulting and enterprise business solutions, extended engineering solutions, and infrastructure management services. Further, the company provides data and analytics; IT infrastructure and cloud services; customer experience solutions; enterprise platforms; and enterprise business solutions. Additionally, it offers testing, telecom product engineering, digital supply chain, performance engineering, and enterprise security and risk management services. The company serves insurance, banking and financial, manufacturing, telecommunication, transportation and logistics, engineering, entertainment, and public and government sectors; and retail and consumer goods industries. Tech Mahindra Limited has strategic partnerships with Openet, ChampTrax, Lucideus, and eNate Limited. The company was founded in 1986 and is based in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    },
    "TEJASNET.NS": {
        "short_name": "TEJAS NETWORKS LTD",
        "long_name": "Tejas Networks Limited",
        "summary": "Tejas Networks Limited designs, develops, and sells optical and data networking products to telecommunications service providers, internet service providers, web-scale internet companies, utility companies, defense companies, and government entities in India, the Americas, and internationally. The company offers converged packet optical products, including TJ1400, an ultra-converged broadband designed for cost-optimized delivery of mobile backhaul, broadband access, enterprise, and network modernization; and TJ1600, an optical product that balances packet and circuit transport. It also provides enterprise Ethernet switches, such as TJ1400P-M4 series of switches designed for data center and cloud deployments; TJ1400P M3 and TJ1400P M2 switching products optimized for LAN and metro applications; and TJ1400P-M1 portfolio of Layer2+ switches for enterprise, campus, and industrial networks. In addition, the company offers TJ1600, a high-density metro core platform comprising TDM, OTN, carrier Ethernet, and DWDM technologies; and TJ1270, an ultra-compact and dense customer premise bandwidth provisioning equipment designed to scale from STM-1 to STM-16 capacity to accommodate surging bandwidth demands in the access. Further, it provides TJ1602W, a LTE Macro eNodeB solution on the TJ1600-2 platform; TJ6003W, a LTE packet core EPC solution; TJ1400, a series of aggregation and core service routers; TJ1270 MSPP, a multi-service provisioning platform; TJ5500 Network Management System, an integrated management application; and TJ1400 OLT, a series of advanced GPON elements designed for optical access networks deployed fibre-to-the-home and fibre-to-the-building formats. The company was formerly known as Tejas Networks India Limited and changed its name to Tejas Networks Limited in March 2008. Tejas Networks Limited was incorporated in 2000 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "TERASOFT.NS": {
        "short_name": "TERA SOFTWARE",
        "long_name": "Tera Software Limited",
        "summary": "Tera Software Limited provides IT and integrated related products and services worldwide. It operates through Integrated Solutions Division, Technical Division, and Projects Division segments. The company offers its services in various categories, such as system integration and networking, and software development and consultancy, as well as GST billing, invoicing, and filing software. Its services include internet of things, human capital management, experience design, enterprise risk and security, engineering and manufacturing, customer relationship management, and consulting. The company also provides services for Aadhaar; creation of national population register; sales tax automation; electricity billing system; RTA project; ration cards; computer education in schools; and socio economic and caste census. It serves banking and financial services, communications, consumer goods, education, and energy and utilities industries. The company was founded in 1994 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "TNTELE.NS": {
        "short_name": "TAMILNADU TELECOMM",
        "long_name": "Tamilnadu Telecommunications Limited",
        "summary": "Tamilnadu Telecommunications Limited manufactures and sells optical fiber cables for telecommunications in India. Its products include nylon jacketed metal-free optical fiber cables for use in saline atmosphere in coastal areas; armored optical fiber cables for direct burial application; self-supporting aerial optical fiber cables; composite cables; and ribbon cables. The company was founded in 1988 and is based in Maraimalai Nagar, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Communication Equipment",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Maraimalai Nagar"
    },
    "TREJHARA.NS": {
        "short_name": "TREJHARA SOLUTIONS",
        "long_name": "Trejhara Solutions Limited",
        "summary": "Trejhara Solutions Limited provides technology products and solutions in the Asia Pacific and internationally. The company offers Interact DX, a communication management product suite in the digitization domain, which provides interactive personalized communication including audio video technology, bills, statements, targeted advertisements, policy kits, welcome kits, receipts, loyalty/rewards, KYC forms, advisory, and notifications across multiple channels, such as email, web, mobile, print, and kiosk. It also provides SCM Profit, a logistic solution that allows to streamline and enhance logistics operations in various segments, such as warehousing, freight forwarding, project logistics, manufacturing, distribution, supplier collaboration and visibility, etc. In addition, the company offers IT consulting and provides resources to corporation in segments, such as banking, insurance, telecom, utility, and retail. Trejhara Solutions Limited was incorporated in 2017 and is headquartered in Thane, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Thane"
    },
    "TRIGYN.NS": {
        "short_name": "TRIGYN TECHNOLOGIE",
        "long_name": "Trigyn Technologies Limited",
        "summary": "Trigyn Technologies Limited provides communications and information technology staffing support services in India and internationally. The company offers system integration services covering custom application development and maintenance, enterprise content management, legacy modernization/application reengineering, mobile application development and enablement, business intelligence and reporting, user experience consulting/design, independent testing, business process outsourcing, and 24X7 helpdesk and support. It also provides managed services consisting of project management and business analysis, helpdesk and network support, network and infrastructure design, ERP technical and functional, and UX/UI and usability, as well as architecture, design, development, and quality assurance. In addition, the company offers development and maintenance, SAP, and IT solutions. It serves international organizations, non-governmental organizations, and state and local governments, as well as the commercial sector comprising financial services, pharmaceutical, manufacturing, and distribution. The company was formerly known as Leading Edge Systems Ltd and changed its name to Trigyn Technologies Limited in July 2000. Trigyn Technologies Limited was incorporated in 1986 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TVSELECT.NS": {
        "short_name": "TVS ELECTRONICS",
        "long_name": "TVS Electronics Limited",
        "summary": "TVS Electronics Limited, through its subsidiaries, designs, manufactures, assembles, markets, sells, and services various transaction automation products in India and internationally. The company operates through Products & Solutions, Customer Support Services, and Fulfillment & Distribution Services segments. Its products include dot matrix printers, mechanical keyboards, thermal printers, label printers, barcode scanners, electronic cash registers, membrane keyboards, mouse products, and currency counting machines. The company also provides repair engineering, installation and demo, remote tech support, call center, and parts management services. It serves governance and back office, oil, mining, manufacturing, BFSI, food and beverage, retail, hospitality, and ticketing industries. The company was founded in 1986 and is headquartered in Chennai, India. TVS Electronics Limited is a subsidiary of TVS Investments Private Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Computer Hardware",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "UJAAS.NS": {
        "short_name": "UJAAS ENERGY LTD",
        "long_name": "Ujaas Energy Limited",
        "summary": "Ujaas Energy Limited manufactures and sells solar power systems in India. It operates through Solar Power Generation and Maintenance; Manufacturing and Sale of Solar Power Plant; and EV segments. The company also develops, operates, owns, and maintains solar energy power plants under the UJAAS brand; and provides engineering, procurement, and construction solutions. Its products include various transformers, including convertor and special purpose transformers, power transformers, distribution transformers, and arc furnace and induction furnace transformers; and offers electric scooters. The company was formerly known as M and B Switchgears Limited and changed its name to Ujaas Energy Limited in August 2013. Ujaas Energy Limited was founded in 1979 and is based in Indore, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Indore"
    },
    "URJA.NS": {
        "short_name": "URJA GLOBAL LTD",
        "long_name": "Urja Global Limited",
        "summary": "Urja Global Limited engages in the design, consultancy, integration, supply, installation, commissioning, and maintenance of off grid and grid connected solar power plants and decentralized solar applications in India. It offers solar, e-rickshaw, automotive, and inverter batteries; solar inverters; LED street, flood, and panel lights, as well as LED bulbs and slim LED panel lights; PV modules; solar water heaters; solar lanterns; solar power packs; solar home lighting systems; and solar charge controllers. The company also provides electric vehicles. Urja Global Limited was incorporated in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "VAKRANGEE.NS": {
        "short_name": "VAKRANGEE LTD",
        "long_name": "Vakrangee Limited",
        "summary": "Vakrangee Limited, a technology company, provides banking, ATM, insurance, financial services, e-governance, e-commerce, and logistics services in India. The company offers bank account opening, cash deposits, withdrawals, money transfer, fixed and recurring deposits, balance enquiry, statement of accounts, money disbursement, consumer loans, housing loans, SME and working capital loans, and domestic money transfer services; and life insurance, motor insurance, health insurance, and social security and micro insurance schemes. It also operates assisted online shopping and healthcare, assisted travel services, and telecom and bill payments services platforms, as well as offers courier and logistics services. The company operates approximately 10,000 Vakrangee Kendra outlets. The company was formerly known as Vakrangee Softwares Limited and changed its name to Vakrangee Limited in October 2013. Vakrangee Limited was founded in 1990 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "VISESHINFO.NS": {
        "short_name": "VISESH INFOTECNICS",
        "long_name": "MPS Infotecnics Limited",
        "summary": "MPS Infotecnics Limited provides information technology (IT) solutions to organizations worldwide. The company operates through three segments: Telecommunication, IT Solutions & Products, and IT Enabled Services. It provides BusinesSoft, a solution for service, pharmaceutical, manufacturing, chemical, and trading companies; BusinessPro, which automates the functions of an organization and deploys enterprise wide applications; and domain name registration and Web hosting services in cloud infrastructure. The company also offers system integration and networking solutions, enterprise software, value added services and IT enabled services, e-business applications, and election cards printing services. In addition, it supplies servers, desktop and notebook computers, peripherals, and power correction equipment; data communication equipment, such as routers, switches, and remote access servers; structured cabling systems; and wireless connectivity products, as well as provides maintenance support services. Further, the company offers networking services, including network planning and designing, hardware and software procurement, network installation, user personnel training, and long-term support, as well as biometrics services. Additionally, it exports mobile phones to Taiwan and Hong Kong. MPS Infotecnics Limited serves customers operating in the government, telecom, manufacturing, MNC and overseas, financial, IT, transport and tourism, and other sectors. The company was formerly known as Visesh Infotecnics Limited and changed its name to MPS Infotecnics Limited in January 2016. MPS Infotecnics Limited was founded in 1989 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "WEBELSOLAR.NS": {
        "short_name": "WEBSOL ENERGY SYST",
        "long_name": "Websol Energy System Limited",
        "summary": "Websol Energy System Limited manufactures and sells photovoltaic (PV) crystalline solar cells and modules in India. Its modules are used across sectors, such as solar PV power plants, remote communication, and rural electrification. The company was formerly known as Websol Energy Systems Ltd. and changed its name to Websol Energy System Limited in October 2011. Websol Energy System Limited was incorporated in 1990 and is based in Falta, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Solar",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Falta"
    },
    "WHIRLPOOL.NS": {
        "short_name": "WHIRLPOOL OF INDIA",
        "long_name": "Whirlpool of India Limited",
        "summary": "Whirlpool of India Limited manufactures and trades in home appliances under the Whirlpool brand in India and internationally. The company primarily offers refrigerators, washing machines, air conditioners, microwave ovens, and small appliances, as well as air and water purifiers. It also provides built-in appliances, including built-in ovens, coffee machines, microwave ovens, cooker hoods, hobs, dishwashers, wine coolers, and washers and dryers, as well as commercial appliances and accessories. It also exports its products to Afghanistan, China, and Sri Lanka. The company was incorporated in 1960 and is headquartered in Gurugram, India. Whirlpool of India Limited is a subsidiary of Whirlpool Mauritius Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Consumer Electronics",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "WIOA.F": {
        "short_name": "WIPRO LTD ADR /1 IR 2",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "WIOA.VI": {
        "short_name": "WIPRO LTD-ADR",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "EUR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "VIE",
        "market": "at_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "WIPRO.NS": {
        "short_name": "WIPRO LTD",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "WIT": {
        "short_name": "Wipro Limited",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "USD",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "WITN.MX": {
        "short_name": "WIPRO LTD",
        "long_name": "Wipro Limited",
        "summary": "Wipro Limited operates as an information technology (IT), consulting, and business process services (BPS) company worldwide. It operates in three segments: IT Services, IT Products, and India State Run Enterprise Services (ISRE). The IT Services segment offers IT and IT-enabled services, including digital strategy advisory, customer-centric design, technology consulting, IT consulting, custom application design, development, re-engineering and maintenance, systems integration, package implementation, infrastructure, analytics, business process, research and development, and hardware and software design services to enterprises. It serves customers in various industry verticals, such as banking, financial services, and insurance; health business; consumer business; energy, natural resources, and utilities; manufacturing; technology; and communications. The IT Products segment provides a range of third-party IT products comprising enterprise platforms, networking solutions, software and data storage products, contact center infrastructure, enterprise security, IT optimization technologies, video solutions, and end-user computing solutions. It serves enterprises in various industries primarily in the India market, which comprise the government, defense, IT and IT-enabled services, telecommunications, manufacturing, utilities, education, and financial services sectors. The ISRE segment offers IT services to entities and/or departments owned or controlled by the Government of India and/or various Indian State Governments. The company has research collaboration agreements with the University of Texas at Austin; Tel Aviv University, Israel; Swinburne University, Melbourne; IIT Kharagpur; IIT Madras; IISc Bangalore; and University of Agricultural Sciences, Bangalore; and strategic relationship with Amazon Web Services in the area of DevOps. Wipro Limited was founded in 1945 and is based in Bengaluru, India.",
        "currency": "MXN",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "XCHANGING.NS": {
        "short_name": "XCHANGING SOLUTION",
        "long_name": "Xchanging Solutions Limited",
        "summary": "Xchanging Solutions Limited provides information technology services in India, Europe, the United States, and internationally. The company was formerly known as Cambridge Solutions Limited and changed its name to Xchanging Solutions Limited in June 2012. Xchanging Solutions Limited was incorporated in 2002 and is based in Bengaluru, India. Xchanging Solutions Limited operates as a subsidiary of Xchanging (Mauritius) Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "XELPMOC.NS": {
        "short_name": "XELPMOC DESIGN AND",
        "long_name": "Xelpmoc Design and Tech Limited",
        "summary": null,
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Bengaluru"
    },
    "ZENSARTECH.NS": {
        "short_name": "ZENSAR TECHNOLOGIE",
        "long_name": "Zensar Technologies Limited",
        "summary": "Zensar Technologies Limited, a digital solutions and technology services company, provides information technology (IT) services and solutions in the United states, Europe, and internationally. It operates through Application Management Services and Infrastructure Management Services segments. The company offers digital supply chain, enterprise analytics, customer experience transformation, agile IT modernization, and digital solutions. It also provides advanced analytics and data warehousing, big data, and enterprise data management services. In addition, the company offers CRM, digital channel, digital marketing, experience, and front end development services; digital foundation, workplace, infrastructure, operations, and enterprise security services; enterprise applications, such as Oracle, SAP, SFDC, and Pega Alliance solutions; and agile, application development, DevOps, enterprise architecture consulting, outcome based managed, and robotic process automation services. Further, it provides testing services; and digital commerce consulting, digital commerce development, digital fulfilment, and managed commerce services. The company serves manufacturing, retail, media, banking, insurance, healthcare, and utilities industries. Zensar Technologies Limited was incorporated in 1963 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Information Technology Services",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Pune"
    }
}