{"COMPINFO.NS": {"short_name": "COMPUAGE INFOCOM L", "long_name": "Compuage Infocom Limited", "summary": "Compuage Infocom Limited, an information technology (IT) and mobility distribution company, trades in computer parts and peripherals, and software and telecom products in India and internationally. The company also provides products support services for IT products. Compuage Infocom Limited was founded in 1987 and is headquartered in Mumbai, India.", "currency": "INR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "CREATIVE.NS": {"short_name": "Creative Peripherals and", "long_name": "Creative Peripherals and Distribution Limited", "summary": "Creative Peripherals and Distribution Limited distributes information technology (IT)/gaming, imaging, lifestyle, and security products in India and internationally. It offers printers, storage devices and cartridges, as well as PC components, such as monitors, hard disks, CD writers, and CD ROMS; cameras, tripods, and other imaging products and accessories; and TVs, headphones, other lifestyle products, and IT accessories. The company offers its products through sub distributors, channel partners, e-commerce/online channels, large format retails, and system integrators. Creative Peripherals and Distribution Limited was founded in 1992 and is based in Mumbai, India.", "currency": "INR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "HCL-INSYS.NS": {"short_name": "HCL INFOSYSTEMS", "long_name": "HCL Infosystems Limited", "summary": "HCL Infosystems Limited sells computer hardware and mobile handsets to enterprises and consumers primarily in India. It operates through Hardware Products & Solution, Learning, and distribution segments. The Hardware Products and Solutions segment sells IT products and solutions to enterprise and government customers. The Learning segment offers training services; and sells educational digital content and related hardware offerings for private schools, colleges, and other education institutes, as well as vocational training. The Distribution segment distributes consumer products, including telecommunication products, digital lifestyle products, and consumer electronic and home appliances; and enterprise products, such as IT products, enterprise software, and office automation products. The company was founded in 1976 and is headquartered in Noida, India.", "currency": "INR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}, "JUMPNET.NS": {"short_name": "Jump Networks Limited", "long_name": "Jump Networks Limited", "summary": "Jump Networks Limited provides information technology and advertisement services. The company offers JumpTalk, a Voice over Internet Protocol (VoIP) service that enables users to make high-quality audio and video calls; JUMP, a device that provides multitude of digital services; Edmission, a digital education platform that offers education for learners and educators; and GAIA Agritech, a technology used by farmer to produce organic milk and eggs. It is also involved in the resale of IT products. The company was formerly known as Iris Mediaworks Limited and changed its name to Jump Networks Limited in May 2019. Jump Networks Limited was incorporated in 1992 and is based in Mumbai, India.", "currency": "INR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Mumbai"}, "OPTIEMUS.NS": {"short_name": "OPTIEMUS INFRACOM", "long_name": "Optiemus Infracom Limited", "summary": "Optiemus Infracom Limited trades in mobile handsets and mobile accessories in India and internationally. The company provides Blackberry, Zen, and Kult mobile devices; OptiSafe, a technology-based personal security and safety devices; and smartphone accessories under the Molife brand names, as well as engages in booking of hotel rooms through online portal. It also rents immovable property. The company was formerly known as Akanksha Cellular Limited and changed its name to Optiemus Infracom Limited in June 2011. Optiemus Infracom Limited was incorporated in 1993 and is based in Noida, India.", "currency": "INR", "sector": "Technology", "industry": "Electronics & Computer Distribution", "exchange": "NSI", "market": "in_market", "country": "India", "city": "Noida"}}