{
    "AGCNET.NS": {
        "short_name": "AGC NETWORKS LTD",
        "long_name": "AGC Networks Limited",
        "summary": "AGC Networks Limited provides information and communications technology solutions worldwide. It operates through System Integration, Technology Product Solution, and Others segments. The company offers unified communication solutions, such as IP communication, multimedia integration, contact center, and collaboration solutions. It also provides data center and edge IT solutions, such as hyper converged infrastructure that integrates computing, storage, networking, and virtualization resources and other technologies; private cloud; mobility; and software defined networking. In addition, the company offers a portfolio of cyber security services, which include certification, compliance, implementation, management, and audit services. Further, it provides digital transformation and applications, such as gamification, customer experience and journey, automation, and IoT solutions. Additionally, the company offers guardian support services consisting of IT infrastructure remote and on-site management services; global security operations center and global network operations center services; managed services, including enterprise service management, integrated management data center, and cloud computing services; and professional services comprising consulting, deployment, design, customization, and audit services. It serves banking, financial service, and insurance; education; healthcare; travel and hospitality; IT/ITES; and manufacturing industries. The company was founded in 1986 and is based in Mumbai, India. AGC Networks Limited is a subsidiary of Essar Global Fund Limited.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400034",
        "website": "http://www.agcnetworks.com",
        "market_cap": "Large Cap"
    },
    "BGLOBAL.NS": {
        "short_name": "BHARATIYA GLOBAL I",
        "long_name": "Bharatiya Global Infomedia Limited",
        "summary": "Bharatiya Global Infomedia Limited provides information technology (IT), and media and entertainment products and services in India. It offers traffic engineering solutions, such as parking management, parking guidance, toll management, ticket dispensing, automatic number plate recognition, under vehicle surveillance, automatic vehicle counter-cum-classifier systems; and facility management solutions comprising smart campus, visitor management, canteen management, asset tracking, laptop tracking, file tracking, and lighting management systems, as well as CCTV, access control, perimeter fencing, etc. The company also provides personnel management solutions consisting of employee tracking, time-attendance, library automation and management, and student information systems; and customized solutions, including automated binning systems, intelligent converters, GSM based mast or I/O controllers, GSM logic controllers, boom barriers, loop detectors, LED panels, and kiosk applications, as well as other customizable converters, counters, etc. In addition, it offers building solutions, such as building management systems, i-BMS systems, energy services, lighting control products, and maintenance services. Further, the company provides home automation for RWA management and jewelry tracking systems. It primarily serves road and transportation, infra and building, health and medical, defense, security and surveillance, and other sectors. The company was formerly known as Bhartiya Global Software Limited and changed its name to Bharatiya Global Infomedia Limited in November 2003. Bharatiya Global Infomedia Limited was incorporated in 1994 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://bgil.in",
        "market_cap": "Small Cap"
    },
    "CALSOFT.NS": {
        "short_name": "CALIFORNIA SOFTWAR",
        "long_name": "California Software Company Limited",
        "summary": "California Software Company Limited provides software development, business process outsourcing, and IT infrastructure services. It offers CLPM, a loyalty business management solution; CsIoT, an Internet of Things solution; CsDigital platform that provides cloud strategy services to design, deploy, and manage cloud environments; CsBigData, a big data analytics solution; CsCloud, a cloud computing solution; CLISAC, a clinical data management solution; CLIDAC, a clinical data warehouse and analytics console; and CASP, a chat-based artificial intelligence (AI) assistance system. The company also offers ARGCIC, a pharmaco-vigilance application; Chronscrapper, an automated data extraction tool used in structuring the data of PDF and scanned documents; EYWA, an AI assistant for doctors; and YesGeeCom solution that enables digital transformation of e commerce solutions by AI integration for business-to-business and business-to-customer segments. The company was founded in 1992 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600096",
        "website": "http://www.calsof.com",
        "market_cap": "Small Cap"
    },
    "CURATECH.NS": {
        "short_name": "CURA TECHNOLOGIES LTD",
        "long_name": "CURA Technologies Limited",
        "summary": "CURA Technologies Limited provides enterprise class software applications for organizations to manage risk, compliance, and audit framework through an automated process worldwide. It primarily serves energy sector The company was formerly known as Softpro Systems Limited and changed its name to CURA Technologies Limited in October 2010. CURA Technologies Limited was incorporated in 1991 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.curatechnologies.co.in",
        "market_cap": "Small Cap"
    },
    "GENESYS.NS": {
        "short_name": "GENESYS INTL",
        "long_name": "Genesys International Corporation Limited",
        "summary": "Genesys International Corporation Limited provides mapping, survey, and geospatial services worldwide. The company offers geospatial consulting services, including mapping/GIS needs assessments, QA/QC analysis, and project design; GIS data capture and analysis for digital photogrammetry; cadastral mapping, topographical mapping, and parcel mapping services; digitization services for raster to vector conversion; and contour, topographic, zonal, cadastral, and utility maps. It also provides 3D and HD mapping; light detection and ranging data acquisition and processing using mobile, aerial, and terrestrial technologies for various applications, such as telecom fiber roll-out, and utilities planning, as well as in forestry and agriculture, oil and gas, and other industries; and engineering services for telcos and utility companies. In addition, the company offers software development services for enterprises, government, and consumers; WoNoBo, a mapping platform; photogrammetry services; building information modeling; and business consulting services, including requirement analysis, project design and planning, GIS orientation seminars and workshops, and database and application design with system configuration. Further, it provides various solutions, such as TeleSCAPE, InfraSCAPE, CitySCAPE, WaterSCAPE, and market analysis and route planning system, a Web based decision support system. The company provides its services to the utility, infrastructure, navigation, natural resources, urban development, and disaster management companies. Genesys International Corporation Limited was founded in 1983 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400096",
        "website": "http://www.igenesys.com",
        "market_cap": "Mid Cap"
    },
    "INFOBEAN.NS": {
        "short_name": "InfoBeans Techno. Ltd.",
        "long_name": "InfoBeans Technologies Limited",
        "summary": "InfoBeans Technologies Limited, a software services company, develops enterprise software in India and internationally. The company offers cloud computing, migration, configuration, deployment, and sustenance; enterprise mobility; and UX and UI design services, as well as distributed storage systems, and eCommerce platforms for mobile and web. It also provides publishing services for Web, mobile, and print, including data conversion; standard publishing process automation; digital transformation and mobility; workflow and document management; and digital selling and distribution services, as well as portal for accreditation enablement. In addition, the company offers automation services, such as continuous integration and delivery, and robotic process automation; and system integration services for IT service management, and business and operations management, as well as managed and consulting services. The company was founded in 2000 and is headquartered in Indore, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Indore",
        "zipcode": "452001",
        "website": "http://www.infobeans.com",
        "market_cap": "Mid Cap"
    },
    "IZMO.NS": {
        "short_name": "IZMO LIMITED",
        "long_name": "IZMO Limited",
        "summary": "IZMO Limited offers hi-tech automotive e-retailing solutions in the United States, Mexico, Europe, and Asia. The company provides Internet solutions to the automotive industry through websites, such as izmocars.com, govirtual.com, izmocars.eu, izmocars.fr, and carazoosolutions.com. It also operates websites for various businesses and professions that include izmoweb.com and izmoweb.in. In addition, the company offers interactive media solutions for the automotive industry through automotive images and animation, virtual brochures, video brochures with voice over, and CGI graphics through websites, such as izmostock.com and izmostudio.com for stock photography, as well as izmomedia.com, izmotion.com, and izmofx.com for interactive media solutions. Further, it provides enterprise products that offers packaged product solutions to meet enterprise requirements in connectivity, security, and interoperability. The company was formerly known as Logix Microsystems Limited and changed its name to IZMO Limited in 2014. IZMO Limited was founded in 1995 and is based in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560076",
        "website": "http://www.izmoltd.com",
        "market_cap": "Small Cap"
    },
    "KELLTONTEC.NS": {
        "short_name": "KELLTON TECH SOLU",
        "long_name": "Kellton Tech Solutions Limited",
        "summary": "Kellton Tech Solutions Limited provides digital transformation, ERP, and other IT services worldwide. The company offers agile software development, digital commerce and marketing, digital integration, outsourced product development, platform modernization, professional, research and development, technology consulting, and testing and automation services. It also provides digital transformation solutions, including artificial intelligence and machine learning, augmented and virtual reality, block chain, data science and analytics, design studio, enterprise mobility, Internet of Things, and robotic process automation. In addition, the company offers Kellton4Media, a solution that gives control for ad publishing, story filing, and content editing; KLGAME, a location based gamification, analytics, and rich messaging engine platform, which sends text, audio, and video notifications to customers' smartphones or wearable devices; Optima, an IoT enabled digital oilfield analytics platform; and tHRive, a human capital management solution, which engages in real-time staff tracking, performance governance, and seamless operations. It serves customers in various industries comprising retail, travel, e-commerce, education, hospitality, manufacturing, consumer goods, logistics, supply-chain management, lifestyle, non-profits and banking, financial services, and insurance. The company was formerly known as VMF Soft Tech Limited and changed its name to Kellton Tech Solutions Limited in November 2012. Kellton Tech Solutions Limited was incorporated in 1993 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500033",
        "website": "http://www.kelltontech.com",
        "market_cap": "Mid Cap"
    },
    "KERNEX.NS": {
        "short_name": "KERNEX MICROSYSTEM",
        "long_name": "Kernex Microsystems (India) Limited",
        "summary": "Kernex Microsystems (India) Limited engages in conceptualizing, designing, developing, manufacturing, installing, and maintaining of level crossing protection systems and anti-collision systems for the railroad sector. The company offers LxGuard, a level crossing protection system; TrainSHIELD, a train collision avoidance system; SAFELx, a train actuated warning device; SENTINEX, a level crossing warning system; and CASRY, a collision avoidance system for yards and terminals. It also provides KMDAX, a multi section digital axle counting system; ACD, an anti-collision device; ATRW, an automatic timing (recording) device for railway wagons; KTPIS, a train passenger information system; and BCPS2440, a battery charger and power supply product. In addition, the company provides product development, electronic product design, embedded software design, electronic manufacturing, ESS testing, offshore development, quality control, and training services. It operates in India, Egypt, South Africa, Sri Lanka, and internationally. Kernex Microsystems (India) Limited was founded in 1991 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "501510",
        "website": "http://www.kernex.in",
        "market_cap": "Small Cap"
    },
    "MEGASOFT.NS": {
        "short_name": "MEGASOFT LTD",
        "long_name": "Megasoft Limited",
        "summary": "Megasoft Limited, together with its subsidiaries, provides information technology services focusing on telecommunication domain primarily in the United States, Canada, South America, Latin America, the Middle East, Africa, and the Asia-Pacific. The company engages in the computer programming, consultancy, and related activities. It offers mobile infrastructure solutions, including XIUS mobile services platform (MSP), which provides end-to-end infrastructure for 3G, 4G, 5G mobile operators, MVNE/mobile virtual network operators, converged broadband 4G/LTE service providers, mobile operator wholesale departments, and machine-to-machine/Internet of Things (IoT) service providers; XIUS MSP that offers a suite of infrastructure options, which enable real-time rating and billing; and Megasoft that enables service providers to navigate mobile ecosystems. The company also provides mobile payment technologies and services, including platforms and applications, e-wallets, and mobile and digital currencies. In addition, it offers analytics, cloud, cyber security, mobile enablement, and IoT services. Megasoft Limited was founded in 1994 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.megasoft.com",
        "market_cap": "Small Cap"
    },
    "MELSTAR.NS": {
        "short_name": "MELSTAR INFORMATIO",
        "long_name": "Melstar Information Technologies Limited",
        "summary": "Melstar Information Technologies Limited, a software services company, provides various information technology (IT) solutions primarily to banking, insurance, government, education, healthcare, and IT sectors in India and internationally. It offers application development services; application management, maintenance, and support services; packaged application services, including consulting, implementation, application maintenance and support, upgrades, and testing in the areas of enterprise resource planning; testing and applications modernization services; and other technology services. In addition, the company provides man power supply services. Melstar Information Technologies Limited was incorporated in 1986 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.melstar.com",
        "market_cap": "Small Cap"
    },
    "NEWGEN.NS": {
        "short_name": "NEWGEN SOFTWARE",
        "long_name": "Newgen Software Technologies Limited",
        "summary": "Newgen Software Technologies Limited provides software products and solutions in India, Australia, Europe, the Middle East, Africa, the Asia Pacific, and the United States. The company offers enterprise content management suite, which enables end-to-end management of enterprise content, from capture to disposition; business process management suite that provides a platform to drive enterprise-wide digital transformation; and customer communication management suite, a communication platform, which enables to share of customers' wallet by tapping various cross-sell/up-sell opportunities across touch points, such as email, SMS, Web, and print. It serves various industries, which include banking and financial services, insurance, healthcare, government, shared services, utilities, pharmaceuticals, cross, and legal. The company was founded in 1992 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110 067",
        "website": "http://www.newgensoft.com",
        "market_cap": "Large Cap"
    },
    "NUCLEUS.NS": {
        "short_name": "NUCLEUS SOFTWARE",
        "long_name": "Nucleus Software Exports Limited",
        "summary": "Nucleus Software Exports Limited provides software solutions in India, the Far East, South East Asia, Europe, the Middle East, Africa, Australia, and internationally. Its products include FinnOne Neo, a lending solution designed to support retail, corporate, and Islamic sectors comprising customer acquisition system, a loan origination software; loan management system, a bank loan management solution; web based and workflow driven solution that allows financial institutions to manage, monitor, and control the delinquent loan accounts; enterprise content management that automates the document management processes; finance against securities that establishes credit lines to individuals and corporate against the pledging of financial securities; and lending analytics, a solution for decision making. The company also offers FinnOne Neo digital portal for loan self-sourcing; digital channels that enable banks and financial services companies to provide digital lending on mobile and web portals; and lending mobility suite. In addition, it provides FinnAxia, an integrated global transaction banking solution comprising global receivables, global payments, global liquidity management, and virtual account management; FinnAxia digital compass, business internet banking, and advisory services; and FarEdge anomaly detector to detect fraudulent and dual transactions. Further, the company offers project management, consulting, training and testing, support, and analytics; application development and management, digital transformation, data management and analytics, mobile and Web application, and verification and validation; and managed infrastructure services comprising 24x7 help desk, network, end user computing and end point security, infrastructure application support, and data center. It serves retail, corporate, and Islamic banking, as well as other sectors. Nucleus Software Exports Limited was founded in 1986 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201307",
        "website": "http://www.nucleussoftware.com",
        "market_cap": "Large Cap"
    },
    "QUICKHEAL.NS": {
        "short_name": "QUICK HEAL TECHNOL",
        "long_name": "Quick Heal Technologies Limited",
        "summary": "Quick Heal Technologies Limited provides security software products and solutions to consumer, small businesses, government establishments, and corporate houses in India and internationally. The company offers cloud-based products under the Quick Heal and Seqrite brands. It also offers technical service and after-sales support services. The company sells its products through a network of service providers, system-integrators, resellers, and distributors. Quick Heal Technologies Limited was incorporated in 1995 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411014",
        "website": "http://www.quickheal.co.in",
        "market_cap": "Large Cap"
    },
    "RAMCOSYS.NS": {
        "short_name": "RAMCO SYSTEMS",
        "long_name": "Ramco Systems Limited",
        "summary": "Ramco Systems Limited operates as an enterprise software company in India, the Americas, Europe, APAC, the Middle East, and Africa. The company offers Ramco AviationSoftware, an enterprise-wide M&E/MRO software to address the needs of airlines, heli operators, MROs, and business aviation segments; Ramco VirtualWorks, a software meta model that captures data required to generate and deliver solutions in various technology platforms; and Ramco DecisionWorks for analytics/reporting. It also provides Ramco ERP on Cloud, a suite of products that covers enterprise functions, such as manufacturing; financial, supply chain, human capital, customer relationship, enterprise asset, and project management; process control; analytics; advanced planning and optimization; and connectors. In addition, the company offers Ramco Human Capital Management, a HR and talent management, and payroll software; and Ramco Logistics Software, a cloud based software that covers the needs of third-party logistics, freight forwarders, and parcel/courier service providers. Further, it provides computer programming, consultancy, hosting, and related services. Ramco Systems Limited was founded in 1992 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600113",
        "website": "http://www.ramco.com",
        "market_cap": "Large Cap"
    },
    "SASKEN.NS": {
        "short_name": "SASKEN TECHNOLOGIE",
        "long_name": "Sasken Technologies Limited",
        "summary": "Sasken Technologies Limited provides product engineering and digital transformation services worldwide. Its services include test automation, consultancy, test specifications, product testing, and application testing; and platform development and sustenance, mobility, data analytics, Internet of Things, and blockchain services to digital solutions. The company offers IC and hardware designs, platform and application software, modem software development services for semiconductor industry; hardware design and development, embedded software development, application development, android security management services, and device and platform testing solutions for smart devices and wearables; and connected infotainment, autonomous, ADAS, V2X, telematics, mobility, analytics, and cloud services for automotive industry. It also provides hardware design and development, middleware development, bearers/protocol stack porting, optimization, android security management services, device and platform testing, and mobility solutions for enterprise grade devices; heavy machinery, industrial products, smart building and home automation services, and industry 4.0 solutions for industrial automation and control services; and terminal design and development, embedded software development, access network enhancement, maintenance, IP, and application development solutions for satellite communication industry. In addition, it offers services for transportation industry. The company was formerly known as Sasken Communication Technologies Limited and changed its name to Sasken Technologies Limited in February 2017. Sasken Technologies Limited was founded in 1989 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560071",
        "website": "http://www.sasken.com",
        "market_cap": "Large Cap"
    },
    "SECURKLOUD.NS": {
        "short_name": "SECUREKLOUD TECH LIMITED",
        "long_name": "SecureKloud Technologies Limited",
        "summary": "SecureKloud Technologies Limited provides information and technology services in the United States, India, the Middle East, North America, and internationally. The company's solutions include CloudEz, an enterprise cloud management solution; EzIAM, an user life cycle management platform; CloudAuth, a multi-factor authentication-as-a-service for governing enterprise applications; DataEz, a data lake management platform; CloudEzRX, an user life cycle management platform; and CloudEzSecure, a cloud framework that provides security, which surpasses stringent security regulations. Its solutions also comprise multi-domain identity services platform, an on-demand platform that extends the capabilities of existing identity management, SSO, and legacy services; Cassandra-as-a-Service, a combination of integrated consulting and operations to enhance agility; Automaton, a cloud platform to manage security, cost, and performance in cloud; HER, an end-to-end HER services; and EzMFA, a multi-factor authentication solution for enterprise applications. In addition, the company provides cloud transformation, identity access management, Big data, cloud data analytics, managed, and UI/UX services. It serves healthcare and pharma industries. The company was formerly known as 8K Miles Software Services Limited and changed its name to SecureKloud Technologies Limited in January 2021. SecureKloud Technologies Limited was incorporated in 1985 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600018",
        "website": "http://www.8kmiles.com",
        "market_cap": "Mid Cap"
    },
    "SUBEXLTD.NS": {
        "short_name": "Subex Ltd",
        "long_name": "Subex Limited",
        "summary": "Subex Limited provides operations and business support systems to communication service providers (CSPs) worldwide. The company offers ROC Revenue Assurance, a solution that helps CSPs enhance CX minimize risk, manage margins, and get business insights true business assurance; and ROC Fraud Management solution to protect operator's voice and SMS services, data services, and new-age digital services from consumer, partner, and internal fraud. It also provides ROC Network Asset Management solution that offers a framework to audit network assets, evaluate inventory, and makes a business case for network upgradation, as well as a view of network assets and inventory to optimize opex and capex; and ROC Capacity Management, a solution, which gleans insights from network capacity trends, identifies capacity hot-spots, and predicts time-to-exhaustion. In addition, the company offers ROC Partner Management, a solution that facilitates in swift partner onboarding, partner self-care, revenue visibility, and communication between Telco and its partners; ROC Route Optimization solution, which processes from dial code/destination operator rate imports to switch updates; and Partner Settlement, a solution that facilitates billing and settlement to manage revenue and margins across interconnect and digital ecosystem. Further, it provides Internet of Things security, a solution from real-time discovery and monitoring to response and recovery; Analytics Center of Trust that offers end-to-end analytics framework; CrunchMetrics, a real-time analytics platform that analyzes streaming data to identify critical incidents and business opportunities; IDcentral, an identity repository enabling enterprises to convert attributes to digital identities; and managed, and consulting and assessment services. The company was formerly known as Subex Azure Limited and changed its name to Subex Limited in December 2007. Subex Limited was founded in 1992 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560103",
        "website": "http://www.subex.com",
        "market_cap": "Large Cap"
    },
    "TANLA.NS": {
        "short_name": "TANLA PLATFORMS L",
        "long_name": "Tanla Platforms Limited",
        "summary": "Tanla Platforms Limited, together with its subsidiaries, provides cloud communication services for mobile operators and enterprises in India and internationally. It offers messaging products and services, such as Application to Peer short message services (SMS) on business-as-a-service basis; SMS Firewall, a telco grade platform that plugs loop holes in the telecom network for fraud and revenue leakage using various filtering capabilities; SMS Hub, a solution that simplifies SMS interoperability, manages number portability, and introduces real-time online monitoring to manage large volumes of SMS; unstructured supplementary service data (USSD) Center for service providers, MVNO's, and wireless operators to offer USSD-based applications and services to enterprises; and Push Notifications to create and manage multiple push notification campaigns through a single user interface. The company also provides cloud voice services, including Hosted IVR solution that enables enterprises to design, build, and update custom IVR applications using a web interface; Voice Broadcast technology that enables enterprises to initiate and deploy personalized interactive voice broadcasts; Free Ring, a solution for engaging and interactive communications with customers and prospects; and Source Trace, which enables enterprises and agencies to track inbound calls back to the marketing source. In addition, it offers IoT platform, which enables businesses to connect people, machines, and processes, as well as provides chat and marketing automation products, and aggregator and offshore development services. Tanla Platforms Limited has partnership with Microsoft to launch blockchain-enabled CPaaS platform. The company was formerly known as Tanla Solutions Limited and changed its name to Tanla Platforms Limited in October 2020. Tanla Platforms Limited was incorporated in 1995 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500081",
        "website": "http://www.tanla.com",
        "market_cap": "Large Cap"
    },
    "TATAELXSI.NS": {
        "short_name": "TATA ELXSI",
        "long_name": "Tata Elxsi Limited",
        "summary": "Tata Elxsi Limited provides product design and engineering, and systems integration and support services in India, the United States, Europe, and internationally. It operates through two segments, Software Development and Services; and Systems Integration and Support. The company offers technology consulting, new product design, development, and testing services for broadcast, consumer electronics, healthcare, telecom, and transportation industries; and electronics, software development, and system design services for automotive and aerospace industries. It also provides animation and visual effects services in the areas of 3D stereoscopy, CG animation, visual effects, and gaming for television service and commercials, custom content development, logos and graphics, and films. In addition, the company offers services in collecting, managing, visualizing, and analyzing data to provide actionable insights combined with predictive/prescriptive analytics; and industrial design services in the areas of consumer insight, branding, industrial design, visual design and merchandising, design engineering, and manufacturing support. Further, it offers design, branding, and mechanical detailing for devices, sensors, and gateways; device, sensor, gateway hardware, system, and application development services; communications integration and testing services; connectivity, device management, big data, network management, analysis and prediction model, and hosted services; and application service/workflow, and user experience and UI design services, as well as mobile/Web-based app development services. Additionally, the company implements and integrates systems and solutions for computing, CAD/CAM/CAE/PLM, broadcast, virtual reality, storage, and disaster recovery, as well as provides professional services for the maintenance and support of IT infrastructure. Tata Elxsi Limited was incorporated in 1989 and is headquartered in Bengaluru, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bengaluru",
        "zipcode": "560048",
        "website": "http://www.tataelxsi.com",
        "market_cap": "Large Cap"
    },
    "TREJHARA.NS": {
        "short_name": "TREJHARA SOLUTIONS",
        "long_name": "Trejhara Solutions Limited",
        "summary": "Trejhara Solutions Limited provides technology products and solutions in the Asia Pacific and internationally. The company offers Interact DX, a communication management product suite in the digitization domain, which provides interactive personalized communication including audio video technology, bills, statements, targeted advertisements, policy kits, welcome kits, receipts, loyalty/rewards, KYC forms, advisory, and notifications across multiple channels, such as email, web, mobile, print, and kiosk. It also provides SCM Profit, a logistic solution that allows to streamline and enhance logistics operations in various segments, such as warehousing, freight forwarding, project logistics, manufacturing, distribution, supplier collaboration and visibility, etc. In addition, the company offers IT consulting and provides resources to corporation in segments, such as banking, insurance, telecom, utility, and retail. Trejhara Solutions Limited was incorporated in 2017 and is headquartered in Thane, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Thane",
        "zipcode": "400701",
        "website": "http://www.trejhara.com",
        "market_cap": "Small Cap"
    },
    "VAKRANGEE.NS": {
        "short_name": "VAKRANGEE LTD",
        "long_name": "Vakrangee Limited",
        "summary": "Vakrangee Limited, a technology company, provides banking, ATM, insurance, financial services, e-governance, e-commerce, and logistics services in India. The company offers bank account opening, cash deposits, withdrawals, money transfer, fixed and recurring deposits, balance enquiry, statement of accounts, money disbursement, consumer loans, housing loans, SME and working capital loans, and domestic money transfer services; and life insurance, motor insurance, health insurance, and social security and micro insurance schemes. It also operates assisted online shopping and healthcare, assisted travel services, and telecom and bill payments services platforms, as well as offers courier and logistics services. The company operates approximately 10,000 Vakrangee Kendra outlets. The company was formerly known as Vakrangee Softwares Limited and changed its name to Vakrangee Limited in October 2013. Vakrangee Limited was founded in 1990 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Technology",
        "industry": "Software - Application",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://vakrangee.in",
        "market_cap": "Large Cap"
    }
}