{
    "0OH.F": {
        "short_name": "OOH MEDIA LTD",
        "long_name": "oOh!media Limited",
        "summary": "oOh!media Limited operates as an out of home media company in Australia and New Zealand. The company's portfolio includes large format classic and digital roadside screens; classic and digital signs in shopping centers, airport terminals, and lounges, as well as in cafes, pubs, universities, office buildings, and gyms; classic and digital street furniture signs; classic and digital rail, and classic format advertising in public transportation corridors, such as rail; and online sites for millennials, students, flyers, small businesses, and city-based audiences. It also engages in content production and digital printing operations. The company serves advertisers, landlords, leaseholders, community organizations, local councils, and governments in reaching various public audiences. oOh!media Limited was founded in 1989 and is headquartered in North Sydney, Australia.",
        "currency": "EUR",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "EGG.AX": {
        "short_name": "ENERO FPO",
        "long_name": "Enero Group Limited",
        "summary": "Enero Group Limited provides integrated marketing and communication services in Australia, the United Kingdom, rest of Europe, and the United States. Its services include strategy, market research and insights, advertising, digital, public relations, communications planning, designing, events management, direct marketing, corporate communications, and programmatic media. The company was incorporated in 2000 and is based in Pyrmont, Australia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pyrmont"
    },
    "GWC.NZ": {
        "short_name": "Snakk Media Limited Ordinary Sh",
        "long_name": "Goodwood Capital Limited",
        "summary": "Goodwood Capital Limited operates as a mobile media advertising company in Australia, New Zealand, and Southeast Asia. It offers precision geo-location and audience based in-app and mobile Web advertising solutions. The company also provides programmatic geographic mobile platform for customers to manage on a self-service basis. The company was formerly known as Snakk Media Limited and changed its name to Goodwood Capital Limited in October 2020. Goodwood Capital Limited was founded in 2010 and is headquartered in Sydney, Australia. As of October 19, 2020, Goodwood Capital Limited was taken private.",
        "currency": "NZD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "NZE",
        "market": "nz_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "MXO.AX": {
        "short_name": "MOTIO FPO",
        "long_name": "Motio Limited",
        "summary": "Motio Limited provides advertising services for metro rail operators and outdoor media companies in Australia. It builds, installs, and maintains cross-track digital systems. The company was formerly known as XTD Limited and changed its name to Motio Limited in November 2020. The company is based in Perth, Australia. Motio Limited is a subsidiary of Lunalite International Pty Ltd.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "OML.AX": {
        "short_name": "OOHMEDIA FPO",
        "long_name": "oOh!media Limited",
        "summary": "oOh!media Limited operates as an out of home media company in Australia and New Zealand. The company's portfolio includes large format classic and digital roadside screens; classic and digital signs in shopping centers, airport terminals, and lounges, as well as in cafes, pubs, universities, office buildings, and gyms; classic and digital street furniture signs; classic and digital rail, and classic format advertising in public transportation corridors, such as rail; and online sites for millennials, students, flyers, small businesses, and city-based audiences. It also engages in content production and digital printing operations. The company serves advertisers, landlords, leaseholders, community organizations, local councils, and governments in reaching various public audiences. oOh!media Limited was founded in 1989 and is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "PPL.AX": {
        "short_name": "PUREPROFIL FPO",
        "long_name": "Pureprofile Ltd",
        "summary": "Pureprofile Ltd provides profile marketing and insights technology services for marketers, researchers, and publishers in Australia and internationally. The company operates through three segments: Data & Insights, Media, and Performance. The Data & Insights segment conducts market research; and provides research technology platforms. The Media segment buys and sells online advertising inventory on behalf of advertisers and publishers. The Performance segment generates leads for clients through its consumer database and proprietary and partner digital assets. It collects deep profiles of consumers and provides businesses the ability to segment, target, and engage with audiences through research, marketing, and advertising. Pureprofile Ltd was founded in 2000 and is headquartered in Darlinghurst, Australia.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Darlinghurst"
    },
    "WPP.AX": {
        "short_name": "WPP AUNZ FPO",
        "long_name": "WPP AUNZ Limited",
        "summary": "WPP AUNZ Limited, together with its subsidiaries, provides marketing, content, and communications services in Australia and internationally. The company operates through four segments: Global Integrated Agencies, Large Format Production, Public Relations & Public Affairs, and Specialist Communications. Its services include advertising, content, media investment management, public relations and public affairs, branding, service design, platforms and applications, data management, marketing technology consulting, and systems integration services; and branding and identity, digital, e-commerce and shopper marketing, and production and specialist communications. The company was formerly known as STW Communications Group Limited and changed its name to WPP AUNZ Limited in May 2016. The company is headquartered in Millers Point, Australia. WPP AUNZ Limited is a subsidiary of WPP plc.",
        "currency": "AUD",
        "sector": "Communication Services",
        "industry": "Advertising Agencies",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Millers Point"
    }
}