{
    "ABV.AX": {
        "short_name": "ADV BRAKE FPO",
        "long_name": "Advanced Braking Technology Limited",
        "summary": "Advanced Braking Technology Limited researches, designs, develops, manufactures, commercializes, and sells braking systems and brake parts worldwide. The company offers service, parking, and emergency sealed integrated braking systems for light, underground mining, and heavy vehicles under the Terra Dura, ABT Failsafe, and ABT Failsafe Emergency brand names. It also provides installation and maintenance services. The company serves in various industries, including mining, defense, civil construction, and waste management. Advanced Braking Technology Limited is headquartered in Wangara, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Wangara"
    },
    "ARBFF": {
        "short_name": "ARB CORPORATION(NEW)",
        "long_name": "ARB Corporation Limited",
        "summary": "ARB Corporation Limited designs, manufactures, distributes, and sells motor vehicle accessories and light metal engineering works in Australia, the United States, New Zealand, Thailand, the Middle East, and Europe. The company provides bull bars, side rails and side steps, canopies, UTE lids and tub accessories, roof racks and bars, suspension systems, driving lights, air compressors and tire accessories, air lockers, winches, recovery equipment, recovery points, under vehicle protection products, fuel tanks and storage, drawers and cargo solutions, portable fridge freezers, tents, swags and awnings, camping and touring accessories, safari snorkels, dual battery and solar systems, and general accessories, as well as rear protection, towing, and wheel carriers. It also offers LINX, a controller that declutters the dashboard and centralizes the command of vehicle accessories by replacing classic switches, gauges and monitors with one sleek and smart driver interface; and UHF radios, map navigators, and GPS and reversing cameras. The company serves stockists, vehicle dealers, and various fleet operators. It operates approximately 67 ARB stores, which include 27 company owned stores in Australia. ARB Corporation Limited was founded in 1975 and is based in Kilsyth, Australia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Kilsyth"
    },
    "NTD.AX": {
        "short_name": "TYRENWHEEL FPO",
        "long_name": "National Tyre & Wheel Limited",
        "summary": "National Tyre & Wheel Limited distributes and markets tires, wheels, tubes, and related products in Australia, New Zealand, and South Africa. The company offers its products for cars, buses, trucks, commercial vans, agricultural vehicles, 4WD's, SUV's, turf and off the road equipment, industrial vehicles, and caravans and trailers. National Tyre & Wheel Limited was founded in 1989 and is based in Moorooka, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Moorooka"
    },
    "PWH.AX": {
        "short_name": "PWR HLDING FPO",
        "long_name": "PWR Holdings Limited",
        "summary": "PWR Holdings Limited engages in designing, prototyping, production, testing, validation, and sales of cooling products and solutions in Australia, the United States, the United Kingdom, Italy, Germany, and internationally. It operates through two segments, PWR Performance Products, and C&R. The company offers radiators, such as car radiators and radiator cores; and air to air, air to ice, and liquid to air intercoolers, as well as aero 2 universal cast tanks, intercooler kits, and air to air intercooler cores. It also provides engine, in-tank, inline engine, transmission, and power steering/diff/aux oil coolers; and accessories, including thermo fans, power steering reservoirs, radiator caps, expansion-recovery-surge tanks, fillers-fittings, liquid to air pumps, silicon hoses, T-bolt clamps, outlets, and other products. The company offers its cooling solutions for the motorsports, automotive original equipment manufacturing, automotive aftermarket, and emerging technologies sectors, as well as for racing, 4WD and off-road vehicle, military, and industrial applications. PWR Holdings Limited was founded in 1987 and is headquartered in Ormeau, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Ormeau"
    },
    "SFC.AX": {
        "short_name": "SCHAFFER FPO",
        "long_name": "Schaffer Corporation Limited",
        "summary": "Schaffer Corporation Limited, a diversified industrial company, manufactures and sells automotive leather and building materials primarily in Australia, Asia, and Europe. The company's Automotive Leather segment manufactures and supplies leather to automotive manufacturers in the automotive industry. Its Building Materials segment manufactures pre-cast and pre-stressed concrete floors, beams, and wall products primarily for the construction market. The Group Investments segment leases office, factory, and retail properties; and develops and sells property assets. It also owns the North Coogee land, a residential property. The company was incorporated in 1955 and is headquartered in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto Parts",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    }
}