{
    "APE.AX": {
        "short_name": "EAGERS FPO",
        "long_name": "Eagers Automotive Limited",
        "summary": "Eagers Automotive Limited engages in the ownership and operation of motor vehicle and truck dealerships in Australia and New Zealand. It operates through four segments: Car Retailing, Truck Retailing, Property, and Investments. The Car Retailing segment offers a range of automotive products and services, including new vehicles, used vehicles, vehicle maintenance and repair services, vehicle parts, service contracts, vehicle brokerage services, vehicle protection products, and other aftermarket products. It also facilitates financing for vehicle purchases through third-party sources. In addition, this segment is involved in motor auction and forklift rental businesses. The Truck Retailing segment offers various products and services comprising new trucks, used trucks, truck maintenance and repair services, truck parts, service contracts, truck protection products, and other aftermarket products; and facilitates financing for truck purchases through third-party sources. The Property segment acquires and rents commercial properties. The Investment segment is involved in investment activities. The company was formerly known as A.P. Eagers Limited and changed its name to Eagers Automotive Limited in July 2020. Eagers Automotive Limited was founded in 1913 and is based in Newstead, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Newstead"
    },
    "ASG.AX": {
        "short_name": "AUTOSPORTS FPO",
        "long_name": "Autosports Group Limited",
        "summary": "Autosports Group Limited, together with its subsidiaries, operates in the retail automotive industry in Australia. It sells new and used motor vehicles, aftermarket products, and spare parts; distributes finance and insurance products; and provides motor vehicle servicing and collision repair services. As of June 30, 2020, it operates 41 franchised dealerships; 3 used motor vehicle outlets; and 6 motor vehicle collision repair facilities. Autosports Group Limited was founded in 2006 and is based in Leichhardt, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Leichhardt"
    },
    "MTO.AX": {
        "short_name": "MOTORCYCLE FPO",
        "long_name": "MotorCycle Holdings Limited",
        "summary": "MotorCycle Holdings Limited owns and operates motorcycle dealerships in Australia. It operates in two segments, Motorcycle Retailing and Motorcycle Accessories Wholesaling. The company is involved in the sale of new motorcycles, used motorcycles, accessories and parts, and mechanical protection plan contracts; wholesaling and retailing of motorcycle accessories; and finance, insurance, and warranty activities, as well as servicing and repair of motorcycles. It also owns and operates a rider training school and a motorcycle repair business that performs smash repair work for insurers. The company operates 48 franchises from 31 dealership and 8 retail accessory locations in Queensland, New South Wales, Victoria, and the Australian Capital Territory. MotorCycle Holdings Limited was founded in 1989 and is based in Slacks Creek, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Auto & Truck Dealerships",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Slacks Creek"
    }
}