{
    "FFI.AX": {
        "short_name": "F.F.I.HOLD FPO",
        "long_name": "FFI Holdings Limited",
        "summary": "FFI Holdings Limited, a food processing company, engages in the processing, manufacture, packaging, and distribution of food products in Australia. The company operates through Bakery and Investment Property segments. It offers bakers' jams and fruit fillings for use in bakery products, including donuts, tarts, swiss rolls, pastries, sponge cakes, and various post bake applications; fruit mince for use in tarts and slices; patisserie fillings, spreads, and glazes; fresh diced Apple; chocolate and confectionery products; cake icings, toppings, and decoration items; ice creams and desserts; and bacon and other processed meat products. The company also provides ready to roll icing and popcorn snack foods for the retail market under the Nemar, Golden Popcorn, and Orchard Icing brand names. In addition, it processes and packages a range of products for the home cooking market sector under the Prepact and Snowflake brands; and provides contract packing services for third party brands. Further, the company owns industrial and commercial property for investment purposes. It serves bakers and pastry cooks, and supermarkets, as well as ice cream and dairy, confectionery, chocolate, and food services industries. The company was founded in 1979 and is headquartered in Jandakot, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Jandakot",
        "zipcode": "6164",
        "website": "http://www.ffiholdings.com.au",
        "market_cap": 72955512
    },
    "YOW.AX": {
        "short_name": "YOWIE FPO",
        "long_name": "Yowie Group Limited",
        "summary": "Yowie Group Limited, a brand licensing company, develops and sells consumer products worldwide. Its product portfolio comprises gummy, bites, and surprise-inside the egg. The company owns intellectual property rights to supply Yowie branded chocolate confectionery products, as well as develops Yowie digital platform and Yowie branded licensed consumer products. Yowie Group Limited is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Confectioners",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://www.yowiegroup.com",
        "market_cap": 8961288
    }
}