{
    "CCP.AX": {
        "short_name": "CREDITCORP FPO",
        "long_name": "Credit Corp Group Limited",
        "summary": "Credit Corp Group Limited provides debt purchase and collection, and consumer lending services in Australia and the United States. It operates through three segments: Debt Ledger Purchasing Â\u0096 Australia and New Zealand, Debt Ledger Purchasing Â\u0096 United States, and Consumer Lending Â\u0096 Australia and New Zealand. The company offers debt sale, contingency and agency collection, local government debt recovery, and hardship and insolvency management services, as well as various loan products. It provides financial services under the Wallet Wizard, ClearCash, CarStart Finance, Credit 2U, and CapTrove brands. Credit Corp Group Limited was founded in 1992 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "EPY.AX": {
        "short_name": "EARLYPAY FPO",
        "long_name": "Earlypay Ltd",
        "summary": "Earlypay Ltd provides financial solutions SME businesses in Australia. It operates through Finance, Equipment Finance, and Other Services segments. The company offers invoice factoring and discounting, and receivables finance services. It also provides equipment finance services for old and new equipment, such as sale back of owned or partially owned equipment, private sales, and mid-term financing. In addition, the company offers employment solutions comprising labor sourcing and project management; and trade finance services. Further, it operates Skippr, an online lending platform. The company was formerly known as CML Group Limited and changed its name to Earlypay Ltd in November 2020. Earlypay Ltd was founded in 2001 and is based in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "F5L.F": {
        "short_name": "HUMM GROUP LTD",
        "long_name": "Humm Group Limited",
        "summary": "Humm Group Limited provides various financial services in Australia, New Zealand, and Ireland. It operates through four segments: Buy Now Pay Later, New Zealand Cards, Australia Cards, and Commercial Leasing. The company offers consumer revolving finance, commercial Leasing, and SME financing service. It also provides no interest ever, leasing, vendor finance, interest free finance, credit cards, and other finance solutions to consumers and businesses. The company offers its services under the humm, bundll, Q Mastercard, Skye Mastercard, and FlexiCommercial brands. The company was formerly known as FlexiGroup Limited and changed its name to Humm Group Limited in November 2020. Humm Group Limited was founded in 1988 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "HUM.AX": {
        "short_name": "HUMMGROUP FPO",
        "long_name": "Humm Group Limited",
        "summary": "Humm Group Limited provides various financial services in Australia, New Zealand, and Ireland. It operates through four segments: Buy Now Pay Later, New Zealand Cards, Australia Cards, and Commercial Leasing. The company offers consumer revolving finance, commercial Leasing, and SME financing service. It also provides no interest ever, leasing, vendor finance, interest free finance, credit cards, and other finance solutions to consumers and businesses. The company offers its services under the humm, bundll, Q Mastercard, Skye Mastercard, and FlexiCommercial brands. The company was formerly known as FlexiGroup Limited and changed its name to Humm Group Limited in November 2020. Humm Group Limited was founded in 1988 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "IMMFF": {
        "short_name": "OMNI BRIDGEWAY LTD",
        "long_name": "Omni Bridgeway Limited",
        "summary": "Omni Bridgeway Limited engages in investing in litigation and dispute resolution matters in Australia, the United States, Canada, Asia, Europe, the Middle East, and Africa. It offers litigation financing solutions, including bankruptcy, commercial, intellectual property, investor recoveries, class/group actions, appeals, and whistleblower. The company also provides arbitration financing; funding for companies; judgment enforcement; law firm financing; and distressed asset recovery solutions. It serves individual claimants, law firms, corporations, sovereigns, and multilateral institutions. The company was formerly known as IMF Bentham Limited and changed its name to Omni Bridgeway Limited in March 2020. Omni Bridgeway Limited was founded in 1986 and is based in Sydney, Australia.",
        "currency": "USD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "LAW.AX": {
        "short_name": "LAWFINANCE FPO",
        "long_name": "LawFinance Limited",
        "summary": "LawFinance Limited provides financing solutions to law firms in Australia and the United States. The company operates through JustKapital Finance and National Health Finance segments. It offers disbursement and short-term, and medical lien funding services. The company was formerly known as JustKapital Limited and changed its name to LawFinance Limited in October 2018. LawFinance Limited is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "LIT.L": {
        "short_name": "LITIGATION CAPITAL MANAGEMENT L",
        "long_name": "Litigation Capital Management Limited",
        "summary": "Litigation Capital Management Limited provides litigation finance and risk management services associated with individual and portfolios of litigation projects in Australia and the United Kingdom. Its services include single-case and portfolios; and class actions, commercial claims, claims arising out of insolvency, and international arbitration. The company was founded in 1998 and is headquartered in Sydney, Australia.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "MNY.AX": {
        "short_name": "MONEY3 FPO",
        "long_name": "Money3 Corporation Limited",
        "summary": "Money3 Corporation Limited provides secured vehicle loans in Australia and New Zealand. The company offers vehicle loans that include loans for new and used cars, campervans, vans, minibuses, motorbikes, caravans, utes, trailers, boats, jet skis, trucks, ride on mowers, and tractors. It also provides secured and unsecured personal, and cash loans. The company provides loans through brokers under the Money3 and GoCarFinance brand names. Money3 Corporation Limited was incorporated in 2005 and is headquartered in Bundoora, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Bundoora"
    },
    "PLT.AX": {
        "short_name": "PLENTI GRP FPO",
        "long_name": "Plenti Group Limited",
        "summary": "Plenti Group Limited engages in the consumer lending and investment business in Australia and New Zealand. It provides automotive loans; unsecured loans for the purchase and installation of residential renewable energy equipment, such as solar panels and home batteries; and personal loans for a range of purposes, including debt consolidation, home improvement, legal expenses, travel, medical expenses, and other purposes. The company offers its services through funding platforms. Plenti Group Limited was incorporated in 2012 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "PYR.AX": {
        "short_name": "PAYRIGHT FPO",
        "long_name": "Payright Limited",
        "summary": "Payright Limited provides in-store credit, point of sale, and online buy now pay later payment options at participating merchants and retailers in Australia and New Zealand. The company's instore and online digital application portal provides customers with flexible payment options at the point of sale, making higher price point products and servicesÂ\u0096transactions. Its platform enables consumers to make a purchase through an approved merchant, and to pay for the product or service over time based on agreed loan repayment terms. Payright Limited serves retail, home improvement, health and beauty, photography, education, and automotive sectors. The company was formerly known as Devizo Pty Ltd. Payright Limited was founded in 2015 and is based in Balwyn, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Balwyn"
    },
    "TSL.L": {
        "short_name": "THINKSMART LIMITED ORD NPV (DI)",
        "long_name": "ThinkSmart Limited",
        "summary": "ThinkSmart Limited, a digital payments company, provides leasing point of sale finance for consumers and businesses in the United Kingdom and Australia. It offers payment propositions, digital credit decisions, and customer life cycle contract management through its technology platform SmartCheck. The company was founded in 1996 and is based in Subiaco, Australia.",
        "currency": "GBp",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "Australia",
        "city": "Subiaco"
    },
    "WZR.AX": {
        "short_name": "WISR LTD FPO",
        "long_name": "Wisr Limited",
        "summary": "Wisr Limited engages in the lending business in Australia. It offers personal loans for 3, 5, and 7-year maturities to consumers, then on-sells these loans to retail, wholesale, and institutional investors. Wisr Limited was incorporated in 1966 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "YRR.F": {
        "short_name": "ZIP CO. LTD",
        "long_name": "Zip Co Limited",
        "summary": "Zip Co Limited provides point-of-sale credit and digital payment services to consumers and merchants in Australia, the United Kingdom, the United States, New Zealand, and South Africa. The company operates through ZIP AU, Zip Global, and Spotcap segments. It offers integrated retail finance solutions to merchants in the retail, education, health, and travel industries through online and in store. The company provides Zip Pay and Zip Money, which are digital wallets; and Pocketbook, a personal finance application to help people manage their finances, budget, and savings, as well as unsecured loans to small and medium sized businesses. In addition, it offers a Buy Now Pay Later services whereby consumers split repayments into equal instalments. The company was formerly known as ZipMoney Limited and changed its name to Zip Co Limited in December 2017. Zip Co Limited was incorporated in 2009 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Financial Services",
        "industry": "Credit Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    }
}