{
  "AMO.AX": {
    "city": "Warriewood",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Ambertech Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "AMBERTECH FPO",
    "state": "NSW",
    "summary": "Ambertech Limited, together with its subsidiaries, provides various technologies for the professional and consumer audio/visual markets in Australia and New Zealand. It operates through Professional, Lifestyle Entertainment, and New Zealand segments. The company distributes high technology equipment to professional broadcast, film, recording, and sound reinforcement industries; home theatre products to dealers; projection and display products for business and domestic applications; and custom installation components for home theatre, and commercial installations to dealers and consumers. Its home entertainment products include home cinema and theatre systems, Hi-Fi, and personal audio solutions; speakers, sound bars, and headphones; remote controls and antennas; and connectors, cables, and accessories. The company's professional performance equipment comprise live sound and video production solutions, music equipment, recording equipment and microphones, and video editing and post production systems. It also offers content creation, acquisition, deliver, processing, and asset management for broadcast and media in the areas of production systems, data management, video delivery, infrastructure hardware, cloud and IP video, post, remote operations, and workflow management. In addition, the company offers acoustic panels, amplifiers, audio preamps and matrix controllers, cameras, cases, guitars, hearing augmentation products, microphones, networking products, projectors, receivers, screens, sound level meters, speakers, speech transfer and tour guide systems, vocal and instrument processors, racks, studio and stage products, and audio video content players and recorders; and commercial and residential installation services. It operates through a network of dealers. The company was founded in 1987 and is based in Warriewood, Australia.",
    "website": "http://www.ambertech.com.au",
    "zipcode": "2102"
  },
  "D0D.F": {
    "city": "Kurnell",
    "country": "Australia",
    "currency": "EUR",
    "exchange": "FRA",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Dicker Data Limited",
    "market": "dr_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DICKER DATA LTD",
    "state": "NSW",
    "summary": "Dicker Data Limited engages in the wholesale distribution of computer hardware, software, and related products in Australia and New Zealand. It sells its products to approximately 6,000 resellers. The company was formerly known as Rodin Corporation Pty Limited. Dicker Data Limited was incorporated in 1978 and is headquartered in Kurnell, Australia.",
    "website": "http://www.dickerdata.com.au",
    "zipcode": "2231"
  },
  "DDR.AX": {
    "city": "Kurnell",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronics & Computer Distribution",
    "long_name": "Dicker Data Limited",
    "market": "au_market",
    "market_cap": "Small Cap",
    "sector": "Technology",
    "short_name": "DICKERDATA FPO",
    "state": "NSW",
    "summary": "Dicker Data Limited engages in the wholesale distribution of computer hardware, software, and related products in Australia and New Zealand. It sells its products to approximately 6,000 resellers. The company was formerly known as Rodin Corporation Pty Limited. Dicker Data Limited was incorporated in 1978 and is headquartered in Kurnell, Australia.",
    "website": "http://www.dickerdata.com.au",
    "zipcode": "2231"
  },
  "TTA.AX": {
    "city": "Keilor Park",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Electronics & Computer Distribution",
    "long_name": "TTA Holdings Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Technology",
    "short_name": "TTA HOLDIN FPO",
    "state": "VIC",
    "summary": "TTA Holdings Limited, through its subsidiary, TEAC Australia Pty Limited, distributes TEAC branded audio and visual consumer electronic products to retailers in Australia. Its audio products include sound systems, portable audios, Bluetooth speakers, sound bars, digital radios, and clock radios; and visual products comprise LED flat panel televisions, televisions with built in DVD players, UHD smart and non-smart televisions, set top boxes, and DVD players. The company is based in Thomastown, Australia. TTA Holdings Limited is a subsidiary of TT International Limited.",
    "website": "http://www.teac.com.au",
    "zipcode": "3042"
  }
}
