{
  "CVW.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Financial Conglomerates",
    "long_name": "ClearView Wealth Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "CLEARVIEW FPO",
    "state": "NSW",
    "summary": "ClearView Wealth Limited provides life insurance, wealth management, and financial advisory solutions in Australia. It operates through three segments: Life Insurance, Wealth Management, and Financial Advice. The Life Insurance segment provides life insurance products, including term life, permanent disability, trauma and critical illness benefits, child cover, accident covers, income protection, and business expense covers through financial advisers, third parties, and external advisers. The Wealth Management segment offers life investment contracts, including ordinary savings, superannuation, and allocated pension products; superannuation and retirement income wraps, and investor directed portfolio service wraps; and managed investment schemes. The Financial Advice segment provides financial advisory services, which include licensing and dealer services, as well as LaVista licensee solutions that provide outsourced B2B licensee services to other Australian financial services licensees. ClearView Wealth Limited was founded in 1976 and is headquartered in Sydney, Australia.",
    "website": "http://www.clearview.com.au",
    "zipcode": "2000"
  },
  "GDG.AX": {
    "city": "Melbourne",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Financial Conglomerates",
    "long_name": "Generation Development Group Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Financial Services",
    "short_name": "GEN DEV FPO",
    "state": "VIC",
    "summary": "Generation Development Group Limited manages and markets life insurance and life investment products and services to the retail sector in Australia. It offers investment bond product solutions; and administration services, including unit pricing, fund valuation, investment and fund accounting, fund administration, and business registry. The company was formerly known as Austock Group Limited and changed its name to Generation Development Group Limited in March 2018. Generation Development Group Limited was founded in 1991 and is headquartered in Melbourne, Australia.",
    "website": "http://www.gendevelopmentgroup.com.au",
    "zipcode": "3000"
  },
  "INV.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Financial Conglomerates",
    "long_name": "InvestSMART Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "INVESTSGRP FPO",
    "state": "NSW",
    "summary": "InvestSMART Group Limited provides financial services and products under general advice to retail investors in Australia. It primarily offers wealth and funds management, and personal insurance services. The company was formerly known as Australasian Wealth Investments Limited and changed its name to InvestSMART Group Limited in May 2016. InvestSMART Group Limited was founded in 1999 and is headquartered in Sydney, Australia.",
    "website": "http://www.investsmart.com.au",
    "zipcode": "2000"
  },
  "SEQ.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Financial Conglomerates",
    "long_name": "Sequoia Financial Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "SEQUOIA FPO",
    "state": "NSW",
    "summary": "Sequoia Financial Group Limited, an integrated financial services company, provides financial products and services to retail and wholesale clients, and third party professional service firms primarily in Australia. The company operates through Sequoia Wealth Group, Sequoia Professional Services Group, Sequoia Equity Markets Group, and Sequoia Direct Investment Group segments. It offers products and services, such as adviser market licensing and support, merger and acquisitions, and corporate advisory services to financial planners, wealth managers, equity advisers, and corporate advisory business units. The company also provides self-managed super fund (SMSF) solutions, general insurance broking, and legal document establishment services to financial planners, stock brokers, mortgage brokers, and accountants. In addition, it offers stockbroking and specialized investment solutions to third party institutional and adviser networks; general advisory services for investors on portfolio management and SMSF management share trading, superannuation, products, and insurance; and market data, robo advice, and trading tools through independent news services specializing in finance and business news updates, events, and investor communication for ASX-listed companies. The company was formerly known as MDS Financial Group Limited and changed its name to Sequoia Financial Group Limited in November 2015. Sequoia Financial Group Limited is headquartered in Sydney, Australia.",
    "website": "http://www.sequoia.com.au",
    "zipcode": "2000"
  },
  "YBR.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Financial Conglomerates",
    "long_name": "Yellow Brick Road Holdings Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "YELLOWBRIC FPO",
    "state": "NSW",
    "summary": "Yellow Brick Road Holdings Limited provides lending services in Australia. It offers mortgage broking, aggregation, and management services; investment and wealth management services; and general insurance services. The company was formerly known as ITS Capital Investments Limited and changed its name to Yellow Brick Road Holdings Limited in May 2011. Yellow Brick Road Holdings Limited was founded in 2007 and is based in Sydney, Australia.",
    "website": "http://www.ybr.com.au",
    "zipcode": "2000"
  },
  "YBRHF": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "USD",
    "exchange": "PNK",
    "industry": "Financial Conglomerates",
    "long_name": "Yellow Brick Road Holdings Limited",
    "market": "us_market",
    "market_cap": "Nano Cap",
    "sector": "Financial Services",
    "short_name": "YELLOW BRICK ROAD HOLDINGS LIMI",
    "state": "NSW",
    "summary": "Yellow Brick Road Holdings Limited provides lending services in Australia. It offers mortgage broking, aggregation, and management services; investment and wealth management services; and general insurance services. The company was formerly known as ITS Capital Investments Limited and changed its name to Yellow Brick Road Holdings Limited in May 2011. Yellow Brick Road Holdings Limited was founded in 2007 and is based in Sydney, Australia.",
    "website": "http://www.ybr.com.au",
    "zipcode": "2000"
  }
}
