{
  "CLX.AX": {
    "city": "West Perth",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Integrated Freight & Logistics",
    "long_name": "CTI Logistics Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "CTI LOGIST FPO",
    "state": "WA",
    "summary": "CTI Logistics Limited provides transport and logistics services in Australia. It operates through three segments: Transport, Logistics, and Property. The company offers transport services, such as courier, parcel distribution, taxi truck, fleet management, heavy haulage, line haul, and freight forwarding services. It also provides warehousing and distribution services, including contracted distribution center, overflow warehousing, temperature controlled storage, pick and pack, bulk product storage, external laydown area storage, stock control management, and quarantine inspection and processing services. In addition, the company offers temperature controlled storage, warehousing, and distribution services for wine, and food and health products; and logistical support services to the minerals and energy sector. Further, it provides security systems and services comprising electronic alarms, CCTVs, and access control systems for residential and commercial premises; and records management services consisting of document and archive storage, core sample storage, data and media storage, imaging and scanning, scheduled pickup and deliveries, and document destruction, as well as provides online access to reports and file activities. Additionally, the company offers shredding and recycling services; and wrapping services, including cleaning of plant and equipment, fumigation and spraying services, and sealed quarantine wrapping. The company is also involved in the rental of owner-occupied and investment properties. CTI Logistics Limited was founded in 1974 and is based in West Perth, Australia.",
    "website": "http://www.ctilogistics.com",
    "zipcode": "6005"
  },
  "DBI.AX": {
    "city": "Brisbane",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Dalrymple Bay Infrastructure Limited",
    "market": "au_market",
    "market_cap": null,
    "sector": "Industrials",
    "short_name": "DALRYMPLE STAPLED",
    "state": "QLD",
    "summary": "Dalrymple Bay Infrastructure Limited operates metallurgical coal export terminal in Australia. It also provides port infrastructure and services. The company was incorporated in 2020 and is based in Brisbane, Australia.",
    "website": "http://www.dbinfrastructure.com.au",
    "zipcode": "4000"
  },
  "KSC.AX": {
    "city": "Truganina",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Integrated Freight & Logistics",
    "long_name": "K&S Corporation Limited",
    "market": "au_market",
    "market_cap": "Micro Cap",
    "sector": "Industrials",
    "short_name": "K & S CORP FPO",
    "state": "VIC",
    "summary": "K&S Corporation Limited provides transportation and logistics, contract management, warehousing and distribution, and fuel distribution services primarily in Australia and New Zealand. The company operates through three segments: Australian Transport, Fuels, and New Zealand Transport. It provides road, rail, and coastal sea forwarding for full and break bulk loads, including export packing, wharf lodgement, and the delivery of integrated supply chain and system solutions; support services to offshore exploration and drilling projects; and dry and liquid bulk transportation services to mining, sugar, cement, and fertilizer industries. The company also offers line haul and logistical support, and warehousing and distribution services, as well as equipment and personnel. In addition, it offers facility management services to various companies; distribution chain management services for various importers; general, full load, and part load freight services, as well as project services; and heavy haulage services. Further, the company transports dangerous goods, fuel, gas, lubricants, bulk liquids, chemicals, and explosives by road, rail, and sea; and aviation refueling services and aviation fuel supply solutions to airports and bulk fuel customers. The company was formerly known as Scott Corporation Limited and changed its name to K&S Corporation Limited in December 1998. K&S Corporation Limited was founded in 1945 and is headquartered in Truganina, Australia. K&S Corporation Limited is a subsidiary of AA Scott Pty Ltd.",
    "website": "http://www.ksgroup.com.au",
    "zipcode": "3029"
  },
  "QUB.AX": {
    "city": "Sydney",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Qube Holdings Limited",
    "market": "au_market",
    "market_cap": "Mid Cap",
    "sector": "Industrials",
    "short_name": "QUBE FPO",
    "state": "NSW",
    "summary": "Qube Holdings Limited, together with its subsidiaries, provides integrated import and export logistics services in Australia. The company's Operating Division offers services relating to the import and export of primarily containerized cargo. This division provides various services, including physical and documentary processes, and tasks of the import/export supply chain, such as road and rail transport of containers to and from ports, operation of container parks, customs and quarantine services, warehousing, intermodal terminals, international freight forwarding, and bulk rail haulage for rural commodities. It also offers a range of logistics services relating to the import and export of primarily non-containerized freight with a focus on automotive, bulk, and break bulk products; and an integrated logistics solution for the automotive industry covering a range of activities comprising stevedoring, processing, and delivery. In addition, this division provides stevedoring and related logistics services for the oil and gas industry, forestry products, and project and general cargo; and handles a range of commodities that include iron ore, copper, nickel concentrate, and mineral sands. The company's Infrastructure & Property Division owns a 243 hectare parcel of land in the Moorebank logistics park project; a multi-user facility for the stevedoring industry; and a property at Minto in Sydney. It also owns interest in the Quattro Grain Trust, and a 50% interest in TQ Holdings Pty Limited. The company also offers container stevedoring services in Australia. The company was formerly known as Qube Logistics Holdings Limited and changed its name to Qube Holdings Limited in November 2012. Qube Holdings Limited was incorporated in 2011 and is based in Sydney, Australia.",
    "website": "http://www.qube.com.au",
    "zipcode": "2000"
  },
  "WWG.AX": {
    "city": "Bankstown",
    "country": "Australia",
    "currency": "AUD",
    "exchange": "ASX",
    "industry": "Integrated Freight & Logistics",
    "long_name": "Wiseway Group Limited",
    "market": "au_market",
    "market_cap": "Nano Cap",
    "sector": "Industrials",
    "short_name": "WISEWAYGRP FPO",
    "state": "NSW",
    "summary": "Wiseway Group Limited, together with its subsidiaries, provides logistics and freight forwarding services in Australia. It offers air cargo services, including door to door, airport to airport, import and export shipments, break bulk, personal effects, dangerous goods, scheduled consolidation, time sensitive shipments, documentation handling and processing, special projects, pick-up, and packing and crating services; and sea cargo services ranging from less-than-container loads to full container loads, special equipment, and oversized cargo. The company also provides services for perishables goods; customs clearance services; road transportation services; and warehousing services, such as bonded storage, break bulk and deconsolidation, picking and packing, pallet in/pallet out, long and short term storage, stock control system, order entry/processing, inventory control management, container packing or unpacking, and packaging materials supply. Wiseway Group Limited was founded in 2005 and is headquartered in Bankstown, Australia.",
    "website": "http://www.wiseway.com.au",
    "zipcode": "2000"
  }
}
