{
    "DBI.AX": {
        "short_name": "DALRYMPLE STAPLED",
        "long_name": "Dalrymple Bay Infrastructure Limited",
        "summary": "Dalrymple Bay Infrastructure Limited operates metallurgical and thermal coal export terminal and port infrastructure facility. The company was incorporated in 2020 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "QUB.AX": {
        "short_name": "QUBE FPO",
        "long_name": "Qube Holdings Limited",
        "summary": "Qube Holdings Limited, together with its subsidiaries, provides integrated import and export logistics services in Australia. The company's Operating Division offers services relating to the import and export of primarily containerized cargo. This division provides various services, including physical and documentary processes, and tasks of the import/export supply chain, such as road and rail transport of containers to and from ports, operation of container parks, customs and quarantine services, warehousing, intermodal terminals, international freight forwarding, and bulk rail haulage for rural commodities. It also offers a range of logistics services relating to the import and export of primarily non-containerized freight with a focus on automotive, bulk, and break bulk products; and an integrated logistics solution for the automotive industry covering a range of activities comprising stevedoring, processing, and delivery. In addition, this division provides stevedoring and related logistics services for the oil and gas industry, forestry products, and project and general cargo; and handles a range of commodities that include iron ore, copper, nickel concentrate, and mineral sands. The company's Infrastructure & Property Division owns a 243 hectare parcel of land in the Moorebank logistics park project; a multi-user facility for the stevedoring industry; and a property at Minto in Sydney. It also owns interest in the Quattro Grain Trust, and a 50% interest in TQ Holdings Pty Limited. The company also offers container stevedoring services in Australia. The company was formerly known as Qube Logistics Holdings Limited and changed its name to Qube Holdings Limited in November 2012. Qube Holdings Limited was incorporated in 2011 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "WWG.AX": {
        "short_name": "WISEWAYGRP FPO",
        "long_name": "Wiseway Group Limited",
        "summary": "Wiseway Group Limited, together with its subsidiaries, provides logistics and freight forwarding services in Australia. It offers air cargo services, including door to door, airport to airport, import and export shipments, break bulk, personal effects, dangerous goods, scheduled consolidation, time sensitive shipments, documentation handling and processing, special projects, pick-up, and packing and crating services; and sea cargo services ranging from less-than-container loads to full container loads, special equipment, and oversized cargo. The company also provides services for perishables goods; customs clearance services; road transportation services; and warehousing services, such as bonded storage, break bulk and deconsolidation, picking and packing, pallet in/pallet out, long and short term storage, stock control system, order entry/processing, inventory control management, container packing or unpacking, and packaging materials supply. Wiseway Group Limited was founded in 2005 and is headquartered in Bankstown, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Integrated Freight & Logistics",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Bankstown"
    }
}