{
    "ALG.AX": {
        "short_name": "ARDENTLGLT FPO",
        "long_name": "Ardent Leisure Group Limited",
        "summary": "Ardent Leisure Group Limited invests in and operates leisure and entertainment businesses in Australia and the United States. The company operates in Main Event and Theme Parks segments. It operates 43 main event sites in Texas, Arizona, Georgia, Illinois, Kentucky, Missouri, New Mexico, Ohio, Oklahoma, Kansas, Florida, Tennessee, Maryland, Delaware, Colorado, and Louisiana, as well as Dreamworld and WhiteWater World in Coomera, Queensland; and the SkyPoint observation deck and climb in Surfers Paradise, Queensland. The company is based in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "BBL.AX": {
        "short_name": "BRIS BRONC FPO",
        "long_name": "Brisbane Broncos Limited",
        "summary": "Brisbane Broncos Limited engages in the operation and management of the Brisbane Broncos Rugby League Football Team in Australia. The company is headquartered in Red Hill, Australia. Brisbane Broncos Limited is a subsidiary of Nationwide News Pty Ltd.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Red Hill"
    },
    "CYQ.AX": {
        "short_name": "CYCLIQ FPO",
        "long_name": "Cycliq Group Limited",
        "summary": "Cycliq Group Limited produces and sells HD bike cameras and safety lights in Australia, the United States, the United Kingdom, and internationally. It offers cycling safety and action camera solutions; accessories; and desktop, smartphone, ANT+, and firmware software for commuters, mountain bikers, racers, and professional cyclists. The company is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Subiaco"
    },
    "EXP.AX": {
        "short_name": "EXPERNCECO FPO",
        "long_name": "Experience Co Limited",
        "summary": "Experience Co Limited, an adventure tourism and leisure company, provides tandem skydiving services in Australia and New Zealand. The company operates through Skydiving and Adventure Experiences segments. It also provides white water rafting, canyoning, helicopter and boat tours, reef tours, and snorkeling and diving in the Great Barrier Reef; rain forest tours; and hot air ballooning services. The company operates 16 skydiving locations in Australia and 3 locations in New Zealand; and an adventure hub in Cairns Far North Queensland. Experience Co Limited was founded in 1999 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "FUN.AX": {
        "short_name": "FUNTASTIC FPO",
        "long_name": "Funtastic Limited",
        "summary": "Funtastic Limited distributes toy, outdoor sporting, confectionery, and lifestyle products in Australia and New Zealand. The company offers its products under various categories, such as creative play and crafts, board games and puzzles, kids wearable technology, soft toys and dolls, lifestyle, freestyle rides, and pro and dirt rides. Its brands include Chill Factor, Cry Babies, Educational Insights, Learning Resources, Moochies, Orbeez, Pai, Play Doh, Puffaloons, Razor, Ryan's World, Ryan's World, Shimmer Stars, and Strawberry Shortcake. Funtastic Limited was founded in 1994 and is headquartered in Mount Waverley, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Mount Waverley"
    },
    "IDZ.AX": {
        "short_name": "INDSKYDIVE FPO",
        "long_name": "Indoor Skydive Australia Group Limited",
        "summary": "Indoor Skydive Australia Group Limited owns and operates indoor skydiving facilities in Australia and Malaysia. It operates facilities under the iFly Downunder brand located in Penrith; and the iFLY Gold Coast brand located in Queensland. The company also offers FREAK, a free roam and multiplayer virtual reality experience that offers the user the most cutting edge and real life 4D encounters, as well as provides home delivery services. It serves tourists, families, enthusiast, and military. As of November 13, 2020, the company operated 3 FREAK venues. Indoor Skydive Australia Group Limited incorporated in 2011 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "MD8B.F": {
        "short_name": "ARDENT LEISURE GRP",
        "long_name": "Ardent Leisure Group Limited",
        "summary": "Ardent Leisure Group Limited invests in and operates leisure and entertainment businesses in Australia and the United States. The company operates in Main Event and Theme Parks segments. It operates 43 main event sites in Texas, Arizona, Georgia, Illinois, Kentucky, Missouri, New Mexico, Ohio, Oklahoma, Kansas, Florida, Tennessee, Maryland, Delaware, Colorado, and Louisiana, as well as Dreamworld and WhiteWater World in Coomera, Queensland; and the SkyPoint observation deck and climb in Surfers Paradise, Queensland. The company is based in North Sydney, Australia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "SLK.AX": {
        "short_name": "SEALINK FPO",
        "long_name": "SeaLink Travel Group Limited",
        "summary": "SeaLink Travel Group Limited operates as a tourism and transport company in Australia, Singapore, and the United Kingdom. It operates through Marine & Tourism, Australian Bus, and International Bus segments. The Marine & Tourism segment operates vehicle and passenger ferry services, barging, coach tours and package holidays, lunch, dinner, charter cruises, and accommodation facilities. The Australian Bus segment operates metropolitan public bus services on behalf of governments in Sydney, Melbourne, Perth, Adelaide, and Darwin. The International Bus segment operates metropolitan public bus services on behalf of governments in London and Singapore. The company was formerly known as TravelLink Limited and changed its name to SeaLink Travel Group Limited in September 2008. SeaLink Travel Group Limited was founded in 1989 and is headquartered in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Adelaide"
    },
    "VVA.AX": {
        "short_name": "VIVALEISUR FPO",
        "long_name": "Viva Leisure Limited",
        "summary": "Viva Leisure Limited operates health clubs with the health and leisure industry in Australia. As of March 20, 2020, it operated 75 health clubs under the Club Lime brand name within the Australian Capital Territory, New South Wales, Victoria, and Queensland. The company was founded in 2004 and is based in Mitchell, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Leisure",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Mitchell"
    }
}