{
    "1I4.F": {
        "short_name": "HERAMEDLTD",
        "long_name": "HeraMED Limited",
        "summary": "HeraMED Limited develops and sells pregnancy monitoring solutions for home and professional use in Australia, Europe, and Israel. The company's product is the HeraBEAT, a fetal heart rate monitor principally for use by an expectant mother to monitor their fetus' heartbeat. It is also involved in developing EchoBEAT, the next generation of its home-oriented pregnancy monitoring devices; and Orion, an artificial intelligence powered pregnancy monitoring system for pregnancy monitoring analysis. The company has a co-development agreement with Mayo Clinic for developing platform for pregnancy homecare; cooperation agreement with Freeman Rd & PHI Group to arrange and lead clinical studies in Australia; and partnership agreement with eCare21, Inc. to integrate its technology into the eCare21 platform. HeraMED Limited was founded in 2011 and is based in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "39I.F": {
        "short_name": "IMPEDIMED LTD",
        "long_name": "ImpediMed Limited",
        "summary": "ImpediMed Limited, a medical software technology company, together with its subsidiaries, develops, manufactures, and sells bioimpedance spectroscopy (BIS) devices and software services in Australia, North America, and internationally. It offers SOZO, a noninvasive bioimpedance spectroscopy device for the detection of lymphedema and fluid status monitoring of heart failure patients; SFB7, a single-channel, tetrapolar BIS device to analyze body composition in healthy individuals; and ImpediVET, a single-channel, tetrapolar (BIS) device that measures fluid status and tissue composition for veterinary applications. The company sells its devices to hospitals and clinics. ImpediMed Limited was founded in 1999 and is headquartered in Pinkenba, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Pinkenba"
    },
    "AMEUF": {
        "short_name": "ANTERIS TECHNOLOGIES LTD",
        "long_name": "Anteris Technologies Ltd",
        "summary": "Anteris Technologies Ltd, a structural heart company, researches, develops, commercializes, and distributes various medical technologies and devices. It manufactures, distributes, and sells proprietary ADAPT regenerative tissue products; and researches and develops regenerative medicine and immunotherapies. The company was formerly known as Admedus Limited and changed its name to Anteris Technologies Ltd in May 2020. Anteris Technologies Ltd is based in Toowong, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Toowong"
    },
    "AMT.AX": {
        "short_name": "ALLEGRA FPO",
        "long_name": "Allegra Orthopaedics Limited",
        "summary": "Allegra Orthopaedics Limited designs, sells, and distributes orthopaedic implant products in Australia and New Zealand. The company operates through Orthopaedics Division and Innovation Division segments. It offers adult and adolescent clavicle fixation systems; shoulder implants; ulna heads, compression screws, distal radius systems, and hand fracture systems; reconstruction prosthesis, modular tumor and revision systems, partial pelvis replacement, cementless stems, cups, and ceramic prosthesis heads for hips; and knee replacement systems and knee distal first instruments. The company also provides foot and ankle products, such as total ankle replacement systems, toe products, A-curve handles, screws, staples, and foot systems; surgical screws, sawblades, and kirschner wires and pins; NanoFx, a solution for microfracture; and face shields and mask strap holders. The company was formerly known as Advanced Surgical Design & Manufacture Limited and changed its name to Allegra Orthopaedics Limited in November 2014. Allegra Orthopaedics Limited was founded in 1994 and is based in Lane Cove West, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Lane Cove West"
    },
    "AT1.AX": {
        "short_name": "ATOMO DIAG FPO",
        "long_name": "Atomo Diagnostics Limited",
        "summary": "Atomo Diagnostics Limited researches, designs, develops, manufactures, and sells medical devices for blood-based rapid testing for professional use and self-testing. The company offers AtomoRapid RDT platforms to suit various blood-based lateral flow test assays and are appropriate for a range of applications, including screening for chronic conditions and detection of infectious diseases. Its rapid test devices are used by healthcare professionals and by consumers to screen for a range of diseases and medical conditions, including HIV infection. The company has operations in Europe, Asia, Africa, and Central and South America. Atomo Diagnostics Limited was founded in 2010 and is headquartered in Leichhardt, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Leichhardt"
    },
    "CBL.AX": {
        "short_name": "CTRLBIONIC FPO",
        "long_name": "Control Bionics Limited",
        "summary": "Control Bionics Limited designs, manufactures, and sells communication technologies that allow users to operate and communicate through a computer using their thoughts and neural signals. It offers GridPad Trilogy that offers users additional switch ports, built-in IR, improved speaker output, and a 12-hour battery life; NeuroNode Trilogy, a solution for those living with paralysis and loss of speech; and Control Bionics Complete Communication System, an out of the box solution for those living with paralysis and loss of speech. The company also provides support and warranty services. Its products are used by people suffering from diseases that hamper their communication ability, such as multiple sclerosis and cerebral palsy, as well as spinal cord injuries. The company was founded in 2005 and is based in Surrey Hills, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Surrey Hills"
    },
    "CDX.AX": {
        "short_name": "CARDIEXLTD FPO",
        "long_name": "CardieX Limited",
        "summary": "CardieX Limited designs, manufactures, and markets medical devices for use in cardiovascular health management in the Americas, Europe, and the Asia Pacific. The company develops, markets, and distributes medical technologies that measure patient risk for hypertension, cardiovascular disease (CVD), and other related vascular disorders. It also provides TeleHealth Services, which provides digital, e-commerce, and mobile tools for patients to connect online with health coaches. The company offers its devices and services to hospitals, clinics, research institutions and pharmaceutical companies. CardieX Limited has a strategic collaboration with Blumio Inc. to develop wearable sensor; and a joint development agreement with inHealth to develop hypertension and cardiovascular programs for the products. The company was formerly known as AtCor Medical Holdings Limited and changed its name to CardieX Limited in June 2018. CardieX Limited was founded in 1994 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CHEOF": {
        "short_name": "COCHLEAR LTD",
        "long_name": "Cochlear Limited",
        "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CHEOY": {
        "short_name": "COCHLEAR LTD",
        "long_name": "Cochlear Limited",
        "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "COH.AX": {
        "short_name": "COCHLEAR FPO",
        "long_name": "Cochlear Limited",
        "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CYC.AX": {
        "short_name": "CYCLOPHARM FPO",
        "long_name": "Cyclopharm Limited",
        "summary": "Cyclopharm Limited engages in the research and development, manufacture, and sale of medical equipment and radiopharmaceuticals in the Asia Pacific, Europe, Canada, and internationally. The company operates through Technegas and Molecular Imaging segments. It offers diagnostic equipment and consumables, which are used by physicians in the detection of pulmonary embolism. The company also provides radiopharmaceuticals that are used by physicians in the detection of cancer, neurological disorders, and cardiac diseases. It serves nuclear medicine departments in hospitals. The company has research collaboration agreement with McMasters University and others to understand the short-term and long-term effects of COVID-19 on lung ventilation and perfusion injury. Cyclopharm Limited was founded in 1986 and is headquartered in Kingsgrove, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Kingsgrove"
    },
    "DDF.F": {
        "short_name": "ANTERIS TECHNOLOGIES",
        "long_name": "Anteris Technologies Ltd",
        "summary": "Anteris Technologies Ltd, a structural heart company, researches, develops, commercializes, and distributes various medical technologies and devices. It manufactures, distributes, and sells proprietary ADAPT regenerative tissue products; and researches and develops regenerative medicine and immunotherapies. The company was formerly known as Admedus Limited and changed its name to Anteris Technologies Ltd in May 2020. Anteris Technologies Ltd is based in Toowong, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Toowong"
    },
    "EMV.AX": {
        "short_name": "EMVISION FPO",
        "long_name": "EMvision Medical Devices Limited",
        "summary": "EMvision Medical Devices Limited engages in the research, development, and commercialization of imaging and diagnostic technology for the purpose of commercializing portable medical device for stroke diagnosis and monitoring, and other medical imaging needs. The company has a strategic collaboration with Keysight Technologies Malaysia Sdn Bhd to develop a personalized vector network analysis solution for medical imaging in the healthcare sector. EMvision Medical Devices Limited was founded in 2017 and is based in Macquarie Park, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Macquarie Park"
    },
    "HMD.AX": {
        "short_name": "HERAMED FPO",
        "long_name": "HeraMED Limited",
        "summary": "HeraMED Limited develops and sells pregnancy monitoring solutions for home and professional use in Australia, Europe, and Israel. The company's product is the HeraBEAT, a fetal heart rate monitor principally for use by an expectant mother to monitor their fetus' heartbeat. It is also involved in developing EchoBEAT, the next generation of its home-oriented pregnancy monitoring devices; and Orion, an artificial intelligence powered pregnancy monitoring system for pregnancy monitoring analysis. The company has a co-development agreement with Mayo Clinic for developing platform for pregnancy homecare; cooperation agreement with Freeman Rd & PHI Group to arrange and lead clinical studies in Australia; and partnership agreement with eCare21, Inc. to integrate its technology into the eCare21 platform. HeraMED Limited was founded in 2011 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "IPD.AX": {
        "short_name": "IMPEDIMED FPO",
        "long_name": "ImpediMed Limited",
        "summary": "ImpediMed Limited, a medical software technology company, together with its subsidiaries, develops, manufactures, and sells bioimpedance spectroscopy (BIS) devices and software services in Australia, North America, and internationally. It offers SOZO, a noninvasive bioimpedance spectroscopy device for the detection of lymphedema and fluid status monitoring of heart failure patients; SFB7, a single-channel, tetrapolar BIS device to analyze body composition in healthy individuals; and ImpediVET, a single-channel, tetrapolar (BIS) device that measures fluid status and tissue composition for veterinary applications. The company sells its devices to hospitals and clinics. ImpediMed Limited was founded in 1999 and is headquartered in Pinkenba, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pinkenba"
    },
    "IPDQF": {
        "short_name": "IMPEDIMED LIMITED",
        "long_name": "ImpediMed Limited",
        "summary": "ImpediMed Limited, a medical software technology company, together with its subsidiaries, develops, manufactures, and sells bioimpedance spectroscopy (BIS) devices and software services in Australia, North America, and internationally. It offers SOZO, a noninvasive bioimpedance spectroscopy device for the detection of lymphedema and fluid status monitoring of heart failure patients; SFB7, a single-channel, tetrapolar BIS device to analyze body composition in healthy individuals; and ImpediVET, a single-channel, tetrapolar (BIS) device that measures fluid status and tissue composition for veterinary applications. The company sells its devices to hospitals and clinics. ImpediMed Limited was founded in 1999 and is headquartered in Pinkenba, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Pinkenba"
    },
    "KMLXF": {
        "short_name": "RESPIRI LTD",
        "long_name": "Respiri Limited",
        "summary": "Respiri Limited, an e-health SaaS company, researches, develops, and commercializes, medical devices in Australia and Israel. The company produces and sells mobile health applications. Its products include Wheezo, a mobile app, which has asthma management diary, medication usage and reminders, and symptoms and triggers to help asthma sufferers; and Wholter, a device for home ambulatory recording of nocturnal wheeze and cough. The company also offers PulmoTrack, a computerized wheeze detection product designed for hospital/clinical based real-time monitoring of wheeze and cough in the management of acute asthma in the ER and ICU, and for pediatric pulmonary function testing and sleep labs. The company was formerly known as iSonea Limited and changed its name to Respiri Limited in December 2015. Respiri Limited is based in Melbourne, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "LBT.AX": {
        "short_name": "LABTECH FPO",
        "long_name": "LBT Innovations Limited",
        "summary": "LBT Innovations Limited engages in the research, development, and commercialization of technologies for the healthcare and laboratory supply markets in Australia and Switzerland. It offers MicroStreak, an automated culture-plate streaking and inoculation system; Automated Plate Assessment System, an intelligent imaging and machine learning software; and WoundVue, a technology that uses artificial intelligence to assist clinicians in the assessment and care of chronic wounds. The company was founded in 2004 and is headquartered in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Adelaide"
    },
    "LSM.F": {
        "short_name": "LBT INNOVATIONS LTD.",
        "long_name": "LBT Innovations Limited",
        "summary": "LBT Innovations Limited engages in the research, development, and commercialization of technologies for the healthcare and laboratory supply markets in Australia and Switzerland. It offers MicroStreak, an automated culture-plate streaking and inoculation system; Automated Plate Assessment System, an intelligent imaging and machine learning software; and WoundVue, a technology that uses artificial intelligence to assist clinicians in the assessment and care of chronic wounds. The company was founded in 2004 and is headquartered in Adelaide, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Adelaide"
    },
    "N6A.F": {
        "short_name": "ONCOSIL MEDICAL LTD",
        "long_name": "OncoSil Medical Limited",
        "summary": "OncoSil Medical Limited, a medical device company, focuses on the development of localized treatments for pancreatic and liver cancer in Australia. Its lead product is OncoSil, a brachytherapy device that implants a pre-determined dose of beta radiation directly into cancerous tissue for the treatment of cancer. The company was formerly known as NeuroDiscovery Limited and changed its name to OncoSil Medical Limited in June 2013. OncoSil Medical Limited is headquartered in North Sydney, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "OC5.F": {
        "short_name": "COCHLEAR LTD",
        "long_name": "Cochlear Limited",
        "summary": "Cochlear Limited provides implantable hearing solutions in the Americas, Europe, the Middle East, Africa, and the Asia Pacific. The company offers cochlear implants, including Nucleus 7, Nucleus 6, Nucleus CP802, and Kanso sound processors; and Baha bone conduction implants, such as Baha attract system, Baha connect system, Baha softband, Baha soundarc, Baha 5 sound processor, and Baha sound processor. It also provides Cochlear true wireless accessories comprising mini microphones, phone clips, and TV streamers; Nucleus water-safe accessories; and training and development services. Cochlear Limited was founded in 1981 and is headquartered in Sydney, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "OSL.AX": {
        "short_name": "ONCOSIL FPO",
        "long_name": "OncoSil Medical Limited",
        "summary": "OncoSil Medical Limited, a medical device company, focuses on the development of localized treatments for pancreatic and liver cancer in Australia. Its lead product is OncoSil, a brachytherapy device that implants a pre-determined dose of beta radiation directly into cancerous tissue for the treatment of cancer. The company was formerly known as NeuroDiscovery Limited and changed its name to OncoSil Medical Limited in June 2013. OncoSil Medical Limited is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "OVN.AX": {
        "short_name": "OVENTUS FPO",
        "long_name": "Oventus Medical Limited",
        "summary": "Oventus Medical Limited, a medical device company, develops and commercializes oral appliances for the treatment of obstructive sleep apnoea (OSA) and snoring in Australia, Canada, and the United States. The company offers O2Vent Optima, a customized 3D-printed nylon oral appliance for OSA patients; and ExVent, an alternative for CPAP-intolerant individuals. It also develops O2Vent. The company was incorporated in 2015 and is headquartered in Indooroopilly, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Indooroopilly"
    },
    "QTM.AX": {
        "short_name": "QUANTHEGRP FPO",
        "long_name": "Quantum Health Group Limited",
        "summary": "Quantum Health Group Limited distributes medical imaging and patient treatment equipment and services in Australia, Thailand, South Korea, Vietnam, New Zealand, the Philippines, and China. It operates in two segments, Medical and Environmental Services. The company distributes medical products in the field of radiology, oncology, aesthetics, and environmental health. It also manufactures energy saving heat pump technology used for heating and cooling systems internationally. The company was formerly known as Quantum Energy Limited. Quantum Health Group Limited was founded in 1975 and is headquartered in Rosebery, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rosebery"
    },
    "RHNMF": {
        "short_name": "RHINOMED LIMITED",
        "long_name": "Rhinomed Limited",
        "summary": "Rhinomed Limited engages in the research, development, and commercialization of consumer and medical devices worldwide. It identifies, acquires, and commercializes nasal stent delivery technologies. The company's product portfolio includes Turbine for enhanced breathing in sports; Mute, an anti-snoring device; and Pronto for nasal congestion and sleep disturbance issues. It also engages in developing applications for the delivery of medical cannabis and conditions, including anxiety, pain, allergies, nausea, anxiety, and coughs and colds; and nasal swab to test the presence of upper respiratory tract diseases, including influenza, and coronavirus strains. The company was formerly known as Consegna Group Limited and changed its name to Rhinomed Limited in November 2013. Rhinomed Limited was incorporated in 2004 and is based in Richmond, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Richmond"
    },
    "RHT.AX": {
        "short_name": "RESONANCE FPO",
        "long_name": "Resonance Health Limited",
        "summary": "Resonance Health Limited, a healthcare company, develops and delivers non-invasive medical imaging software and services worldwide. Its flagship products include FerriScan, a non-invasive liver diagnostic technology used for the measurement of liver iron concentration; and FerriSmart, an automated software medical device to manage patients with iron overload disorders, such as thalassemia, sickle cell disease, hereditary haemochromatosis, anaemias, and cancers. The company also offers Cardiac T2, a dual analysis service with FerriScan to provide information regarding body iron stores; HepaFat-Scan, a magnetic resonance imaging (MRI) based tool for the measurement of volumetric liver fat fraction; HepaFat-AI, an artificial intelligence software tool, which is used for the automated assessment of liver fat from MRI data; and Bone Marrow R2-MRI for the assessment of iron levels in the bone marrow. It also provides imaging core laboratory and support services for clinical trials. The company serves clinicians for the diagnosis and management of human diseases; researchers; and pharmaceutical companies for their clinical trials. Resonance Health Limited was incorporated in 1987 and is headquartered in Burswood, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Burswood"
    },
    "RJV.F": {
        "short_name": "SOMNOMED LTD.",
        "long_name": "SomnoMed Limited",
        "summary": "SomnoMed Limited, together with its subsidiaries, produces and sells devices for the oral treatment of sleep related disorders in Europe, North America, and the Asia Pacific Region. Its products include SomnoDent, an oral appliance for obstructive sleep apnea; and SomnoBrux, a mouthguard for the treatment of teeth grinding damage, as well as SomTabs for cleaning its devices. The company was founded in 2004 and is based in Crows Nest, Australia.",
        "currency": "EUR",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Crows Nest"
    },
    "RNO.AX": {
        "short_name": "RHINOMED FPO",
        "long_name": "Rhinomed Limited",
        "summary": "Rhinomed Limited engages in the research, development, and commercialization of consumer and medical devices worldwide. It identifies, acquires, and commercializes nasal stent delivery technologies. The company's product portfolio includes Turbine for enhanced breathing in sports; Mute, an anti-snoring device; and Pronto for nasal congestion and sleep disturbance issues. It also engages in developing applications for the delivery of medical cannabis and conditions, including anxiety, pain, allergies, nausea, anxiety, and coughs and colds; and nasal swab to test the presence of upper respiratory tract diseases, including influenza, and coronavirus strains. The company was formerly known as Consegna Group Limited and changed its name to Rhinomed Limited in November 2013. Rhinomed Limited was incorporated in 2004 and is based in Richmond, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Richmond"
    },
    "RSH.AX": {
        "short_name": "RESPIRI FPO",
        "long_name": "Respiri Limited",
        "summary": "Respiri Limited, an e-health SaaS company, researches, develops, and commercializes, medical devices in Australia and Israel. The company produces and sells mobile health applications. Its products include Wheezo, a mobile app, which has asthma management diary, medication usage and reminders, and symptoms and triggers to help asthma sufferers; and Wholter, a device for home ambulatory recording of nocturnal wheeze and cough. The company also offers PulmoTrack, a computerized wheeze detection product designed for hospital/clinical based real-time monitoring of wheeze and cough in the management of acute asthma in the ER and ICU, and for pediatric pulmonary function testing and sleep labs. The company was formerly known as iSonea Limited and changed its name to Respiri Limited in December 2015. Respiri Limited is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "SOM.AX": {
        "short_name": "SOMNOMED FPO",
        "long_name": "SomnoMed Limited",
        "summary": "SomnoMed Limited, together with its subsidiaries, produces and sells devices for the oral treatment of sleep related disorders in Europe, North America, and the Asia Pacific Region. Its products include SomnoDent, an oral appliance for obstructive sleep apnea; and SomnoBrux, a mouthguard for the treatment of teeth grinding damage, as well as SomTabs for cleaning its devices. The company was founded in 2004 and is based in Crows Nest, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Crows Nest"
    },
    "SOMNF": {
        "short_name": "SOMNOMED LIMITED",
        "long_name": "SomnoMed Limited",
        "summary": "SomnoMed Limited, together with its subsidiaries, produces and sells devices for the oral treatment of sleep related disorders in Europe, North America, and the Asia Pacific Region. Its products include SomnoDent, an oral appliance for obstructive sleep apnea; and SomnoBrux, a mouthguard for the treatment of teeth grinding damage, as well as SomTabs for cleaning its devices. The company was founded in 2004 and is based in Crows Nest, Australia.",
        "currency": "USD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Crows Nest"
    },
    "SVA.AX": {
        "short_name": "SIMAVITA CDI 1:1",
        "long_name": "Simavita Limited",
        "summary": "Simavita Limited develops smart wearable and disposable sensors for the diaper industry primarily in Australia, North America, and Europe. It offers Smartz, a platform technology linked to phones and tablets that provides indicators, including wetness, ambient temperature, pressure sore management, falls, and other features and information for incontinence pad or diaper to parents and carers of infants and adults. The company was incorporated in 1968 and is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Sydney"
    },
    "UBI.AX": {
        "short_name": "UNI BIOSEN CDI 1:1",
        "long_name": "Universal Biosensors, Inc.",
        "summary": "Universal Biosensors, Inc., through its subsidiary, Universal Biosensors Pty Ltd, designs and develops electrochemical cells in Australia. The company focuses on the research, development, and manufacture of medical or testing devices. It uses electrochemical cell technology platform to develop point of use devices for various industries, including healthcare, food and drink, and agriculture. The company offers prothrombin time international normalized ratio coagulation test strips; and coagulation testing and calibration services, as well as distributes Siemens' Xprecia Stride Coagulation Analyzer. It also owns, operates, and manages a hemostasis laboratory. The company was founded in 2001 and is based in Rowville, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rowville"
    },
    "UCM.AX": {
        "short_name": "USCOM FPO",
        "long_name": "Uscom Limited",
        "summary": "Uscom Limited designs, develops, manufactures, and markets non-invasive cardiovascular and pulmonary medical devices worldwide. It offers USCOM 1A, a non-invasive hemodynamic monitor that measures cardiovascular function using Doppler ultrasound; BP+, a supra-systolic oscillometric central blood pressure monitor that measures blood pressure and blood pressure waveforms at the heart, as well as in the arm; and SpiroSonic, a pulmonary function testing device based on multi-path ultrasound technology. The company provides Ventitest, a ventilator testing device; Ventitest sensor to test lung function; and The SpiroSonic AIR, a digital home care spirometer which feeds digital lung function signals through a phone app. It serves hospitals and other medical care locations through a network of distribution partners. The company was incorporated in 1999 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Healthcare",
        "industry": "Medical Devices",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    }
}