{
    "ALD.AX": {
        "short_name": "AMPOL FPO",
        "long_name": "Ampol Limited",
        "summary": "Ampol Limited engages in purchasing, refining, and distributing petroleum products in Australia, New Zealand, and Singapore. The company operates through Convenience Retail, and Fuels & Infrastructure segments. The Convenience Retail segment sells fuels through a Caltex network of stores. The Fuels and Infrastructure segment wholesales fuels and lubricants. It distributes its products through a network of depots, diesel stops, marine facilities, and service station sites. The company was formerly known as Caltex Australia Limited and changed its name to Ampol Limited in May 2020. Ampol Limited was founded in 1900 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "CTXAF": {
        "short_name": "AMPOL LTD",
        "long_name": "Ampol Limited",
        "summary": "Ampol Limited engages in purchasing, refining, and distributing petroleum products in Australia, New Zealand, and Singapore. The company operates through Convenience Retail, and Fuels & Infrastructure segments. The Convenience Retail segment sells fuels through a Caltex network of stores. The Fuels and Infrastructure segment wholesales fuels and lubricants. It distributes its products through a network of depots, diesel stops, marine facilities, and service station sites. The company was formerly known as Caltex Australia Limited and changed its name to Ampol Limited in May 2020. Ampol Limited was founded in 1900 and is headquartered in Sydney, Australia.",
        "currency": "USD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "VEA.AX": {
        "short_name": "VIVA E GRP FPO",
        "long_name": "Viva Energy Group Limited",
        "summary": "Viva Energy Group Limited operates as an energy company in Australia, Singapore, and Papua New Guinea. The company operates in three segments: Retail, Fuels and Marketing; Refining; and Supply, Corporate and Overheads. The Retail, Fuels and Marketing segment supplies and markets fuel products to a network of approximately 1,300 retail service stations, as well as to other retail operators and wholesalers. It is also involved in supplying fuel, lubricants, and specialty hydrocarbon products to commercial customers in the aviation, marine, transport, resources, and construction and manufacturing industries. This segment sells its products primarily under Shell and Viva Energy brands. The Refining segment owns and operates a refinery in Geelong, Victoria. It offers petroleum products, such as gasoline, diesel, jet fuel, aviation gasoline, gas, solvents, bitumen, and other specialty products. The Supply, Corporate and Overheads segment owns and manages an integrated supply chain of terminals, storage tanks, depots, pipelines, and distribution assets in Australia. Viva Energy Group Limited was incorporated in 2018 and is based in Docklands, Australia.",
        "currency": "AUD",
        "sector": "Energy",
        "industry": "Oil & Gas Refining & Marketing",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Docklands"
    }
}