{
    "23O.F": {
        "short_name": "BUBS AUSTRALIA LTD",
        "long_name": "Bubs Australia Limited",
        "summary": "Bubs Australia Limited, together with its subsidiaries, engages in the production and sale of various infant nutrition products in Australia, China, and internationally. It offers organic baby food, goat milk infant formula, adult goat milk powder, and fresh dairy products, as well as pouches, cereals, and snacks under the Bubs, CapriLac, Deloraiane, and Capela brands. The company also provides children's vitamin and mineral supplement products under the Vita Bubs name; canning services for nutritional dairy products; and holds IP and trademarks. Bubs Australia Limited was incorporated in 1993 and is headquartered in Dandenong, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Dandenong",
        "zipcode": "3175",
        "website": "http://www.bubsaustralia.com",
        "market_cap": 139037696
    },
    "AHF.AX": {
        "short_name": "AUSDAIRY STAPLED",
        "long_name": "Australian Dairy Nutritionals Group",
        "summary": "Australian Dairy Nutritionals Group operates as an integrated dairy producer in Australia. It operates through Dairy Farms and Dairy Processing segments. The Dairy Farms segment owns and operates dairy farms and dairy livestock. The Dairy Processing segment processes and sells dairy products that include milk, yoghurt, cream, and butter. It sells its products through home delivery, supermarkets, and foodservice and niche retailers. The company is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.adfl.com.au",
        "market_cap": 27632768
    },
    "B0K.F": {
        "short_name": "BESTON GLOBAL FOOD CO.LTD",
        "long_name": "Beston Global Food Company Limited",
        "summary": "Beston Global Food Company Limited, together with its subsidiaries, engages in the manufacture and sale of food and beverage products in Australia and internationally. It operates in four segments: Dairy, Meat, Other, and International Other. The company owns dairy farms that offer milk, cheese, and other dairy related products; harvests, processes, packages, and distributes live, chilled, and frozen seafood; and produces and processes meat products. It also develops and produces health and food, beverage, and pharmaceutical products; processes natural spring water; and develops and commercializes end-to-end food traceability and anti-counterfeit technology solutions, as well as operates as a food e-commerce platform. In addition, the company markets and distributes dairy, seafood, meat, wine, water, health, and nutrition products. Beston Global Food Company Limited was incorporated in 2014 and is headquartered in Adelaide, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5000",
        "website": "http://www.bestonglobalfoods.com.au",
        "market_cap": 58276800
    },
    "B6G.F": {
        "short_name": "BEGA CHEESE LTD.",
        "long_name": "Bega Cheese Limited",
        "summary": "Bega Cheese Limited engages in receiving, processing, manufacturing, and distributing dairy and other food-related products in Australia. The company operates in two segments, Branded and Bulk. The Branded segment manufactures bulk ingredients into value added consumer products for internal or external brands. The Bulk segment manufactures bulk dairy ingredients, nutritional, and bio nutrient products. It offers natural and processed cheese; butter and cream cheese products under the Farmer's Table brand name; dips, mayonnaise, and dressings under the ZoOSh brand name, as well as spreads under B honey, Bega peanut butter, and VEGEMITE brands. The company also develops and supplies bio nutrient ingredients for the health and nutrition markets. In addition, it operates as a contract packer of natural cheddar and processed cheddar cheese products for corporations; and is involved in contract packaging for private proprietary brands, supermarket house brands, and QSR raw material inputs, as well as products for other dairy companies into their brands. The company also exports its products to approximately 40 countries across the Middle East, Southeast Asia, North Asia, Central and South America, and the Pacific Islands. Bega Cheese Limited was founded in 1899 and is headquartered in Bega, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Bega",
        "zipcode": "2550",
        "website": "http://www.begacheese.com.au",
        "market_cap": 1127835776
    },
    "BFC.AX": {
        "short_name": "BEST GLOB FPO",
        "long_name": "Beston Global Food Company Limited",
        "summary": "Beston Global Food Company Limited, together with its subsidiaries, engages in the manufacture and sale of food and beverage products in Australia and internationally. It operates in four segments: Dairy, Meat, Other, and International Other. The company owns dairy farms that offer milk, cheese, and other dairy related products; harvests, processes, packages, and distributes live, chilled, and frozen seafood; and produces and processes meat products. It also develops and produces health and food, beverage, and pharmaceutical products; processes natural spring water; and develops and commercializes end-to-end food traceability and anti-counterfeit technology solutions, as well as operates as a food e-commerce platform. In addition, the company markets and distributes dairy, seafood, meat, wine, water, health, and nutrition products. Beston Global Food Company Limited was incorporated in 2014 and is headquartered in Adelaide, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Adelaide",
        "zipcode": "5000",
        "website": "http://www.bestonglobalfoods.com.au",
        "market_cap": 86469912
    },
    "BGA.AX": {
        "short_name": "BEGA FPO",
        "long_name": "Bega Cheese Limited",
        "summary": "Bega Cheese Limited engages in receiving, processing, manufacturing, and distributing dairy and other food-related products in Australia. The company operates in two segments, Branded and Bulk. The Branded segment manufactures bulk ingredients into value added consumer products for internal or external brands. The Bulk segment manufactures bulk dairy ingredients, nutritional, and bio nutrient products. It offers natural and processed cheese; butter and cream cheese products under the Farmer's Table brand name; dips, mayonnaise, and dressings under the ZoOSh brand name, as well as spreads under B honey, Bega peanut butter, and VEGEMITE brands. The company also develops and supplies bio nutrient ingredients for the health and nutrition markets. In addition, it operates as a contract packer of natural cheddar and processed cheddar cheese products for corporations; and is involved in contract packaging for private proprietary brands, supermarket house brands, and QSR raw material inputs, as well as products for other dairy companies into their brands. The company also exports its products to approximately 40 countries across the Middle East, Southeast Asia, North Asia, Central and South America, and the Pacific Islands. Bega Cheese Limited was founded in 1899 and is headquartered in Bega, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Bega",
        "zipcode": "2550",
        "website": "http://www.begacheese.com.au",
        "market_cap": 1805108352
    },
    "BUB.AX": {
        "short_name": "BUBS AUST FPO",
        "long_name": "Bubs Australia Limited",
        "summary": "Bubs Australia Limited, together with its subsidiaries, engages in the production and sale of various infant nutrition products in Australia, China, and internationally. It offers organic baby food, goat milk infant formula, adult goat milk powder, and fresh dairy products, as well as pouches, cereals, and snacks under the Bubs, CapriLac, Deloraiane, and Capela brands. The company also provides children's vitamin and mineral supplement products under the Vita Bubs name; canning services for nutritional dairy products; and holds IP and trademarks. Bubs Australia Limited was incorporated in 1993 and is headquartered in Dandenong, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Dandenong",
        "zipcode": "3175",
        "website": "http://www.bubsaustralia.com",
        "market_cap": 232854880
    },
    "C9CB.F": {
        "short_name": "PURE FOODS TASMANIA LTD.",
        "long_name": "Pure Foods Tasmania Limited",
        "summary": "Pure Foods Tasmania Limited engages in the food business in Australia. The company operates through Tasmanian Pate and Woodbridge Smokehouse segments. It offers pate products under the Tasmanian Pate brand; and smoked salmon and trout products under the Woodbridge Smokehouse brand. The company sells its products through direct food service, distributors, and retailers, as well as online. It also exports its products. The company was founded in 2015 and is based in Mornington, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "TAS",
        "city": "Mornington",
        "zipcode": "7018",
        "website": "http://www.purefoodstas.com",
        "market_cap": 20486698
    },
    "CLV.AX": {
        "short_name": "CLOVER FPO",
        "long_name": "Clover Corporation Limited",
        "summary": "Clover Corporation Limited refines and sells natural oils in Australia, New Zealand, Asia, Europe, and the Americas. The company is also involved in the production of encapsulated powders; and research and product development of functional food and infant nutrition ingredients. It offers Nu-Mega Hi docosahexaenoic acid tuna oils for use in infant formula and pharmaceutical products; Ocean Gold refined tuna oils; Nu-Mega Driphorm powders that are used in a range of infant formula, follow-on formula, growing up milks, and food applications; and Nu-Mega Driphorm HA for non-dairy applications. The company was founded in 1988 and is headquartered in Altona North, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Altona North",
        "zipcode": "3025",
        "website": "http://www.clovercorp.com.au",
        "market_cap": 296863360
    },
    "EVE.AX": {
        "short_name": "EVE INVEST FPO",
        "long_name": "EVE Investments Limited",
        "summary": "EVE Investments Limited is a venture capital firm specializing in seed and startup investments. It seeks to invest in health, nutrition, and wellness sector. The firm prefers to invests in Australia. EVE Investments Limited is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Subiaco",
        "zipcode": "6008",
        "website": "http://www.evehealthgroup.com.au",
        "market_cap": 19215700
    },
    "FFF.AX": {
        "short_name": "FORBIDDEN FPO",
        "long_name": "Forbidden Foods Limited",
        "summary": "Forbidden Foods Limited supplies organic rice, conventional rice, rice flour, and rice food solutions in Australia and New Zealand. It offers black, organic, and conventional rice; and rice flour, flakes, and syrups under the Forbidden brand; and range of flours, powders, grains, and blends for plant-based food home-cooks and food manufactures under the Sensory Mill brand. The company also provides its products under the FUNCH brand name. It serves retail, food service, and quick service restaurant customers through e-commerce. The company also exports its products to New Zealand, Ireland, Singapore, and the United States. Forbidden Foods Limited was founded in 2010 and is based in Box Hill South, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Box Hill South",
        "zipcode": "3000",
        "website": "http://www.forbiddenfoodsgroup.com",
        "market_cap": 12750170
    },
    "FIJ.AX": {
        "short_name": "FIJI KAVA FPO",
        "long_name": "Fiji Kava Limited",
        "summary": "Fiji Kava Limited operates as a medicinal kava health and wellness company in Australia, Fiji, Hong Kong, New Zealand, and the United States. It sources, produces, markets, and sells noble kava extract capsules, instant powder mixes, and flavored shots under the Fiji Kava and Taki Mai brand names. The company offers its products through supermarkets, health professionals, health food stores, retail channels, and other health-related businesses, as well as operates fijikava.com e-commerce platform. Fiji Kava Limited was founded in 2014 and is based in West End, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "West End",
        "zipcode": "4014",
        "website": "http://www.fijikava.com",
        "market_cap": 12605732
    },
    "FNP.AX": {
        "short_name": "FREEDOMFGL FPO",
        "long_name": "Freedom Foods Group Limited",
        "summary": "Freedom Foods Group Limited engages in sourcing, manufacture, selling, marketing, and distribution of plant-based beverages, and dairy and nutritional ingredient products to wholesale and consumer markets. It operates through Dairy and Nutritional, Plant Based Beverages, Cereal and Snacks, and Specialty Seafood segments. The company offers gluten free, allergen free, nutritional oat based, low sugar or salt, fortified, or functional products, including breakfast cereals, snack bars, and other related products. It also provides dairy milk beverage and nutritional ingredient products; UHT food and beverage products, such as liquid stocks, soy, rice, and almond beverages; performance and adult nutritional products comprising powders, bars, and drinks, as well as on the go beverages; and canned seafood products that include sardines, salmon, and specialty seafood. In addition, the company offers popping corn, yellow maize and derivatives, white maize and derivatives, rice flour, sorghum flour, and specialty gluten-free flours; and invests in dairy farming operations. It provides its products under the Messy Monkeys, Heritage Mill, Brekky Heroes, Freedom Foods, Barley+, Arnold's Farm, Crankt Protein, Australia's Own, MILKLAB, Simply White, So Natural, Almond Breeze, Australia's Own Organic, Brunswick, Paramount, Vital Life, UPPROTEIN, and Vital Strength brand names. The company operates in in Australia, New Zealand, South Africa, China, South East Asia, and the Middle East. The company was founded in 1986 and is headquartered in Taren Point, Australia. Freedom Foods Group Limited is a subsidiary of Arrovest Pty Limited.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Taren Point",
        "zipcode": "2229",
        "website": "http://ffgl.com.au",
        "market_cap": 109458056
    },
    "FOD.AX": {
        "short_name": "FOOD REV FPO",
        "long_name": "The Food Revolution Group Limited",
        "summary": "The Food Revolution Group Limited operates as a food processing company in Australia. It manufactures and sells a range of functional juices, fibers, infused fruits and waters, and fruit waters under The Original Juice Co, Juice Lab, and Eridani brands. The company also offers its products as ingredients to other food producers in the functional food, beverage, and nutraceutical markets. In addition, it engages in the provision of co-packing and logistics services to third parties; and research and development of food related technologies to develop functional food products and ingredients. The company was incorporated in 2011 and is headquartered in Mill Park, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Mill Park",
        "zipcode": "3082",
        "website": "http://www.thefoodrevolutiongroup.com.au",
        "market_cap": 27456096
    },
    "H0I.F": {
        "short_name": "SELECT HARVEST",
        "long_name": "Select Harvests Limited",
        "summary": "Select Harvests Limited engages in the processing, packaging, marketing, and distribution of edible nuts, dried fruits, seeds, and a range of natural health foods in Australia. The company operates through Almond Division and Food Division segments. It also grows, processes, and sells almonds to the food industry from company owned and leased almond orchards. In addition, the company offers health snacks, cooking nuts, mixes, and muesli; and holds a portfolio of approximately 7,696 hectares of almond orchards. It also exports its products to India and China, as well as the rest of Asia, Europe, and the Middle East. The company offers its products to retailers, distributors, and industrial users under the Lucky, NuVitality, and Sunsol in retail; and Renshaw and Alling Farms in the wholesale and industrial markets. The company is based in Thomastown, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Thomastown",
        "zipcode": "3074",
        "website": "http://www.selectharvests.com.au",
        "market_cap": 474101088
    },
    "HCT.AX": {
        "short_name": "HOLISTA FPO",
        "long_name": "Holista CollTech Limited",
        "summary": "Holista CollTech Limited operates as a biotech company in Australia, Malaysia, and the United States. The company operates through Supplements, Ovine Collagen, Infection control Solutions, and Food Ingredients segments. It manufactures and wholesales dietary supplements; cosmetic grade collagen; and healthy food ingredients, including low-glycaemic index (GI) flour mix for noodles, pasta, flatbreads and other baked products, low-sodium salt, low-fat fried foods, less-calorie sugar, and low-GI sugar. It also provides infection control solutions. Holista CollTech Limited is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.holistaco.com",
        "market_cap": 17622336
    },
    "HPP.AX": {
        "short_name": "HEALTHPPGL FPO",
        "long_name": "Health and Plant Protein Group Limited",
        "summary": "Health and Plant Protein Group Limited, together with its subsidiaries, manufactures and distributes confectionery ginger and other ginger-based products to industrial, food service, and retail customers worldwide. It operates through Ginger, Macadamias, and Tourism segments. The company also engages in the processing, production, and marketing of macadamia products to wholesale and retail customers. In addition, it sells ginger, and other retail gift and food products, as well as provides leisure services in the Australian tourism market. The company was formerly known as Buderim Group Limited and changed its name to Health and Plant Protein Group Limited in December 2020. Health and Plant Protein Group Limited was founded in 1941 and is headquartered in Milton, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Milton",
        "zipcode": "4064",
        "website": "http://www.hppgroup.com",
        "market_cap": 31933458
    },
    "JAT.AX": {
        "short_name": "JATCORP FPO",
        "long_name": "Jatcorp Limited",
        "summary": "Jatcorp Limited operates as a trade specialist of fast moving consumer goods in Australia and China. The company engages in the development and manufacture of various consumer products; related brand development, marketing, and promotion activities; and sale of client and in-house products primarily through a multichannel network, including traditional retail and e-commerce platforms. It primarily sells milk powder, vitamins, cosmetic products, dairy products, and other health-related consumer goods to wholesale and retail customers. The company was formerly known as Jatenergy Limited and changed its name to Jatcorp Limited in June 2020. Jatcorp Limited is based in Toorak, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Toorak",
        "zipcode": "3142",
        "website": "http://www.jatenergy.com",
        "market_cap": 23090980
    },
    "MBH.AX": {
        "short_name": "MAGGIEBEER FPO",
        "long_name": "Maggie Beer Holdings Limited",
        "summary": "Maggie Beer Holdings Limited manufactures and sells food and beverage products in Australia. It operates through three segments: Paris Creek Farms, St David Dairy, and MBP. The company provides pates, fruit pastes, jams, sugo, sauces, wine, and other products under the Maggie Beer brand. It also offers dairy food and beverage products, such as milk, yogurt, butter, cream, cheese, and others under the Paris Creek Farms brand. In addition, the company is involved in the processing and distribution of dairy products, including cream, yogurt, and butter under the Saint David Dairy brand. It offers its products to cafes, deli's and restaurants, dairy farmers, and fruit and vegetable growers. The company was formerly known as Longtable Group Limited and changed its name to Maggie Beer Holdings Limited in July 2020. Maggie Beer Holdings Limited was founded in 2000 and is based in Tanunda, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "SA",
        "city": "Tanunda",
        "zipcode": "5352",
        "website": "http://www.maggiebeerholdings.com.au",
        "market_cap": 114436528
    },
    "NUC.AX": {
        "short_name": "NUCHEV FPO",
        "long_name": "Nuchev Limited",
        "summary": "Nuchev Limited, a health and nutrition solutions company, develops, produces, markets, and sells goat milk based formula and nutritional products to consumers in Australia and China. It offers goat infant formula and nutritional range, toddler nutrition, and health and well-being products under the Oli6 brand. The company provides its products through retailers, wholesalers, and e-commerce platforms. Nuchev Limited was founded in 2013 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3004",
        "website": "http://www.nuchev.com.au",
        "market_cap": 28718142
    },
    "NZS.AX": {
        "short_name": "NZ COASTAL FPO",
        "long_name": "New Zealand Coastal Seafoods Limited",
        "summary": "New Zealand Coastal Seafoods Limited produces nutraceuticals, seafood products, and marine ingredients in New Zealand, Australia, and Asia. It offers ready to eat products, such as cooked ling maw, cooked paua, and powdered collagen ling maw nutraceutical products under the NZCS brand. The company also offers products its online. New Zealand Coastal Seafoods Limited was incorporated in 2007 and is based in Nedlands, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Nedlands",
        "zipcode": "6009",
        "website": "http://nzcs.co",
        "market_cap": 10751065
    },
    "PFT.AX": {
        "short_name": "PURE FOODS FPO",
        "long_name": "Pure Foods Tasmania Limited",
        "summary": "Pure Foods Tasmania Limited engages in the food business in Australia. The company operates through Tasmanian Pate and Woodbridge Smokehouse segments. It offers pate products under the Tasmanian Pate brand; and smoked salmon and trout products under the Woodbridge Smokehouse brand. The company sells its products through direct food service, distributors, and retailers, as well as online. It also exports its products. The company was founded in 2015 and is based in Mornington, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "TAS",
        "city": "Mornington",
        "zipcode": "7018",
        "website": "http://www.purefoodstas.com",
        "market_cap": 33308928
    },
    "SHV.AX": {
        "short_name": "SELECT FPO",
        "long_name": "Select Harvests Limited",
        "summary": "Select Harvests Limited engages in the processing, packaging, marketing, and distribution of edible nuts, dried fruits, seeds, and a range of natural health foods in Australia. The company operates through Almond Division and Food Division segments. It also grows, processes, and sells almonds to the food industry from company owned and leased almond orchards. In addition, the company offers health snacks, cooking nuts, mixes, and muesli; and holds a portfolio of approximately 7,696 hectares of almond orchards. It also exports its products to India and China, as well as the rest of Asia, Europe, and the Middle East. The company offers its products to retailers, distributors, and industrial users under the Lucky, NuVitality, and Sunsol in retail; and Renshaw and Alling Farms in the wholesale and industrial markets. The company is based in Thomastown, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Thomastown",
        "zipcode": "3074",
        "website": "http://www.selectharvests.com.au",
        "market_cap": 738175360
    },
    "SHVTF": {
        "short_name": "SELECT HARVESTS",
        "long_name": "Select Harvests Limited",
        "summary": "Select Harvests Limited engages in the processing, packaging, marketing, and distribution of edible nuts, dried fruits, seeds, and a range of natural health foods in Australia. The company operates through Almond Division and Food Division segments. It also grows, processes, and sells almonds to the food industry from company owned and leased almond orchards. In addition, the company offers health snacks, cooking nuts, mixes, and muesli; and holds a portfolio of approximately 7,696 hectares of almond orchards. It also exports its products to India and China, as well as the rest of Asia, Europe, and the Middle East. The company offers its products to retailers, distributors, and industrial users under the Lucky, NuVitality, and Sunsol in retail; and Renshaw and Alling Farms in the wholesale and industrial markets. The company is based in Thomastown, Australia.",
        "currency": "USD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Thomastown",
        "zipcode": "3074",
        "website": "http://www.selectharvests.com.au",
        "market_cap": 592737152
    },
    "TFL.AX": {
        "short_name": "TASFOODS FPO",
        "long_name": "TasFoods Limited",
        "summary": "TasFoods Limited processes, manufactures, and sells Tasmanian-made food products in Australia and internationally. The company operates through Dairy and Poultry segments. It offers poultry meat products under Nichols Poultry, Nichols Ethical Free Range, and Nichols Kitchen brands; and wasabi flowers and leaves, as well as fresh wasabi stems and powdered wasabi. The company also provides fresh milk, cheese, cream, butter, and fresh fermented products under the Meander Valley Dairy, Pyengana Dairy, Real Milk, Robur Farm Dairy, Betta Milk, and Tassie Taste brands. In addition, it operates cafe and retail shop, as well as markets its products through online stores and websites. The company was incorporated in 1998 and is based in Launceston, Australia.",
        "currency": "AUD",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "TAS",
        "city": "Launceston",
        "zipcode": "7250",
        "website": "http://www.tasfoods.com.au",
        "market_cap": 43987876
    },
    "UMG.F": {
        "short_name": "NEW ZEALAND + COAST.SEAF.",
        "long_name": "New Zealand Coastal Seafoods Limited",
        "summary": "New Zealand Coastal Seafoods Limited produces nutraceuticals, seafood products, and marine ingredients in New Zealand, Australia, and Asia. It offers ready to eat products, such as cooked ling maw, cooked paua, and powdered collagen ling maw nutraceutical products under the NZCS brand. The company also offers products its online. New Zealand Coastal Seafoods Limited was incorporated in 2007 and is based in Nedlands, Australia.",
        "currency": "EUR",
        "sector": "Consumer Defensive",
        "industry": "Packaged Foods",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "WA",
        "city": "Nedlands",
        "zipcode": "6009",
        "website": "http://nzcs.co",
        "market_cap": 6795072
    }
}