{
    "OORD.F": {
        "short_name": "ORORA LTD",
        "long_name": "Orora Limited",
        "summary": "Orora Limited designs, manufactures, and supplies packaging products and services to the grocery, fast moving consumer goods, and industrial markets in Australia, New Zealand, the United States, and internationally. It operates through Orora Australasia and Orora North America segments. The company provides glass bottles, aluminum cans, closures and caps, boxes and cartons, point-of-purchase displays, packaging equipment, rigid and flexible packaging, bags and sacks, flexible packaging, and general packaging materials and supplies, as well as recycled paper. It also purchases, warehouses, sells, and delivers a range of packaging and related materials; sells equipment; and provides point of purchase retail display solutions and other visual communication services. In addition, the company offers printing and signage, research and technology, product sourcing, automation and engineering, design, kitting and fulfilment, logistics, and digital technology services. The company was formerly known as Amcor Packaging (Australia) Limited and changed its name to Orora Limited in October 2013. Orora Limited was incorporated in 1949 and is headquartered in Hawthorn, Australia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Hawthorn",
        "zipcode": "3122",
        "website": "http://www.ororagroup.com",
        "market_cap": "Mid Cap"
    },
    "ORA.AX": {
        "short_name": "ORORA FPO",
        "long_name": "Orora Limited",
        "summary": "Orora Limited designs, manufactures, and supplies packaging products and services to the grocery, fast moving consumer goods, and industrial markets in Australia, New Zealand, the United States, and internationally. It operates through Orora Australasia and Orora North America segments. The company provides glass bottles, aluminum cans, closures and caps, boxes and cartons, point-of-purchase displays, packaging equipment, rigid and flexible packaging, bags and sacks, flexible packaging, and general packaging materials and supplies, as well as recycled paper. It also purchases, warehouses, sells, and delivers a range of packaging and related materials; sells equipment; and provides point of purchase retail display solutions and other visual communication services. In addition, the company offers printing and signage, research and technology, product sourcing, automation and engineering, design, kitting and fulfilment, logistics, and digital technology services. The company was formerly known as Amcor Packaging (Australia) Limited and changed its name to Orora Limited in October 2013. Orora Limited was incorporated in 1949 and is headquartered in Hawthorn, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Hawthorn",
        "zipcode": "3122",
        "website": "http://www.ororagroup.com",
        "market_cap": "Mid Cap"
    },
    "ORRAF": {
        "short_name": "ORORA LTD",
        "long_name": "Orora Limited",
        "summary": "Orora Limited designs, manufactures, and supplies packaging products and services to the grocery, fast moving consumer goods, and industrial markets in Australia, New Zealand, the United States, and internationally. It operates through Orora Australasia and Orora North America segments. The company provides glass bottles, aluminum cans, closures and caps, boxes and cartons, point-of-purchase displays, packaging equipment, rigid and flexible packaging, bags and sacks, flexible packaging, and general packaging materials and supplies, as well as recycled paper. It also purchases, warehouses, sells, and delivers a range of packaging and related materials; sells equipment; and provides point of purchase retail display solutions and other visual communication services. In addition, the company offers printing and signage, research and technology, product sourcing, automation and engineering, design, kitting and fulfilment, logistics, and digital technology services. The company was formerly known as Amcor Packaging (Australia) Limited and changed its name to Orora Limited in October 2013. Orora Limited was incorporated in 1949 and is headquartered in Hawthorn, Australia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Hawthorn",
        "zipcode": "3122",
        "website": "http://www.ororagroup.com",
        "market_cap": "Mid Cap"
    },
    "PGH.AX": {
        "short_name": "PACT GROUP FPO",
        "long_name": "Pact Group Holdings Ltd",
        "summary": "Pact Group Holdings Ltd manufactures and supplies rigid plastic and metal packaging in Australia, New Zealand, and internationally. The company operates through Packaging and Sustainability, Materials Handling and Pooling, and Contract Manufacturing Services segments. It primarily converts plastic resin and steel into packaging and related products for customers in the food, dairy, beverage, chemical, agricultural, industrial, and other sectors. The company offers packaging products for fresh food, chilled meat, frozen food, ready meals, baked goods, dairy products, juice and bottled water, and others for use in supermarkets, convenience stores, and fast food outlets; and sauces, edible oils, preserves, pancake mixes, flours, dry mixes, rice, fruit jars, and spreads, as well as household consumer products, including personal care, health, cleaning, and laundry products in supermarkets, pharmacies, health and beauty shops, and hardware stores. It also provides packaging solutions for agricultural chemicals, surface coatings, lubricants, and other petroleum products; handling solutions primarily for the transportation and storage of products using pallets, crates, and other containers; and infrastructure solutions, such as communication pits, hazard prevention products, noise walls, industrial tanks, and others primarily for the telecommunications, gas, and electrical industries, as well as various road and rail infrastructure projects. In addition, the company offers contract manufacturing services for home care, personal care, automotive, promotional packaging, and aerosol and liquid based consumer products in the non-food FMCG, and household and industrial chemicals sectors, as well as pharmaceutical and nutraceutical manufacturing, recycling, sustainability, and crate pooling services. Pact Group Holdings Ltd was founded in 2002 and is headquartered in Cremorne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Cremorne",
        "zipcode": "3121",
        "website": "http://pactgroup.com.au",
        "market_cap": "Small Cap"
    },
    "PPG.AX": {
        "short_name": "PRO PAC FPO",
        "long_name": "Pro-Pac Packaging Limited",
        "summary": "Pro-Pac Packaging Limited, together with its subsidiaries, engages in the manufacture and distribution of industrial, flexible, and rigid packaging products in Australia, New Zealand, and Canada. It operates through: Flexibles, Industrial, and Rigid segments. The Flexibles segment manufactures flexible packaging materials products, such as stretch and shrink wrap, agricultural silage packaging, fresh produce bags, barrier and lidding films, and industrial protective films. The Industrial segment sources and distributes industrial packaging materials and related consumer products. The Rigid segment manufactures, sources, and distributes containers, closures, and related products and services. It offers cartons, flexible films, plastic bottles, lids and closures, food processing products, packaging products to the fresh produce industry, industrial and protective packaging products, strapping and wrapping, and pallet wrapping machines, safety and PPE products, washroom and janitorial products. The company also provides void fill solutions; bags and liners; cleaning supplies; labels and warehouse products; and sign products. It supplies a range of products and services to industry segments comprising primary produce, food and food processing, and warehousing and logistics, as well as agricultural, industrial, and commercial markets; and retail and FMCG markets. Pro-Pac Packaging Limited was founded in 1987 and is headquartered in Reservoir, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Reservoir",
        "zipcode": "3073",
        "website": "http://www.ppgaust.com.au",
        "market_cap": "Micro Cap"
    },
    "SES.AX": {
        "short_name": "SECOS FPO",
        "long_name": "SECOS Group Limited",
        "summary": "SECOS Group Limited manufactures and distributes sustainable packaging materials in Oceanic, Asia, Americas, Europe, and Africa. The company provides biodegradable resins, packaging products, and cast films to blue-chip companies. It also develops and manufactures bioplastic resins derived from renewable resources for the packaging and plastic products industries. The company is headquartered in Mount Waverley, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Mount Waverley",
        "zipcode": "3149",
        "website": "http://www.secosgroup.com.au",
        "market_cap": "Micro Cap"
    },
    "SINC": {
        "short_name": "SINCERITY APPLIED MATLS HLDGS C",
        "long_name": "Sincerity Applied Materials Holdings Corp.",
        "summary": "Sincerity Applied Materials Holdings Corp. provides packing materials for the automotive, packaging, building and construction, and engineering industries in Australia, Asia, and the Middle East. The company primarily offers breathable plastic films and modified atmosphere packaging products for the packaging of perishable foods, as well as extruded plastic pallets for aluminum cans to end users and distributors. Its products are used in packaging, agriculture, automotive and transportation, paint and coating, construction, personal care and hygiene, electronic, pharmaceutical, energy and natural resource, plastic, and rubber and leather applications. The company was founded in 2005 and is headquartered in South Yarra, Australia.",
        "currency": "USD",
        "sector": "Consumer Cyclical",
        "industry": "Packaging & Containers",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "South Yarra",
        "zipcode": "3141",
        "website": "http://www.sincerityholdings.com",
        "market_cap": "Micro Cap"
    }
}