{
    "AFL.AX": {
        "short_name": "AF LEGAL FPO",
        "long_name": "AF Legal Group Limited",
        "summary": "AF Legal Group Limited operates as a family and relationship law firm in Australia. It provides family law services, such as separation, divorce, child custody, child support, spousal maintenance, and property settlement. The company was formerly known as Navigator Resources Limited and changed its name to AF Legal Group Limited in May 2019. AF Legal Group Limited was incorporated in 1994 and is based in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.australianfamilylawyers.com.au",
        "market_cap": "Small Cap"
    },
    "AHX.AX": {
        "short_name": "APIAM FPO",
        "long_name": "Apiam Animal Health Limited",
        "summary": "Apiam Animal Health Limited, a vertically integrated animal health company, provides veterinary products and services to production and companion animals in Australia. It operates through three segments: Dairy and Mixed, Feedlots, and Pigs. The company engages in the veterinary wholesale, warehousing, logistics, and other ancillary activities. Its products and services include systems to assist in herd health programs; production advisory services; consulting services and products to assist in the prevention of animal diseases; technologies to manage compliance with legislative requirements on pharmaceutical use; and advice and services in respect of animal welfare compliance, as well as on-farm delivery of products. The company also provides third party auditing services for industry quality assurance programs; ancillary services, such as the sale and/or delivery of genetics and associated products; on-farm and online training programs for clients; and payroll and transport services. In addition, it retails animal health products; and develops technology for animal health management. The company offers its services through production animal and mixed animal veterinary clinics. Apiam Animal Health Limited was founded in 1998 and is based in Bendigo, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Bendigo",
        "zipcode": "3550",
        "website": "http://www.apiam.com.au",
        "market_cap": "Small Cap"
    },
    "IVC.AX": {
        "short_name": "INVOCARE FPO",
        "long_name": "InvoCare Limited",
        "summary": "InvoCare Limited provides funeral, cemetery, crematoria, and related services in Australia, New Zealand, and Singapore. The company operates approximately 290 funeral home locations, and 18 cemeteries and crematoria that offers burial, memorialization, and cremation services. It also offers pet cremation services under the Patch & Purr, Pets in Peace, Family Pet Care, and the Lanswood and Edenhill brands; and LifeArt coffins. In addition, the company operates MyGriefAssist, an online grief resource website; and MyMemorial, a website that provides range of cremation and burial memorial options. Further, it offers digital funeral planning services under the Funeral Planner brand name; and Guardian Plan, a prepaid funeral plan. InvoCare Limited was incorporated in 2001 and is headquartered in North Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "North Sydney",
        "zipcode": "2060",
        "website": "http://www.invocare.com.au",
        "market_cap": "Small Cap"
    },
    "MFD.AX": {
        "short_name": "MAYFIELD FPO",
        "long_name": "Mayfield Childcare Limited",
        "summary": "Mayfield Childcare Limited provides long day childcare services in Victoria, Australia. The company operates 20 long day childcare centers. Mayfield Childcare Limited was incorporated in 2015 and is based in Malvern East, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Malvern East",
        "zipcode": "3145",
        "website": "http://www.mayfieldchildcare.com.au",
        "market_cap": "Small Cap"
    },
    "MPA.AX": {
        "short_name": "MAD PAWS FPO",
        "long_name": "Mad Paws Holdings Limited",
        "summary": "Mad Paws Holdings Limited operates pet care services online marketplace. Its marketplace matches and connects pet owners seeking pet care services, such as pet sitting, walking, daycare, and grooming, with pet sitters, walkers, and other pet service providers registered on the marketplace. It also offers pet food subscription service providing pet owners with pre-prepared, individually packed meals for pets. In addition, it provides pet insurance products. The company was founded in 2014 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2009",
        "website": "http://www.madpaws.com.au",
        "market_cap": "Small Cap"
    },
    "N1R.MU": {
        "short_name": "AL LEGAL GROUP LTD",
        "long_name": "AF Legal Group Limited",
        "summary": "AF Legal Group Limited operates as a family and relationship law firm in Australia. It provides family law services, such as separation, divorce, child custody, child support, spousal maintenance, and property settlement. The company was formerly known as Navigator Resources Limited and changed its name to AF Legal Group Limited in May 2019. AF Legal Group Limited was incorporated in 1994 and is based in Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "MUN",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.australianfamilylawyers.com.au",
        "market_cap": "Small Cap"
    },
    "OQH.F": {
        "short_name": "SLATER AND GORDON LTD",
        "long_name": "Slater and Gordon Limited",
        "summary": "Slater and Gordon Limited, a law firm, operates legal practices in Australia. The company provides legal services in various areas, such as workers compensation, motor vehicle accidents, public liability, asbestos, silicosis, military compensation, comcare, superannuation and disability insurance, medical law, commercial litigation, will, and employment law. It also offers union services and class actions. The company was founded in 1935 and is based in Melbourne, Australia. Slater and Gordon Limited is a subsidiary of AIO V Finance (Ireland) DAC.",
        "currency": "EUR",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.slatergordon.com.au",
        "market_cap": "Small Cap"
    },
    "PFP.AX": {
        "short_name": "PROPEL FP FPO",
        "long_name": "Propel Funeral Partners Limited",
        "summary": "Propel Funeral Partners Limited provides death care services in Australia and New Zealand. It is involved in the collection and transfer of the deceased; provision of mortuary services; arrangement and conducting a funeral; and cremation, burial, and memorialization activities. As of June 30, 2020, the company owned and operated 130 properties comprising 72 owned and 58 leased, which included 31 cremation facilities and 9 cemeteries. It serves individuals and families dealing with, or preparing for, death and bereavement. The company was founded in 2012 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.propelfuneralpartners.com.au",
        "market_cap": "Small Cap"
    },
    "SGH.AX": {
        "short_name": "SLATER & G FPO",
        "long_name": "Slater and Gordon Limited",
        "summary": "Slater and Gordon Limited, a law firm, operates legal practices in Australia. The company provides legal services in various areas, such as workers compensation, motor vehicle accidents, public liability, asbestos, silicosis, military compensation, comcare, superannuation and disability insurance, medical law, commercial litigation, will, and employment law. It also offers union services and class actions. The company was founded in 1935 and is based in Melbourne, Australia. Slater and Gordon Limited is a subsidiary of AIO V Finance (Ireland) DAC.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.slatergordon.com.au",
        "market_cap": "Small Cap"
    },
    "SHJ.AX": {
        "short_name": "SHINE CORP FPO",
        "long_name": "Shine Justice Ltd",
        "summary": "Shine Justice Ltd, through its subsidiaries, provides damages based plaintiff litigation legal services in Australia; and insurance recovery consulting services in New Zealand. It operates through two segments, Personal Injury and New Practice Areas. The Personal Injury segment provides services related to public liability, catastrophic injuries, workers' compensation, and motor vehicle accidents. The New Practice Areas segment offers abuse law, disability insurance and superannuation claims, asbestos and dust disease, federal compensation law, medical law, class actions, commercial disputes, employment, and private client services. It operates 54 branches. The company was formerly known as Shine Corporate Ltd and changed its name to Shine Justice Ltd in April 2020. The company was founded in 1976 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.shinejustice.com.au",
        "market_cap": "Small Cap"
    },
    "TNK.AX": {
        "short_name": "THINK CHIL STAPLED",
        "long_name": "Think Childcare Group",
        "summary": "Think Childcare Group provides childcare services under the Nido brand in Australia. The company offers full or part-time care services for babies, toddlers, and young children. It owns and manages approximately 78 centers. The company was incorporated in 2019 and is based in Drummoyne, Australia.",
        "currency": "AUD",
        "sector": "Consumer Cyclical",
        "industry": "Personal Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Drummoyne",
        "zipcode": "2047",
        "website": "http://www.thinkchildcare.com.au",
        "market_cap": "Small Cap"
    }
}