{
    "AEI.AX": {
        "short_name": "AERIS ENV FPO",
        "long_name": "Aeris Environmental Ltd",
        "summary": "Aeris Environmental Ltd engages in the research, development, and commercialization of proprietary technologies in Australia and internationally. It provides HVAC/R hygiene and remediation technology; and energy efficiency services. The company also offers indoor surface clean and treatment solutions; heavy duty cleaning, treatments, and odour control technologies for the HVAC/R, remediation and restoration, and facilities maintenance industries; bioactive filter treatment and pan tablets; corrosion protection solutions; duct treatment to prevent colonization by mould and bacteria; and hood coating for commercial kitchen range hoods. In addition, it provides ice machine/dairy and beverages cleaners and sanitizers; and cooling tower cleaners. The company is headquartered in Rosebery, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Rosebery",
        "zipcode": "2018",
        "website": "http://www.aeris.com.au",
        "full_time_employees": null
    },
    "DEM.AX": {
        "short_name": "DEMEM LTD FPO",
        "long_name": "De.mem Limited",
        "summary": "De.mem Limited designs, builds, owns, and operates de-centralized water and waste water treatment systems for its customers in industrial, municipal, and residential sectors in Singapore, Australia, and Germany. The company offers disinfection systems, such as chlorination and ultraviolet systems; biological treatments that include aerobic and anaerobic treatments; chemical dosing systems and chemical treatments; membrane based water treatment systems, including microfiltration, ultrafiltration, hollow fiber nano filtration, reverse osmosis, membrane bioreactors, and hollow fire forward osmosis; and other specialized treatment processes, such as dissolved air filtration, media filtration, and ion exchange. It also provides programmable logic controller and automation tools; and sludge management services. In addition, the company offers potable water supply, sewage treatment, industrial waste water, recycling, desalination, and process water solutions. Further, it provides operation and maintenance of water or waste water treatment systems; consulting, engineering, and optimization services; and technical advisory services. The company serves mining, infrastructure, electronics, chemicals, oil and gas, and food and beverage industries. De.mem Limited was founded in 2013 and is based in South Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3205",
        "website": "http://www.demembranes.com",
        "full_time_employees": null
    },
    "DM2.F": {
        "short_name": "DE.MEM LTD O.N.",
        "long_name": "De.mem Limited",
        "summary": "De.mem Limited designs, builds, owns, and operates de-centralized water and waste water treatment systems for its customers in industrial, municipal, and residential sectors in Singapore, Australia, and Germany. The company offers disinfection systems, such as chlorination and ultraviolet systems; biological treatments that include aerobic and anaerobic treatments; chemical dosing systems and chemical treatments; membrane based water treatment systems, including microfiltration, ultrafiltration, hollow fiber nano filtration, reverse osmosis, membrane bioreactors, and hollow fire forward osmosis; and other specialized treatment processes, such as dissolved air filtration, media filtration, and ion exchange. It also provides programmable logic controller and automation tools; and sludge management services. In addition, the company offers potable water supply, sewage treatment, industrial waste water, recycling, desalination, and process water solutions. Further, it provides operation and maintenance of water or waste water treatment systems; consulting, engineering, and optimization services; and technical advisory services. The company serves mining, infrastructure, electronics, chemicals, oil and gas, and food and beverage industries. De.mem Limited was founded in 2013 and is based in South Melbourne, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3205",
        "website": "http://www.demembranes.com",
        "full_time_employees": null
    },
    "ECT.AX": {
        "short_name": "ENVIRON FPO",
        "long_name": "Environmental Clean Technologies Limited",
        "summary": "Environmental Clean Technologies Limited invests in, researches, develops, and commercializes technologies in the environmental and energy industries in Australia. Its technologies include Coldry, a method to dewater brown coal and transform this resource into a black coal equivalent; and HydroMOR, a process for producing iron product from low-rank coal with brown coal and iron oxide bearing material, such as mill scale, nickel tailings, and high or low-grade iron ore. The company also offers catalytic de-polymerization technology that enables the production of automotive diesel from a range of hydrocarbon-based inputs, including various waste and hydrocarbon streams, such as waste timber, end-of-life plastics, and low-rank coal; and catalytic organic hydrogen generation technology for producing hydrogen from lignite. It also provides equity lending facility loans. Environmental Clean Technologies Limited was founded in 1985 and is based in South Yarra, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "South Yarra",
        "zipcode": "3141",
        "website": "http://www.ectltd.com.au",
        "full_time_employees": null
    },
    "EGL.AX": {
        "short_name": "ENVN GROUP FPO",
        "long_name": "The Environmental Group Limited",
        "summary": "The Environmental Group Limited engages in the design, application, and servicing of gas and vapor emission control systems, and inlet and exhaust systems for gas turbines in Australia and internationally. Its products include gas turbine inlet filtration systems (filter houses), inlet cooling/fogging systems, acoustical components, expansion joints, and complete exhaust systems with guillotine and diverter dampers; and a range of air pollution control equipment and services for the removal of pollutants from industrial gas and air streams. The company also provides engineering, and water treatment services to various industries; and installation, commissioning, service, and maintenance of steam boilers, inert gas generators, hot water boilers, valves, thermal oil heaters, economizers, and burners. The Environmental Group Limited was incorporated in 1923 and is headquartered in Notting Hill, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Notting Hill",
        "zipcode": "3168",
        "website": "http://www.environmental.com.au",
        "full_time_employees": null
    },
    "SREMF": {
        "short_name": "SUNRISE ENERGY METALS LTD",
        "long_name": "Sunrise Energy Metals Limited",
        "summary": "Sunrise Energy Metals Limited, together with its subsidiaries, provides metals recovery and industrial water treatment services primarily in Australia. It operates in two segments, Water and Metals. The Water segment offers Continuous Ionic Filtration, Macroporous Polymer Adsorption, and Graphene Oxide and BIOCLENS resin technologies to filter, separate, purify, and recycle polluted water for drinking, agricultural, recreational, and industrial uses. The Metals segment provides Clean-iX resin technology for the extraction and purification of a range of resources, including base and precious metals, as well as radioactive elements, such as uranium. This segment is also involved in the development of the Sunrise project in New South Wales. The company was formerly known as Clean TeQ Holdings Limited and changed its name to Sunrise Energy Metals Limited in March 2021. Sunrise Energy Metals Limited was founded in 1990 and is based in Notting Hill, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Notting Hill",
        "zipcode": "3168",
        "website": "http://sunriseem.com",
        "full_time_employees": null
    },
    "SRL.AX": {
        "short_name": "SUNRISE FPO",
        "long_name": "Sunrise Energy Metals Limited",
        "summary": "Sunrise Energy Metals Limited, together with its subsidiaries, provides metals recovery and industrial water treatment services primarily in Australia. It operates in two segments, Water and Metals. The Water segment offers Continuous Ionic Filtration, Macroporous Polymer Adsorption, and Graphene Oxide and BIOCLENS resin technologies to filter, separate, purify, and recycle polluted water for drinking, agricultural, recreational, and industrial uses. The Metals segment provides Clean-iX resin technology for the extraction and purification of a range of resources, including base and precious metals, as well as radioactive elements, such as uranium. This segment is also involved in the development of the Sunrise project in New South Wales. The company was formerly known as Clean TeQ Holdings Limited and changed its name to Sunrise Energy Metals Limited in March 2021. Sunrise Energy Metals Limited was founded in 1990 and is based in Notting Hill, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Notting Hill",
        "zipcode": "3168",
        "website": "http://sunriseem.com",
        "full_time_employees": null
    },
    "WAT.AX": {
        "short_name": "WATERCO FPO",
        "long_name": "Waterco Limited",
        "summary": "Waterco Limited engages in the manufacture, wholesale, and export of equipment and accessories in the swimming pool, spa pool, spa bath, rural pump, and water treatment industries in Australia, New Zealand, Asia, North America, and Europe. It also manufactures and sells solar heating systems for swimming pools and pre-heat industrial solar systems. The company's pool and spa products comprise infloor cleaning systems, mineral crystals, swimming pool pumps, filtration systems, pool heating products, chlorine free spa products, controllers and automation products, pool lighting products, sunction and robotic pool cleaners, and commercial products. Its pool and spa products also include pool filter media products, recirculation and maintenance accessories, blowers, values, spa equipment, chemical pool products, sensation and enviropro eco range products, ozone mineral pool products, and test kits. The company's water treatment products include commercial filter media and cooling water filtration products, cartridge and bag filters, centrifugal filters, and fiberglass media filters; and residential pressure pumps, centrifugal filters, water filters, water softeners, and drinking water purifiers. It also provides aquaculture equipment, such as aquabiome mechanical and biological filters, aquaculture heating and pup ranges, bio-mec bead media, multicyclones, and spa airflo blowers. In addition, the company franchises retail outlets for swimming pool equipment and accessories. Further, it engages in formulating, packing, and distributing swimming pool chemicals to independent pool stores and stores in its Swimart franchise network. It operates 68 stores and 9 mobile franchises under the Swimart names, and 15 WaterShoppe stores. Waterco Limited was founded in 1981 and is headquartered in Rydalmere, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Rydalmere",
        "zipcode": "2116",
        "website": "http://www.waterco.com",
        "full_time_employees": 660
    }
}