{
    "AEI.AX": {
        "short_name": "AERIS ENV FPO",
        "long_name": "Aeris Environmental Ltd",
        "summary": "Aeris Environmental Ltd engages in the research, development, and commercialization of proprietary technologies in Australia and internationally. It provides HVAC/R hygiene and remediation technology; and energy efficiency services. The company also offers indoor surface clean and treatment solutions; heavy duty cleaning, treatments, and odour control technologies for the HVAC/R, remediation and restoration, and facilities maintenance industries; bioactive filter treatment and pan tablets; corrosion protection solutions; duct treatment to prevent colonization by mould and bacteria; and hood coating for commercial kitchen range hoods. In addition, it provides ice machine/dairy and beverages cleaners and sanitizers; and cooling tower cleaners. The company is headquartered in Rosebery, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Rosebery"
    },
    "ECT.AX": {
        "short_name": "ENVIRON FPO",
        "long_name": "Environmental Clean Technologies Limited",
        "summary": "Environmental Clean Technologies Limited invests in, researches, develops, and commercializes technologies in the environmental and energy industries in Australia. Its technologies include Coldry, a method to dewater brown coal and transform this resource into a black coal equivalent; and HydroMOR, a process for producing iron product from low-rank coal with brown coal and iron oxide bearing material, such as mill scale, nickel tailings, and high or low-grade iron ore. The company also offers catalytic de-polymerization technology that enables the production of automotive diesel from a range of hydrocarbon-based inputs, including various waste and hydrocarbon streams, such as waste timber, end-of-life plastics, and low-rank coal; and catalytic organic hydrogen generation technology for producing hydrogen from lignite. It also provides equity lending facility loans. Environmental Clean Technologies Limited was founded in 1985 and is based in South Yarra, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Pollution & Treatment Controls",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "South Yarra"
    }
}