{
    "AZJ.AX": {
        "short_name": "AURIZON FPO",
        "long_name": "Aurizon Holdings Limited",
        "summary": "Aurizon Holdings Limited, through its subsidiaries, operates as a rail freight operator in Australia. It operates through Network, Coal, Bulk, and Other segments. The company transports various commodities, including mining, agricultural, industrial, and retail products; and retail goods and groceries across small and big towns, and cities, as well as coal and iron ore. It also operates and manages the Central Queensland Coal Network that consists of 2,670 kilometers of track network; and provides various specialist services, such as rail design, engineering, construction, management, and maintenance, as well as supply chain solutions. In addition, the company transports bulk rail freight services for miners, primary producers, and the manufacturing industry. Further, it is involved in the general freight business. The company was formerly known as QR National Limited and changed its name to Aurizon Holdings Limited in December 2012. Aurizon Holdings Limited was incorporated in 2010 and is headquartered in Fortitude Valley, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Fortitude Valley",
        "zipcode": "4006",
        "website": "http://www.aurizon.com.au",
        "market_cap": "Mid Cap"
    },
    "EGN.AX": {
        "short_name": "ENGENCO FPO",
        "long_name": "Engenco Limited",
        "summary": "Engenco Limited, together with its subsidiaries, provides engineering services and products in Australasia, Europe, and the United States. The company's Gemco Rail segment engages in the remanufacture and repair of locomotives, wagons, bearings, and other rail products for rail operators and maintainers. This segment offers wheel-set, bogie, and in-field wagon maintenance services; and manufactures new and refurbished wagons, bogie component parts, customized remote controlled ballast car discharge gates, and rail maintenance equipment and spares. Its Convair segment manufactures pneumatic road tankers and mobile silos for the carriage and storage of construction materials, grains, and other dry bulk materials; and offers maintenance, repair, and overhaul services, as well as sells ancillary equipment and spare parts. The company's Drivetrain segment offers engine and powertrain maintenance, repair, and overhaul; power generation design and construction; and technical support, professional engineering, and training services, as well as fluid connectors, new components, and parts to mining, oil and gas, rail, transport, defense, marine, construction, materials handling, automotive, agriculture, and power generation industries. Its Momentum Rail segment provides personnel and project management services, such as professional recruitment; and training and workforce solutions comprising management and provision of track construction, and maintenance projects to freight rail and mining rail infrastructure managers. The company's CERT segment provides rail training, rail incident investigation training, security (transit guard) training, first aid training, and company induction and course design services; issues certificates of competency; and manages apprenticeship and trainee schemes for various infrastructure and rail clients. Engenco Limited was founded in 1989 and is headquartered in Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.engenco.com.au",
        "market_cap": "Small Cap"
    },
    "QRL.F": {
        "short_name": "AURIZON HLDGS LTD",
        "long_name": "Aurizon Holdings Limited",
        "summary": "Aurizon Holdings Limited, through its subsidiaries, operates as a rail freight operator in Australia. It operates through Network, Coal, Bulk, and Other segments. The company transports various commodities, including mining, agricultural, industrial, and retail products; and retail goods and groceries across small and big towns, and cities, as well as coal and iron ore. It also operates and manages the Central Queensland Coal Network that consists of 2,670 kilometers of track network; and provides various specialist services, such as rail design, engineering, construction, management, and maintenance, as well as supply chain solutions. In addition, the company transports bulk rail freight services for miners, primary producers, and the manufacturing industry. Further, it is involved in the general freight business. The company was formerly known as QR National Limited and changed its name to Aurizon Holdings Limited in December 2012. Aurizon Holdings Limited was incorporated in 2010 and is headquartered in Fortitude Valley, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Fortitude Valley",
        "zipcode": "4006",
        "website": "http://www.aurizon.com.au",
        "market_cap": "Mid Cap"
    },
    "QRNNF": {
        "short_name": "AURIZON HOLDINGS LIMITED",
        "long_name": "Aurizon Holdings Limited",
        "summary": "Aurizon Holdings Limited, through its subsidiaries, operates as a rail freight operator in Australia. It operates through Network, Coal, Bulk, and Other segments. The company transports various commodities, including mining, agricultural, industrial, and retail products; and retail goods and groceries across small and big towns, and cities, as well as coal and iron ore. It also operates and manages the Central Queensland Coal Network that consists of 2,670 kilometers of track network; and provides various specialist services, such as rail design, engineering, construction, management, and maintenance, as well as supply chain solutions. In addition, the company transports bulk rail freight services for miners, primary producers, and the manufacturing industry. Further, it is involved in the general freight business. The company was formerly known as QR National Limited and changed its name to Aurizon Holdings Limited in December 2012. Aurizon Holdings Limited was incorporated in 2010 and is headquartered in Fortitude Valley, Australia.",
        "currency": "USD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "PNK",
        "market": "us_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Fortitude Valley",
        "zipcode": "4006",
        "website": "http://www.aurizon.com.au",
        "market_cap": "Mid Cap"
    },
    "TTI.AX": {
        "short_name": "TRAFFIC FPO",
        "long_name": "Traffic Technologies Limited",
        "summary": "Traffic Technologies Limited, together with its subsidiaries, provides traffic solutions in Australia and internationally. The company designs, manufactures, and installs traffic signals, traffic controllers, pedestrian countdown timers, electronic road signs, emergency telephones, road lighting products, and control systems. It also supplies a range of directional and regulatory traffic signs and traffic control products to road traffic authorities, municipal councils, and construction companies. In addition, the company's Traffic SmartCity Technology platform enables the integration of street lights and other traffic management equipment to a central control/management system through remote Internet of Things sensors primarily for the road industry, councils, and power authorities. Further, it offers traffic control products, vests, brackets, cones, and bollards, as well as corporate signage for government and private sectors; sign installation and computer assessment of local government signage; and intelligent transport systems. The company was founded in 2004 and is headquartered in Eltham, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Railroads",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Eltham",
        "zipcode": "3095",
        "website": "http://www.trafficltd.com.au",
        "market_cap": "Small Cap"
    }
}