{
    "ACU.AX": {
        "short_name": "ACUMENTIS FPO",
        "long_name": "Acumentis Group Limited",
        "summary": "Acumentis Group Limited provides valuation, research, and advisory services in relation to property and businesses in Australia. The company offers residential property valuation, government, commercial property valuation, insurance valuation, rural and agribusiness, property advisory, quantity surveying, buyers agency, illicit substance screening, projects division, self-managed super funds property assessment, stamp duty assessment, family law and litigation, and homebuilder grant valuation services. It serves the private owner and investor, professional/SME, corporate, government, banking, finance, REIT, and development industries. The company was formerly known as LandMark White Limited and changed its name to Acumentis Group Limited in January 2020. Acumentis Group Limited was founded in 1982 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.acumentis.com.au",
        "full_time_employees": null
    },
    "AU1.AX": {
        "short_name": "THE AGENCY FPO",
        "long_name": "The Agency Group Australia Limited",
        "summary": "The Agency Group Australia Limited engages in the real estate business in Australia. The company offers property management, real estate agency, and related services, as well as sells properties. The Agency Group Australia Limited was incorporated in 2006 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6000",
        "website": "http://theagencygroup.com.au",
        "full_time_employees": null
    },
    "ECF.AX": {
        "short_name": "ELANOR COM STAPLED",
        "long_name": "Elanor Commercial Property Fund",
        "summary": "Elanor Commercial Property Fund (ASX: ECF) is an externally managed real estate investment trust that invests in Australian commercial office assets. It was listed on the ASX in 2019 and currently owns 7 office assets with a combined valuation of $374 million.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.elanorinvestors.com/ecf/",
        "full_time_employees": null
    },
    "EDC.AX": {
        "short_name": "EILDON CAP STAPLED",
        "long_name": "Eildon Capital Fund",
        "summary": "Eildon Capital Fund is a real estate investment firm specializing in senior financing, preferred equity, mezzanine and bridge financing, and equity financing. The firm participates in retail, industrial, residential and commercial opportunities. Eildon Capital Fund was founded in 1993 and is based in Melbourne, Australia and having an additional office in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.eildonfunds.com/index.html",
        "full_time_employees": null
    },
    "EGH.AX": {
        "short_name": "EUR GROUP FPO",
        "long_name": "Eureka Group Holdings Limited",
        "summary": "Eureka Group Holdings Limited, together with its subsidiaries, owns and manages senior independent living communities in Australia. The company operates in two segments, Rental Villages and Property Management. It also provides specialist property management and caretaking services; and catering services. The company was formerly known as SCV Group Limited and changed its name to Eureka Group Holdings Limited in October 2010. Eureka Group Holdings Limited was incorporated in 2001 and is headquartered in Southport, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Southport",
        "zipcode": "4215",
        "website": "http://www.eurekagroupholdings.com.au",
        "full_time_employees": null
    },
    "ERF.AX": {
        "short_name": "ELANORETL STAPLED",
        "long_name": "Elanor Retail Property Fund",
        "summary": "Elanor Retail Property Fund (ASX:ERF) is an externally managed listed real estate investment fund investing in Australian retail property. The fund invests in high investment quality, non-discretionary retail based neighborhood and sub-regional shopping centers. The strategy of Elanor Retail Property Fund is to acquire assets that provide strong income and capital growth potential. The Elanor Retail Property Fund's management team has proven experience in identifying and managing high investment value retail property assets.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.elanorinvestors.com/ERF",
        "full_time_employees": null
    },
    "GDF.AX": {
        "short_name": "GARDAPRGRP STAPLED",
        "long_name": "Garda Property Group",
        "summary": "Garda Diversified Property Fund is a real estate investment trust externally managed by Garda Capital Group. It invests in real estate markets of Australia. The fund intends to invest in commercial offices in city and suburban markets as well as industrial facilities along the eastern seaboard of Australia. Garda Diversified Property is domiciled in Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "QLD",
        "city": "Brisbane",
        "zipcode": "4000",
        "website": "http://www.gardaproperty.com.au/gdf-investor-centre/company-overview/",
        "full_time_employees": null
    },
    "MEA.AX": {
        "short_name": "MCGRATH FPO",
        "long_name": "McGrath Limited",
        "summary": "McGrath Limited operates as an integrated residential real estate services company in Australia. It operates through Company Owned Sales, Company Owned Property Management, Franchise Services, and Other Services segments. The company provides residential property sales, property management, mortgage broking, auction, and real estate training and conferences, as well as manages franchise offices. As of June 30, 2020, it operated 30 owned offices and 67 franchise offices. The company was founded in 1988 and is headquartered in Pyrmont, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Pyrmont",
        "zipcode": "2009",
        "website": "http://www.mcgrath.com.au",
        "full_time_employees": 305
    },
    "SRV.AX": {
        "short_name": "SERVCORP FPO",
        "long_name": "Servcorp Limited",
        "summary": "Servcorp Limited provides executive serviced and virtual offices, coworking and IT, communications, and secretarial services. It offers office space solutions; virtual office services, such as business address, secretary and receptionist, mail forwarding, and telephone answering services; and co-working and meeting room services. The company operates in Australia, New Zealand, Southeast Asia, the United States, Europe, the Middle East, North Asia, and internationally. Servcorp Limited was founded in 1978 and is headquartered in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.servcorp.com",
        "full_time_employees": 694
    },
    "SSL.AX": {
        "short_name": "SIETEL FPO",
        "long_name": "Sietel Limited",
        "summary": "Sietel Limited invests in industrial, commercial, and retail real estate properties in Australia. It also finances and leases facilities, as well as offers plant and management services. In addition, the company also operates as a commercial vehicle body builder; and a designer, developer, importer, and distributor of domestic appliances, as well as a property maintenance company. Sietel Limited is based in Moorabbin, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Moorabbin",
        "zipcode": "3189",
        "website": "http://www.sietel.com.au",
        "full_time_employees": null
    },
    "TGP.AX": {
        "short_name": "360 GROUP STAPLED",
        "long_name": "360 Capital Group Limited",
        "summary": "360 Capital Group is an ASX-listed, investment and funds management group, focused on strategic and active investment management of alternative assets. Led by a highly experienced team, the Group operates in Australian and global markets investing across real estate, public and private equity and credit strategies. We partner with our stakeholders to identify, invest and realise on opportunities.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://www.360capital.com.au",
        "full_time_employees": null
    },
    "VOL.AX": {
        "short_name": "VICTRY OFF FPO",
        "long_name": "Victory Offices Limited",
        "summary": "Victory Offices Limited provides workspace services for individuals and businesses in Australia. The company offers space to private serviced, virtual, and day offices; training and board rooms; and co-working, hot desks, and shared and meeting spaces, as well as victory lounge, auditorium, and event spaces. It also offers covid-19 risk solutions, such as virtual assistance and business continuity programs. The company was founded in 2013 and is based in Melbourne, Australia. Victory Offices Limited is a subsidiary of Victory Group Holdings Pty Ltd.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3000",
        "website": "http://www.victoryoffices.com.au",
        "full_time_employees": null
    }
}