{
    "A05.SI": {
        "short_name": "a AVJennings A$",
        "long_name": "AVJennings Limited",
        "summary": "AVJennings Limited engages in the development of residential properties in Australia. It is involved in the land and apartment development, and integrated housing activities. The company was founded in 1932 and is based in Hawthorn, Australia. AVJennings Limited is a subsidiary of SC Global Developments Pte. Ltd.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "SES",
        "market": "sg_market",
        "country": "Australia",
        "city": "Hawthorn"
    },
    "AVJ.AX": {
        "short_name": "AVJ FPO",
        "long_name": "AVJennings Limited",
        "summary": "AVJennings Limited engages in the development of residential properties in Australia. It is involved in the land and apartment development, and integrated housing activities. The company was founded in 1932 and is based in Hawthorn, Australia. AVJennings Limited is a subsidiary of SC Global Developments Pte. Ltd.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Hawthorn"
    },
    "CWP.AX": {
        "short_name": "CEDARWOODS FPO",
        "long_name": "Cedar Woods Properties Limited",
        "summary": "Cedar Woods Properties Limited engages in property investment and development activities in Australia. It is involved in the urban land subdivision and development of residential, commercial, and retail projects in Western Australia, South Australia, Victoria, and Queensland. The company's property portfolio also includes medium and high-density apartments, townhouses, and office developments. Cedar Woods Properties Limited was founded in 1987 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "West Perth"
    },
    "DGH.AX": {
        "short_name": "DESANE FPO",
        "long_name": "Desane Group Holdings Limited",
        "summary": "Desane Group Holdings Limited, engages in the property development and investment activities in New South Wales, Australia. It operates through Property Development, Property Investment, Property Project Management and Resale, and Property Services segments. The company is involved in the development, management, and resale of commercial, industrial, and residential properties; leasing of properties; and provision of property and related services. Desane Group Holdings Limited was incorporated in 1986 and is based in Pyrmont, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Pyrmont"
    },
    "DVN.AX": {
        "short_name": "DEVINE FPO",
        "long_name": "Devine Limited",
        "summary": "Devine Limited, together with its subsidiaries, engages in the land development and construction activities in Australia. The company develops and sells apartment and mixed use projects; and constructs residential apartments. It also offers property management services. The company was founded in 1983 and is headquartered in Hamilton, Australia. Devine Limited is a subsidiary of CIMIC Residential Investments Pty Limited.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Hamilton"
    },
    "EZX.F": {
        "short_name": "ULTIMA UNITED LTD.",
        "long_name": "Ultima United Limited",
        "summary": "Ultima United Limited engages in property development business in Australia. It develops residential apartment projects in Cannington and Bentley, Western Australia. The company was formerly known as United Uranium Limited and changed its name to Ultima United Limited in November 2014. Ultima United Limited was founded in 2007 is based in Como, Australia.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "city": "Como"
    },
    "FRI.AX": {
        "short_name": "FINBAR FPO",
        "long_name": "Finbar Group Limited",
        "summary": "Finbar Group Limited, through its subsidiaries, develops and invests in properties in Australia. It develops medium to high density residential buildings and commercial properties, as well as rents its properties in Western Australia. The company was incorporated in 1984 and is based in East Perth, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "East Perth"
    },
    "MPX.AX": {
        "short_name": "MUSTERA FPO",
        "long_name": "Mustera Property Group Limited",
        "summary": "Mustera Property Group Limited, together with its subsidiaries, operates as a property investment and development company in Australia. It acquires, invests in, develops, rents, and sells residential, commercial, industrial and retail, and mixed-use properties. The company also engages in the management activities. Mustera Property Group Limited was incorporated in 2010 and is based in North Fremantle, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "North Fremantle"
    },
    "PPC.AX": {
        "short_name": "PEET FPO",
        "long_name": "Peet Limited",
        "summary": "Peet Limited acquires, develops, and markets residential land in Australia. The company operates through Funds Management, Company-Owned Projects, and Joint Arrangements segments. The Funds Management segment provides underwriting, capital raising, and asset identification services. The Company-Owned Projects segment acquires parcels of land for residential development purpose, as well as produces non-residential blocks of land. The Joint Arrangements segment undertakes the development of land through joint arrangements with government, statutory authorities, and private landowners. As of June 30, 2020, it managed and marketed a land bank of approximately 47,300 lots. The company was founded in 1895 and is based in Perth, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Perth"
    },
    "SDG.AX": {
        "short_name": "SUNLAND FPO",
        "long_name": "Sunland Group Limited",
        "summary": "Sunland Group Limited develops and constructs residential properties in Australia. It operates through Residential Housing and Urban Development, and Multi-Storey Development segments. The Residential Housing and Urban Development segment is involved in land subdivision and medium density integrated housing developments, as well as provides project services. The Multi-Storey segment develops and sells medium-rise projects between five and 15 storeys, and high-rise developments above 15 storeys. Sunland Group Limited was founded in 1983 and is based in Brisbane, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "TIA.AX": {
        "short_name": "TIAN AN AU FPO",
        "long_name": "Tian An Australia Limited",
        "summary": "Tian An Australia Limited engages in the development and sale of residential land and built-form products in Australia. It primarily focuses its development in the east coast of Australia and Mandurah/Peel Region of Western Australia. The company develops residential, commercial, and tourism projects. The company was formerly known as PBD Developments Limited and changed its name to Tian An Australia Limited in April 2016. Tian An Australia Limited was incorporated in 1985 and is based in Sydney, Australia. Tian An Australia Limited is a subsidiary of Oasis Star Limited.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "UUL.AX": {
        "short_name": "ULTIMA UTD FPO",
        "long_name": "Ultima United Limited",
        "summary": "Ultima United Limited engages in property development business in Australia. It develops residential apartment projects in Cannington and Bentley, Western Australia. The company was formerly known as United Uranium Limited and changed its name to Ultima United Limited in November 2014. Ultima United Limited was founded in 2007 is based in Como, Australia.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "Real Estate - Development",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Como"
    }
}