{
    "ADI.AX": {
        "short_name": "APNINDREIT STAPLED",
        "long_name": "APN Industria REIT",
        "summary": "APN Industria REIT (Â\u0091Industria) (ASX code: ADI) is a listed Australian real estate investment trust which owns interests in office and industrial properties that provide functional and affordable workspaces for business. Industria's $824 million portfolio of 32 properties located across the major Australian cities provides sustainable income and capital growth prospects for security holders over the long term. Industria has a target gearing band of 30 Â\u0096 40%, providing flexibility for future growth without compromising the low-risk approach to management. Industria is managed by APN Property Group, a specialist real estate investment manager established in 1996, and governed by a majority independent Board.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "AOF.AX": {
        "short_name": "AU OFFICE FPO",
        "long_name": "Australian Unity Office Fund",
        "summary": "AOF is an ASX-listed REIT that wholly owns a diversified portfolio of nine office properties located across Australian metropolitan and CBD markets in Sydney, Adelaide, Melbourne, Brisbane and Canberra.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Melbourne"
    },
    "CMW.AX": {
        "short_name": "CROMWELL STAPLED",
        "long_name": "Cromwell Property Group",
        "summary": "Cromwell Property Group (ASX:CMW) is a diversified real estate investor and manager with operations on three continents and a global investor base. As at 30 June 2020, Cromwell had a market capitalisation of $2.4 billion, a direct property investment portfolio valued at $3.0 billion and total assets under management of $11.5 billion across Australia, New Zealand and Europe.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Brisbane"
    },
    "COF.AX": {
        "short_name": "CENTOREIT ORD UNIT",
        "long_name": "Centuria Office REIT",
        "summary": "COF is Australia's largest ASX listed pure play office REIT and is included in the S&P/ASX300 Index. COF owns a portfolio of high quality assets situated in core office markets throughout Australia. COF is overseen by a hands-on, active manager and provides investors with income and the opportunity for capital growth from a pure play portfolio of high-quality Australian office assets. Centuria Property Funds Limited (CPFL) is the Responsible Entity for the ASX listed Centuria Office REIT (COF). CPFL, is a wholly owned subsidiary of Centuria Capital Group (CNI). CNI is an ASX-listed specialist investment manager with $10.2 billion in total assets under management and offers a range of investment opportunities including listed and unlisted property funds as well as tax effective investment bonds.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "GDI.AX": {
        "short_name": "GDI PROP STAPLED",
        "long_name": "GDI Property Group",
        "summary": "GDI Property Group (GDI) is an ASX listed property owner and fund manager. We have a proud history of delivering strong returns to investors for over 25 years. Our Board and employees are passionate about property and about funds management. We aim to continue to grow the wealth of our investors, provide exceptional accommodation to our customers and be a highly respected brand in our community. Our success has been founded on a sound investment philosophy of buying well, managing well and selling well.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "MGR.AX": {
        "short_name": "MIRVAC GRP STAPLED",
        "long_name": "Mirvac Group",
        "summary": "Mirvac is an Australian property group with a clearly defined purpose to reimagine urban life. By creating beautiful homes, inspiring workplace precincts and thriving shopping centres, we aim to make a positive contribution to our cities and communities. Mirvac was founded in 1972, which means we've been shaping Australia's urban landscape for almost fifty years. Of course, we've evolved a lot over that time Â\u0096 growing from a small joint venture to become a thriving ASX-listed property group that leads the way in innovation, sustainability and placemaking. Renowned for the quality of our products, we've created some of Australia's most iconic places and precincts, from thriving masterplanned communities, to landmark offices including our own headquarters at EY Centre, 200 George Street, Sydney. At the heart of every project there exists a deep commitment to our customers and communities.",
        "currency": "AUD",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "city": "Sydney"
    },
    "MJB.SG": {
        "short_name": "MIRVAC GROUP Reg. Stapled Units",
        "long_name": "Mirvac Group",
        "summary": "Mirvac is an Australian property group with a clearly defined purpose to reimagine urban life. By creating beautiful homes, inspiring workplace precincts and thriving shopping centres, we aim to make a positive contribution to our cities and communities. Mirvac was founded in 1972, which means we've been shaping Australia's urban landscape for almost fifty years. Of course, we've evolved a lot over that time Â\u0096 growing from a small joint venture to become a thriving ASX-listed property group that leads the way in innovation, sustainability and placemaking. Renowned for the quality of our products, we've created some of Australia's most iconic places and precincts, from thriving masterplanned communities, to landmark offices including our own headquarters at EY Centre, 200 George Street, Sydney. At the heart of every project there exists a deep commitment to our customers and communities.",
        "currency": "EUR",
        "sector": "Real Estate",
        "industry": "REIT - Office",
        "exchange": "STU",
        "market": "dr_market",
        "country": "Australia",
        "city": "Sydney"
    }
}