{
    "AVA.AX": {
        "short_name": "AVA RISK FPO",
        "long_name": "Ava Risk Group Limited",
        "summary": "Ava Risk Group Limited provides risk management services and technologies worldwide. The company operates through Perimeter Security, Access Control Solutions, and International Valuable Logistics segments. It manufactures and sells fiber optic intrusion detection and location systems that are used to detect and locate perimeter intrusion; for data network tapping and tampering, and oil and gas pipeline third party interference detection; and for other applications, including health, safety, and traffic monitoring. The company also provides smart card readers and card systems, biometric solutions, and electric locking and access control products. In addition, it offers international logistics services comprising armored vehicle collection and delivery, storage, commercial and chartered air and sea freight, and customs brokerage services for high-risk valuables, precious metals, and currency. Further, the company provides consultancy services in the areas of risk and vulnerability assessments; incident, emergency, and crisis management; designing, integration, and installation for CCTV, electronic intrusion detection and location, electronic, biometric, smart card, and mechanical access control systems; and cyber security and risk management solutions. Additionally, its consultancy services comprise business continuity planning, cash management strategies and day to day management plans, vendor and service provider assessments, technical tender management with site supervision, specialized security training and skills workshops, distribution and loss prevention plans, and secure transportation management. The company serves architects, commercial and industrial customers, military, and governments. The company has a strategic alliance with CMTE Development Ltd. The company was formerly known as Future Fibre Technologies Limited and changed its name to Ava Risk Group Limited in May 2018. Ava Risk Group Limited was founded in 1994 and is based in Mulgrave, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Mulgrave",
        "zipcode": "3170",
        "website": "http://www.theavagroup.com",
        "market_cap": 100233520
    },
    "DDT.AX": {
        "short_name": "DATADOT FPO",
        "long_name": "DataDot Technology Limited",
        "summary": "DataDot Technology Limited, together with its subsidiaries, provides asset identification, management, protection, and authentication products and solutions to governments, police, insurance companies, and blue-chip customer base within the automotive industry in Australasia, the Americas, Africa, and Europe. The company operates in two segments, DataDotDNA and DataTraceID. It manufactures and distributes asset identification systems, including DataDotDNA polymer and metallic microdots; asset registers, which are databases that record asset identification data and are accessible by law enforcement agencies and insurance investigators; and security DataTraceID authentication solutions. The company also provides theft deterrence solutions, such as ToolMate that protects tools, as well as deters thieves using the microdot identification technology; and PartMate, which protects stock by combining microdots with encoded serial numbers and a hidden tracer that can be viewed with a black-light. In addition, it offers authentication solutions for liability reduction, warranty claims, counterfeit detection, track and trace, grey market/diversion, supply chain management, enhanced packaging, retail loss prevention, credentials/ID cards, and document security. Additionally, the company offers DataDotDNA National Register, a law enforcement resource center that allows customers to verify the original owner of assets protected by DataDotDNA. It also operates as a re-seller of PadJack's range of network security products. The company sells its products through a network of distributors. DataDot Technology Limited was incorporated in 2000 and is based in Brookvale, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Brookvale",
        "zipcode": "2100",
        "website": "http://www.datadotdna.com/au",
        "market_cap": 8693090
    },
    "DTI.AX": {
        "short_name": "DTI GROUP FPO",
        "long_name": "DTI Group Limited",
        "summary": "DTI Group Limited, together with its subsidiaries, develops, manufactures, and supplies integrated surveillance and passenger communication systems, and fleet management solutions worldwide. Its surveillance solutions comprising hardware systems that incorporate videos, audios, GPS tracking, communications, and recording technology, as well as support through sophisticated device and data management software providing fleet-wide, CCTV, and vehicle management solutions. The company's passenger communication solutions include hardware systems, which incorporate real time passenger information through graphical and high brightness displays, public address and hearing aid loop communications, passenger emergency communications, and driver awareness systems incorporating live viewing of passengers, and infotainment systems, as well as support through a device and content management software to provide a comprehensive, fleet-wide, and passenger information management solutions. It also offers managed services, such as back-end control room communications and infrastructure comprising wide-area urban surveillance, driver development and risk mitigation, video management, vehicle data analysis and monitoring, schedule adherence analysis, IT infrastructure, help desk, technical support and monitoring, and first line maintenance services. The company's products are used in law enforcement, depot, passenger and heavy haul rail, mining, taxi, bus and coach, tram and LRV solution, and level applications. It serves transit agencies, transit vehicle manufacturers, and transit operators. DTI Group Limited was founded in 1995 and is headquartered in Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Perth",
        "zipcode": "6105",
        "website": "http://www.dti.com.au",
        "market_cap": 6699539
    },
    "HIL.AX": {
        "short_name": "HILLS FPO",
        "long_name": "Hills Limited",
        "summary": "Hills Limited supplies technology solutions to the health, security, surveillance, and IT markets in Australia and New Zealand. The company operates through Hills Health Solutions and Hills Distribution. It offers security products, such as CCTV and surveillance products, analogue HD cameras, bundle kits, encoders and decoders, IP cameras, lighting, monitors, networking and transmission, recorders, video analytics, and video management software; access control and intrusion products, including access control peripherals and systems, alarm accessories, alarms and intrusion, asset management, batteries and power supplies, cable fire and security, detectors, home integrated systems, intercom systems, locking, security connectors, structured cabling, and wireless security; and fire panels and detectors, fire panel accessories, fire modules, fire speakers strobes, fie miscellaneous, fire suppressions, and fire extinguishers and blankets. The company also provides firewall and cybersecurity, switches, routers, IOT, WIFI, fixed wireless, and computers and display products; and nurse call and patient engagement solutions. The company was formerly known as Hills Holding Limited and changed its name to Hills Limited in December 2013. Hills Limited was founded in 1945 and is headquartered in Lidcombe, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Lidcombe",
        "zipcode": "2141",
        "website": "http://www.hills.com.au",
        "market_cap": 32478040
    },
    "HIQ.F": {
        "short_name": "HILLS LTD",
        "long_name": "Hills Limited",
        "summary": "Hills Limited supplies technology solutions to the health, security, surveillance, and IT markets in Australia and New Zealand. The company operates through Hills Health Solutions and Hills Distribution. It offers security products, such as CCTV and surveillance products, analogue HD cameras, bundle kits, encoders and decoders, IP cameras, lighting, monitors, networking and transmission, recorders, video analytics, and video management software; access control and intrusion products, including access control peripherals and systems, alarm accessories, alarms and intrusion, asset management, batteries and power supplies, cable fire and security, detectors, home integrated systems, intercom systems, locking, security connectors, structured cabling, and wireless security; and fire panels and detectors, fire panel accessories, fire modules, fire speakers strobes, fie miscellaneous, fire suppressions, and fire extinguishers and blankets. The company also provides firewall and cybersecurity, switches, routers, IOT, WIFI, fixed wireless, and computers and display products; and nurse call and patient engagement solutions. The company was formerly known as Hills Holding Limited and changed its name to Hills Limited in December 2013. Hills Limited was founded in 1945 and is headquartered in Lidcombe, Australia.",
        "currency": "EUR",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Lidcombe",
        "zipcode": "2141",
        "website": "http://www.hills.com.au",
        "market_cap": 21457606
    },
    "MSG.AX": {
        "short_name": "MCSSERVICE FPO",
        "long_name": "MCS Services Limited",
        "summary": "MCS Services Limited, together with its subsidiaries, provides guard security and related services in Australia. It offers uniformed unarmed guards at retail shopping centers, government offices, health facilities, commercial properties, sports stadia, and events in the Perth metropolitan area and Western Australia. The company also provides covert security, mobile patrol, and response vehicle services. In addition, it engages in supplying, installing, and commissioning of security alarms, CCTV, biometric, and access control systems to the commercial, industrial, and domestic sectors. The company was founded in 2005 and is headquartered in Joondalup, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Joondalup",
        "zipcode": "6027",
        "website": "http://mcssecurity.com.au",
        "market_cap": 10803950
    },
    "RDF.AX": {
        "short_name": "REDFLEX FPO",
        "long_name": "Redflex Holdings Limited",
        "summary": "Redflex Holdings Limited, together with its subsidiaries, develops and implements intelligent traffic management products and services in the Americas, Australia, Saudi Arabia, United Arab Emirates, Ireland, the United Kingdom, New Zealand, and Asia. The company's solutions include Alcyon, a cloud-based case management and photo enforcement processing solution; TruVision, a traffic and speed enforcement laser; Alcyon IQ, a system monitoring, data matching, and alerting solution; Radarcam, a speed detection and enforcement device; Halo, an enforcement solution that delivers a diverse range of Intelligent Transport Systems applications; and Halo Distributed, a vehicle detection point to point system for accurate automatic number plate recognition applications, traffic monitoring, and enforcement. It also provides Deployable 250, a solution that utilises dual radar technology to capture incident and enforcement rates; Halo Edge, a video analytics platform for enforcement across a wide array of environments and offence types; and Red X, a lane management solution, which alerts drivers to speed changes and land closures. Redflex Holdings Limited was founded in 1995 and is headquartered in South Melbourne, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "VIC",
        "city": "Melbourne",
        "zipcode": "3205",
        "website": "http://www.redflex.com",
        "market_cap": 145455392
    },
    "SCT.AX": {
        "short_name": "SCOUTSEC FPO",
        "long_name": "Scout Security Limited",
        "summary": "Scout Security Limited provides home security systems and services in the United States. The company's products include hub that connects sensors and Scout's integrations; door panel, which monitors the opening and closing of door, houses a loud siren to deter intruders, and equipped with an RFID reader so one can arm and disarm system without a phone; and motion sensor that monitors room with one sensor for monitoring critical paths through a house; and access sensor, which detects opening and closing of windows, doors, cabinets, and safes. It also offers indoor cameras, video doorbells, keypads, water sensors, glass break sensors, smoke alarm, and door locks, as well as refurbished products; and accessories, such as yard sign, panic button, remote control, siren and zigbee repeater, window sticker, key fobs, and RFID sticker. The company provides monitoring services. It sells its products and services directly through its Website, as well as through Amazon and Zego partners. The company was founded in 2013 and is based in Leederville, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Leederville",
        "zipcode": "6007",
        "website": "http://www.scoutalarm.com",
        "market_cap": 9905764
    },
    "SP3.AX": {
        "short_name": "SPECTUR FPO",
        "long_name": "Spectur Limited",
        "summary": "Spectur Limited designs, develops, manufactures, and sells remote solar sensing, thinking, and acting platforms, and related products and services in Australia. The company offers 3G/4G solar security, time-lapse, and thermal security camera systems; and camera emergency warning systems, including shark warning system that bridges the crucial time gap between a shark sighting and authorities alerting beach users. It also provides portable hard stand base; and security camera rapid deployment trailer for mobile and temporary applications. In addition, the company offers security cameras for hire. Its products are used in construction and building, government, warehouse and logistics, farming and agriculture, and utility sectors, as well as remote sites. Spectur Limited was incorporated in 2009 and is based in Welshpool, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Welshpool",
        "zipcode": "6106",
        "website": "http://www.spectur.com.au",
        "market_cap": 7653959
    },
    "TPS.AX": {
        "short_name": "THREAT PRO FPO",
        "long_name": "Threat Protect Australia Limited",
        "summary": "Threat Protect Australia Limited provides security, monitoring, and risk management services for personal and business use in Australia. It operates through Monitoring, Protective Services, and Service segments. The company offers 24-hour monitored home security systems; intruder detection systems, safe@home and safe heaven-duress alarms, and uniformed security guards, as well as alarm and CCTV installation and maintenance services. It also provides high net worth family security solutions, including the development of personal and family safety procedures, ongoing review and assessment to the penetrability of existing residences, evacuation and emergency planning, residential and commercial security systems, phone based duress and location services, customized electronic dashboards, personal safety and travel awareness training services, incident management and response services, close personal protection/personal security drivers, and supplier selection and vetting services. In addition, the company offers business security solutions, such as security risk advisory and security program development services, customer liaison and security personnel, staff safety training services, and protective technology and monitored security systems; security and risk consulting; threat, risk, and vulnerability assessments; and investigation, due diligence, and surveillance and counter surveillance services, as well as technical surveillance counter measures. Further, it provides security personnel solutions, including security officers, close personal protection and concierge personnel, and personal delivery and transport services. The company was founded in 1993 and is based in West Perth, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "West Perth",
        "zipcode": "6005",
        "website": "http://www.threatprotect.com.au",
        "market_cap": 6505812
    },
    "TZL.AX": {
        "short_name": "TZ LIMITED FPO",
        "long_name": "TZ Limited",
        "summary": "TZ Limited, together with its subsidiaries, develops intelligent devices and smart device systems that enable the commercialization of hardware and software solutions for the management, control, and monitoring of business assets. It offers smart lockers and cabinet security solutions. The company also provides associated value added services. It operates in Australia, the United States, the United Kingdom, and Singapore. TZ Limited was incorporated in 1996 and is based in Sydney, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "NSW",
        "city": "Sydney",
        "zipcode": "2000",
        "website": "http://tz.net",
        "market_cap": 21181078
    },
    "YPB.AX": {
        "short_name": "YPB GROUP FPO",
        "long_name": "YPB Group Limited",
        "summary": "YPB Group Limited develops, markets, and sells anti-counterfeiting, product authentication, and consumer engagement solutions to brand owners. It offers digital engagement platform, a cloud-based customer digital engagement and analytics platform that enables brands to form a relationship with customers; manufactures and sells covert forensic products that are used for tracing a product or packaging during or after the manufacturing process, which is detectable using the company's proprietary scanner; and forensic laboratory services for the examination of counterfeit products. The company also provides security consulting services to governments, corporations, and intellectual property owners for the deterrence of counterfeiting, grey markets, product diversions, and fraud activities; and brand protection labelling solutions for sellers, brands, and product owners. It operates in Australia, the Peoples Republic of China, Thailand, and the United States. YPB Group Limited was incorporated in 2004 and is based in Subiaco, Australia.",
        "currency": "AUD",
        "sector": "Industrials",
        "industry": "Security & Protection Services",
        "exchange": "ASX",
        "market": "au_market",
        "country": "Australia",
        "state": "WA",
        "city": "Subiaco",
        "zipcode": "6008",
        "website": "http://www.ypbsystems.com",
        "market_cap": 9983640
    }
}