{
  "FORUS.SN": {
    "city": "Las Condes",
    "country": "Chile",
    "currency": "CLP",
    "exchange": "SGO",
    "industry": "Apparel Retail",
    "long_name": "Forus S.A.",
    "market": "cl_market",
    "market_cap": "Small Cap",
    "sector": "Consumer Cyclical",
    "short_name": "FORUS S.A.",
    "state": null,
    "summary": "Forus S.A. designs, produces, imports, markets, and distributes footwear, clothing articles, and accessories in Chile, Peru, Colombia, and Uruguay. The company offers its products under the Hush Puppies, Columbia, Cat, RKF, Azaleia, Merrell, Nine West, Hush Puppies Kids, Calpany, Brooks, Mountain Hardwear, Patagonia, Sorel, Church's, Jansport, Norseg, Burton, Dakine, Pasqualini, Billabong, Element, Keds, Sperry, 7Veinte, RVCA, Body And Soul, Prana, We Love Shoes, and Vans brands. It also engages in the wholesale business. The company sells its products through 507 stores and 37 e-commerce websites. The company was formerly known as Comercial Hush Puppies Chile Limitada and changed its name to Forus S.A. in December 1991. The company was founded in 1980 and is headquartered in Las Condes, Chile. Forus S.A. is a subsidiary of Inversiones Costanera Limitada.",
    "website": "http://www.forus.cl",
    "zipcode": null
  },
  "TRICOT.SN": {
    "city": "Macul",
    "country": "Chile",
    "currency": "CLP",
    "exchange": "SGO",
    "industry": "Apparel Retail",
    "long_name": "Empresas Tricot S.A.",
    "market": "cl_market",
    "market_cap": "Micro Cap",
    "sector": "Consumer Cyclical",
    "short_name": "EMPRESAS TRICOT SA",
    "state": null,
    "summary": "Empresas Tricot S.A. operates fashion stores in Chile. It offers T-shirts, shorts and bermudas, swimsuits, sports wears, jeans, underwear, accessories, sweatshirts, fabrics, pants, and jackets for women and men; blouses, dresses, skirts, pajamas, and kimonous for women; suits and shirts for men; and footwear products for women, men, and kids. The company also provides divers, hats and caps, jeans and pants, T-shirts and shirts, sweatshirts, underwear, swimsuits, socks, and accessories for boys, girls, and babies, as well as skirts, shorts and bermudas, and dresses for girls. It operates through approximately 92 stores. The company was founded in 1952 and is based in Macul, Chile. Empresas Tricot S.A. is a subsidiary of Inversiones Retail Chile S.A.",
    "website": "http://www.tricot.cl",
    "zipcode": null
  }
}
