{
    "CENCOSHOPP.SN": {
        "short_name": "CENCOSUD SHOPPING",
        "long_name": "Cencosud Shopping S.A.",
        "summary": "Cencosud Shopping S.A. develops, builds, manages, exploits, and leases premises and spaces in shopping centers in Chile, Peru, and Colombia. The company is based in Santiago, Chile. Cencosud Shopping S.A. is a subsidiary of Cencosud S.A.",
        "currency": "CLP",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Santiago de Chile"
    },
    "MALLPLAZA.SN": {
        "short_name": "PLAZA SA",
        "long_name": "Plaza S.A.",
        "summary": "Plaza S.A. develops, builds, administers, manages, exploits, leases, and subleeses premises and spaces in shopping centers in Latin America. The company operates 22 shopping centers. The company operates its shopping centers under the Mall Plaza, Autoplaza, and Motorplaza brands in Chile and Peru. The company was founded in 1990 and is based in Santiago, Chile. Plaza SA is a subsidiary of Desarrollos Inmobiliarios S.A.",
        "currency": "CLP",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Santiago"
    },
    "PAZ.SN": {
        "short_name": "PAZ CORP SA",
        "long_name": "Paz Corp S.A.",
        "summary": "Paz Corp S.A., a real estate company, engages in housing development business. It develops real estate projects in Chile and Peru. The company also offers real estate and financial advisory, and after-sale services. Paz Corp S.A. was founded in 1982 and is based in Santiago, Chile.",
        "currency": "CLP",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Santiago de Chile"
    },
    "ZOFRI.SN": {
        "short_name": "ZONA FRANCA IQUIQU",
        "long_name": "Zona Franca de Iquique S.A.",
        "summary": "Zona Franca de Iquique S.A. operates premises for wholesale and retail business centers in the duty-free zones of South America. It offers required infrastructure for companies to store, commercialize, and distribute their products in the markets. The company's on premises services include food gardens, toilets, cleaning, security, street lighting, paved avenues and streets, sewage and drinking water systems, telephone networks, and online services, as well as high, medium, and low voltage lines, as well as people and vehicle access control system. It also operates logistics centers. Zona Franca de Iquique S.A. is based in Iquique, Chile.",
        "currency": "CLP",
        "sector": "Real Estate",
        "industry": "Real Estate Services",
        "exchange": "SGO",
        "market": "cl_market",
        "country": "Chile",
        "city": "Iquique"
    }
}