{
    "0Q18.L": {
        "short_name": "CATERPILLAR INC CATERPILLAR ORD",
        "long_name": "Caterpillar Inc.",
        "summary": "Caterpillar Inc. manufactures and sells construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives worldwide. Its Construction Industries segment offers asphalt pavers, compactors, cold planers, motorgraders, pipelayers, road reclaimers, telehandlers, and utility vehicles; backhoe, compact track, multi-terrain, skid steer, and track-type loaders; forestry and wheel excavators; and site prep and track-type tractors. The company's Resource Industries segment provides electric rope and hydraulic shovels, draglines, rotary drills, hard rock vehicles, track-type tractors, mining trucks, longwall miners, wheel loaders, off-highway and articulated trucks, wheel tractor scrapers, wheel dozers, landfill and soil compactors, machinery components, autonomous ready vehicles and solutions, and select work tools. Its Energy & Transportation segment offers reciprocating engine powered generator sets; reciprocating engines and integrated systems for the power generation, marine, oil, and gas industries; turbines, centrifugal gas compressors, and related services; remanufactured reciprocating engines and components; and diesel-electric locomotives and components, and other rail-related products. The company's Financial Products segment provides operating and finance leases, installment sale contracts, working capital loans, and wholesale financing; and insurance and risk management, as well as other equipment-related loans. Its All Other Operating segment offers filters and fluids, undercarriage, ground engaging tools, fluid transfer products, precision seals, and rubber sealing and connecting components; parts distribution; integrated logistics solutions; portfolio management; brand management and marketing strategy; and digital investments services. The company was formerly known as Caterpillar Tractor Co. The company was founded in 1925 and is headquartered in Deerfield, Illinois.",
        "currency": "EUR",
        "sector": "Industrial Goods",
        "industry": "Farm & Construction Machinery",
        "exchange": "LSE",
        "market": "gb_market",
        "country": "United States",
        "state": "IL",
        "city": "Deerfield",
        "zipcode": "60015",
        "website": "http://www.caterpillar.com",
        "market_cap": 66938109952
    },
    "ACA.MX": {
        "short_name": "ARCOSA INC",
        "long_name": "Arcosa, Inc.",
        "summary": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products, Engineered Structures, and Transportation Products. The Construction Products segment offers natural and lightweight aggregates; specialty materials, including lightweight aggregates and plaster; trench shields and shoring products for residential and non-residential construction, agriculture, specialty building products, and underground construction markets, as well as for infrastructure, including road, bridge, and other public products markets. The Engineered Structures segment provides utility structures, wind towers, traffic and lighting structures, telecommunication structures, storage and distribution tanks for electricity transmission and distribution, wind power generation, highway road construction, and wireless communication markets, as well as for gas and liquids storage and transportation for residential, commercial, agriculture, and industrial markets. The Transportation Products segment offers inland barges; fiberglass barge covers, winches, and other components; axles and couplers for railcars and locomotives; industrial and military castings, and forged products for transportation products serving various markets, including agriculture/food, refined, chemicals, upstream oil, and railcar manufacturers and maintenance operations industries. Arcosa, Inc. was incorporated in 2018 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "TX",
        "city": "Dallas",
        "zipcode": "75201",
        "website": "http://www.arcosa.com",
        "market_cap": 69489885184
    },
    "AME.MX": {
        "short_name": "AMETEK INC",
        "long_name": "AMETEK, Inc.",
        "summary": "AMETEK, Inc. manufactures and sells electronic instruments and electromechanical devices worldwide. It operates in two segments, Electronic Instruments (EIG) and Electromechanical (EMG). The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the oil and gas, petrochemical, pharmaceutical, semiconductor, automation, and food and beverage industries; and instruments to the laboratory equipment, ultra-precision manufacturing, medical, and test and measurement markets. This segment also provides power quality monitoring and metering devices, uninterruptible power supplies, programmable power equipment, electromagnetic compatibility test equipment, sensors for gas turbines, dashboard instruments for heavy trucks and other vehicles, and instrumentation and controls for the food and beverage industries; and aircraft and engine sensors, monitoring systems, power supplies, fuel and fluid measurement systems, and data acquisition units for the aerospace industry. Its EMG segment offers engineered electrical connectors and electronics packaging for protecting sensitive electronic devices; precision motion control products for data storage, medical devices, business equipment, automation and other applications; high-purity powdered metals, strip and foil, specialty clad metals, and metal matrix composites; motor-blower systems and heat exchangers for use in thermal management, military, commercial aircraft, and military ground vehicles; and motors for use in commercial appliances, fitness equipment, food and beverage machines, hydraulic pumps, and industrial blowers. This segment also operates a network of aviation maintenance, repair, and overhaul facilities. In addition, the company offers clinical and education communication solutions for healthcare facilities and educational institutions. AMETEK, Inc. was incorporated in 1930 and is headquartered in Berwyn, Pennsylvania.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "PA",
        "city": "Berwyn",
        "zipcode": "19312-1177",
        "website": "http://www.ametek.com",
        "market_cap": 636045623296
    },
    "CHMR": {
        "short_name": "CHIMERA ENERGY CORP",
        "long_name": "Chimera Energy Corporation",
        "summary": "Chimera Energy Corporation, a development stage company, supplies equipment and components that are used in the exploration and production of oil and gas in the United States. It markets and sells polycrystalline diamond compact cutters for use in coal mining, geological exploration, and oil and gas drilling. The company was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": null,
        "market_cap": 19800
    },
    "INS": {
        "short_name": "Intelligent Systems Corporation",
        "long_name": "Intelligent Systems Corporation",
        "summary": "Intelligent Systems Corporation, through its subsidiary, CoreCard Software, Inc., provides technology solutions and processing services to the financial technology and services market in the United States and European Union. The company designs, develops, and markets a suite of software solutions to program managers, accounts receivable businesses, financial institutions, retailers, and processors to manage their credit and debit cards, prepaid cards, private label cards, fleet cards, loyalty programs, and accounts receivable and loan transactions. Its software solutions allow companies to offer various types of debit and credit cards, as well as installment and revolving loans; set up and maintain account data; record advances and payments; assess fees, interests, and other charges; resolve disputes and chargebacks; manage collections of accounts receivable; generate reports; and settle transactions with financial institutions and network associations. Intelligent Systems Corporation was founded in 1973 and is headquartered in Norcross, Georgia.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Norcross",
        "zipcode": "30093",
        "website": "http://www.intelsys.com",
        "market_cap": 296226368
    },
    "IXEH": {
        "short_name": "IX ENERGY HOLDINGS INC",
        "long_name": "IX Energy Holdings, Inc.",
        "summary": "IX Energy Holdings, Inc. engages in the development of solar power and other renewable energy solutions systems for government agencies, municipalities and commercial customers. IX Energy Holdings, Inc. was formerly known as Yoo, Inc. The company was founded in 2006 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10017",
        "website": null,
        "market_cap": 28160
    },
    "RTX.BA": {
        "short_name": "RAYTHEON TECHNOLOG",
        "long_name": "Raytheon Technologies Corporation",
        "summary": "Raytheon Technologies Corporation, an aerospace and defense company, provides systems and services for the commercial, military, and government customers worldwide. It operates through four segments: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems segment offers aerospace and defense products, and aftermarket service solutions for aircraft manufacturers and airlines, as well as regional, business, and general aviation; and for defense and commercial space operations. This segment also designs, produces, and supports cabin interior, communications and aviation systems, oxygen systems, food and beverage preparation, storage and galley systems, and lavatory and wastewater management systems; airborne intelligence, surveillance and reconnaissance systems, test and training range systems, crew escape systems, and simulation and training solutions; information management services; and aftermarket services that include spare parts, overhaul and repair, engineering and technical support, training and fleet management solutions, and information management services. The Pratt & Whitney segment supplies aircraft engines for commercial, military, business jet, and general aviation customers; and produces, sells, and services military and commercial auxiliary power units. The Raytheon Intelligence & Space segment develops and provides integrated sensor and communication systems for missions, training, and cyber and software solutions to intelligence, defense, federal, and commercial customers. The Raytheon Missiles & Defense segment designs, develops, produces, and sustains integrated air and missile defense systems; defensive and combat solutions; land- and sea-based radars; command, control, communications, and intelligence solutions; and naval and undersea sensor solutions for the U.S. and foreign government customers. The company is headquartered in Waltham, Massachusetts.",
        "currency": "ARS",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "state": "MA",
        "city": "Waltham",
        "zipcode": "02451",
        "website": "http://www.rtx.com",
        "market_cap": null
    },
    "TPAC": {
        "short_name": "TRANS-PACIFIC AEROSPACE CO INC",
        "long_name": "Trans-Pacific Aerospace Company, Inc.",
        "summary": "Trans-Pacific Aerospace Company, Inc. designs, manufactures, and sells aerospace component parts for commercial and military aircrafts, space vehicles, power plants, and surface and undersea vessels in the United States. It primarily offers self-lubricating spherical bearings, which are integral to the operation of commercial aircrafts and help with various flight-critical tasks, including aircraft flight controls and landing gear. The company was formerly known as Pinnacle Energy Corp. and changed its name to Trans-Pacific Aerospace Company, Inc. in March 2010. Trans-Pacific Aerospace Company, Inc. was founded in 2007 and is based in San Marino, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "San Marino",
        "zipcode": "91108",
        "website": "http://tpacbearings.com",
        "market_cap": 2466597
    },
    "USAE": {
        "short_name": "US AEROSPACE INC",
        "long_name": "U.S. Aerospace, Inc.",
        "summary": "U.S. Aerospace, Inc. produces and supplies aircraft assemblies, structural components, and engineered and precision machined details. It also supplies structural aircraft parts for military aircraft. The companies offers its products for the United States Department of Defense, United States Air Force, and other aircraft manufacturers, aerospace companies, and defense contractors. U.S. Aerospace, Inc. was formerly known as New Century Companies, Inc. and changed its name to U.S. Aerospace, Inc. in April 2010. The company was founded in 1980 and is based in Rancho Cucamonga, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "CA",
        "city": "Rancho Cucamonga",
        "zipcode": "91730",
        "website": null,
        "market_cap": 108840
    },
    "WSML": {
        "short_name": "WILLIAMSVILLE SEARS MANAGEMENT ",
        "long_name": "Williamsville Sears Management, Inc.",
        "summary": "Williamsville Sears Management, Inc. does not have significant operations. The company was formerly engaged in the design, manufacture, and distribution of oral health and teeth whitening products. The company was founded in 2008 and is based in New York, New York. As of March 9, 2018, Williamsville Sears Management, Inc. is a subsidiary of Palewater Global Management Inc.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "NY",
        "city": "New York",
        "zipcode": "10111",
        "website": null,
        "market_cap": 10373220
    }
}