{
    "ACA.MX": {
        "short_name": "ARCOSA INC",
        "long_name": "Arcosa, Inc.",
        "summary": "Arcosa, Inc., together with its subsidiaries, provides infrastructure-related products and solutions for the construction, energy, and transportation markets in North America. It operates through three segments: Construction Products Group, Energy Equipment Group, and Transportation Products Group. The Construction Products Group segment offers natural and lightweight aggregates, trench shields, shoring products, and specialty milled or processed materials that are used in construction landscape, including commercial, industrial, road and bridge, and underground construction. It serves equipment rental dealers, as well as commercial, residential, and industrial contractors. The Energy Equipment Group segment provides structural wind towers for wind turbine producers; steel utility structures for electricity transmission and distribution; pressurized and non-pressurized tanks that store and transport various products, including propane, anhydrous ammonia, and natural gas liquids; and fertilizer storage containers for agricultural markets. The Transportation Products Group segment offers hopper barges, tank barges, fiberglass covers, hatches, castings, and winches for commercial marine transportation companies and industrial shippers; axles, circular forgings, and coupling devices for freight, tank, locomotive, and passenger rail transportation equipment, as well as for other industrial uses; and cast components for use in the industrial and mining sectors. The company was incorporated in 2018 and is headquartered in Dallas, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Heavy Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Dallas"
    },
    "AME.MX": {
        "short_name": "AMETEK INC",
        "long_name": "AMETEK, Inc.",
        "summary": "AMETEK, Inc. manufactures and sells electronic instruments and electromechanical devices worldwide. It operates through two segments, Electronic Instruments (EIG) and Electromechanical (EMG). The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the oil and gas, petrochemical, pharmaceutical, semiconductor, automation, and food and beverage industries; and instruments to the laboratory equipment, ultra-precision manufacturing, medical, and test and measurement markets. This segment also provides power quality monitoring and metering, uninterruptible power supplies, programmable power equipment, electromagnetic compatibility test equipment, sensors for gas turbines, dashboard instruments for heavy trucks and other vehicles, and instrumentation and controls for the food and beverage industries; and aircraft and engine sensors, monitoring systems, power supplies, fuel and fluid measurement systems, and data acquisition units for the aerospace industry. Its EMG segment offers engineered electrical connectors and electronics packaging for protecting sensitive electronic devices; precision motion control products for data storage, medical devices, business equipment, automation and other applications; high-purity powdered metals, strip and foil, specialty clad metals, and metal matrix composites; motor-blower systems and heat exchangers for use in thermal management, military, commercial aircraft, and military ground vehicles; and motors for use in commercial appliances, fitness equipment, food and beverage machines, hydraulic pumps, and industrial blowers. This segment also operates a network of aviation maintenance, repair, and overhaul facilities. In addition, the company offers clinical and education communication solutions for hospitals, health systems, and educational facilities. AMETEK, Inc. was incorporated in 1930 and is headquartered in Berwyn, Pennsylvania.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Berwyn"
    },
    "CHMR": {
        "short_name": "CHIMERA ENERGY CORP",
        "long_name": "Chimera Energy Corporation",
        "summary": "Chimera Energy Corporation, a development stage company, supplies equipment and components that are used in the exploration and production of oil and gas in the United States. It markets and sells polycrystalline diamond compact cutters for use in coal mining, geological exploration, and oil and gas drilling. The company was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Houston"
    },
    "DHI.MX": {
        "short_name": "DR HORTON INC",
        "long_name": "D.R. Horton, Inc.",
        "summary": "D.R. Horton, Inc. operates as a homebuilding company in East, Midwest, Southeast, South Central, Southwest, and West regions in the United States. It engages in the acquisition and development of land; and construction and sale of homes in 29 states and 88 markets under the names of D.R. Horton, America's Builder, Express Homes, Emerald Homes, and Freedom Homes. The company constructs and sells single-family detached homes; and attached homes, such as town homes, duplexes, and triplexes. It also provides mortgage financing services; and title insurance policies, and examination and closing services, as well as engages in the residential lot development business. In addition, the company constructs and owns multi-family rental properties; owns residential real estate, including ranch land and improvements; and owns and operates oil and gas assets. The company primarily serves homebuyers. D.R. Horton, Inc. was founded in 1978 and is based in Arlington, Texas.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Arlington"
    },
    "IXEH": {
        "short_name": "IX ENERGY HOLDINGS INC",
        "long_name": "IX Energy Holdings, Inc.",
        "summary": "IX Energy Holdings, Inc. engages in the development of solar power and other renewable energy solutions systems for government agencies, municipalities and commercial customers. IX Energy Holdings, Inc. was formerly known as Yoo, Inc. The company was founded in 2006 and is headquartered in New York, New York.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "General Contractors",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    },
    "NOC.MX": {
        "short_name": "NORTHROP GRUMMAN CORP",
        "long_name": "Northrop Grumman Corporation",
        "summary": "Northrop Grumman Corporation operates as an aerospace and defense company worldwide. The company operates through four segments: Aeronautics Systems, Defense Systems, Mission Systems, and Space Systems. The Aeronautics Systems segment designs, develops, manufactures, integrates, and sustains aircraft systems for strategic and tactical intelligence, surveillance, and reconnaissance (ISR) missions; and long-range strike aircraft systems, tactical fighter aircrafts, and airborne battle management systems. The Defense Systems segment offers weapon and mission systems for the U.S. military and civilian agency customers. Its principal products and services include integrated battle management systems, weapons systems, information technology services, and intelligence operations. This segment provides command and control and weapons systems, including munitions and missiles; precision strike weapons; propulsion, such as air-breathing systems; and gun systems and precision munitions. It also offers life cycle service and support for software, weapons systems, and aircraft; security services, including information and cyber operations; intelligence analysis and support; and IT infrastructure, such as cloud. The Mission Systems segment offers command, control, communications, and computers ISR systems; radar, electro-optical/infrared, and acoustic sensors; electronic warfare systems; communications and network systems; processing systems; navigation; and maritime power, propulsion, and payload launch systems. This segment also provides airborne sensors and networks; cyber and intelligence mission solutions; maritime/land systems and sensors; and navigation, targeting, and survivability solutions. The Space Systems segment offers satellites and payloads; ground systems; missile defense systems and interceptors; launch vehicles and related propulsion systems; and strategic missiles. Northrop Grumman Corporation was founded in 1939 and is based in Falls Church, Virginia.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Falls Church"
    },
    "NVIC": {
        "short_name": "N-VIRO INTERNATIONAL CORP",
        "long_name": "N-Viro International Corporation",
        "summary": "N-Viro International Corporation markets its N-Viro Fuel technology that produces a renewable alternative fuel product out of certain bio-organic wastes. N-Viro Fuel is a patented biomass alternative energy fuel process that produces a product that has physical and chemical characteristics similar to certain coals and is created from municipal biosolids, collectable animal manure, pulp and paper sludge, and other organic wastes. The company owns and licenses the N-Viro Process, a patented technology to treat and recycle wastewater sludges and other bio-organic wastes, utilizing certain alkaline by-products produced by the cement, lime, and other industries, as well as electric utilities. Its N-Viro Process stabilizes and pasteurizes sludge; reduces odors to acceptable levels; neutralizes or immobilizes various constituents; and generates N-Viro Soil, a product that has a granular appearance similar to soil and is used in various agricultural applications. In addition, the company is involved in the distribution and resale of alkaline admixtures. N-Viro International Corporation was founded in 1979 and is based in Toledo, Ohio.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Pollution & Treatment Controls",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Toledo"
    },
    "RSGA.MX": {
        "short_name": "REPUBLIC SERVICES INC",
        "long_name": "Republic Services, Inc.",
        "summary": "Republic Services, Inc., together with its subsidiaries, provides non-hazardous solid waste collection, transfer, disposal, recycling, and environmental services in the United States. The company serves small-container, large-container, and municipal and residential customers. The company's collection services include curbside collection of waste for transport to transfer stations, landfills, or recycling processing centers; supply of waste containers; and renting of compactors. It is also involved in the processing and sale of old corrugated containers, old newsprint, aluminum, glass, and other materials; temporary waste and recycling collection services; and provision of landfill services. As of December 31, 2019, the company operated through 340 collection operations, 212 transfer stations, 189 active landfills, 79 recycling processing centers, and 15 salt water disposal wells, as well as 7 treatment, recovery, and disposal facilities in 41 states and Puerto Rico. It also operated 75 landfill gas-to-energy and renewable energy projects and had 130 closed landfills. The company was founded in 1996 and is headquartered in Phoenix, Arizona.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Waste Management",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "Phoenix"
    },
    "RTX.BA": {
        "short_name": "RAYTHEON TECHNOLOG",
        "long_name": "Raytheon Technologies Corporation",
        "summary": "Raytheon Technologies Corporation, an aerospace and defense company, provides advanced systems and services for commercial, military, and government customers worldwide. It operates in four businesses: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems business offers aerostructures, avionics, interiors, mechanical systems, mission systems, and power and control systems that serve customers in the commercial, regional, business aviation, and military sectors. The Pratt & Whitney business designs, manufactures, and services aircraft engines and auxiliary power systems for commercial, military, and business aircraft. The Raytheon Intelligence & Space business engages in developing various sensors, training, and cyber and software solutions. The Raytheon Missiles & Defense business produces a portfolio of advanced technologies, including air and missile defense systems, precision weapons, radars, and command and control systems that delivers end-to-end solutions to detect, track, and engage threats. The company is headquartered in Waltham, Massachusetts.",
        "currency": "ARS",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense - Major Diversified",
        "exchange": "BUE",
        "market": "ar_market",
        "country": "United States",
        "city": "Waltham"
    },
    "SWK.MX": {
        "short_name": "STANLEY BLACK & DECKER INC",
        "long_name": "Stanley Black & Decker, Inc.",
        "summary": "Stanley Black & Decker, Inc. engages in tools and storage, industrial, and security businesses worldwide. Its Tools & Storage segment offers power tools and equipment, including professional products, such as professional grade corded and cordless electric power tools and equipment, and pneumatic tools and fasteners; and consumer products comprising corded and cordless electric power tools primarily under the BLACK+DECKER brand, as well as lawn and garden products and related accessories, and home products. This segment sells its products through retailers, distributors, and a direct sales force to professional end users, distributors, retail consumers, and industrial customers in various industries. The company's Industrial segment provides engineered fastening products and systems to customers in the automotive, manufacturing, electronics, construction, aerospace industries, and others; sells and rents custom pipe handling, joint welding, and coating equipment for use in the construction of large and small diameter pipelines, as well as provides pipeline inspection services; and sells hydraulic tools, attachments, and accessories. This segment also serves oil and natural gas pipeline industry and other industrial customers. Its Security segment designs, supplies, and installs commercial electronic security systems and provides electronic security services; offers healthcare solutions, which include asset tracking, infant protection, pediatric protection, patient protection, wander management, fall management, and emergency call products; and sells automatic doors to commercial customers. This segment serves consumers, retailers, educational, financial, and healthcare institutions, as well as commercial, governmental, and industrial customers. The company was formerly known as The Stanley Works and changed its name to Stanley Black & Decker, Inc. in March 2010. Stanley Black & Decker, Inc. was founded in 1843 and is headquartered in New Britain, Connecticut.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Machine Tools & Accessories",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "city": "New Britain"
    },
    "TPAC": {
        "short_name": "TRANS-PACIFIC AEROSPACE CO INC",
        "long_name": "Trans-Pacific Aerospace Company, Inc.",
        "summary": "Trans-Pacific Aerospace Company, Inc. designs, manufactures, and sells aerospace component parts for commercial and military aircrafts, space vehicles, power plants, and surface and undersea vessels in the United States. It primarily offers self-lubricating spherical bearings, which are integral to the operation of commercial aircrafts and help with various flight-critical tasks, including aircraft flight controls and landing gear. The company was formerly known as Pinnacle Energy Corp. and changed its name to Trans-Pacific Aerospace Company, Inc. in March 2010. Trans-Pacific Aerospace Company, Inc. was founded in 2007 and is based in San Marino, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "San Marino"
    },
    "USAE": {
        "short_name": "US AEROSPACE INC",
        "long_name": "U.S. Aerospace, Inc.",
        "summary": "U.S. Aerospace, Inc. produces and supplies aircraft assemblies, structural components, and engineered and precision machined details. It also supplies structural aircraft parts for military aircraft. The companies offers its products for the United States Department of Defense, United States Air Force, and other aircraft manufacturers, aerospace companies, and defense contractors. U.S. Aerospace, Inc. was formerly known as New Century Companies, Inc. and changed its name to U.S. Aerospace, Inc. in April 2010. The company was founded in 1980 and is based in Rancho Cucamonga, California.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Aerospace Defense Products & Services",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "Rancho Cucamonga"
    },
    "WSML": {
        "short_name": "WILLIAMSVILLE SEARS MANAGEMENT ",
        "long_name": "Williamsville Sears Management, Inc.",
        "summary": "Williamsville Sears Management, Inc. does not have significant operations. The company was formerly engaged in the design, manufacture, and distribution of oral health and teeth whitening products. The company was founded in 2008 and is based in New York, New York. As of March 9, 2018, Williamsville Sears Management, Inc. is a subsidiary of Palewater Global Management Inc.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Residential Construction",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "city": "New York"
    }
}