{"NOC.MX": {"short_name": "NORTHROP GRUMMAN CORP", "long_name": "Northrop Grumman Corporation", "summary": "Northrop Grumman Corporation operates as an aerospace and defense company worldwide. The company operates through four segments: Aeronautics Systems, Defense Systems, Mission Systems, and Space Systems. The Aeronautics Systems segment designs, develops, manufactures, integrates, and sustains aircraft systems for strategic and tactical intelligence, surveillance, and reconnaissance (ISR) missions; and long-range strike aircraft systems, tactical fighter aircrafts, and airborne battle management systems. The Defense Systems segment offers weapon and mission systems for the U.S. military and civilian agency customers. Its principal products and services include integrated battle management systems, weapons systems, information technology services, and intelligence operations. This segment provides command and control and weapons systems, including munitions and missiles; precision strike weapons; propulsion, such as air-breathing systems; and gun systems and precision munitions. It also offers life cycle service and support for software, weapons systems, and aircraft; security services, including information and cyber operations; intelligence analysis and support; and IT infrastructure, such as cloud. The Mission Systems segment offers command, control, communications, and computers ISR systems; radar, electro-optical/infrared, and acoustic sensors; electronic warfare systems; communications and network systems; processing systems; navigation; and maritime power, propulsion, and payload launch systems. This segment also provides airborne sensors and networks; cyber and intelligence mission solutions; maritime/land systems and sensors; and navigation, targeting, and survivability solutions. The Space Systems segment offers satellites and payloads; ground systems; missile defense systems and interceptors; launch vehicles and related propulsion systems; and strategic missiles. Northrop Grumman Corporation was founded in 1939 and is based in Falls Church, Virginia.", "currency": "MXN", "sector": "Industrial Goods", "industry": "Aerospace/Defense - Major Diversified", "exchange": "MEX", "market": "mx_market", "country": "United States", "city": "Falls Church"}, "RTX.BA": {"short_name": "RAYTHEON TECHNOLOG", "long_name": "Raytheon Technologies Corporation", "summary": "Raytheon Technologies Corporation, an aerospace and defense company, provides advanced systems and services for commercial, military, and government customers worldwide. It operates in four businesses: Collins Aerospace Systems, Pratt & Whitney, Raytheon Intelligence & Space, and Raytheon Missiles & Defense. The Collins Aerospace Systems business offers aerostructures, avionics, interiors, mechanical systems, mission systems, and power and control systems that serve customers in the commercial, regional, business aviation, and military sectors. The Pratt & Whitney business designs, manufactures, and services aircraft engines and auxiliary power systems for commercial, military, and business aircraft. The Raytheon Intelligence & Space business engages in developing various sensors, training, and cyber and software solutions. The Raytheon Missiles & Defense business produces a portfolio of advanced technologies, including air and missile defense systems, precision weapons, radars, and command and control systems that delivers end-to-end solutions to detect, track, and engage threats. The company is headquartered in Waltham, Massachusetts.", "currency": "ARS", "sector": "Industrial Goods", "industry": "Aerospace/Defense - Major Diversified", "exchange": "BUE", "market": "ar_market", "country": "United States", "city": "Waltham"}}