{
    "AME.MX": {
        "short_name": "AMETEK INC",
        "long_name": "AMETEK, Inc.",
        "summary": "AMETEK, Inc. manufactures and sells electronic instruments and electromechanical devices worldwide. It operates in two segments, Electronic Instruments (EIG) and Electromechanical (EMG). The company's EIG segment offers advanced instruments for the process, aerospace, power, and industrial markets; process and analytical instruments for the oil and gas, petrochemical, pharmaceutical, semiconductor, automation, and food and beverage industries; and instruments to the laboratory equipment, ultra-precision manufacturing, medical, and test and measurement markets. This segment also provides power quality monitoring and metering devices, uninterruptible power supplies, programmable power equipment, electromagnetic compatibility test equipment, sensors for gas turbines, dashboard instruments for heavy trucks and other vehicles, and instrumentation and controls for the food and beverage industries; and aircraft and engine sensors, monitoring systems, power supplies, fuel and fluid measurement systems, and data acquisition units for the aerospace industry. Its EMG segment offers engineered electrical connectors and electronics packaging for protecting sensitive electronic devices; precision motion control products for data storage, medical devices, business equipment, automation and other applications; high-purity powdered metals, strip and foil, specialty clad metals, and metal matrix composites; motor-blower systems and heat exchangers for use in thermal management, military, commercial aircraft, and military ground vehicles; and motors for use in commercial appliances, fitness equipment, food and beverage machines, hydraulic pumps, and industrial blowers. This segment also operates a network of aviation maintenance, repair, and overhaul facilities. In addition, the company offers clinical and education communication solutions for healthcare facilities and educational institutions. AMETEK, Inc. was incorporated in 1930 and is headquartered in Berwyn, Pennsylvania.",
        "currency": "MXN",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "MEX",
        "market": "mx_market",
        "country": "United States",
        "state": "PA",
        "city": "Berwyn",
        "zipcode": "19312-1177",
        "website": "http://www.ametek.com",
        "market_cap": 636045623296
    },
    "CHMR": {
        "short_name": "CHIMERA ENERGY CORP",
        "long_name": "Chimera Energy Corporation",
        "summary": "Chimera Energy Corporation, a development stage company, supplies equipment and components that are used in the exploration and production of oil and gas in the United States. It markets and sells polycrystalline diamond compact cutters for use in coal mining, geological exploration, and oil and gas drilling. The company was founded in 2011 and is headquartered in Houston, Texas.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "PNK",
        "market": "us_market",
        "country": "United States",
        "state": "TX",
        "city": "Houston",
        "zipcode": "77056",
        "website": null,
        "market_cap": 19800
    },
    "INS": {
        "short_name": "Intelligent Systems Corporation",
        "long_name": "Intelligent Systems Corporation",
        "summary": "Intelligent Systems Corporation, through its subsidiary, CoreCard Software, Inc., provides technology solutions and processing services to the financial technology and services market in the United States and European Union. The company designs, develops, and markets a suite of software solutions to program managers, accounts receivable businesses, financial institutions, retailers, and processors to manage their credit and debit cards, prepaid cards, private label cards, fleet cards, loyalty programs, and accounts receivable and loan transactions. Its software solutions allow companies to offer various types of debit and credit cards, as well as installment and revolving loans; set up and maintain account data; record advances and payments; assess fees, interests, and other charges; resolve disputes and chargebacks; manage collections of accounts receivable; generate reports; and settle transactions with financial institutions and network associations. Intelligent Systems Corporation was founded in 1973 and is headquartered in Norcross, Georgia.",
        "currency": "USD",
        "sector": "Industrial Goods",
        "industry": "Diversified Machinery",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "United States",
        "state": "GA",
        "city": "Norcross",
        "zipcode": "30093",
        "website": "http://www.intelsys.com",
        "market_cap": 296226368
    }
}