{
    "ACC.NS": {
        "short_name": "ACC LIMITED",
        "long_name": "ACC Limited",
        "summary": "ACC Limited manufactures and sells cement and ready-mix concrete in India. The company provides ordinary Portland cement; blended cement, including Portland Pozzolana cement, Portland slag cement, and composite cement; gold and silver range of cement; ready mixed concrete value-added products; and bulk cement. It also offers construction chemicals, such as ACC LeakBlock, a polymer-based integral waterproofing compound used in various types of cement mortar, plasters, and concrete; ACC LeakBlock WaterProof Plaster - LB 101, a ready-to-use cementitious waterproof mortar for internal and external plaster applications; and tile adhesives. In addition, the company provides EcoPact, a concrete with lower embodied carbon content for various structural components applications comprising foundations, columns, beams, external or internal walls, driveways, walkways, etc. It distributes its products through a network of dealers, retailers, masons, engineers, and architects, as well as sales platforms. The company was formerly known as The Associated Cement Companies Limited and changed its name to ACC Limited in September 2006. ACC Limited was incorporated in 1936 and is headquartered in Mumbai, India. ACC Limited is a subsidiary of Ambuja Cements Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.acclimited.com",
        "market_cap": "Mid Cap"
    },
    "AMBUJACEM.NS": {
        "short_name": "AMBUJA CEMENTS LTD",
        "long_name": "Ambuja Cements Limited",
        "summary": "Ambuja Cements Limited, together with its subsidiaries, manufactures and markets cement and cement related products to individual homebuilders, masons and contractors, and architects and engineers in India. The company offers Portland pozzolana cement, ordinary Portland cement, and pozzolana composite cement, as well as temperature resistant concrete blocks, Blaine Portland cement, and micro materials. It sells its products through dealers, authorized retail stockiest, retailers, and authorized sales representatives. The company was formerly known as Gujarat Ambuja Cements Limited and changed its name to Ambuja Cements Limited in April 2007. The company was incorporated in 1981 and is based in Mumbai, India. Ambuja Cements Limited operates as a subsidiary of Holderind Investments Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400059",
        "website": "http://www.ambujacement.com",
        "market_cap": "Mid Cap"
    },
    "ANDHRACEMT.NS": {
        "short_name": "ANDHRA CEMENTS",
        "long_name": "Andhra Cements Limited",
        "summary": "Andhra Cements Limited manufactures and sells cement and cement related products primarily in India. The company offers ordinary Portland, Portland Pozolana, and Portland slag cement products. It sells its products through a network of dealers and agents. The company was formerly known as Andhra Cement Company Limited and changed its name to Andhra Cements Limited in December 1990. The company was incorporated in 1936 and is based in Guntur, India. Andhra Cements Limited is a subsidiary of Jaypee Development Corporation Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Guntur",
        "zipcode": "522414",
        "website": "http://www.andhracements.com",
        "market_cap": "Micro Cap"
    },
    "APCL.NS": {
        "short_name": "ANJANI PRTLND CEMT",
        "long_name": "Anjani Portland Cement Limited",
        "summary": "Anjani Portland Cement Limited manufactures and sells cement in India. It offers ordinary Portland, and Portland Pozollana and composite cement, as well as engages in power generation. The company was formerly known as Shez Cement Limited and changed its name to Anjani Portland Cement Limited in October 1999. The company was incorporated in 1983 and is based in Hyderabad, India. Anjani Portland Cement Limited is a subsidiary of Chettinad Cement Corporation Private Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.anjanicement.com",
        "market_cap": "Micro Cap"
    },
    "BIRLACORPN.NS": {
        "short_name": "BIRLA CORP",
        "long_name": "Birla Corporation Limited",
        "summary": "Birla Corporation Limited manufactures and sells cement in India. The company operates through three segments: Cement, Jute, and Others. It offers ordinary Portland, Portland Pozzolana, and Portland slag cement under the MP Birla Cement Perfect Plus, MP Birla Cement Samrat Advanced, MP Birla Cement Ultimate Ultra, MP Birla Cement Unique, MP Birla Cement Samrat, MP Birla Cement Ultimate, MP Birla Cement Chetak, MP Birla Cement PSC, MP Birla Cement MULTICEM, and MP Birla Cement CONCRECEM brand names that are used in bridges, dams, railway sleepers, reservoirs, industrial buildings, marine structures, cooling towers, metro lines, and airport runways. The company also manufactures various jute products, such as jute yarn, floor and wall coverings, lino hessian products, decorative fabrics, nursery cloths, scrims, jute carpets, non-woven jute felts, hydrocarbon-free bags/cloths, D.W. canvas products, carpet backing cloths, hessian cloths/bags, and sacking bags/cloths, which are used in mats, yarns, ropes, bags, carpets, and panama. In addition, it offers auto trims, as well as iron and steel castings. The company also exports its products. The company was formerly known as Birla Jute Manufacturing Company Limited and changed its name to Birla Corporation Limited in 1998. Birla Corporation Limited was incorporated in 1919 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700071",
        "website": "http://www.birlacorporation.com",
        "market_cap": "Small Cap"
    },
    "BURNPUR.NS": {
        "short_name": "BURNPUR CEMENT LTD",
        "long_name": "Burnpur Cement Limited",
        "summary": "Burnpur Cement Limited manufactures and sells cement in India. It offers Portland slag cement. Burnpur Cement Limited was incorporated in 1986 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700071",
        "website": "http://www.burnpurcement.com",
        "market_cap": "Nano Cap"
    },
    "BVCL.NS": {
        "short_name": "BARAK VALLEY CEMEN",
        "long_name": "Barak Valley Cements Limited",
        "summary": "Barak Valley Cements Limited manufactures and sells various grades of cement and clinker primarily in India. The company offers ordinary portland cement and portland pozzolana cement under the Valley Strong Cement brand. It is also involved in tea, rubber, and biomass plantation activities; and extraction and crushing of limestone. The company serves individuals, contractors, builders, institutions, and government agencies. Barak Valley Cements Limited was incorporated in 1999 and is based in Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110034",
        "website": "http://www.barakcement.com",
        "market_cap": "Nano Cap"
    },
    "DALBHARAT.NS": {
        "short_name": "DALMIA BHARAT LTD",
        "long_name": "Dalmia Bharat Limited",
        "summary": "Dalmia Bharat Limited, together with its subsidiaries, manufactures and sells clinker and cement products. The company operates through Cement and Others segments. It provides Portland slag cement, Portland pozzolana cement, Portland composite cement, ordinary Portland cement, and specialty cement under the Dalmia Cement, Konark Cement, Dalmia DSP, Dalmia Infra Pro, Dalmia Infrafreen, and Dalmia InstaPro brands. The company also offers refractory products, solutions, and services; sugar products; and management consultancy services. It operates in India, China, Bangladesh, Nepal, Sri Lanka, Myanmar, Bhutan, Italy, Spain, the United Kingdom, Germany, Turkey, and Russia. The company was formerly known as Odisha Cement Limited and changed its name to Dalmia Bharat Limited in April 2019. Dalmia Bharat Limited was founded in 1939 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.dalmiabharat.com",
        "market_cap": "Mid Cap"
    },
    "DECCANCE.NS": {
        "short_name": "DECCAN CEMENT",
        "long_name": "Deccan Cements Limited",
        "summary": "Deccan Cements Limited manufactures and sells cement in India. The company offers ordinary Portland, Portland pozzolana, and Portland slag cement products; and other specialty cement products, such as rapid hardening, sulphate resistant, high alumina, and oil well cement, as well as 53-S grade ordinary Portland cement, a specialty cement for railway applications. It also generates and sells electricity through thermal, wind, and hydro-electric power units. Deccan Cements Limited was incorporated in 1979 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500082",
        "website": "http://www.deccancements.com",
        "market_cap": "Micro Cap"
    },
    "GRASIM.NS": {
        "short_name": "GRASIM INDUSTRIES",
        "long_name": "Grasim Industries Limited",
        "summary": "Grasim Industries Limited operates in fibre, yarn, pulp, chemicals, textile, fertilizers, and insulators businesses in India and internationally. The company operates through Viscose, Chemicals, Cement, Financial Services, and Others segments. It provides viscose staple fiber, a man-made biodegradable fiber for use in apparels, home textiles, dress materials, knitted wear products, and non-woven applications; wood pulp products; viscose filament yarn, a natural fibre for manufacturing fabrics; and textile products, such as linen and wool. The company also offers various chemical products, including chlor-alkali and epoxy resin products; and fertilizers comprising neem-coated urea, soil and crop specific customised fertilizers, seeds, agrochemicals, and plant and soil health products under the Birla Shaktiman brand name. In addition, it provides electrical insulators for transmission lines and substations, as well as equipment and railways. Further, the company offers grey cement; white cement under the Birla White brand; ready mix concrete; and cement-based putty. Additionally, it provides various financial services comprising non-bank financial, life insurance, asset management, housing finance, equity broking, wealth management, general insurance advisory, and health insurance services. The company is also involved in solar power designing, engineering procurement, and commissioning business. Grasim Industries Limited was founded in 1947 and is based in Nagda, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nagda",
        "zipcode": "456331",
        "website": "http://www.grasim.com",
        "market_cap": "Large Cap"
    },
    "GSCLCEMENT.NS": {
        "short_name": "GUJARAT SIDHEE CEM",
        "long_name": "Gujarat Sidhee Cement Limited",
        "summary": "Gujarat Sidhee Cement Limited manufactures and sells cement and clinker in India. It offers ordinary Portland cement and Portland pozzolana cement under the Sidhee brand name. The company also exports its products. Gujarat Sidhee Cement Limited was incorporated in 1973 and is based in Mumbai, India. Gujarat Sidhee Cement Limited is a subsidiary of Bhadra Textiles and Trading Private Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.gujaratsidheecementlimited.com",
        "market_cap": "Nano Cap"
    },
    "HEIDELBERG.NS": {
        "short_name": "HEIDELBERGCEMENT I",
        "long_name": "HeidelbergCement India Limited",
        "summary": "HeidelbergCement India Limited manufactures and sells cement in India. It offers Portland pozzolana cement and Portland slag cement under the Mycem and Mycem Power brand. The company was formerly known as Mysore Cements Limited and changed its name to HeidelbergCement India Limited in April 2009. HeidelbergCement India Limited was incorporated in 1958 and is based in Gurugram, India. HeidelbergCement India Limited is a subsidiary of Cementrum I.B.V.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gurugram",
        "zipcode": "122002",
        "website": "http://www.mycemco.com",
        "market_cap": "Small Cap"
    },
    "IFGLEXPOR.NS": {
        "short_name": "IFGL EXPORTS LTD",
        "long_name": "IFGL Refractories Limited",
        "summary": "IFGL Refractories Limited engages in the manufacture, trade, and sale of refractory items used in steel plants in India and internationally. The company offers isostatic and slide gate refractories, tube changer systems, and purging systems refractories; cast products and monolithics, zircon and zircona nozzles, spray machines, robotic gunning, and slag control darts and machines; and foundry ceramics, wire guides, and heating ovens. The company was formerly known as IFGL Exports Limited has changed its name to IFGL Refractories Limited in October 2017. IFGL Refractories Limited was incorporated in 2007 and is headquartered in Kolkata, India. IFGL Refractories Limited is a subsidiary of Bajoria Financial Services Private Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.ifglref.com",
        "market_cap": "Micro Cap"
    },
    "INDIACEM.NS": {
        "short_name": "INDIA CEMENTS",
        "long_name": "The India Cements Limited",
        "summary": "The India Cements Limited produces and sells cement and cement related products in India and internationally. It offers cement and allied products under the Sankar Super Power, Coromandel King, and Raasi Gold brands, as well as the Coromandel White and Coromandel Super brands; and ready mix concrete. The company also engages in the generation of power from windmills and thermal power plants; provision of ship hiring services; and ownership and operation of coal mines. The company was founded in 1946 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600028",
        "website": "http://www.indiacements.co.in",
        "market_cap": "Small Cap"
    },
    "JKCEMENT.NS": {
        "short_name": "JK CEMENTS LTD",
        "long_name": "J.K. Cement Limited",
        "summary": "J.K. Cement Limited manufactures and sells cement and its related products in India and internationally. The company offers grey cement products, including ordinary Portland, Portland Pozzolana, weather shield cements, and Portland slag cements under the JK Super Cement brand name; cement products for concrete under the JK Super Strong Cement brand; and white cement for floors, walls, and decorative and architectural applications under the JK White Cement brand name. It also provides white cement based primer under the JK Primaxx brand; white cement for exterior/interior walls and ceilings, mosaic tiles, terrazzo flooring, and white cement based value-added products under the JK White Cement brand; gypsum plaster for application on walls and ceilings under the JK Cement GypsoMaxX brand; white cement based waterproof putty under the JK Cement ShieldMaxX brand; wall and floor adhesives, multipurpose adhesives, and white adhesives under the JK Cement TileMaxX brand; and white Portland cement under the JK Cement WhiteMaxX brand. In addition, the company imports, exports, and trades in cement clinker, limestone, etc. The company was founded in 1974 and is headquartered in Kanpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kanpur",
        "zipcode": "208001",
        "website": "http://www.jkcement.com",
        "market_cap": "Mid Cap"
    },
    "JKLAKSHMI.NS": {
        "short_name": "JK LAKSHMI CEMENT",
        "long_name": "JK Lakshmi Cement Limited",
        "summary": "JK Lakshmi Cement Limited, together with its subsidiaries, manufactures and supplies cement in India. It offers Portland Pozzolana blended cement, and 53 grade and 43 grade ordinary Portland cement under the JK LAKSHMI CEMENT and JK Lakshmi PRO+ Cement names for use in various R.C.C. and industrial works, plastering, underground structures, dams, heavy machinery foundations, marine structures, hydropower stations, high-rise buildings, pre-stressed concrete works, railway sleepers and concrete poles, commercial buildings, industrial constructions, multi-storeyed complexes, cement concrete roads, and heavy duty floors. The company also provides ready mix concrete under the JK Lakshmi Power Mix name; autoclaved aerated concrete blocks under the JK SmartBlox name; gypsum plaster products under the JK Lakshmiplast name; and gypsum-based plaster products. It markets its products through a network of dealers in Rajasthan, Gujarat, Haryana, Delhi, Uttar Pradesh, Punjab, Jammu and Kashmir, Madhya Pradesh, Chattisgarh, Odisha, South Bengal, Vidharbha, Mumbai, and Pune. JK Lakshmi Cement Limited was incorporated in 1938 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110002",
        "website": "http://www.jklakshmicement.com",
        "market_cap": "Small Cap"
    },
    "KAKATCEM.NS": {
        "short_name": "KAKATIYA CEM SUGAR",
        "long_name": "Kakatiya Cement Sugar and Industries Limited",
        "summary": "Kakatiya Cement Sugar and Industries Limited manufactures and sells Portland cement in India. The company operates through three segments: Cement, Sugar, and Power. It also produces and sells sugar; and owns and operates a 17 megawatt cogeneration power plant. The company was formerly known as Kakatiya Cements Limited. Kakatiya Cement Sugar and Industries Limited was incorporated in 1979 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500020",
        "website": "http://www.kakatiyacements.com",
        "market_cap": "Nano Cap"
    },
    "KCP.NS": {
        "short_name": "KCP LTD",
        "long_name": "The KCP Limited",
        "summary": "The KCP Limited engages in the cement, heavy engineering, power generation, and hospitality businesses in India and Vietnam. It operates through Cement unit, Engineering Unit, Power Generation unit, and Hotel segments. The company manufactures and sells cement; a range of heavy equipment for various industries, such as cement, sugar, power, mining (minerals), mineral processing, metal, oil and gas, chemicals and fertilizers, defense, space, industrial gases, and general engineering. In addition, it operates a 30 MW power co-generation plant in Son Hoa, Vietnam and sells it to the National Grid in Vietnam. Further, the company manufactures sugar; and operates Mercure Hyderabad KCP hotel in Hyderabad, India. The KCP Limited was founded in 1941 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600008",
        "website": "http://www.kcp.co.in",
        "market_cap": "Micro Cap"
    },
    "KESORAMIND.NS": {
        "short_name": "KESORAM INDUSTRIES",
        "long_name": "Kesoram Industries Limited",
        "summary": "Kesoram Industries Limited manufactures and markets cement products under the Birla Shakti brand in India. It also offers rayon, transparent paper, and filament yarn under the Kesoram Rayon brand. The company was formerly known as Kesoram Industries & Cotton Mills Ltd. and changed its name to Kesoram Industries Limited in 1986. Kesoram Industries Limited was founded in 1919 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.kesocorp.com",
        "market_cap": "Micro Cap"
    },
    "MANGLMCEM.NS": {
        "short_name": "MANGALAM CEMENT",
        "long_name": "Mangalam Cement Limited",
        "summary": "Mangalam Cement Limited manufactures and sells cement in India. The company offers Portland Pozzolana cement, and 43 grade and 53 grade ordinary Portland cement under the Birla Uttam brand name. Mangalam Cement Limited was incorporated in 1976 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.mangalamcement.com",
        "market_cap": "Micro Cap"
    },
    "NCLIND.NS": {
        "short_name": "NCL INDUSTRIES",
        "long_name": "NCL Industries Limited",
        "summary": "NCL Industries Limited manufactures and sells building materials in India. It operates through five segments: Cement, Boards, Doors, Energy, and Ready Mix Concrete. It offers cement, including ordinary Portland and pozzolana Portland cement under the Nagarjuna brand name; and special cement for supply to Indian Railways for concrete sleepers and pre-stressed concrete works. The company also provides ready mixed concrete; plain, laminated, embossed, and sandwich panels under the brand names of Bison Panel, Bison Lam, and Bison Designer Boards; and readymade doors under the Duradoor brand name. In addition, it engages in the generation of hydel power with a total installed capacity of 15.75 MW. The company was formerly known as Nagarjuna Cements Limited and changed its name to NCL Industries Limited in December 1987. NCL Industries Limited was founded in 1979 and is based in Secunderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Secunderabad",
        "zipcode": "500026",
        "website": "http://www.nclind.com",
        "market_cap": "Micro Cap"
    },
    "ORIENTCEM.NS": {
        "short_name": "ORIENT CEMENT LTD",
        "long_name": "Orient Cement Limited",
        "summary": "Orient Cement Limited manufactures and sells cement in India. The company offers pozzolana and ordinary Portland cement under the Birla.A1 brand name. Its products are used in residential, commercial, infrastructure, industrial, and community projects. Orient Cement Limited was founded in 1979 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.orientcement.com",
        "market_cap": "Small Cap"
    },
    "PRSMJOHNSN.NS": {
        "short_name": "PRISM JOHNSON LTD",
        "long_name": "Prism Johnson Limited",
        "summary": "Prism Johnson Limited, an integrated building materials company, provides cement, ready-mixed concrete, ceramic tiles, and bathroom products in India and internationally. It operates through four segments: Cement, Tile and Bath (HRJ), Ready Mixed Concrete (RMC), and Insurance. The company offers Portland pozzolana cement under the Champion, Champion Plus, Duratech and Ordinary Portland Cement brands. It also provides aggregates; and operates quarries. In addition, the company offers ceramic and vitrified tiles; and sanitaryware, bath fittings, and engineered marble and quartz products under the Johnson, Johnson Marbonite, Johnson Porselano, and Johnson Endura brand names. Further, it engages in the general insurance business. The company was formerly known as Prism Cement Limited and changed its name to Prism Johnson Limited in April 2018. Prism Johnson Limited was incorporated in 1992 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400054",
        "website": "http://prismjohnson.in",
        "market_cap": "Small Cap"
    },
    "RAMCOCEM.NS": {
        "short_name": "RAMCO CEMENTS(THE)",
        "long_name": "The Ramco Cements Limited",
        "summary": "The Ramco Cements Limited manufactures and sells cement and cementious materials in India. It offers Portland Pozzolana, OPC, sulphate resisting, sleeper grade, and rapid hardening Portland cement, as well as ready mix concrete and dry mortar products under the RAMCO brand. The company is also involved in the generation and sale of electricity from wind mills and thermal power plants. As of March 31, 2019, it operated a wind farm with an installed capacity of 125.95 MW comprising 108 wind electric generators. The Ramco Cements Limited also exports its products. The company was formerly known as Madras Cements Ltd. and changed its name to The Ramco Cements Limited in July 2013. The Ramco Cements Limited was incorporated in 1957 and is headquartered in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600004",
        "website": "http://www.ramcocements.in",
        "market_cap": "Mid Cap"
    },
    "SAGCEM.NS": {
        "short_name": "SAGAR CEMENTS",
        "long_name": "Sagar Cements Limited",
        "summary": "Sagar Cements Limited engages in the manufacturing and selling of cement in India. It operates through Cement Manufacturing and Power Generation segments. The company offers various cements, such as ordinary Portland, Portland Puzzolona, white, Portland, blast furnace slag, oil well, rapid hardening Portland, and water proof, as well as sulphate resistant Portland cements under the Sagar brand. It also operates hydel, waste heat recovery, solar power, hydro power, and thermal power plants. Sagar Cements Limited was incorporated in 1981 and is based in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500033",
        "website": "http://www.sagarcements.in",
        "market_cap": "Micro Cap"
    },
    "SANGHIIND.NS": {
        "short_name": "SANGHI INDUSTRIES",
        "long_name": "Sanghi Industries Limited",
        "summary": "Sanghi Industries Limited manufactures and markets cement and cement products in India and internationally. It provides ordinary Portland, Portland Pozzolana, and Portland slag cement; and ready mix concrete and clinker. The company was incorporated in 1985 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Ahmedabad",
        "zipcode": "380051",
        "website": "http://www.sanghicement.com",
        "market_cap": "Micro Cap"
    },
    "SHREDIGCEM.NS": {
        "short_name": "SHREE DIGVIJAY CEMENT",
        "long_name": "Shree Digvijay Cement Company Ltd.",
        "summary": "Shree Digvijay Cement Company Ltd. manufactures and sells cement in India. The company's products include ordinary Portland cement, Portland Pozzolana cement, sulphate resisting Portland cement, oil well cement, and other cements. It sell its products under the KAMAL CEMENT and CEMENT KA SARDAR brands. The company was founded in 1942 and is based in Jamnagar, India. Shree Digvijay Cement Company Ltd. is a subsidiary of True North Fund VI LLP.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Jamnagar",
        "zipcode": "361140",
        "website": "http://www.digvijaycement.com",
        "market_cap": "Micro Cap"
    },
    "SHREECEM.NS": {
        "short_name": "SHREE CEMENT LTD",
        "long_name": "Shree Cement Limited",
        "summary": "Shree Cement Limited manufactures and sells cement and clinker in India and internationally. It offers cement under the Shee Jung Rodhak, Bangur, Rockstrong, Roofon Concrete Master, and Bangur Power brand names. The company also engages in the generation of power with a total capacity of 742 megawatts through thermal, waste heat recovery, solar, and wind power plants. Shree Cement Limited was incorporated in 1979 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700001",
        "website": "http://www.shreecement.com",
        "market_cap": "Large Cap"
    },
    "SICAGEN.NS": {
        "short_name": "SICAGEN INDIA LTD",
        "long_name": "Sicagen India Limited",
        "summary": "Sicagen India Limited trades in and distributes building materials in India and internationally. It operates through Trading and Manufacturing segments. The company offers building materials, such as MS/GI pipes, precision tubes, structural tubes, seamless tubes, ERW tubes, rectangular/square hollow sections, steel fittings, PVC pipes, UPVC pipes, roofing sheets, electrical cables, switchgears, cement, etc., as well as construction steel, including TMT steel rebars. It also provides mechanical governor services, servicing for actuators, field services, and conversion of mechanical and electronic governing systems; and manufactures drums and barrels that are used for the transport of lubricant oil, hazardous and non-hazardous chemicals, bitumen, and fruit pulp. In addition, the company offers water treatment and process enhancement solutions for petrochemical, fertilizer, refinery, power, pharmaceutical, agro, and pesticide industries; builds boats, tugs, and barges; manufactures cables for industrial and other critical applications; and engages in the precision fabrication of steel, carbon steel, mild steel, and aluminum. It serves dealers, contractors, builders, and corporate buyers. The company was incorporated in 2004 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Chennai",
        "zipcode": "600032",
        "website": "http://www.sicagen.com",
        "market_cap": "Nano Cap"
    },
    "STARCEMENT.NS": {
        "short_name": "STAR CEMENT LTD",
        "long_name": "Star Cement Limited",
        "summary": "Star Cement Limited manufactures and sells cement and clinker products in north eastern and eastern states of India. It operates through Cement and Power segments. The company offers ordinary Portland, Portland pozzolana, Portland slag, and antirust cement products under the Star Cement brand. It also generates power. The company markets its products through a network of dealers and retailers. It also exports its products to Nepal and Bhutan. The company was formerly known as Cement Manufacturing Company Limited and changed its name to Star Cement Limited in June 2016. Star Cement Limited was founded in 2001 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700027",
        "website": "http://www.starcement.co.in",
        "market_cap": "Small Cap"
    },
    "ULTRACEMCO.NS": {
        "short_name": "ULTRATECH CEMENT",
        "long_name": "UltraTech Cement Limited",
        "summary": "UltraTech Cement Limited, together with its subsidiaries, manufactures and sells cement and cement related products in India. It offers ordinary Portland cement, Portland blast furnace slag cement, Portland Pozzolana cement, white cement, and white cement based products; and ready mix concrete, including specialty concrete, as well as building products consisting AAC blocks, jointing mortars, and host of others in retail formats. The company also provides Super Stucco, a self-curing-no water curing plaster; Power Grout, a self-curing industrial grout for anchoring/grouting applications; Seal & Dry water proofing systems, which helps in water conservation in water storage tanks and canals; and C'retePro, a liquid system for mortar and concrete modifier, as well as repair mortars and concrete under the name of Basekrete and Microkrete. UltraTech Cement Limited exports its products to the United Arab Emirates, Bahrain, and Sri Lanka. In addition, it offers construction products and value-added services that include technical advice during construction, vaastu consultancy, product training in various categories, and technical meets for customers. The company was formerly known as UltraTech CemCo Limited and changed its name to UltraTech Cement Limited in October 2004. The company was incorporated in 2000 and is based in Mumbai, India. UltraTech Cement Limited is a subsidiary of Grasim Industries Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Building Materials",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.ultratechcement.com",
        "market_cap": "Large Cap"
    }
}