{
    "ANDHRSUGAR.NS": {
        "short_name": "ANDHRA SUGARS",
        "long_name": "The Andhra Sugars Limited",
        "summary": "The Andhra Sugars Limited, together with its subsidiaries, manufactures and sells sugar, and organic and inorganic chemicals in India. The company operates through Sugars, Caustic Soda, Power Generation, Industrial Chemicals, and Others segments. It offers chemicals and fertilizers, including caustic potash, caustic soda, ethanol, hydrochloric acid, hydrogen gas, liquid chlorine, poly aluminum chloride, potassium carbonate, industrial alcohol, sodium hypochlorite, sulphuric acid, and super phosphate. The company also provides aspirin products, including salicylic acids, sodium salicylate, and aspirin starch granules, as well as aspirin IP, USP, and BP products. In addition, it offers soaps, fatty acids, acetic acids, liquid propellants, bulk drugs, edible oils, transportation receipts, etc.; and liquid hydrogen, UH 25 and MMH, and HTPB products. Further, the company engages in power generation through wind and solar resources. The Andhra Sugars Limited also exports its products. The company was founded in 1947 and is based in Tanuku, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Tanuku",
        "zipcode": "534215",
        "website": "http://theandhrasugars.com",
        "market_cap": 11847576576
    },
    "BASF.NS": {
        "short_name": "BASF INDIA",
        "long_name": "BASF India Limited",
        "summary": "BASF India Limited provides chemicals, materials, industrial solutions, surface technologies, nutrition and care, and agricultural solutions in India and internationally. Its Agricultural Solutions segment provides crop protection products, such as insecticides, herbicides, fungicides, and plant growth regulators. The company's Chemicals segment provides petrochemicals, such as solvents, acrylic acid, acrylic monomers, and plasticizers, as well as catalysts; and intermediate chemicals, including amines, diols, polyalcohols, acids, and specialties for pharmaceuticals, agrochemicals, coatings, food and feed, flavor and fragrance, surfactants, rubber chemicals, textiles, personal care, adhesives, dyes, etc. Its Materials segment offers performance chemicals, such as polyurethane, engineering, and specialty plastics; and monomers comprising basic raw materials for polyurethanes, inorganics and polyamides, as well as its precursors. The company's Industrial Solutions segment provides dispersions and resins comprising resins, additives, and dispersions for paints and coatings, construction, paper, adhesives, printing, and packaging industries; and performance chemicals consisting of plastic additives, fuel and lubricants, and mining chemicals for polymer manufacturers, packaging automotive, agriculture, and electronics industries. Its Surface Technologies segment provides Catalysts, coatings, construction chemicals, and admixture systems, as well as construction systems, such as industrial floorings, insulation and waterproofing solutions, concrete and building repair and protection products, and tile fixing solutions. The company's Nutrition & Care segment offers textile, agrochemicals, and metal surface cleaning chemicals; and human nutrition, animal nutrition, pharma solutions, and aroma ingredients. BASF India Limited was incorporated in 1943 and is based in Mumbai, India. BASF India Limited is a subsidiary of BASF SE.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400051",
        "website": "http://www.basf.com/in",
        "market_cap": 108478849024
    },
    "BEPL.NS": {
        "short_name": "BHANSALI ENG POLYM",
        "long_name": "Bhansali Engineering Polymers Limited",
        "summary": "Bhansali Engineering Polymers Limited operates as an integrated petrochemical company in India and internationally. It manufactures and sells acrylonitrile butadiene styrene (ABS) and styrene acrylonitrile (SAN) resins, as well as high rubber graft. The company's products include general, heat resistant, flame retardant, transparent, and extrusion ABS; and ABS-polycarbonate alloys, glass reinforced ABS, PMMA-ABS, and PVC modifiers. Its ABS resins are used as a raw material for companies dealing in automobiles, home appliances, telecommunications, luggage, bus body, and other applications. The company was incorporated in 1984 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400058",
        "website": "http://www.bhansaliabs.com",
        "market_cap": 30261551104
    },
    "DCW.NS": {
        "short_name": "DCW",
        "long_name": "DCW Limited",
        "summary": "DCW Limited operates as a heavy chemical manufacturing company in India. It operates through Soda Ash, Caustic Soda, PVC, SIOP, and C-PVC. The company's products include caustic soda, liquid chlorine, hydrochloric acid, synthetic rutile, trichloroethylene, synthetic and yellow iron oxide, red and yellow pigment, ferric chloride, utox, poly vinyl chloride, soda ash, and sodium and ammonium bicarbonate. It also exports its products. The company was formerly known as Dhrangadhra Chemical Works Limited. DCW Limited was founded in 1925 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400021",
        "website": "http://www.dcwltd.com",
        "market_cap": 9004540928
    },
    "DEEPAKFERT.NS": {
        "short_name": "DEEPAK FERTILISERS",
        "long_name": "Deepak Fertilisers And Petrochemicals Corporation Limited",
        "summary": "Deepak Fertilisers And Petrochemicals Corporation Limited produces and sells fertilizers and industrial chemicals in India. It operates through Chemicals, Bulk Fertilisers, Realty, and Others segments. The Chemicals segment offers ammonia, methanol, dilute nitric acid, concentrated nitric acid, carbon dioxide, technical ammonium nitrate, iso-propyl alcohol, propane, and bulk and specialty chemicals. The Bulk Fertilisers segment provides nitro phosphate, muriate of potash, di-ammonium phosphate AP, ammonium sulphate, mixtures, single super phosphate, sulphur, micronutrients, SSF, bio fertilizers, fruits, vegetables, and pesticides. The Realty segment is involved in the real estate business. The Others segment generates electricity through windmills. The company primarily exports its products to South Asia, South East Asia, East and West Africa, and the Middle East. Deepak Fertilisers And Petrochemicals Corporation Limited was founded in 1979 and is headquartered in Pune, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "411036",
        "website": "http://www.dfpcl.com",
        "market_cap": 40700141568
    },
    "DEEPAKNTR.NS": {
        "short_name": "DEEPAK NITRITE",
        "long_name": "Deepak Nitrite Limited",
        "summary": "Deepak Nitrite Limited manufactures and sells basic chemicals, fine and speciality chemicals, performance products, and phenolics in India. The company's Basic Chemicals segments offers intermediates for colorants, rubber chemicals, explosives, dyes, pigments, food colors, pharmaceuticals, petrol and diesel blending, and agrochemicals. Its Fine and Speciality Chemicals segment provides products for agro-chemicals, colorants, pigments, pharmaceuticals, and personal wellness products. The company's Performance Products segment offers optical brighteners; and products for paper, detergent, coating, and textile industries. Its Phenolics segment provides phenols, cumene, isopropyl alcohol, and acetone. It also exports its products primarily to Europe, the United States, Japan, Latin America, and South East and Far-East Asia. Deepak Nitrite Limited was founded in 1970 and is based in Vadodara, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390024",
        "website": "http://www.godeepak.com",
        "market_cap": 244297596928
    },
    "FAIRCHEMOR.NS": {
        "short_name": "Fairchem Organics Limited",
        "long_name": "Fairchem Organics Limited",
        "summary": "Fairchem Organics Limited engages in manufacturing and selling of specialty oleo chemicals and intermediate nutraceuticals in India. The company offers aroma chemicals products, such as dihydromyrcenol, amber fleur, terpineol - pine oil, and OTBCHA Â\u0096 PTBCHA. It also provides nutraceuticals comprising mixed tocopherol and sterol concentrate; and oleo chemicals, such as dimer, linoleic, monomer, and distilled fatty acid products. The company was incorporated in 2019 and is based in Navi Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Navi Mumbai",
        "zipcode": "400709",
        "website": "http://www.fairchem.in",
        "market_cap": 16307449856
    },
    "FLUOROCHEM.NS": {
        "short_name": "Gujarat Fluorochem Ltd",
        "long_name": "Gujarat Fluorochemicals Limited",
        "summary": "Gujarat Fluorochemicals Limited engages in the manufacture and trading of refrigerant gases, caustic soda, chloromethane, polytetrafluoroethylene (PTFE), fluoropolymers, fluoromonomers, specialty fluorointermediates, specialty chemicals, and allied activities in India , Europe, the United States, and internationally. It provides carbon tetrachloride, chlorine, methylene di chloride, hydrochloric acid, sodium hydrogen sulphate, hydrogen gas, fluorspar, and chloroform. The company offers its products under the Inoflon, Fluonox, Inoflar, Inolub, and Refron brands. Gujarat Fluorochemicals Limited exports its products to approximately 75 countries. The company was formerly known as Inox Fluorochemicals Limited and changed its name to Gujarat Fluorochemicals Limited in July 2019. The company was founded in 1987 and is headquartered in Noida, India. Gujarat Fluorochemicals Limited is a subsidiary of Inox Leasing and Finance Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.gfl.co.in",
        "market_cap": 129275568128
    },
    "FOSECOIND.NS": {
        "short_name": "FOSECO(INDIA)",
        "long_name": "Foseco India Limited",
        "summary": "Foseco India Limited manufactures and sells additives and consumables used in the metallurgical industry in India. The company also exports its products. Foseco India Limited was founded in 1932 and is based in Pune, India. Foseco India Limited is a subsidiary of Foseco Overseas Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Pune",
        "zipcode": "412208",
        "website": "http://www.fosecoindia.com",
        "market_cap": 9097373696
    },
    "GHCL.NS": {
        "short_name": "GHCL",
        "long_name": "GHCL Limited",
        "summary": "GHCL Limited, together with its subsidiaries, manufactures and sells inorganic chemicals and home textile products in India. It offers light soda ash, a basic alkali products used in soap and detergents, pulp and paper, iron and steel, aluminum cleaning compounds, water softening and dyeing, in fibre-reactive dyes, effluent treatment, and chemicals products; dense soda ash for use in glass manufacturing, silicate, ultramarine, and chemical products under the LION brand name. The company also provides refined sodium bicarbonate for use in food, food dyes, poultry and animal feed, leather tanning, fire extinguishers, vegetable cleaning, blasting of metals, manufacture of chemicals, pharma, deodorizers, and personal care products. In addition, it manufactures and sells edible and industrial grade salt, as well as markets honey and spices under the Sapan and i-FLO brands. Further, the company manufactures and exports cotton yarn, polyester yarn, and home textile products, including bed sheets, bed covers, duvet sets, and comforter sets under the REKOOP, CIRKULARITY, MEDITASI, and REKOOP 2.0 brands. Additionally, manufactures food products; and wholesales food, beverages, and tobacco. GHCL Limited was incorporated in 1983 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.ghcl.co.in",
        "market_cap": 26913392640
    },
    "GNFC.NS": {
        "short_name": "GUJARAT NARMADA VA",
        "long_name": "Gujarat Narmada Valley Fertilizers & Chemicals Limited",
        "summary": "Gujarat Narmada Valley Fertilizers & Chemicals Limited manufactures and markets fertilizers and chemicals in India. It offers fertilizers, such as Neem coated Urea, ammonium nitrophosphate, neem de-oiled cake, Neem Manure, and neem pesticides under the NARMADA brand name; and neem soap, neem hand wash, and neem shampoo under the Neo Neem brand. The company also trades in muriate of potash, di-ammonium phosphate, ammonium sulphate, single super phosphate, and city compost. In addition, it provides industrial chemicals, such as methanol, acetic acid, toluene di Â\u0096 isocyanate, aniline, concentrated nitric acid, weak nitric acid, formic acid, ammonium nitrate, ethyl acetate, methyl formate, calcium carbonate, nitrobenzene, and catsol, as well as other products comprising hydrochloric acid, liquid nitrogen, ortho-toluene diamine, meta-toluene diamine, dilute sulphuric acid, dilute nitric acid, and sodium hypochlorite. Further, the company offers various information technology services in the areas of digital signature certificate and e-procurement; and system integration, e-auction, education domain, data center's/cloud services, CCTV surveillance systems, etc.; and undertakes smart cities implementation and e-governance projects. The company was formerly known as Gujarat Narmada Valley Fertilizers Co. Ltd. Gujarat Narmada Valley Fertilizers & Chemicals Limited was founded in 1976 and is headquartered in Bharuch, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bharuch",
        "zipcode": "392015",
        "website": "http://www.gnfc.in",
        "market_cap": 57525202944
    },
    "GUJALKALI.NS": {
        "short_name": "GUJARAT ALKALIES",
        "long_name": "Gujarat Alkalies and Chemicals Limited",
        "summary": "Gujarat Alkalies and Chemicals Limited engages in the production and sale of various chemical products in India. It provides caustic soda lye, soda flake, and soda prill, liquid chlorine, hydrochloric acid, and compressed hydrogen gas; anhydrous aluminum chloride, chlorinated paraffin, benzyl alcohol, benzaldehyde, and benzyl chloride; and sodium chlorate. The company also offers caustic potash lye and flakes, and potassium carbonate; methylene chloride, chloroform, and carbon tetrachloride; and phosphoric acid. In addition, it provides hydrogen peroxide; and bleachwin, scalewin, poly aluminum chloride, biowin, and stable bleaching powder. The company's products are used in various industries, such as textile, pulp and paper, soap and detergent, alumina, water treatment, petroleum, plastic, fertilizer, pharmaceutical, agrochemical, plant protection, dyes and intermediate, refrigeration gas, epoxy, etc. It also exports its products to the United States, Europe, Australia, Africa, the Middle East, China, Russia, Turkey, South Asia, etc. Gujarat Alkalies and Chemicals Limited was founded in 1973 and is based in Vadodara, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "391346",
        "website": "http://www.gacl.com",
        "market_cap": 30633791488
    },
    "GULPOLY.NS": {
        "short_name": "GULSHAN POLYOLS LT",
        "long_name": "Gulshan Polyols Limited",
        "summary": "Gulshan Polyols Limited engages in the mineral processing, grain processing, and distillary businesses in India and internationally. The company provides starch sugar products, such as sorbitol 70% solution, dextrose monohydrate, malto dextrine powder, and liquid glucose, as well as rice fructose syrups, brown rice syrups, and rice syrup solids; organic sweeteners; and activated, precipitated, and ground calcium carbonate products. It also offers Grain based extra neutral alcohol, ethanol from damaged food grain, country liquor, bottling, sanitizers, and dried distillers grain solids, as well as alcoholic beverages under the Tiger Gold and Golden deer brands; and manufactures agro based animal feed products comprising corn/maize gluten feed, corn germ, cattle feed/enriched fiber, rice protein/gluten, and corn steep liquor products. In addition, the company provides native and maize starches in various grades. It serves pharmaceutical, personal care, footwear, tire, rubber and plastic, paint, alcohol, paper, agrochemical, and food and agro industries. Gulshan Polyols Limited was incorporated in 2000 and is based in Delhi, India. Gulshan Polyols Limited is a subsidiary of Gulshan Holdings Pvt. Ltd.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Delhi",
        "zipcode": "110092",
        "website": "http://www.gulshanindia.com",
        "market_cap": 7897730048
    },
    "INDIAGLYCO.NS": {
        "short_name": "INDIA GLYCOL",
        "long_name": "India Glycols Limited",
        "summary": "India Glycols Limited, a green petrochemical company, manufactures and sells industrial chemicals in India. The company operates through Industrial Chemical, Ethyl Alcohol, and Nutraceuticals segments. It offers monoethylene, diethylene, and triethylene glycols; polyethylene glycols; fatty alcohol, acid, and amine ethoxylates; alkyl phenol ethoxylates; castor/natural oil ethoxylates; and ethoxylated and propoxylated co-polymers. The company also provides polysorbates; glycol ethers and acetates; brake fluids and anti-freeze coolants; performance chemicals; natural gums, including guar and other hydrocolloid products; extra neutral alcohols/rectified spirits; and Indian-made foreign liquor. In addition, it offers natural active pharmaceutical ingredients, nutraceuticals, natural food colors, standardized herbal extracts, and spice extracts; and industrial gases, such as liquid oxygen, argon, nitrogen, and carbon dioxide, as well as IGL Steri-gas ethylene oxide and carbon dioxide gas mixtures. The company also exports its products. It serves agrochemical, automotive, detergent, healthcare and food processing, mining, oil and gas, paper, personal care, pharmaceutical, paint and emulsion polymerization, textile, and other industries. The company was formerly known as UP Glycols Limited and changed its name to India Glycols Limited in August 1986. India Glycols Limited was founded in 1983 and is headquartered in Noida, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201304",
        "website": "http://www.indiaglycols.com",
        "market_cap": 17150416896
    },
    "INEOSSTYRO.NS": {
        "short_name": "INEOS STYROLUTION",
        "long_name": "INEOS Styrolution India Limited",
        "summary": "INEOS Styrolution India Limited engages in the manufacture, trading, and sale of engineering thermoplastics in India and internationally. It operates in Specialties and Polystyrene segments. The company's products include Absolac, a plastic resin that is used for manufacturing of home appliances, automobile interiors and exteriors, consumer durables, business machines, and office equipment; Absolan, a polymerized plastic resin, which is primarily used in lightings, stationeries, novelties, refrigerators, cosmetic packing, industrial goods, electrical appliances, cosmetic jars, and household applications; and Luran, an acrylonitrile styrene acrylate polymer that is used for automobile interiors and exteriors, PVC cap stocks, and household applications. Its products also comprise Novodur, a material for heat resistance and aesthetics, which is used in automobile interiors and exteriors, housing vacuum cleaners, and coffee machines; general purpose polystyrenes, which are transparent polymers that are used in injection molding and extrusion applications to produce toys, CD cases, hangers, plastic cups, IT equipment, jewel boxes, disposable medical products, bath accessories, and garden equipment; and high-impact polystyrenes for use in the manufacture of single-use yogurt cups, electronic goods housings, refrigerator liners and parts, toys and stationary products, and household items, as well as food packaging products, such as cups, dishes, containers, yogurt bottles, etc. The company was formerly known as Styrolution ABS (India) Limited and changed its name to INEOS Styrolution India Limited in March 2016. The company was incorporated in 1973 and is headquartered in Vadodara, India. INEOS Styrolution India Limited is a subsidiary of INEOS Styrolution APAC Pte Ltd.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "390023",
        "website": "http://www.ineosstyrolutionindia.com",
        "market_cap": 26107947008
    },
    "KANORICHEM.NS": {
        "short_name": "KANORIA CHEMICALS",
        "long_name": "Kanoria Chemicals & Industries Limited",
        "summary": "Kanoria Chemicals & Industries Limited manufactures and sells chemical intermediates in India. The company operates through Alco Chemicals, Solar Power, Electronic Automotive, and Textile segments. It offers chemicals, such as acetaldehyde, di-pentaerythritol, formaldehyde, hexamine, pentaerythritol, phenolic resins, and sodium formate products. The company also develops and sells electronic and mechatronic modules, and control devices for the automotive, consumer goods, power tool electronics, and building automation industries. In addition, it operates a solar power plant with a generation capacity of 5 MW in Jodhpur district, Rajasthan; and manufactures and sells yarn and denim. Kanoria Chemicals & Industries Limited also exports its products. The company was incorporated in 1960 and is based in New Delhi, India. Kanoria Chemicals & Industries Limited is a subsidiary of Vardhan Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "New Delhi",
        "zipcode": "110001",
        "website": "http://www.kanoriachem.com",
        "market_cap": 5688247296
    },
    "NAVINFLUOR.NS": {
        "short_name": "NAVIN FLUORINE INT",
        "long_name": "Navin Fluorine International Limited",
        "summary": "Navin Fluorine International Limited manufactures and sells specialty fluorochemicals in India and internationally. The company offers refrigerants to OEMs, service technicians, and equipment owners under the Mafron brand name for use in various applications, including window and split room air conditioners, chillers, packaged air conditioners, commercial and industrial refrigeration units, intermediate for API's, fluoropolymer resins, domestic and industrial refrigerators, and mobile air conditioning. It also provides inorganic fluoride products, such as ammonium bifluoride, potassium fluoride, sodium fluoride, potassium fluorotitanate, potassium fluoroborate, hexafluorophosphoric acid, and HF pyridine and HF urea complex products that are used in various industries comprising oil and gas, stainless steel, pharmaceutical and agrochemicals, abrasives, electronics, and solar energy. In addition, the company offers various specialty fluoro intermediates consisting of boron trifluoride gas and adducts for use in pharmaceutical, crop protection, hydrocarbon, and fragrance applications. Further, it provides contract research and manufacturing services for custom chemical syntheses of fluorinated compounds in the pharmaceuticals, agro chemicals, and specialty chemicals industries; and basic research, library syntheses, process development, scale up, and batch manufacturing services, as well as custom synthesis services. The company also exports its products. The company was founded in 1967 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400057",
        "website": "http://www.nfil.in",
        "market_cap": 165603344384
    },
    "NOCIL.NS": {
        "short_name": "NOCIL LTD",
        "long_name": "NOCIL Limited",
        "summary": "NOCIL Limited manufactures and sells rubber chemicals in India. The company offers accelerators, anti-degradants, antioxidants, pre vulcanization inhibitors, and post vulcanization stabilizers. It serves tire and other rubber processing industries. The company also exports its products. NOCIL Limited was incorporated in 1961 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400020",
        "website": "http://www.nocil.com",
        "market_cap": 34624823296
    },
    "OCCL.NS": {
        "short_name": "ORIENTAL CARB & CH",
        "long_name": "Oriental Carbon & Chemicals Limited",
        "summary": "Oriental Carbon & Chemicals Limited engages in the manufacture and sale of insoluble sulphur worldwide. It operates in two segments, Chemicals and General Engineering Products. The company offers insoluble sulphur under the Diamond Sulf brand; and pre-dispersed insoluble sulphur under the Diamix brand. It also provides commercial and battery grade sulfuric acid, and oleum for use in the fertilizer, detergent, and battery industries. In addition, the company offers off-highway tire accessories, pneumatics, hydraulics, and valve automation systems. The company was incorporated in 1978 and is based in Noida, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Noida",
        "zipcode": "201301",
        "website": "http://www.occlindia.com",
        "market_cap": 9481072640
    },
    "PUNJABCHEM.NS": {
        "short_name": "PUNJAB CHEM&CROP",
        "long_name": "Punjab Chemicals and Crop Protection Limited",
        "summary": "Punjab Chemicals and Crop Protection Limited manufactures and sells agrochemicals and specialty chemicals, and bulk drugs and its intermediates in India, Europe, Japan, and internationally. The company provides agrochemicals, such as herbicides, insecticides, and fungicides; pharmaceutical products, including APIs, intermediates, anti-oxidants, and intermediates for APIs; fine and specialty chemicals; basic and industrial chemicals; and phosphorus derivatives and phosphates. It also imports and sells chemicals; and offers contract manufacturing services for multinational companies. The company was founded in 1975 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400053",
        "website": "http://www.punjabchemicals.com",
        "market_cap": 15604075520
    },
    "RAIN.NS": {
        "short_name": "RAIN INDUSTRIES LT",
        "long_name": "Rain Industries Limited",
        "summary": "Rain Industries Limited, together with its subsidiaries, manufactures and sells carbon products, cement, electricity, and specialty chemicals in India and internationally. The company operates through three segments: Carbon, Advanced Materials, and Cement. It offers calcined petroleum coke, coal tar pitch, and green petroleum coke, as well as other derivatives of coal tar distillation, including carbon black oil, creosote oil, naphthalene, and other aromatic oils; naphthalene derivatives, including naphthalene, phthalic anhydride, polynaphthalene sulfonates, and modifiers; petrochemical intermediates, such as benzene, toluene, xylene, solvents, and fuel additives; carbon resins, hydrocarbon resins, pure resins, hydrogenated resins, and phenolics; and engineered products comprising binders and sealer coatings, as well as superplasticizers. The company also engages in the co-generation of energy through waste heat recovered in the calcining process. In addition, it produces and sells ordinary Portland and Portland pozzolana cement under the Priya Cement brand. The company was formerly known as Rain Commodities Limited and changed its name to Rain Industries Limited in July 2013. Rain Industries Limited was incorporated in 1974 and is headquartered in Hyderabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Hyderabad",
        "zipcode": "500073",
        "website": "http://www.rain-industries.com",
        "market_cap": 61349175296
    },
    "SANGINITA.NS": {
        "short_name": "Sanginita Chemicals Limit",
        "long_name": "Sanginita Chemicals Limited",
        "summary": "Sanginita Chemicals Limited manufactures and exports cuprous chloride, cupric chloride, and copper sulphate in India. The company also offers copper phthalocyanine blue crude. Its products are used in dyes and pigment industries, paint industries, pharmaceuticals industries, electroplating industries, metal extraction industries and ink, carbon paper, PVC pipe coating industries, etc. The company was incorporated in 2005 and is headquartered in Gandhinagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Gandhinagar",
        "zipcode": "382011",
        "website": "http://www.sanginitachemicals.co.in",
        "market_cap": 410971232
    },
    "SRHHYPOLTD.NS": {
        "short_name": "SREE RAYALASEEMA H",
        "long_name": "Sree Rayalaseema Hi-Strength Hypo Limited",
        "summary": "Sree Rayalaseema Hi-Strength Hypo Limited engages in the manufacture and sale of chemicals in India. The company operates in two segments, Chemical Manufacturing and Power generation. It offers chloramine, purichlor, oleum, sodium dichloroisocyanurate, hydrogen gas, aluminum sulphate, stable bleaching powder, sodium hydride, sodium methoxide powder, sodium methoxide solution, calcium hypochlorite, and water treatment chemicals; and sulphuric, chloro sulphonic, hydrochloric, and monochloro acetic acids. The company is also involved in the generation of power through thermal, solar, and wind mills; and coal trading business. Sree Rayalaseema Hi-Strength Hypo Limited also exports its products. The company was incorporated in 2005 and is based in Kurnool, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kurnool",
        "zipcode": "518004",
        "website": "http://www.srhhl.com",
        "market_cap": 5120637952
    },
    "SUPPETRO.NS": {
        "short_name": "SUPREME PETROCHEM",
        "long_name": "Supreme Petrochem Limited",
        "summary": "Supreme Petrochem Limited manufactures and sells polystyrene, expandable polystyrene, specialty polymers and compounds, and extruded polystyrene foam boards (XPS) in India and internationally. It provides general purpose, high impact, and expandable polystyrene products; white, black, color, additive, and performance/nucleating masterbatches and compounds of styrenics and other polymers; styrene methyl methacrylate for household, molding, sheet extrusion, and extrusion profiles applications; and XPS insulation boards under the brand name of INSUBOARD. The company also exports its products to approximately 100 countries. Supreme Petrochem Limited was incorporated in 1989 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.supremepetrochem.com",
        "market_cap": 72421376000
    },
    "TATACHEM.NS": {
        "short_name": "TATA CHEMICALS",
        "long_name": "Tata Chemicals Limited",
        "summary": "Tata Chemicals Limited manufactures, sells, and distributes basic chemistry and specialty products in India, Europe, Africa, the United States, rest of Asia, and internationally. It offers dense and light soda ash; crushed refined soda; Portland and masonry cement under the Tata Shudh brand name; salt; pharmaceutical grade, food grade, and animal feed grade sodium bicarbonate, as well as technical and refined grade sodium bicarbonate; and allied chemicals, such as caustic soda, bromine-based products, and gypsum, as well as marine chemicals and nutrition solutions. In addition, it offers specialty products, including nano zinc oxides for various industrial and cosmetic applications; and silica. Further, the company provides fungicides, insecticides, pesticides, herbicides, plant growth nutrients, crop protection solutions, and seeds, as well as agri-input solutions; and runs farmer connect initiative under the Rallis Kisan Kutumb name. Its products are used in various industrial applications, such as agriculture; animal nutrition; chemicals; construction; food and nutrition; glass; high performance rubber; metals; oral care and cosmetics; paints, inks, and adhesives; pharmaceuticals; safety and environmen; soaps and detergents; textiles and leather; lithium-ion, dry cell, and other batteries; and others. The company was founded in 1927 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.tatachemicals.com",
        "market_cap": 190541103104
    },
    "UNIENTER.NS": {
        "short_name": "UNIPHOS ENTERPRISE",
        "long_name": "Uniphos Enterprises Limited",
        "summary": "Uniphos Enterprises Limited engages in the trading of chemicals and other products in India. The company was incorporated in 1969 and is based in Mumbai, India. Uniphos Enterprises Limited is a subsidiary of Nerka Chemicals Private Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400052",
        "website": "http://www.uelonline.com",
        "market_cap": 8546422272
    },
    "VALIANTORG.NS": {
        "short_name": "Valiant Organics Limited",
        "long_name": "Valiant Organics Limited",
        "summary": "Valiant Organics Limited, a chemical manufacturing company, manufactures and markets specialty chemicals in India. Its products include para chlorophenol; ortho chlorophenol; 2,4 di-chlorophenol; 2,4,6 tri- chlorophenol; 2,6 di-chlorophenol; and para nitroaniline. The company's products also comprise ortho chloro para nitro aniline, 6 acetyl OAPSA, OA acetanilide, and PA acetanilide; ortho anisidine, para anisidine, ortho toluidine, para toluidine, IPPCA, FI aniline, and meta chloro aniline; acids; and ortho nitro anisole and para nitro anisole. Its products are primarily used as intermediates in agro chemicals, dyes, pigments, pharmaceuticals, speciality chemicals, polymer, and veterinary drugs. The company also exports its products to Europe, Asia, and the United States. Valiant Organics Limited was founded in 1984 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Chemicals",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400080",
        "website": "http://www.valiantorganics.com",
        "market_cap": 44020334592
    }
}