{
    "17SA.F": {
        "short_name": "VEDANTA LTD. ADR  IR 1",
        "long_name": "Vedanta Limited",
        "summary": "Vedanta Limited operates as a diversified natural resources company in India. The company explores for, develops, extracts, produces, processes, and sells oil and gas, zinc, lead, silver, copper, aluminum, iron ore, steel, and power. It is involved in the exploration, development, and production of oil and gas; and exploration, mining, and processing of iron ore, pig iron, and metallurgical coke. The company also operates a thermal coal-based commercial power facility of 600 megawatts (MW) at Jharsuguda in the State of Odisha in eastern India; two 300 MW thermal coal based power plants at Korba; 1,980 MW (three units of 660 MW each) thermal coal-based commercial power facilities; 274MW of wind power plants; and a power plant situated at Mettur Dam in the state of Tamil Nadu in southern India. In addition, it manufactures and supplies billets, TMT bars, wire rods, and ductile iron pipes; engages in the mechanization of coal handling facilities and upgradation of general cargo berth for handling coal at the outer harbor of Visakhapatnam Port on the east coast of India; and provides logistics and other allied services inter alia rendering stevedoring, and other allied services in ports and other allied sectors. Further, the company is involved in manufacturing glass substrates in South Korea and Taiwan. It also has operations in South Africa, Namibia, Ireland, Australia, Liberia, and the United Arab Emirates. The company was incorporated in 1965 and is based in Mumbai, India.",
        "currency": "EUR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "FRA",
        "market": "dr_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.vedantalimited.com",
        "market_cap": "Large Cap"
    },
    "20MICRONS.NS": {
        "short_name": "20 MICRONS LTD",
        "long_name": "20 Microns Limited",
        "summary": "20 Microns Limited engages in the industrial micronised minerals and specialty chemicals businesses in India. It offers industrial minerals, such as ground calcium carbonate, dolomite, hydrous kaolins, calcined kaolins, talcs, natural barytes, silica/quartz, muscovite mica, feldspar/nepheline syenite, and natural and synthetic red oxide. The company also provides specialty chemicals, including white pigment opacifiers, buff colored TIO2, synthetic barium sulphate, micronized wax and wax additives, high aspect ratio talc, flash and surface modified calcined kaolins, matting agents, rheological additives, inorganic thickeners, sub micron calcium carbonate, decorative colored quartz sand, calcium oxide desiccant, and flame retardants. Its products are used in paints and coatings, inks and pigments, plastics and polymers, papers, rubber, cosmetics, adhesives and sealants, agrochemicals, welding electrodes, foundry, ceramics, construction and construction chemicals, oil well drilling, filtration, detergents and soaps, leather, and textiles applications. The company also exports its products. 20 Microns Limited was founded in 1987 and is headquartered in Vadodara, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Vadodara",
        "zipcode": "391760",
        "website": "http://www.20microns.com",
        "market_cap": "Small Cap"
    },
    "ARENTERP.NS": {
        "short_name": "RAJDARSHAN INDUSTR",
        "long_name": "Rajdarshan Industries Limited",
        "summary": "Rajdarshan Industries Limited does not have significant operations. Previously, the company was engaged in operating machineries in mining of raw materials for various cement units through contract execution in Rajasthan, India. The company was formerly known as A.R.Enterprises Limited. Rajdarshan Industries Limited was incorporated in 1980 and is based in Udaipur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Udaipur",
        "zipcode": "313001",
        "website": "http://www.rajdarshanindustrieslimited.com",
        "market_cap": "Small Cap"
    },
    "ASHAPURMIN.NS": {
        "short_name": "ASHAPURA MINE CHEM",
        "long_name": "Ashapura Minechem Limited",
        "summary": "Ashapura Minechem Limited produces and sells bentonite and bauxite in India and internationally. The company offers bentonite mining, processing, and logistics services to aluminum, foundry, cosmetics, metal ore pellatization, construction, and paper industries; refractory materials for abrasives, refectories, foundries, grinding, and road surfacing applications; and hydrocarbon exploration solutions to oil well drilling and hydraulic fracturing industries. It also provides adsorbent solutions for use in various applications, including bleaching edible oils, refining of petroleum products, water purification, pet care, and bleaching waste oils; products for waterproofing, repair &restoration, admixtures, grouts and floor hardeners. In addition, the company offers white mineral solutions for use in paper, paint, rubber, pesticide, cosmetic, pharmaceutical, ceramic, glass, plastic, and building products; and clay products for use in paints, sealants, plasters, polymers, coating and pharmaceutical applications, and aviation fuel enhancers. It also exports its products. Ashapura Minechem Limited was founded in 1960 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400001",
        "website": "http://www.ashapura.com",
        "market_cap": "Small Cap"
    },
    "HINDZINC.NS": {
        "short_name": "HINDUSTAN ZINC",
        "long_name": "Hindustan Zinc Limited",
        "summary": "Hindustan Zinc Limited explores for, extracts, and processes minerals in India and internationally. The company operates through Zinc, Lead, Silver & others; and Wind Energy segments. It produces refined zinc and lead, and silver, as well as sulphuric acid. The company also operates thermal captive power plants with a total power generation capacity of 474 megawatts; wind power plants with a capacity of 273.5 megawatts; solar power plants with a capacity of 16 megawatts; and waste heat power plants with a capacity of 35.4 megawatts. Hindustan Zinc Limited was incorporated in 1966 and is based in Udaipur, India. Hindustan Zinc Limited is a subsidiary of Vedanta Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Udaipur",
        "zipcode": "313004",
        "website": "http://www.hzlindia.com",
        "market_cap": "Large Cap"
    },
    "IMPEXFERRO.NS": {
        "short_name": "IMPEX FERRO TECH",
        "long_name": "Impex Ferro Tech Limited",
        "summary": "Impex Ferro Tech Limited manufactures and sells ferro alloys in India and internationally. The company's ferro alloy products include ferro-manganese/silico manganese, high carbon ferro manganese, and medium carbon ferro manganese for use in making various types of carbon and alloy steels, as well as in the deoxidation, desulphurization, and refining of steel. It also trades in iron and steel products. Impex Ferro Tech Limited was incorporated in 1995 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Kolkata",
        "zipcode": "700026",
        "website": "http://www.impexferrotech.com",
        "market_cap": "Small Cap"
    },
    "MOIL.NS": {
        "short_name": "MOIL LTD",
        "long_name": "MOIL Limited",
        "summary": "MOIL Limited engages in the exploration, exploitation, and marketing of various grades of manganese ore and value added products in India. It operates through three segments: Mining, Manufacturing, and Power Generation. The company manufactures and sells various grades of manganese ores, such as high grade ores for the production of ferro manganese; medium grade ores for the production of silico manganese; blast furnace grade ores for producing hot metals; and dioxide for dry battery cells and chemical industries. It also offers electrolytic manganese dioxide for the manufacture of dry battery cells; ferro manganese; and ferro manganese slag. The company operates 11 mines, including seven mines located in the Nagpur and Bhandara districts of Maharashtra; and four mines in the Balaghat district of Madhya Pradesh. In addition, it operates wind energy farms with an installed capacity of 4.8 MW at Nagda Hills and 15.2 MW at Ratedi Hills in Dewas district of Madhya Pradesh. The company was formerly known as Manganese Ore (India) Limited. MOIL Limited was founded in 1896 and is headquartered in Nagpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Nagpur",
        "zipcode": "440013",
        "website": "http://www.moil.nic.in",
        "market_cap": "Small Cap"
    },
    "ORISSAMINE.NS": {
        "short_name": "ORISSA MINERALS DE",
        "long_name": "The Orissa Minerals Development Company Limited",
        "summary": "The Orissa Minerals Development Company Limited mines and markets iron ore and manganese ore in India. It also produces and sells sponge iron. The company was incorporated in 1918 and is headquartered in Bhubaneswar, India. The Orissa Minerals Development Company Limited is a subsidiary of Eastern Investments Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Bhubaneswar",
        "zipcode": "751001",
        "website": "http://www.birdgroup.co.in/omdc",
        "market_cap": "Small Cap"
    },
    "RAJMET.NS": {
        "short_name": "Rajnandini Metal Limited",
        "long_name": "Rajnandini Metal Limited",
        "summary": "Rajnandini Metal Limited engages in the trading of various metals in India and internationally. Its products include base/primary metals, secondary metals and alloys, minor metals, ferro-alloys, ferrous and non-ferrous scraps, recyclable plastic scraps, finished and semi-finished metals and steel products, and alloying additives for smelters and foundries. The company trades copper scrap, semi-finished copper, brass scrap, semi-finished brass, aluminum scrap, aluminum alloy, semi-finished lead, ferrous/HMS scrap, and zinc scrap products. In addition, it offers steel, iron, iron alloy, castings, various metals and chemicals, furnace oil, and petroleum products, as well as act as a fabricator, contractor, exporter, importer, stocker, agent, dealer, and distributer. Further, the company is involved in the smelting, refining, finishing, buying, and selling of ferrous and non-ferrous metals, such as iron and steel, aluminum, tin, nickel, and zinc led. The company was founded in 2010 and is headquartered in Faridabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Faridabad",
        "zipcode": "121001",
        "website": "http://www.rajnandinimetal.com",
        "market_cap": "Small Cap"
    },
    "VEDL.NS": {
        "short_name": "VEDANTA LIMITED",
        "long_name": "Vedanta Limited",
        "summary": "Vedanta Limited operates as a diversified natural resources company in India. The company explores for, develops, extracts, produces, processes, and sells oil and gas, zinc, lead, silver, copper, aluminum, iron ore, steel, and power. It is involved in the exploration, development, and production of oil and gas; and exploration, mining, and processing of iron ore, pig iron, and metallurgical coke. The company also operates a thermal coal-based commercial power facility of 600 megawatts (MW) at Jharsuguda in the State of Odisha in eastern India; two 300 MW thermal coal based power plants at Korba; 1,980 MW (three units of 660 MW each) thermal coal-based commercial power facilities; 274MW of wind power plants; and a power plant situated at Mettur Dam in the state of Tamil Nadu in southern India. In addition, it manufactures and supplies billets, TMT bars, wire rods, and ductile iron pipes; engages in the mechanization of coal handling facilities and upgradation of general cargo berth for handling coal at the outer harbor of Visakhapatnam Port on the east coast of India; and provides logistics and other allied services inter alia rendering stevedoring, and other allied services in ports and other allied sectors. Further, the company is involved in manufacturing glass substrates in South Korea and Taiwan. It also has operations in South Africa, Namibia, Ireland, Australia, Liberia, and the United Arab Emirates. The company was incorporated in 1965 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.vedantalimited.com",
        "market_cap": "Large Cap"
    },
    "VEDL": {
        "short_name": "Vedanta Limited",
        "long_name": "Vedanta Limited",
        "summary": "Vedanta Limited operates as a diversified natural resources company in India. The company explores for, develops, extracts, produces, processes, and sells oil and gas, zinc, lead, silver, copper, aluminum, iron ore, steel, and power. It is involved in the exploration, development, and production of oil and gas; and exploration, mining, and processing of iron ore, pig iron, and metallurgical coke. The company also operates a thermal coal-based commercial power facility of 600 megawatts (MW) at Jharsuguda in the State of Odisha in eastern India; two 300 MW thermal coal based power plants at Korba; 1,980 MW (three units of 660 MW each) thermal coal-based commercial power facilities; 274MW of wind power plants; and a power plant situated at Mettur Dam in the state of Tamil Nadu in southern India. In addition, it manufactures and supplies billets, TMT bars, wire rods, and ductile iron pipes; engages in the mechanization of coal handling facilities and upgradation of general cargo berth for handling coal at the outer harbor of Visakhapatnam Port on the east coast of India; and provides logistics and other allied services inter alia rendering stevedoring, and other allied services in ports and other allied sectors. Further, the company is involved in manufacturing glass substrates in South Korea and Taiwan. It also has operations in South Africa, Namibia, Ireland, Australia, Liberia, and the United Arab Emirates. The company was incorporated in 1965 and is based in Mumbai, India.",
        "currency": "USD",
        "sector": "Basic Materials",
        "industry": "Other Industrial Metals & Mining",
        "exchange": "NYQ",
        "market": "us_market",
        "country": "India",
        "state": null,
        "city": "Mumbai",
        "zipcode": "400093",
        "website": "http://www.vedantalimited.com",
        "market_cap": "Large Cap"
    }
}