{
    "ANDHRAPAP.NS": {
        "short_name": "ANDHRA PAPER LIMITED",
        "long_name": "Andhra Paper Limited",
        "summary": "Andhra Paper Limited manufactures, sells, and exports paper and pulp products in India and internationally. The company offers writing, printing, copier, and specialty paper products; paperboards; and cut-size paper products, such as office documentation and multipurpose papers. Its products are used in account books, annual reports, bills, blade wrapping, book printing, brochures, calendars, cash books, challans, children books, computer forms, covers, diaries, envelopes, files/folders, foil laminates, forms, greeting cards, inkjet printing, invoices, carry bags, variable data printing, journals, labels, leaflets, lottery and laser printing, magazine covers, magazines, notebooks, novels, pamphlets, paper cups, picture posters, plotter rolls, photocopying, soap wrappers, stationery, textbooks, tickets, wedding cards, writing pads, and pizza boxes with inner liners, as well as base paper for chromos/art papers/artboards; and pharma inserts. The company was formerly known as International Paper APPM Limited and changed its name to Andhra Paper Limited in January 2020. The company was founded in 1964 and is headquartered in Hyderabad, India. Andhra Paper Limited is a subsidiary of West Coast Paper Mills Limited.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Hyderabad"
    },
    "ASTRON.NS": {
        "short_name": "ASTRON PAPER & BOA",
        "long_name": "Astron Paper & Board Mill Limited",
        "summary": "Astron Paper & Board Mill Limited manufactures and sells a range of kraft papers from waste paper for packaging industry in India. The company offers high ring crust test papers, kraft liners, liners, and corrugated medium papers for use in the manufacture of corrugated boxes and liners, corrugated sacks, and composite containers. It also exports its products. The company was founded in 2010 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "BALLARPUR.NS": {
        "short_name": "BALLARPUR INDS",
        "long_name": "Ballarpur Industries Limited",
        "summary": "Ballarpur Industries Limited, together with its subsidiaries, manufactures, sells, and exports writing and printing paper, and pulp products in India and internationally. It provides writing and printing papers comprising coated and uncoated wood-free papers, copier papers, and creamwove papers; tissue papers; rayon grade pulp; and specialty papers, such as water marked bond, ledger, cartridge, envelope, super printing, and matrix multipurpose papers, as well as food packaging products. The company offers uncoated wood-free products under the Magna and Wisdom Print brands, offset printing paper under the Sunshine Super Printing Paper brand, and commercial printing under the T.A.NSD brand; and copier paper products under the Copy Power, Image Copier, Ten on Ten, and BILT Matrix brands. Ballarpur Industries Limited was incorporated in 1945 and is headquartered in Gurugram, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Gurugram"
    },
    "CENTURYTEX.NS": {
        "short_name": "CENTURY TEXT & IND",
        "long_name": "Century Textiles and Industries Limited",
        "summary": "Century Textiles and Industries Limited manufactures and sells cement, textiles, and pulp and paper products in India. It operates through Textiles, Pulp and Paper, Real Estate, and Others segments. The Textile segment offers yarn, fabric, viscose filament yarn, and tire yarn; and leases viscose filament yarn and tire yarn plant. Its products include shirting, suiting fabrics, finer fabrics, and bed linen. The Pulp and Paper segment offers pulp, writing and printing papers, tissue papers, and multi-layer packaging boards. The Real Estate segment develops commercial and residential projects; and leases properties. The Others segment engages in the salt works and chemicals related businesses. It also exports its products. Century Textiles and Industries Limited was founded in 1897 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "GENUSPAPER.NS": {
        "short_name": "GENUS PAPER AND BO",
        "long_name": "Genus Paper & Boards Limited",
        "summary": "Genus Paper & Boards Limited manufactures and sells kraft paper in India. The company operates through two segments, Kraft Paper Business and Strategic Investment Activity. It also invests in shares and securities, and loans. The company was incorporated in 2012 and is based in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "JKPAPER.NS": {
        "short_name": "JK PAPER LTD",
        "long_name": "JK Paper Limited",
        "summary": "JK Paper Limited manufactures, sells, and exports papers and boards in India, the United States, the United Kingdom, Sri Lanka, Bangladesh, Singapore, Malaysia, Africa, the Middle East, and internationally. It offers a range of office documentation papers, such as photocopy and multi-purpose papers for use in desktop, inkjet and laser printers, fax machines, photocopiers, and multi-functional devices; and premium watermarked and laid-marked business stationery papers for corporate customers and individuals under the JK Copier Slims, JK Copier Plus, JK Copier, JK Easy Copier, JK CMax, JK Sparkle, JK Max, JK Cedar, JK Excel Bond, JK Bond, JK Ledger, and, Cedar Digital brand names. The company also provides uncoated writing and printing papers, MICR cheque papers, and pulp boards, as well as bonds, ledgers, parchment grades, and maplitho papers under the JK Bond, JK MICR Cheque Paper, JK Parchment Paper, JK SS Pulpboard, JK ELEKTRA, JK FINESSE, JK LUMINA, and JK SHB brand names; and coated papers and boards under the JK Cote, JK Superkote/JK Cote Premium, and JK Cote Chromo brand names. In addition, it offers coated packaging boards for the packaging industry under the JK Ultima, JK TuffCote, JK TuffPac, JK Endura, JK IV Board, JK Club Card, JK FBL, JK Tuffpack GC 2, JK FBU, JK Induction WAD, JK CBL, JK JCC, JK PNT, and JK FSK brand names; and imported coated art papers. The company was formerly known as Central Pulp Mills Ltd. and changed its name to JK Paper Limited in May 2002. JK Paper Limited was incorporated in 1960 and is headquartered in New Delhi, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "New Delhi"
    },
    "KUANTUM.NS": {
        "short_name": "Kuantum Papers Limited",
        "long_name": "Kuantum Papers Limited",
        "summary": "Kuantum Papers Limited produces, markets, and sells wood free writing and printing paper in India. It offers maplitho, colored paper, ledger, cartridge, parchment, duplicating, and wood free specialty papers. The company's products are used for printing books, trade directories, newsprint, diaries, calendars, and computer stationery, as well as for manufacturing note books and other stationery items. It also exports its products. The company was formerly known as ABC Paper Limited and changed its name to Kuantum Papers Limited in March 2012. Kuantum Papers Limited was incorporated in 1997 and is based in Chandigarh, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chandigarh"
    },
    "MAGNUM.NS": {
        "short_name": "MAGNUM VENTURES LT",
        "long_name": "Magnum Ventures Limited",
        "summary": "Magnum Ventures Limited manufactures and sells paper products in India. The company operates through two segments, Paper Division and Hotel Division. It offers newsprint, printing, writing, Xerox, wrapping, and packing papers, as well as duplex boards. The company's products are primarily used in newspapers, fine arts, and packaging applications, as well as graphic printing applications, such as book and magazine covers, or postcards. It also operates a five-star hotel with 216 rooms, 11 banquet halls, and approximately 60,000 square feet of meeting space under the Country Inn & Suites by Radisson name in Sahibabad, Delhi. The company was formerly known as Magnum Papers Limited. Magnum Ventures Limited was founded in 1980 and is based in Ghaziabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ghaziabad"
    },
    "MALUPAPER.NS": {
        "short_name": "MALU PAPER MILLS",
        "long_name": "Malu Paper Mills Limited",
        "summary": "Malu Paper Mills Limited manufactures and sells paper in India. It provides newsprint, writing and printing, kraft, and packaging paper. Malu Paper Mills Limited was incorporated in 1994 and is based in Nagpur, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Nagpur"
    },
    "NRAIL.NS": {
        "short_name": "NR AGARWAL IND",
        "long_name": "N R Agarwal Industries Limited",
        "summary": "N R Agarwal Industries Limited develops, manufactures, and sells finished paper products in India. The company offers grey back and white back duplex boards for gravure printing, embossing, and foil stamping; writing and printing papers; and newsprint products. Its products are primarily used in FMCG packaging, textbooks and notebooks, and print media applications. The company exports its products to approximately 36 countries. N R Agarwal Industries Limited was founded in 1975 and is headquartered in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "ORIENTPPR.NS": {
        "short_name": "ORIENT PAPER & IND",
        "long_name": "Orient Paper & Industries Limited",
        "summary": "Orient Paper & Industries Limited manufactures and sells pulp and paper products in India. The company provides chemicals; and writing, printing, industrial, specialty, and soft tissue papers. It also exports its products to Africa, the Middle East, Bangladesh, Sri Lanka, and Nepal. The company was incorporated in 1939 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "PDMJEPAPER.NS": {
        "short_name": "PUDUMJEE PAPER PRO",
        "long_name": "Pudumjee Paper Products Limited",
        "summary": "Pudumjee Paper Products Limited manufactures and markets paper products in India. The company operates through Paper and Hygiene Products segments. It offers facial, napkin, bathroom/toilet, toweling, and diaper tissues; absorbent kraft, barrier, overlay, print base, and shuttering base paper products; bake oven, grease proof, grease proof slip easy, TDL poster, vegetable parchment, and wet strength grease proof paper products; Bible printing, medical, opaque laminating base (OLB) pharma, and yellow interleaving paper products; and glassine, super white glassine, S.W. glassine, OLB, and release base paper products. The company also provides absorbent porous kraft, anti-rust tissue, carbon base, melamine transfer, packing tissue, parchmentine, and saturating base paper products; and band roll and MICR cheque papers, as well as thin printing paper products. In addition, it markets and distributes hygiene products, such as bathroom rolls, kitchen towels, napkins, dispensers, sanitizers, disinfectants, hand wash soaps, and other hygiene products under the Greenlime and Chef Smartr brand names for hotels, airports, corporate offices, professional chefs, restaurants, caterings, and facility managers. The company also exports its products. Pudumjee Paper Products Limited was incorporated in 2015 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "RAMANEWS.NS": {
        "short_name": "SHREE RAMA NEWSPRI",
        "long_name": "Shree Rama Newsprint Limited",
        "summary": "Shree Rama Newsprint Limited manufactures and sells newsprint, and writing and printing papers in India. The company also offers photocopier paper; and packaged drinking water. It also exports its products. The company was formerly known as Rama Newsprint and Papers Limited and changed its name to Shree Rama Newsprint Limited in June 2013. Shree Rama Newsprint Limited was incorporated in 1991 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "RUCHIRA.NS": {
        "short_name": "RUCHIRA PAPERS LTD",
        "long_name": "Ruchira Papers Limited",
        "summary": "Ruchira Papers Limited manufactures and sells paper and paper products in India and internationally. The company offers writing and printing papers, which are used for manufacturing notebooks; and colored papers used in the fabrication of spiral notebooks, wedding cards, shade cards, children's coloring books, colored copier papers, and bill books. It also provides Kraft papers for making corrugated boxes/cartons, as well as for other packaging products, such as textile tubes and paper core-pipes. The company was founded in 1980 and is based in Yamuna Nagar, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Yamuna Nagar"
    },
    "SATIA.NS": {
        "short_name": "Satia Industries Limited",
        "long_name": "Satia Industries Limited",
        "summary": "Satia Industries Limited manufactures and sells writing and printing paper in India and internationally. The company operates through Paper, Yarn and Cotton, Cogeneration, Agriculture, and Solar divisions. It offers snow white, super snow white, map litho, colored, ledger, cartridge, duplicating, bond, water mark, and chromo papers for use in the printing of text books, note books, directories, envelops, diaries, calendars, computer stationery, etc. The company is also involved in the generation of solar power; trading of cotton and yarns; and agricultural and plantation operations. Satia Industries Limited also exports its products. The company was formerly known as Satia Paper Mills Limited. Satia Industries Limited was incorporated in 1980 and is headquartered in Sri Muktsar Sahib, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Sri Muktsar Sahib"
    },
    "SESHAPAPER.NS": {
        "short_name": "SESHASAYEE PAPER&B",
        "long_name": "Seshasayee Paper and Boards Limited",
        "summary": "Seshasayee Paper and Boards Limited operates an integrated pulp, paper, and paper board mill in Tamilnadu, India. The company offers printing and writing papers. It also exports its products. The company was incorporated in 1960 and is based in Erode, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Erode"
    },
    "SHRENIK.NS": {
        "short_name": "SHRENIK LTD",
        "long_name": "Shrenik Limited",
        "summary": "Shrenik Limited engages in the trading and processing of paper, pulp, paperboards, etc. in Gujarat, Rajasthan, and Maharashtra. It offers printing and writing papers, and other specialty papers; and coated paper, uncoated maplitho paper, copier paper, and duplex and folding box boards under the Shrenik Premium Copier Paper and Shrenik Premium Digital Paper brand names. Shrenik Limited was incorporated in 2012 and is based in Ahmedabad, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ahmedabad"
    },
    "SHREYANIND.NS": {
        "short_name": "SHREYANS INDUSTRIE",
        "long_name": "Shreyans Industries Limited",
        "summary": "Shreyans Industries Limited manufactures and sells writing and printing papers, and newsprint in India and internationally. The company offers a range of 44 GSM to 200 GSM paper products, such as high brightness, cream wove, colored, duplicating, surface sized printing, azure laid, maplitho, stamp, inland letter, postal envelope, offset, cover, super calendared, rail ticket, and super printing paper products. It serves publishers, copy manufacturers, job printers, various states text book boards, exporters of notebooks and diaries, printing and stationary department, railways, P&T departments, security press, etc. The company was formerly known as Shreyans Paper Mills Ltd. and changed its name to Shreyans Industries Limited in October 1992. Shreyans Industries Limited was founded in 1979 and is based in Ludhiana, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Ludhiana"
    },
    "STARPAPER.NS": {
        "short_name": "STAR PAPER MILLS",
        "long_name": "Star Paper Mills Limited",
        "summary": "Star Paper Mills Limited engages in the manufacture and supply of paper and paper products in India and internationally. It offers a range of cultural papers, industrial and packaging papers, and other grades. The company was incorporated in 1936 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    },
    "SUNDARAM.NS": {
        "short_name": "SUNDARAM MULTI",
        "long_name": "Sundaram Multi Pap Limited",
        "summary": "Sundaram Multi Pap Limited designs, manufactures, and markets paper stationery products for students in India. It offers exercise note, long, scrap, drawing, graph, A4/A5/A3, college, hard bound, note, sketch, lekhan, practical, laboratory, pocket, six subject, answer, duplicate, cash memo, challan, and voucher books. The company also provides note and conference pads; graph and map, answer, origami paper, and tinted sheets; office/corporate stationery products; and printing, writing, and packaging papers. In addition, it offers digital educational content for the students of Maharashtra State Board's 1st to 10th standards for various subjects available in English, Marathi, Semi English, Hindi, and Urdu medium as per the syllabus. The company markets and sells its products primarily under the Sundaram brand. It also exports its products. The company was founded in 1985 and is based in Mumbai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Mumbai"
    },
    "TNPL.NS": {
        "short_name": "TAMIL NADU NEWSPRI",
        "long_name": "Tamil Nadu Newsprint and Papers Limited",
        "summary": "Tamil Nadu Newsprint and Papers Limited manufactures and sells paper and paper boards in India. The company operates through Paper & Paper Board, Energy, and Cement segments. It offers surface-sized and non-surface sized papers for printing and writing; and coated and uncoated boards under the AURA brand for the packing industry. The company also generates power through TGs and wind mills. In addition, it manufactures and sells cement. The company exports its products to Sri Lanka, Iran, Nigeria, Sudan, Uganda, Turkey, Kenya, South Africa, Malaysia, and Ghana. Tamil Nadu Newsprint and Papers Limited was incorporated in 1979 and is based in Chennai, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Chennai"
    },
    "WSTCSTPAPR.NS": {
        "short_name": "WEST COAST PAPER M",
        "long_name": "West Coast Paper Mills Limited",
        "summary": "West Coast Paper Mills Limited produces and sells pulp, paper, and paper boards in India. It operates through two segments, Paper/Paperboard and Telecommunication Cables. The company provides printing and writing paper, machine-glazed paper and boards, security and hi-value grades paper, cup stock and coated duplex boards, and business stationery products, as well as premium printing paper under the WESCO brand. It is also involved in the production and sale of optical fiber cables; and generation of wind power with a capacity of 1.75 MW wind mill located in Tamilnadu, India. The company exports its paper products to the Asia Pacific, the Middle-East, the Mediterranean, and the African sub continents. West Coast Paper Mills Limited was founded in 1955 and is based in Kolkata, India.",
        "currency": "INR",
        "sector": "Basic Materials",
        "industry": "Paper & Paper Products",
        "exchange": "NSI",
        "market": "in_market",
        "country": "India",
        "city": "Kolkata"
    }
}